"The client is a 42-year-old married entrepreneur with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, reaching out on the 20th of August for a 94-second conversation. This was the second time they were contacted during this campaign. There is no record of previous contact with this client or the outcome of any previous marketing campaign. The client's average yearly balance is 149 euros.###\nHence this label was No."
"The client is a 30-year-old single technician with a secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 298 euros. The last contact was on the 16th of May, lasting 164 seconds. This is the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The communication type used for contact is also unknown.###\nHence this label was No."
"This client is a 50-year-old married technician with secondary education. They do not have credit in default but have a housing loan. They were contacted via cellular communication, and the last call duration was 276 seconds. This was the third contact made during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous campaign is unknown. The client does not have a personal loan and has an average yearly balance of 10757 euros. The last contact was made on the 6th day of August.###\nHence this label was No."
"The client is a 51-year-old married individual working in the services sector with a secondary education. They do not have any credit defaults, housing loans, or personal loans. They were contacted via cellular communication on the 14th of August and the call lasted for 80 seconds. This was the second contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 276 euros.###\nHence this label was No."
"The client is a 51-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 18th of August and the call lasted for 146 seconds. This was the 5th contact made during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 193.###\nHence this label was No."
"The client is a 39-year-old married individual working as an admin, with secondary education. They do not have any credit in default but have a personal loan. Their average yearly balance is negative. They do not have a housing loan. The bank contacted them via cellular communication and the last call was made on the 18th of July for 75 seconds. This is the first contact made during the current campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old divorced technician with a secondary education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 27th of August. The call lasted 130 seconds, and this was the 10th contact made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1085 euros.###\nHence this label was No."
"The client is a 33-year-old married individual working in the services sector with primary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 18th of July and the call lasted 351 seconds. This was the second contact made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown, and the client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 52-year-old unemployed married individual with secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is negative. The last contact was made on the 9th of June for 123 seconds, and it was the first contact during this campaign. There is no record of previous contact or outcome from a previous marketing campaign. The communication type for this contact is unknown.###\nHence this label was No."
"The client is a 33-year-old single individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 7084. The client was contacted via cellular communication on the 27th day of August. The last contact duration was 512 seconds, and a total of 8 contacts were made during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 38-year-old divorced individual working in an administrative role with secondary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The average yearly balance is 198 euros. The communication type for contact is unknown. The client was last contacted on the 26th of May and the call duration was 431 seconds. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 40-year-old married individual working in a management position with tertiary education. They do not have any credit in default and have a yearly average balance of 917 euros. They have a housing loan but no personal loan. The communication type for the last contact is unknown, which lasted for 292 seconds. This client was contacted once during this campaign and has not been previously contacted. The outcome of the previous marketing campaign is also unknown. The last contact was made on the 20th of May.###\nHence this label was No."
"The client is a 42-year-old married technician with tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 6th day of August. The call duration was 286 seconds and it was the 3rd contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 446.###\nHence this label was No."
"A 31-year-old married individual working in management with a tertiary education was contacted via cellular communication. They do not have credit in default, housing loan, or personal loan. They have an average yearly balance of 351 euros. During the current marketing campaign, they have been contacted 3 times, with the last contact lasting 165 seconds on the 21st of August. This client has not been contacted in any previous campaigns, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 59-year-old self-employed individual who is married and has a tertiary level of education. They do not have credit in default and have an average yearly balance of 6237 euros. They have a housing loan but do not have a personal loan. The client was contacted via cellular communication and the last contact was on the 8th of May, with a duration of 63 seconds. This is the first contact made during this campaign, and the client was last contacted 169 days ago from a previous campaign where there were 2 contacts made. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"This client is a 28-year-old single technician with a secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 2034 euros. The communication type for the last contact is unknown, which lasted for 196 seconds on the 21st day of May. This was the first contact during this campaign, and there was no previous campaign contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have housing and personal loans. The average yearly balance is €1797. The client was last contacted via cellular communication on the 17th of November for 166 seconds. This was the first contact during this campaign, but they were contacted twice in a previous campaign, resulting in a failure outcome.###\nHence this label was No."
"The client is a 38-year-old self-employed individual who is married with primary education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication, reaching out on the 9th of July for a duration of 184 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with this client is unknown. The client maintains an average yearly balance of 618 euros.###\nHence this label was No."
"The client is a 46-year-old unemployed married individual with secondary education and no credit in default. They have an average yearly balance of 562 euros and do not have any housing or personal loans. The bank contacted them via cellular communication on the 8th of July for a duration of 491 seconds. This was the first contact made during this campaign, and there was no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 73-year-old retired married individual with primary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 15th of October and the call lasted 103 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 154 euros.###\nHence this label was No."
"The client is a 54-year-old single technician with tertiary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is 1433 euros. The client was contacted via an unknown communication type on the 18th of June and the call lasted for 18 seconds. This call was the 20th contact made during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 51-year-old divorced individual working in an administrative role with a secondary education. They do not have credit in default and have an average yearly balance of 228 euros. They have a housing loan but no personal loan. The last contact made was on the 6th of May with a duration of 136 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, as well as the specific type of communication used.###\nHence this label was No."
"The client is a 35-year-old single individual who works as an admin and has a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 1087 euros. The marketing campaign contacted them via cellular communication and the call lasted for 110 seconds. This was the first time they were contacted during this campaign. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 42-year-old divorced individual working in a management position with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, reaching out on the 26th of August. The call lasted for 1000 seconds, and this was the 4th contact made during this campaign. The client had not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1243 euros.###\nHence this label was Yes."
"The client is a 30-year-old single technician with secondary education. They do not have credit in default and do not have a housing or personal loan. The average yearly balance is 853 euros. The communication type for the marketing campaign was cellular. The client was last contacted on the 29th of October and the call duration was 279 seconds. This was the second contact made during this campaign, with 148 days passing since the previous contact from a different campaign. The outcome of the previous marketing campaign was a failure.###\nHence this label was Yes."
"The client is a 60-year-old divorced individual working in administration with a secondary level education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The client was contacted through an unknown communication type on the 15th of May. The call lasted for 131 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3020 euros.###\nHence this label was No."
"The client is a 33-year-old student who is single. Their education level is unknown. They do not have any credit in default and do not have a housing or personal loan. The bank contacted them via cellular communication. The last contact was on the 30th of April, and the call lasted 352 seconds. This was the first contact made to the client during this marketing campaign. There is no information on any previous marketing campaign outcome. The client's average yearly balance is 1170 euros.###\nHence this label was Yes."
"The client is a 28-year-old single individual working in management with a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 6791 euros. The bank contacted them via telephone on the 9th of August and the call lasted for 361 seconds. This was the 1st contact made during this campaign and the 35th contact overall. They were previously contacted 46 days ago, and the outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 51-year-old blue-collar worker who is divorced and has primary education. They do not have any credit in default, but have a housing loan. They were contacted via cellular communication on the 10th of July and the call lasted for 613 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. They have an average yearly balance of 1236 euros and do not have a personal loan.###\nHence this label was No."
"A 34-year-old married technician with secondary education, who does not have credit in default, no housing loan, and no personal loan, was contacted via cellular communication on the 15th of May. The client's average yearly balance is -25 euros. The call lasted 207 seconds, and it was the first contact made during this campaign. There is no record of previous contact with this client from a previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old single technician with secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 11th of August. The average yearly balance is 388 euros. The last contact duration was 144 seconds, and they have been contacted twice during this campaign with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 20th of August, and the call lasted 165 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 70 euros.###\nHence this label was No."
