"The client is a 48-year-old married individual working in administration, with secondary education. They do not have any credit in default, housing loan, but have a personal loan. The average yearly balance is 0 euros. The communication was done via cellular phone, with a call duration of 195 seconds on the 11th day of October. This is the 1st contact in the current campaign, following 5 previous contacts. The outcome of the previous campaign was a failure, and the last contact was made 104 days ago.###\nHence this label was No."
"A 38-year-old single individual working in a blue-collar job was contacted for a marketing campaign. They have a primary level of education and do not have any credit in default. The individual has an average yearly balance of 1375 euros, has a housing loan, but no personal loan. The communication type for the contact was unknown, and the call lasted for 83 seconds. This was the third contact made during this campaign. The individual had not been contacted in any previous campaigns. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 47-year-old single individual working in an administrative role with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 15 euros. They were contacted via an unknown communication type on the 12th of May and the call lasted for 181 seconds. This is the fourth contact made during this campaign. The client has not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old single individual working in management with tertiary education. They do not have credit in default but have a housing loan. They were contacted via cellular communication on the 22nd of July and the call lasted for 383 seconds. This was the third contact made during this campaign, with no previous contacts. The client's average yearly balance is negative at -149 euros and they do not have a personal loan. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old single individual working in the management field with a tertiary education. They do not have any credit in default and have an average yearly balance of 867 euros. They have a housing loan and a personal loan. The client was contacted via an unknown communication type on the 12th of May. The call duration was 145 seconds, and this was the 4th contact made to the client during this campaign. There were no previous contacts with the client regarding marketing campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 59-year-old retired married individual with tertiary education. They do not have a credit in default, housing loan, or personal loan. The bank contacted them via a cellular phone call on the 11th day of August. The call lasted for 862 seconds, and it was the 11th contact made during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 1296 euros.###\nHence this label was No."
"The client is a 37-year-old married individual working in a management position with a tertiary education. They do not have any credit in default and have a housing loan. Their average yearly balance is 2987 euros, and they do not have a personal loan. The bank contacted them via cellular communication on the 15th of February, and the call lasted for 93 seconds. This was the 1st contact made during this campaign, following 9 contacts from a previous campaign. The previous marketing campaign outcome was a failure, and the client was last contacted 91 days ago.###\nHence this label was Yes."
"The client is a 35-year-old single technician with tertiary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via telephone on the 12th of February, with a call duration of 1416 seconds. This was the client's first contact in this campaign, but they were previously contacted 4 times before. The outcome of the previous marketing campaign was a failure. The client's average yearly balance is 992 euros.###\nHence this label was No."
"The client is a 37-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 4997. The client was contacted via an unknown communication type on the 9th day of June, with a call duration of 172 seconds. This was the second contact made during this campaign, with no previous contacts for this client. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working in an administrative role with a secondary level education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their bank account is 1309 euros. They were contacted via cellular communication on the 28th of January and the call lasted for 622 seconds. This was the first contact made during this marketing campaign. The outcome of any previous marketing campaign with this client is unknown.###\nHence this label was Yes."
"The client is a 39-year-old entrepreneur who is divorced and has a secondary level of education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 7th of May. The client's average yearly balance is negative at -271 euros. The previous marketing campaign's outcome is unknown. The client was contacted only once during this campaign, with a call duration of 406 seconds. There were no previous contacts with this client before this campaign.###\nHence this label was No."
"The client is a 38-year-old single technician with secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 1130. The contact was made via cellular communication, with a call duration of 96 seconds. This was the second contact during this campaign, following up after 98 days from a previous successful marketing campaign.###\nHence this label was Yes."
"A 42-year-old blue-collar single individual with primary education and no credit default has an average yearly balance of 1628 euros. They have a housing loan but no personal loan. The communication type was cellular, and the last contact was on the 25th of July with a duration of 590 seconds. During this campaign, 8 contacts were made. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 38-year-old married individual working in a blue-collar job with primary education. They do not have credit in default but have a housing loan. They were contacted via cellular communication, and the call lasted for 87 seconds. This was the first contact made to the client during this campaign. The client had not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. Their average yearly balance is -42 euros, and they do not have a personal loan. The contact was made on the 14th of May.###\nHence this label was No."
"The client is a 50-year-old divorced housemaid with primary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The bank contacted the client via cellular communication on the 21st of July, with a call duration of 99 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 120 euros.###\nHence this label was No."
"The client is a 38-year-old single administrative worker with secondary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via an unknown communication type on the 6th of May. The call lasted 211 seconds, which was the second contact made during this campaign. There were no previous contacts or known outcomes from previous campaigns. The client's average yearly balance is 221 euros.###\nHence this label was No."
"The client is a 30-year-old single technician with secondary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 9th of April, and the call lasted 743 seconds. This was the first contact during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3286 euros.###\nHence this label was Yes."
"The client is a 45-year-old married technician with secondary education. They do not have credit in default and do not have housing or personal loans. They were contacted via cellular communication, with the last call lasting 617 seconds on the 5th day of February. This was the 4th call made during this campaign, with 251 days passed since the client was last contacted. Prior to this campaign, 2 contacts were made with the client, resulting in the previous campaign being unsuccessful. The client's average yearly balance is 858 euros.###\nHence this label was No."
"The client is a 46-year-old divorced technician with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via cellular communication and the last call lasted 298 seconds. This was the first contact made during this campaign. The outcome of the previous campaign is unknown. The client's average yearly balance is 387 euros. The last contact was on the 3rd of April.###\nHence this label was No."
"The client is a 38-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is 433 euros. The communication method used for contact was cellular. The client was last contacted on the 20th of November and the call lasted for 81 seconds. This is the second time they have been contacted during this campaign, with 2 contacts in total. They were last contacted 136 days ago from a previous campaign, where they had 3 contacts. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 35-year-old single individual working in management with a tertiary education. They do not have credit in default and have an average yearly balance of 1496 euros. They have a housing loan but no personal loan. The client was last contacted via cellular communication on the 22nd of August and the call lasted 73 seconds. This is the 4th contact made to the client during this campaign. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"This is a married 34-year-old individual working in the services sector with secondary education. They do not have any credit in default and have a housing loan. They have been contacted via cellular communication for a marketing campaign in April. During the current campaign, they have been contacted twice, with the last call lasting 139 seconds. The previous marketing campaign outcome for this client was a failure. They do not have a personal loan and had one contact before this campaign. Their average yearly balance is 334 euros. The last time they were contacted before this campaign was 318 days ago.###\nHence this label was No."
"A 24-year-old single individual working in management with a tertiary education was contacted via cellular communication. They do not have a housing or personal loan, nor do they have credit in default. With an average yearly balance of 3197 euros, they were last contacted on the 22nd of May for 172 seconds, as part of a campaign where this was their first contact. The outcome of any previous marketing campaigns with this client is unknown.###\nHence this label was No."
"The client is a 51-year-old married individual working in a management position with a tertiary education. They do not have any credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 22nd of May, with a call duration of 168 seconds. This is their first contact during this campaign, and they have not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 60-year-old married individual working in management with tertiary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The communication with the client was done via cellular phone. The last contact was on the 29th of July and lasted 333 seconds. This was the 19th contact made during this campaign. The client had not been contacted previously. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 6657 euros.###\nHence this label was No."
"The client is a 54-year-old married individual working in an administrative role with a secondary education. They do not have any credit in default and have a housing loan. Their average yearly balance is 3136 euros, and they do not have a personal loan. The bank contacted them via telephone on the 14th of April and had a phone call duration of 104 seconds. This was the second time they were contacted during this campaign, with the previous contact being 146 days ago, resulting in a failed outcome.###\nHence this label was No."
"The client is a 51-year-old married individual working in the services sector with a secondary level of education. They do not have credit in default, do not have a housing loan but have a personal loan. The client was contacted via cellular communication in July and the call duration was 130 seconds. This was the third contact made during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. Additionally, the client has an average yearly balance of -437 euros.###\nHence this label was No."
"The client is a 30-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank reached out to them via cellular communication on the 17th of November and the call lasted 348 seconds. This was the second contact made to the client during this campaign, with the previous contact occurring 123 days ago, resulting in a failed outcome. The client's average yearly balance is 101 euros.###\nHence this label was No."
"The client is a 29-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan but no personal loan. The client's average yearly balance is 1366 euros. They were contacted via an unknown communication type on the 29th of May, with the call lasting 273 seconds. This was the third contact made to the client during this campaign. There were no previous contacts with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in the services sector with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 196. The client was last contacted via cellular communication on the 6th of February, with a call duration of 59 seconds. This is the third contact made during the current campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 51-year-old married technician with tertiary education, having no credit in default and no existing housing or personal loans, was contacted via an unknown communication type on the 18th of June. The average yearly balance held by this individual is 1533 euros. The client was previously contacted twice during this campaign, with the last call lasting 242 seconds. There is no record of any previous marketing campaign outcome or prior contacts with this client.###\nHence this label was No."
"A 22-year-old blue-collar single individual with secondary education, no credit in default, but with housing and personal loans. They were contacted through an unknown communication type on the 19th of May. The call lasted 194 seconds, it was the second contact in the current campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 3992 euros.###\nHence this label was No."
"The client is a 32-year-old single technician with a secondary education. They do not have credit in default, a housing loan, or a personal loan. The bank communicated with them via cellular phone, contacting them on the 3rd of February for a duration of 613 seconds. This was the second time they were contacted during this campaign. There were no previous contacts with the client for marketing purposes. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 13565 euros.###\nHence this label was No."
"The client is a 30-year-old single housemaid with tertiary education and no credit in default. They have an average yearly balance of 19 euros and do not have a housing or personal loan. The bank contacted them via cellular communication on the 4th of August and the call lasted 139 seconds. This was the first contact during the current campaign, but there were 5 previous contacts. The outcome of the previous marketing campaign was successful, indicating a potential interest in subscribing to a term deposit.###\nHence this label was Yes."
"The client is a 62-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 11th of August. The last call duration was 146 seconds, and this was the first contact during the current campaign. They were contacted 286 days after the previous campaign, where the outcome was a failure. The client's average yearly balance is 272 euros.###\nHence this label was Yes."
"The client is a 56-year-old single technician with a secondary education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via cellular communication on the 19th of November for 85 seconds. This was the 5th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 751 euros.###\nHence this label was No."
"The client is a 31-year-old single person working as an admin, with secondary education. They do not have credit in default and have an average yearly balance of 68 euros. They have a housing loan but no personal loan. The communication type for contact is cellular. The client was last contacted on the 16th of April and the call lasted for 570 seconds. This is the second call made to this client during the current campaign. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 22-year-old student, who is single and has a secondary education, with no credit in default, an average yearly balance of 364 euros, a housing loan, and no personal loan. They were contacted via an unknown communication type on the 15th of May, with the call lasting 282 seconds. This was the first contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old married housemaid with primary education. They do not have credit in default and have a housing loan but no personal loan. The communication type during the marketing campaign was unknown. The client was last contacted on the 6th of May for 124 seconds. This was their first contact during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working as a blue-collar worker with a secondary level of education. They do not have any credit in default but have both a housing loan and a personal loan. The client was contacted via cellular communication on the 22nd of July and the call lasted for 477 seconds. This was the second contact made during this campaign, with no previous contact history. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 2926 euros.###\nHence this label was No."
"The client is a 45-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via an unknown communication type on the 19th of May. The call duration was 211 seconds, and this was the 2nd contact made to the client during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The average yearly balance in their account is 4111 euros.###\nHence this label was No."
"The client is a 41-year-old married housemaid with primary education. They do not have credit in default, do not have a housing loan, but have a personal loan. The client was contacted via an unknown communication type in September. The call lasted for 9 seconds, and it was the first contact made during this campaign. There was no previous contact with the client for marketing purposes. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 379 euros.###\nHence this label was No."
"The client is a 59-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 3372 euros. The communication type for the marketing campaign was cellular, and the call lasted for 87 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is an 80-year-old retired individual who is married with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the last day of June. The call lasted for 166 seconds, and it was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3669 euros.###\nHence this label was No."
"The client is a 48-year-old married individual working as an admin, with secondary education. They do not have credit in default and do not have a housing loan but have a personal loan. They were contacted via cellular communication on the 25th of August and the call lasted for 98 seconds. This was the third contact made during this campaign. The client was not previously contacted in any previous campaign, and the outcome of the previous campaign is unknown. The average yearly balance in euros is 44.###\nHence this label was No."
"The client is a 36-year-old single technician with a tertiary education. They do not have credit in default, housing loan, or personal loan. The contact communication type was cellular, and the last contact was made on the 14th of August with a duration of 111 seconds. This was the second contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 306 euros.###\nHence this label was No."
"The client is a 51-year-old married individual working in a blue-collar job with secondary education. They do not have any credit default, housing loan, or personal loan. The average yearly balance in euros is 193. The communication type used for contact is cellular. The last contact was made on the 18th of August and lasted for 146 seconds. This is the 5th contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married person working in the services sector with tertiary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is 546 euros. The client was contacted via an unknown communication type on the 9th of May and the call lasted for 253 seconds. This was the first contact made during the current campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 52-year-old married individual working in management with primary education. They do not have credit in default, a housing loan, or a personal loan. They were contacted via an unknown communication type on the 16th of June. The call lasted 206 seconds, and this was the first contact made during this campaign. There is no information on any previous marketing campaign outcome or past contacts with the client. The client's average yearly balance is 740 euros.###\nHence this label was No."
"The client is a 38-year-old single individual working in management with a tertiary education. They do not have any credit in default but have a housing loan. They have an average yearly balance of 3646 euros and do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting 1710 seconds. This was the second contact during this campaign, with the previous contact occurring 286 days ago. There was one contact with the client before this campaign, resulting in no subscription to a term deposit. The outcome of the previous marketing campaign was categorized as \"other.\"###\nHence this label was Yes."
"The client is a 31-year-old single individual working as a blue-collar worker with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The communication type during the marketing campaign is unknown. The client was last contacted on the 6th of May for 273 seconds. This is the second time they have been contacted during this campaign. There is no information about previous marketing campaign outcomes.###\nHence this label was No."
"The client is a 38-year-old married individual working in the services sector with a secondary education. They do not have any credit in default, housing loan, or personal loan. The client was contacted via an unknown communication type on the 18th of June and the call duration was 89 seconds. This was the 5th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2289 euros.###\nHence this label was No."
"The client is a 46-year-old married technician with a secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 10th of July, with the call lasting 185 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 278 euros.###\nHence this label was No."
"The client is a 54-year-old housemaid who is divorced and has a primary education. They do not have credit in default and have an average yearly balance of 502 euros. They have a housing loan but no personal loan. The communication type used for contact is cellular. The last contact was on the 20th of April and lasted 317 seconds. This was the first contact made during this campaign. There is no information on previous campaign outcomes or contact history with the client.###\nHence this label was No."
"The client is a 44-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan. Their average yearly balance is 321 euros, and they do not have a personal loan. The client was contacted via an unknown communication type on the 11th of June for 59 seconds. This was the 8th contact made to the client during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via a cellular phone call on the 17th of November, with the call lasting 199 seconds. This was the first contact made during this marketing campaign. The outcome of any previous marketing campaigns is unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working in an administrative role with a secondary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 20th of November and the call lasted 203 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown since the client was not previously contacted. The client has an average yearly balance of 7 euros.###\nHence this label was No."
"The client is a 50-year-old divorced individual working in management with tertiary education. They do not have credit in default, a housing loan, or a personal loan. Communication was done via cellular phone, and the last contact was made on the 8th of May, lasting 198 seconds. This is the 2nd contact during this campaign, following 5 previous contacts. The outcome of the previous marketing campaign was classified as \"other\". The client's average yearly balance is 356 euros.###\nHence this label was No."
"The client is a 58-year-old divorced individual working in management with an unknown level of education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 16th of September, with a call lasting 414 seconds. This was the first contact made during this campaign, following up after 91 days from the previous campaign where there were 5 contacts. The outcome of the previous campaign was categorized as \"other.\" The client's average yearly balance is 2986 euros.###\nHence this label was Yes."
"The client is a 48-year-old married individual working in administration with secondary education. They do not have credit in default and have a housing loan. They have an average yearly balance of 182 euros and do not have a personal loan. The communication type for the contact is unknown, and the last contact was on the 6th of May for 180 seconds. This is the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"This data represents a married 43-year-old individual working as an admin, with secondary education and no credit in default. They have an average yearly balance of 71 euros and do not have a housing or personal loan. The client was contacted via an unknown communication type in May, with the last contact lasting 180 seconds. This was the 5th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old married individual working in the services sector with a secondary level education. They do not have any credit default, housing loan, or personal loan. Their average yearly balance is negative at 369 euros. The bank contacted them via cellular communication, reaching out on the 14th of July for a 72-second conversation. This was the third contact made during this marketing campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 2378 euros. The contact communication type is unknown. The last contact was made on the 9th day of May, with a duration of 460 seconds, as part of the second contact during this campaign. The client has not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 52-year-old married technician with secondary education and no credit in default. They have an average yearly balance of 64 euros and do not have a housing or personal loan. The client was contacted via telephone on the 29th of August and the call lasted for 20 seconds. This was the second contact made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old retired individual who is married with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 16th of July, with a call duration of 166 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 975 euros.###\nHence this label was No."
"The client is a 40-year-old single individual working in a blue-collar job with primary education. They do not have credit in default, but have a housing loan. They were not previously contacted for marketing. Their average yearly balance is negative. They do not have a personal loan. The communication type used was cellular, and the call lasted for 160 seconds. The client was contacted once during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 56-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and have a housing loan. Their average yearly balance is 1255 euros, and they do not have a personal loan. The bank contacted them via telephone on the 8th of May, with a call duration of 145 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, indicating that the client was not previously contacted.###\nHence this label was No."
"The client is a 33-year-old single individual working in management with secondary education. They do not have any credit default and have a housing loan. They were contacted via an unknown communication type on the 26th of May. The client's average yearly balance is negative at -424 euros, and they do not have a personal loan. The last contact duration was 863 seconds, and this was the first contact during this campaign. There is no information on previous marketing campaign outcome or previous contacts with the client.###\nHence this label was No."
"The client is a 49-year-old single technician with unknown education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cell phone on the 28th of January and the call lasted 91 seconds. This was the third contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 350 euros.###\nHence this label was No."
"The client is a 30-year-old single individual working in the services sector with a secondary level of education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in their account is 566 euros. The communication with the client was done via a cellular phone call on the 5th of February, with a duration of 110 seconds. This was the first contact made during this campaign. There is no information on any previous marketing campaign outcome.###\nHence this label was No."
"The client is a 52-year-old married individual working in a blue-collar job with a secondary level of education. They do not have any credit in default and do not have a housing loan, but they have a personal loan. The average yearly balance in euros is 60. The client was contacted via cellular communication, and the last call lasted 196 seconds. This was the second contact made during this campaign, with no previous contacts. The previous outcome of the marketing campaign is unknown.###\nHence this label was No."
"A 31-year-old single individual working as a blue-collar worker with secondary education was contacted via cellular communication. They do not have a housing or personal loan and have never been in default. Their average yearly balance is 26 euros. The last contact was on the 5th of February and lasted 103 seconds. This was the first contact made to the client during this campaign, and the outcome of any previous campaigns is unknown.###\nHence this label was No."
"The client is a 59-year-old married technician with a tertiary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 883 euros. The contact communication type is cellular. The last contact was on the 18th of September and lasted for 1551 seconds. This was the first contact during this campaign, but the client was contacted 3 times in previous campaigns, with the last contact being 31 days ago and resulting in a failure outcome.###\nHence this label was No."
"This is a record of a 28-year-old married technician with secondary education. They do not have credit in default, have a housing loan, but no personal loan. The client was contacted via cellular communication on the 15th of May and the call lasted 191 seconds. This was the first contact during this campaign, but they were contacted 2 times in a previous campaign, 371 days ago. The outcome of the previous campaign was categorized as 'other'. The client's average yearly balance is 916 euros.###\nHence this label was No."
"The client is a 34-year-old single individual working in the administrative sector with secondary education. They do not have any credit in default and have an average yearly balance of 2677 euros. They have a housing loan but no personal loan. The communication with the client was via cellular phone, and the last contact was on the 20th of November, lasting 259 seconds. This was the first contact made during this campaign. There is no information available about any previous marketing campaigns with this client.###\nHence this label was No."
"The client is a 28-year-old student who is single and has tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 30th of October and the call lasted for 177 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3717 euros.###\nHence this label was No."
"The client is a 41-year-old single technician with tertiary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 13th of August, and the call lasted 209 seconds. This was the 5th time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of €5389.###\nHence this label was No."
"The client is a 58-year-old retired married individual with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, with the last call lasting 54 seconds on the 5th of August. This was the third contact made during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 571 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in an administrative role with secondary education. They do not have any credit in default and have a housing loan. They have been contacted via cellular communication and the last call lasted for 80 seconds. So far, they have been contacted 4 times during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1358 euros and they do not have a personal loan. The last contact was made on the 14th day of May.###\nHence this label was No."
"The client is a 54-year-old married individual working in management with a tertiary education and no credit in default. They have an average yearly balance of 11 euros and do not have any housing or personal loans. The client was contacted via an unknown communication type on the 14th of May for 452 seconds, as part of a campaign where 2 contacts were made. There were no previous contacts with the client, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"A 28-year-old married individual working in the services sector, with secondary education, and no credit default, was contacted for a marketing campaign. They have a housing and personal loan, with an average yearly balance of 468 euros. The contact was made via an unknown communication type, lasting 222 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with the client is unknown.###\nHence this label was No."
"The client is a 36-year-old married technician with a primary education and no credit in default. They have no housing or personal loans. The average yearly balance in euros is 0. They were contacted via an unknown communication type on the 4th of July, with a call duration of 584 seconds. This is the first contact during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 52-year-old divorced individual working in the services sector with primary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The communication type during the marketing campaign is unknown. The client was last contacted on the 12th of May and the call lasted for 179 seconds. This was the second contact made to the client during this campaign. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 111 euros.###\nHence this label was No."
"The client is a 38-year-old entrepreneur who is single and has a secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication and had a successful previous marketing campaign with them. The client's average yearly balance is 2543 euros. The last contact with the client was on the 11th of November, lasting 357 seconds. This was the third contact made during the current campaign, with 93 days passing since the client was last contacted in a previous campaign. In total, this client has been contacted 5 times before this campaign.###\nHence this label was Yes."
"The client is a 39-year-old married blue-collar worker with secondary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 13 seconds on the 18th of May. This was the 4th contact during this campaign, following up after 362 days from the previous campaign contact. The outcome of the previous campaign was categorized as \"other\". The client's average yearly balance is 4430 euros.###\nHence this label was No."
"The client is a 49-year-old divorced technician with primary education. They do not have credit in default and have a personal loan. They do not have a housing loan. The average yearly balance is 1807 euros. The contact communication type is unknown. The last contact was made on the 3rd of July and lasted 122 seconds. This is the third contact made during this campaign to this client, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working in management with a secondary education. They do not have credit in default and do not have a housing loan, but they do have a personal loan. The client was contacted via cellular communication, with the last contact being on the 30th of July for 117 seconds. This was the 17th contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is negative at -62 euros.###\nHence this label was No."
"The client is a 45-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via telephone on the 12th of May for a duration of 422 seconds. This was the second contact made during this campaign. The client was not contacted previously. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 644 euros.###\nHence this label was No."
"The client is a 37-year-old married entrepreneur with a tertiary education. They do not have credit in default and do not have a housing loan, but they do have a personal loan. They were contacted via cellular communication, with the last call lasting 140 seconds on the 1st of July. This was the 3rd contact made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1649 euros.###\nHence this label was Yes."
"The client is a 43-year-old divorced individual working in management with tertiary education. They do not have any credit in default or existing housing or personal loans. The bank contacted them via telephone on the 28th of August and the call lasted for 146 seconds. This client has been contacted 19 times during this campaign but has not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3327 euros.###\nHence this label was No."
"The client is a 30-year-old single student with a secondary education. They do not have any credit in default and have a yearly balance of 948 euros. They have a housing loan but no personal loan. The communication with the client was through a cellular phone, and the last call lasted for 150 seconds on the 11th day of May. This was the first contact during this campaign, but there were 2 previous contacts in the past, resulting in a failure outcome. The client was last contacted 370 days ago.###\nHence this label was No."
"The client is a 57-year-old married housemaid with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 22nd of August. The call lasted for 197 seconds, and it was the 2nd contact made during this campaign. The client has not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown to the bank.###\nHence this label was No."
"The client is a 79-year-old retired individual who is divorced and has primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 13th of July, and the call lasted for 617 seconds. This was the first time they were contacted during this campaign, but they were previously contacted 377 days ago with a successful outcome. The average yearly balance in their account is 2787 euros.###\nHence this label was Yes."
"The client is a 47-year-old unemployed married individual with primary education. They do not have credit in default and have a housing loan, but no personal loan. The bank contacted them via telephone on the 30th of January and the call lasted for 66 seconds. This was the second time they were contacted during this campaign, after a gap of 241 days from the previous contact. The outcome of the previous marketing campaign with the client was classified as \"other\". The client's average yearly balance is 168 euros.###\nHence this label was No."
"The client is a 76-year-old retired individual who is married with a primary education. They do not have any credit in default, housing loan, or personal loan. The bank communicated with them via cellular phone and contacted them on the 11th of February. The call lasted for 309 seconds. This client was previously contacted 90 days ago and the outcome of that campaign was successful. This current campaign is the 5th contact with the client.###\nHence this label was Yes."
"The client is a 41-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication during the month of August. The client's average yearly balance is negative. During the current campaign, they were contacted 6 times, with the last call lasting for 171 seconds. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is 40 years old, unemployed, single, with secondary education, and does not have credit in default. They have an average yearly balance of 6 euros and do not have a housing or personal loan. The client was contacted via an unknown communication type on the 9th of June, with a call duration of 134 seconds. This is their third contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old single technician with tertiary education. They do not have credit in default but have a housing loan. They do not have a personal loan and were contacted via an unknown communication type in May. The client has an average yearly balance of 231 euros. The last contact duration was 198 seconds, and this was the second contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old individual with an unknown job and education status, who is married. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 164. The communication type for the marketing campaign was cellular. The client was last contacted on the 4th of August for 119 seconds, as part of the 2nd contact made in this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is 35 years old, employed in the services sector, married, with secondary education, and does not have credit in default. They have a negative average yearly balance of 50 euros. They do not have a housing or personal loan. The client was contacted via cellular communication and the call lasted for 71 seconds. This was the first contact made during this campaign. The client was not previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old divorced technician with secondary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 11th of August for a duration of 105 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign with this client is unknown. The client's average yearly balance is 256 euros.###\nHence this label was No."
"The client is a 38-year-old married individual working in the services sector with secondary education. They do not have any credit in default but have a personal loan. Their average yearly balance is 1 euro. They do not have a housing loan. The client was contacted via cellular communication and the last call lasted 152 seconds on the 21st of November. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 49-year-old divorced individual working in the administrative sector with a secondary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is in the negative. The bank contacted them via cellular communication on the 11th of May and the call lasted for 469 seconds. This was the second time they were contacted during this campaign, with the previous contact happening 350 days ago. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 63-year-old married housemaid with tertiary education, no credit defaults, and no housing or personal loans. They were contacted via cellular communication on the 18th of January and had a call duration of 309 seconds. This was their 2nd contact during the current campaign, with 95 days passed since the previous campaign contact. The outcome of the previous campaign was a success.###\nHence this label was No."
"The client is a 45-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have housing and personal loans. They were contacted via cellular communication and the last call lasted 245 seconds. This is the second time they are being contacted during this campaign, with the previous contact being 343 days ago, resulting in a failed outcome.###\nHence this label was No."
"This individual is a 57-year-old divorced person working in management with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 12th of August, and the call lasted for 108 seconds. This was the second time they were contacted during this campaign, with no prior contacts. The outcome of the previous campaign is unknown. Their average yearly balance is 396 euros.###\nHence this label was No."
"The client is a 39-year-old divorced individual working in the administrative field with secondary education. They do not have credit in default and have both a housing loan and a personal loan. The average yearly balance in euros is 399. The client was last contacted in August via cellular communication for 133 seconds. This is the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old married individual working in an administrative role with secondary education. They do not have any credit in default and maintain an average yearly balance of 568 euros. They have a housing loan but no personal loan. The communication with the client was via cellular phone. The last contact was on the 4th day of February, with a call duration of 11 seconds. This was the 6th contact made during this campaign, and the client was last contacted 252 days ago from a previous campaign, where 4 contacts were made. The outcome of the previous marketing campaign was categorized as 'other'.###\nHence this label was No."
"A 37-year-old married individual with a management job and tertiary education was contacted via cellular communication. They do not have credit in default, but have a housing loan. They do not have a personal loan. The average yearly balance is 489 euros. In the current marketing campaign, they were contacted 5 times, with the last contact lasting 205 seconds. This is their first contact in this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old individual with an unknown job, single marital status, and unknown education level. They have credit in default and an average yearly balance of 61 euros. They do not have a housing loan or personal loan. The communication type used to contact them is unknown. The client was last contacted on the 20th of June and the call lasted for 115 seconds. This was the first contact made during this marketing campaign. There is no information available about any previous marketing campaigns targeting this client.###\nHence this label was No."
"A married 41-year-old blue-collar worker with primary education and no credit in default was contacted via cellular communication. They have a housing loan but no personal loan. During the current campaign, they were contacted 3 times, with the last call lasting 611 seconds on the 20th of November. This client was not contacted in any previous campaign, and the outcome of the previous marketing campaign is unknown. They have an average yearly balance of 3803 euros.###\nHence this label was No."
"A 49-year-old married individual working in administration with secondary education was contacted via cellular communication for a marketing campaign. They have no credit in default, do not have a housing or personal loan, and had an average yearly balance of 635 euros. The client was last contacted on the 25th of August for 220 seconds as part of the third contact in this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old single technician with secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 23rd of July, with a call duration of 711 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 329 euros.###\nHence this label was No."
"The client is a 41-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default and have housing and personal loans. The average yearly balance is 1522 euros. The client was contacted via cellular communication on the 20th of April and the call lasted for 377 seconds. This was the first contact made during this campaign, with 2 previous contacts made in the past. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 26-year-old single individual working in management with tertiary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 23rd of February for 176 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 42-year-old married technician with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in April. The client was last contacted on the 9th of the month and the call lasted for 230 seconds. This is the second time they have been contacted during this campaign, with 325 days passing since the previous contact. The outcome of the previous marketing campaign was labeled as \"other\".###\nHence this label was No."
"The client is a 44-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 6th of August, and the call lasted for 113 seconds. This was the 4th contact made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1858 euros.###\nHence this label was No."
"The client is a 41-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 25th of August. The call duration was 160 seconds, and this was the 4th contact made during this campaign. The client had not been contacted before. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2039 euros.###\nHence this label was No."
"The client is a 40-year-old married housemaid with secondary education. They do not have any credit in default, but they have a housing loan. The client does not have a personal loan. The bank contacted the client via cellular communication on the 11th of May and the call lasted 508 seconds. This was the 3rd contact made to the client during this campaign, with 5 contacts made in previous campaigns. The client was last contacted 173 days ago. The outcome of the previous marketing campaign with this client was a failure.###\nHence this label was No."
"The client is a 31-year-old married technician with a tertiary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication and the last call lasted 118 seconds on the 19th of August. This was the second contact during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 6562 euros.###\nHence this label was No."
"The client is a 41-year-old married individual working in administration with a secondary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 19th of May. The call lasted for 657 seconds. This was the second time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3855 euros.###\nHence this label was No."
"The client is a 48-year-old married individual working in a management position with tertiary education. They do not have any credit in default and do not have a housing loan, but they do have a personal loan. They were contacted via cellular communication on the 19th of November and the call lasted for 37 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, indicating that the client may not have been contacted before. The client has an average yearly balance of 5057 euros.###\nHence this label was No."
"The client is a 37-year-old single individual working in management with tertiary education. They do not have any credit in default and do not have a housing or personal loan. They were contacted via cellular communication on the 7th of July and the call lasted for 643 seconds. This was the third contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 0 euros.###\nHence this label was No."
"The client is a 44-year-old single admin worker with secondary education. They do not have credit in default, have a housing loan and a personal loan. They were contacted via cellular communication, with the last call lasting 158 seconds on the 12th of May. This is the second call made to the client during this campaign. The client has not been previously contacted for a marketing campaign. The outcome of the previous campaign is unknown. The client's average yearly balance is 469 euros.###\nHence this label was No."
"The client is a 56-year-old married individual working in the services sector with secondary education. They do not have any credit in default and have a housing loan. Their average yearly balance is 642 euros, and they do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting 16 seconds on the 30th of January. This was the first contact during this campaign, but they were contacted 3 times in the past. The outcome of the previous campaign was categorized as \"other\".###\nHence this label was No."
"The client is a 60-year-old married individual working in the administration sector with a secondary level of education. They do not have credit in default but have a housing loan. They do not have a personal loan. The average yearly balance in euros is 12210. The communication type for the last contact is unknown, which lasted for 256 seconds on the 19th of May. This is the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married technician with a secondary level education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 127 seconds on the 17th of July. This was the third contact during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown. The average yearly balance in their account is 1081 euros.###\nHence this label was No."
"The client is a 64-year-old retired individual who is married with a secondary education. They do not have any credit in default and have an average yearly balance of 571 euros. They have a housing loan but do not have a personal loan. The communication type for contact is cellular, and the last contact was on the 20th of April for a duration of 1422 seconds. This is the second contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
