"A 56-year-old married technician with a tertiary education, having no credit in default and no existing housing or personal loans, was contacted via an unknown communication type on the 19th of June. During this contact, which lasted 22 seconds, it was the first time he was approached in the current campaign. The outcome of any previous marketing efforts targeting him is unknown. The client's average yearly balance is at 1663 euros.###\nHence this label was No."
"The client is a 25-year-old single individual working in an administrative role with secondary education. They do not have any credit in default and have an average yearly balance of 122 euros. They have a housing loan but no personal loan. The communication type for the marketing campaign is unknown. The client was last contacted on the 6th of May, with a call duration of 286 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaigns is unknown.###\nHence this label was No."
"The client is a 32-year-old married technician with secondary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 20th of August. The call lasted 210 seconds, and it was the second time they were contacted during this campaign. There was no previous contact with the client, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 20 euros.###\nHence this label was No."
"The client is a 36-year-old divorced individual working in administration, with a secondary level of education. They do not have any credit in default and have an average yearly balance of 181 euros. They have a housing loan but no personal loan. The communication type for contacting the client is cellular. The last contact was on the 7th of May, lasting 271 seconds. This is the second time they have been contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 40-year-old married individual working in the services sector with a secondary level education was contacted via cellular communication for a marketing campaign. They do not have any credit in default, but have both housing and personal loans. They have an average yearly balance of 87 euros. The last contact was made on the 31st of July and lasted 247 seconds. This was the 4th contact made during this campaign, with no prior contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with primary education. They do not have credit in default and have housing and personal loans. They were contacted via cellular communication in April and had a previous campaign contact duration of 399 seconds. This is the second contact in the current campaign, following 2 previous contacts. The client's average yearly balance is 738 euros. The outcome of the previous marketing campaign was a failure, and 258 days had passed since the client was last contacted.###\nHence this label was No."
"The client is a 53-year-old retired married individual with secondary education and no credit in default. They have a negative yearly balance, do not have a housing or personal loan, and were contacted through an unknown communication type in May. The last call lasted 209 seconds, it was the 9th contact made during this campaign, with no previous contacts. The outcome of the previous campaign is unknown.###\nHence this label was No."
"A 34-year-old married individual working in management with a tertiary education was contacted via cell phone regarding a banking campaign. They do not have any credit in default, but have a housing loan. They have a relatively average yearly balance of 490 euros and do not have a personal loan. The call lasted 491 seconds and it was the first contact made during this campaign. The outcome of the previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 72-year-old married individual working in management with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 3rd day of September. The call lasted 531 seconds, and it was the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown. This client has an average yearly balance of 6199 euros.###\nHence this label was No."
"A 46-year-old single housemaid with tertiary education, who does not have any credit in default, housing loan or personal loan, was contacted via telephone on the 15th of June. They have an average yearly balance of 3232 euros. During this campaign, they were contacted twice and the calls lasted 94 seconds each time. The client had not been previously contacted for marketing purposes. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 59-year-old divorced individual working in management with a tertiary education. They do not have any credit in default, have a housing loan, but do not have a personal loan. They were contacted via cellular communication on the 20th of November and the call lasted for 470 seconds. This was the second contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 17,056 euros.###\nHence this label was No."
"The client is a 28-year-old single technician with secondary education. They do not have credit in default and do not have a housing loan, but they do have a personal loan. The average yearly balance is 440 euros. The client was contacted via cellular communication and the last call duration was 177 seconds. This is the second call during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The person is a 50-year-old entrepreneur who is divorced and has a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 19th of November. The last call duration was 630 seconds, and it was the first contact made during this marketing campaign. There is no record of previous contact with this client. The outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 816.###\nHence this label was No."
"The client is a 52-year-old married individual working in a management position with a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 258 euros. The last contact was made on the 14th of May, with a duration of 188 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, and the communication type used is also unknown.###\nHence this label was No."
"A 41-year-old married individual with a management job and tertiary education was contacted via cellular communication. They do not have credit in default, have a housing loan but no personal loan. Their average yearly balance is 4063 euros. The last contact was made on the 12th of May, lasting 14 seconds. This was the 5th contact during this campaign and the client was contacted 172 days after the previous campaign. Prior to this, 2 contacts were made, resulting in a previous marketing campaign failure.###\nHence this label was No."
"The client is a 31-year-old single individual working in an administrative role with a tertiary education. They do not have any credit in default, but they have a housing loan. Their average yearly balance is €1531, and they do not have a personal loan. The client was contacted via an unknown communication type, with the last call lasting 48 seconds on the 28th day of May. This was the 5th contact made to the client during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married technician with secondary education. They do not have credit in default, but have a housing loan. They do not have a personal loan. The last contact was made via cellular communication, lasting 361 seconds on the 5th of February. This was the first contact during this campaign, following up after 253 days from the previous campaign where there were 2 contacts, resulting in a failure outcome. The average yearly balance is -378 euros.###\nHence this label was No."
"The client is a 34-year-old single admin with secondary education. They do not have credit in default, housing, or personal loans. The average yearly balance is 1 euro. The contact was made via an unknown communication type on the 25th of June, with a call duration of 247 seconds. This was the first contact made to this client during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual working in a blue-collar profession with primary education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 19th of November. The call lasted for 370 seconds, and it was the first contact made during this campaign. There is no record of previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 10443 euros.###\nHence this label was No."
"The client is a 52-year-old retired married individual with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 1052 euros. The communication type for the last contact is unknown, which lasted for 35 seconds on the 29th of May. This was the first contact made during this campaign. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 57-year-old married housemaid with primary education and no credit in default. They have an average yearly balance of 1969 euros and do not have any housing or personal loans. The bank contacted them via cellular communication on the 14th of August, with a call duration of 286 seconds. This was the third contact made to the client during this campaign. They have not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"This is a record of a 35-year-old divorced individual working in management with a tertiary education. They do not have credit in default, but have a housing loan. They were not contacted before for a marketing campaign, and the outcome of any previous campaign is unknown. Their average yearly balance is 36 euros and they do not have a personal loan. They were contacted 6 times during this campaign, with the last contact lasting 182 seconds on the 13th of May. The communication type is unknown.###\nHence this label was No."
"The client is a 35-year-old married technician with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 18th of May. The call lasted for 132 seconds. This was the second time the client was contacted during this campaign, with 360 days passing since the last contact from a previous campaign. The outcome of the previous marketing campaign was a failure. The client's average yearly balance is 1092 euros.###\nHence this label was No."
"The client is a 60-year-old married technician with secondary education. They do not have credit in default, a housing loan but they do have a personal loan. They were contacted via cellular communication on the 18th of July for 112 seconds. This is the second time they have been contacted in the current campaign. There is no information on previous campaign contacts or outcomes. The client's average yearly balance is 851 euros.###\nHence this label was No."
"The client is a 52-year-old married individual working in the services sector with tertiary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 3094 euros. The communication type used for contact was cellular, and the last call was on the 17th of November, lasting 96 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old self-employed individual who is married with tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 753. The contact communication type is unknown and the last contact was on the 17th of June for 31 seconds. This is the first contact made during this campaign and there was no previous contact with the client. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 25-year-old single individual working in management with tertiary education. They do not have any credit in default, housing loan, or personal loan. The communication type used during the marketing campaign is unknown. The client was last contacted on the 9th of July for 119 seconds. This is the first contact during this campaign, and there was no previous contact with the client from earlier campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 710 euros.###\nHence this label was No."
"The client is a 33-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default and have a yearly average balance of 932 euros. They have a housing loan but no personal loan. The communication type for the last contact is unknown, which took place on the 21st of May and lasted for 226 seconds. This is the first contact made during this campaign. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 52-year-old married entrepreneur with primary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 2138. The communication type during the campaign was unknown, and the last contact was on the 17th of June for 134 seconds. This was the first contact during this campaign, and there was no previous campaign contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married technician with a secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. They were contacted via an unknown communication type on the 23rd of May. The call lasted for 72 seconds and this was the second time they were contacted during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 207 euros.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with tertiary education. They do not have any credit in default but have both a housing and personal loan. The average yearly balance is negative at 83 euros. They were contacted via cellular communication, with the last call lasting 131 seconds on the 11th of July. This was the second contact made to the client during this campaign. The client has not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default but have a housing loan. Despite having no personal loan, their average yearly balance is 4111 euros. The contact communication type is unknown, and the last contact was made on the 19th of May, lasting 211 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old married individual working in a management role with a secondary level education. They do not have any credit in default and do not have any housing or personal loans. The average yearly balance in their bank account is 123 euros. The bank contacted them via a cellular phone call on the 2nd day of February, and the call lasted for 154 seconds. This was the second contact made to the client during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"A 27-year-old unemployed individual who is single and holds a tertiary education level was contacted via cellular communication. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is 1 euro. They were last contacted on the 3rd of February for 65 seconds during the second call of this campaign. Prior to this, they have not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old blue-collar worker who is divorced and has secondary education. They do not have credit in default and have a housing loan but no personal loan. The communication type for contacting the client is unknown. The last contact was on the 16th of May and lasted for 277 seconds. This was the 6th contact made during this campaign. There were no previous contacts with the client from previous campaigns and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 9 euros.###\nHence this label was No."
"The client is a 53-year-old blue-collar worker who is divorced. They have a primary level of education and do not have any credit in default. With an average yearly balance of 255 euros, they have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 8th day of May. The call lasted 206 seconds, and this was the second time they were contacted during the current campaign. There is no information on previous contacts or outcomes of previous marketing campaigns.###\nHence this label was No."
"The client is a 37-year-old divorced individual working in the services sector with a secondary level of education. They do not have any credit in default and have an average yearly balance of 241 euros. They have a housing loan but do not have a personal loan. The communication with the client was done via cellular phone. The last contact was made on the 14th of May and lasted 189 seconds. This was the second time they were contacted during this campaign, with the previous contact being 371 days ago, resulting in a failed outcome.###\nHence this label was No."
"The client is a 49-year-old married individual working in management with a tertiary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 2139. The client was contacted via cellular communication on the 5th of August and the call lasted 278 seconds. This was the first contact made during this campaign. There is no record of any previous contact or outcome from a previous marketing campaign.###\nHence this label was No."
"The client is a 39-year-old married individual working in management with a tertiary education. They do not have credit in default and have a housing loan but no personal loan. Communication was done via cellular phone. The last contact was made on the 19th of August, lasting 391 seconds. This was the 6th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 5495 euros.###\nHence this label was No."
"The client is a 45-year-old married housemaid with secondary education. They do not have credit in default, do not have a housing loan but have a personal loan. Their average yearly balance is 870 euros. They were contacted via an unknown communication type on the 19th of June for 258 seconds. This was the second contact made to them during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 76-year-old married housemaid with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication and made 4 calls, with the last call lasting 90 seconds in August on the 2nd day of the month. This was the first time they were contacted for this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1483 euros.###\nHence this label was No."
"The client is a 29-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default but have a housing loan. The client does not have a personal loan. They were contacted via cellular communication on the 24th of July and the call lasted for 257 seconds. This was the second contact made to the client during this marketing campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 787 euros.###\nHence this label was No."
"The client is a 34-year-old married technician with a secondary education. They do not have credit in default but have a housing loan. They have no personal loan. The bank contacted them via cellular communication on the 23rd of July, with a call duration of 429 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not contacted before.###\nHence this label was No."
"The client is a 33-year-old married technician with secondary education. They do not have any credit in default, housing loan, but have a personal loan. The average yearly balance in euros is 362. The communication with the client was through a cellular phone call that lasted 160 seconds. This client was contacted 6 times during this campaign and was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working in the services sector with secondary education. They have credit in default and do not have a housing or personal loan. The bank contacted them via cellular communication in May. The call lasted for 136 seconds, which was the 5th contact made during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2 euros.###\nHence this label was No."
"The client is a 32-year-old married technician with secondary education. They do not have credit in default and have an average yearly balance of 765 euros. They have a housing loan and a personal loan. The bank contacted them via cellular communication on the 14th of April, with the call lasting 850 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous campaign is unknown.###\nHence this label was Yes."
"The client is a 31-year-old divorced individual working in the services sector with a secondary level of education. They do not have credit in default, but they have a housing loan. They do not have a personal loan. The client was contacted by phone, but the communication type is unknown. The last contact was on the 9th of May, and it lasted for 208 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1656 euros.###\nHence this label was No."
"The client is a 39-year-old married individual working in an administrative role with secondary education. They do not have any credit in default and have a housing loan but no personal loan. Their average yearly balance is 973 euros. The bank contacted them via cellular communication and had a 172-second long conversation during the last call in September. This was the fourth contact in the current campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old divorced housemaid with primary education. They do not have credit in default, housing loan, or personal loan. They were contacted via an unknown communication type on the 9th of June. The call lasted for 97 seconds. This was the first contact made with the client during this campaign. The outcome of any previous marketing campaigns with this client is unknown. Their average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 40-year-old divorced individual working in administration with secondary education. They do not have credit in default and have a relatively low average yearly balance of 1000 euros. They have a housing loan but no personal loan. The last contact was made on the 14th of May with an unknown communication type, lasting 98 seconds. This was the first contact during this campaign, and there is no record of previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 22-year-old student who is single. They have secondary education and do not have any credit in default. With an average yearly balance of 111 euros, they have a housing loan but no personal loan. The communication type for the last contact is unknown, which lasted 89 seconds. This client was contacted once during this campaign, and it was the first time they were contacted. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 45-year-old married entrepreneur with primary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The contact was made through an unknown communication type on the 15th of May. The call lasted for 95 seconds, and this was the 3rd contact made to the client during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1953 euros.###\nHence this label was No."
"The client is a 63-year-old retired individual who is divorced and has primary education. They do not have credit in default, a housing loan, or a personal loan. The bank communicated with them via a cellular phone call on the 12th of March, with the call duration lasting 71 seconds. This was the third contact made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1840 euros.###\nHence this label was No."
"The client is a 54-year-old married individual working in a blue-collar job with unknown education status. They do not have credit in default but have a housing loan. Their average yearly balance is in the negative. They do not have a personal loan. The last contact was made on the 26th of May for 227 seconds. This was the first contact during this campaign, and there is no previous contact history. The outcome of the previous campaign is unknown. The communication type for the contact is also unknown.###\nHence this label was No."
"The client is a 37-year-old married individual working in the administrative sector with secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 1559. The communication with the client was done through a cellular phone. The last contact was made on the 27th of May, and it lasted for 81 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 47-year-old married entrepreneur with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 495 seconds on the 2nd day of February. This was the first contact during this campaign, with 258 days passing since the client was last contacted from a previous campaign where the outcome was a failure. The client's average yearly balance is 583 euros.###\nHence this label was No."
"This data is about a 29-year-old single individual working in the services sector with secondary education. They do not have any credit in default, have housing and personal loans. The average yearly balance is 23 euros. The communication with the client was done via cellular phone. The last contact was made on the 18th of May, with a duration of 159 seconds. This client has been contacted 3 times during this campaign and 2 times in previous campaigns. The outcome of the previous marketing campaign was described as \"other.\"###\nHence this label was No."
"The client is a 48-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default but have a housing loan. Their average yearly balance is 5306 euros, and they do not have a personal loan. They were last contacted via cellular communication on the 18th of May, with a call duration of 66 seconds. This is the second time they have been contacted during this campaign, with 368 days passing since they were last contacted in a previous campaign. The outcome of the previous marketing campaign with this client was a failure.###\nHence this label was No."
"The client is a 30-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication, and the last call duration was 18 seconds on the 5th day of May. This was the 6th contact made during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 203 euros.###\nHence this label was No."
"The client is a 31-year-old self-employed individual who is single and holds a tertiary education degree. They do not have any credit in default, housing loan, or personal loan. The communication with the client was done via cellular phone. The last contact was made on the 19th of November, with a duration of 501 seconds. This was the 4th contact made during the current campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 217 euros.###\nHence this label was No."
"The client is a 48-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and do not have any housing or personal loans. The client was last contacted on the 11th of June through an unknown communication type, with the call lasting 409 seconds. This was the third contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3304 euros.###\nHence this label was No."
"A 31-year-old unemployed single individual with secondary education and no credit in default was contacted via an unknown communication type. They have a housing loan but no personal loan. The average yearly balance is 8 euros. The last contact was made on the 2nd of June and lasted for 123 seconds. This was the first contact made during this campaign, and there was no previous contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married technician with a tertiary education. They do not have credit in default, have a housing loan, and a personal loan. The average yearly balance is 816 euros. The client was contacted via an unknown communication type on the 29th of May and the call lasted 159 seconds. This was the first contact made to the client during this campaign. There is no information available on previous campaign contacts or outcomes.###\nHence this label was No."
"The client is a 33-year-old unemployed married individual with secondary education. They have credit in default, a housing loan, and a personal loan. The bank contacted them via cellular communication on the 19th of November, with a call duration of 286 seconds, as part of the third contact during this campaign. They were not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is -108 euros.###\nHence this label was No."
"The client is a 53-year-old married individual working in management with a tertiary level of education. They do not have any credit in default and have an average yearly balance of 241 euros. They have a housing loan but do not have a personal loan. The client was contacted via cellular communication on the 19th of November for 137 seconds. This is the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 59-year-old married individual working in a management position with a tertiary education. They do not have credit in default, but they have housing and personal loans. The average yearly balance is 261 euros. The communication with the client was through a cellular phone call that lasted 124 seconds on the 21st of November. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 7th of July, and the call lasted for 46 seconds. This was the 5th contact made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3969 euros.###\nHence this label was No."
"The client is a 34-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 14th of May. The call lasted for 330 seconds, and this was the second contact made during this campaign. There is no record of any previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2447 euros.###\nHence this label was No."
"The client is a 39-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default but have a housing loan. Their average yearly balance is in the negative. They do not have a personal loan. The client was contacted via cellular communication, and the last call duration was 282 seconds. This is the first contact during this campaign, but there were 2 previous contacts. The previous marketing campaign outcome was a failure. The client was last contacted 352 days ago in May on the 14th day of the month.###\nHence this label was No."
"The client is a 27-year-old married housemaid with primary education. They do not have credit in default but have housing and personal loans. The average yearly balance is 3 euros. The communication type was cellular, and the last contact was on the 30th of July for 64 seconds. This was the 4th contact made during this campaign with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old single individual working in a blue-collar job with primary education. They do not have credit in default but have housing and personal loans. The average yearly balance in their bank account is 2369 euros. The communication type for the marketing campaign was cellular, and the client was last contacted on the 20th of November for 470 seconds. This was the second time they were contacted during this campaign, with no prior contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 29-year-old single admin with secondary education. They do not have credit in default but have a housing loan. Their average yearly balance is 1070 euros and they do not have a personal loan. They were contacted via an unknown communication type on the 19th of May. The call lasted 30 seconds and it was the first contact in this campaign, but they were previously contacted 357 days ago. The outcome of the previous marketing campaign was classified as \"other.\"###\nHence this label was Yes."
"The client is a 41-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via an unknown communication type on the 8th of May, with the call lasting 63 seconds. This was the second contact during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous campaign is unknown. Their average yearly balance is 225 euros.###\nHence this label was No."
"The client is a 55-year-old divorced individual working in management with a tertiary level of education. They do not have any credit in default and have an average yearly balance of 608 euros. They have a housing loan but no personal loan. The communication type is cellular. The last contact was on the 7th of May, with a duration of 161 seconds. This is the second time they have been contacted during this campaign. There is no record of previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old single individual working in management with secondary education. They do not have any credit in default, but they have housing and personal loans. The average yearly balance in their account is 24 euros. The bank contacted them via cellular communication on the 11th of August, and the call lasted for 232 seconds. This was the 4th contact made to the client during this campaign. They have not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 49-year-old married entrepreneur with primary education. They do not have credit in default, but they have housing and personal loans. The client was contacted via cellular communication on the 13th of May. The call lasted for 99 seconds. This was the first contact made during this campaign. There is no information available about any previous marketing campaigns with this client.###\nHence this label was No."
"The client is a 58-year-old married technician with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 15th of October for a duration of 441 seconds. This is the 5th contact during this campaign, with 246 days passed since the client was last contacted. The outcome of the previous marketing campaign was a failure.###\nHence this label was Yes."
"The client is a 54-year-old self-employed individual who is single and holds a tertiary education degree. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 21st of November, with the call lasting for 336 seconds. This was the first contact made during the current marketing campaign. The outcome of any previous marketing campaign with this client is unknown. The client's average yearly balance is 760 euros.###\nHence this label was No."
"The client is a 73-year-old retired individual, married, with tertiary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 2575. The communication type for the marketing campaign was cellular. The last contact was on the 17th of August, with a duration of 152 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, as the client was not previously contacted.###\nHence this label was No."
"The client is a 46-year-old married individual working in the services sector with unknown education level. They do not have credit in default and have an average yearly balance of 854 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication and the last call duration was 478 seconds. This is the third call made to the client during this campaign. The last contact was made on the 3rd of April. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old self-employed individual who is married with a secondary level of education. They do not have credit in default and have a yearly average balance of 65 euros. They do not have a housing loan but do have a personal loan. The communication with the client was done via cellular phone, and the last contact was on the 9th of July, with a duration of 171 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default and have a yearly average balance of 2313 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 12th of May, with a call duration of 788 seconds. This was the second call made to the client during this campaign. There is no information on previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 43-year-old married entrepreneur with secondary education. They do not have credit in default, but they do have a housing loan. Their average yearly balance is 3862 euros and they do not have a personal loan. The bank made one phone call to the client, which lasted 102 seconds. The call was made on the 3rd day of June. This is the first time the bank has contacted the client for this campaign, and the outcome of any previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default and have a housing loan. The client does not have a personal loan. They were contacted via an unknown communication type on the 19th of May. The call duration was 149 seconds, and this was the 4th time they were contacted during this campaign. There is no information on previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2128 euros.###\nHence this label was No."
"The client is a 31-year-old single technician with a tertiary education. They have credit in default, a yearly balance of 24 euros, and no housing or personal loans. The bank contacted them via cellular communication on the 21st of August for 246 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 53-year-old married individual working in management with secondary education. They have a credit in default, a housing loan, but no personal loan. The average yearly balance is negative at -689 euros. The contact communication type is unknown. The last contact was on the 13th of May and lasted for 242 seconds. This was the first contact made during this campaign. Previous marketing campaign outcome is unknown for this client.###\nHence this label was No."
"The client is a 25-year-old student who is single and has an unknown level of education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 27th of May, with a call duration of 311 seconds. This was the second contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 277 euros.###\nHence this label was Yes."
"The client is a 44-year-old married technician with tertiary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in their bank account is 964 euros. The bank contacted them via cellular communication on the 29th of July, and the call lasted for 158 seconds. This was the 2nd contact made to the client during this campaign. The client has not been contacted before for any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old married technician with a tertiary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 16th of April, with a call duration of 901 seconds. This was the second call made to this client during the current campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 4596 euros.###\nHence this label was Yes."
"The client is a 35-year-old married entrepreneur with tertiary education and no credit in default. They do not have a housing or personal loan. The bank contacted them via cellular communication on the 18th of November. The call duration was 150 seconds, and this was the 4th contact made during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. Their average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 41-year-old unemployed individual who is married with a secondary level education. They do not have credit in default and have a yearly balance of 2081 euros. They have a housing loan but no personal loan. The contact was made via cellular communication, with the last call lasting 53 seconds on the 3rd day of February. This was the third call made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old divorced individual working in a blue-collar job with a secondary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via an unknown communication type on the 2nd of June. The call lasted 187 seconds, and this was the 9th contact made during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default and have a housing loan. They have been contacted via cellular communication, and during the current campaign, they have been contacted 3 times with the last call lasting 14 seconds. The last contact was made on the 18th of May, with 178 days passed since the previous campaign contact. The client does not have a personal loan and had 3 contacts in the previous campaign, resulting in an 'other' outcome.###\nHence this label was No."
"The client is a 43-year-old married technician with tertiary education and no credit in default. They have an average yearly balance of 1485 euros and do not have housing or personal loans. The client was contacted via cellular communication on the 21st of August and the call lasted for 180 seconds. This is the second contact made during this campaign, with no previous contact history available. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 26-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default, but have a housing loan. They have an average yearly balance of 755 euros and do not have a personal loan. The client was contacted via an unknown communication type on the 28th of May. The call lasted for 61 seconds and it was the first contact made during this campaign. There is no information available about previous marketing campaigns with this client.###\nHence this label was No."
"This client is a 28-year-old married technician with secondary education. They do not have credit in default, have a housing loan but no personal loan. They were contacted via cellular communication on the 15th of May and the call lasted 191 seconds. This was the first contact made during this campaign, but they were contacted twice in a previous campaign, which took place 371 days ago. The outcome of the previous campaign was not successful. The client's average yearly balance is 916 euros.###\nHence this label was No."
"The client is a 37-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default but have housing and personal loans. The client was contacted via cellular communication and the last call duration was 10 seconds. This is the 7th contact made during this campaign, with a gap of 113 days since the client was last contacted from a previous campaign. There were 5 contacts made before this campaign. The outcome of the previous marketing campaign was a failure. The client's average yearly balance is 2066 euros.###\nHence this label was No."
"A 37-year-old married individual working as a blue-collar worker with primary education was contacted via cellular communication. They have an average yearly balance of 89 euros, a housing loan, and no personal loan. The last contact was made on the 2nd of February, with a duration of 393 seconds. This was the 1st contact made during this campaign, following 4 previous contacts. The outcome of the previous marketing campaign was a failure, and the client does not have credit in default.###\nHence this label was No."
"This individual is a 45-year-old self-employed married person with secondary education. They do not have credit in default, a housing loan, or a personal loan. They were contacted via an unknown communication type on the 20th of June. The call lasted for 76 seconds, and this was the 4th contact made during this campaign. The client was not contacted previously. The outcome of the previous marketing campaign is unknown. They have an average yearly balance of 845 euros.###\nHence this label was No."
"The client is a 31-year-old divorced individual working in the services sector with unknown education level. They do not have credit in default, do not have a housing loan, but have a personal loan. The average yearly balance in euros is 0. They were contacted via cellular communication and the call lasted 138 seconds on the 9th of July. This was the first contact made during this campaign. The outcome of any previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 21-year-old student who is single and has secondary education. They do not have credit in default, a housing loan, or a personal loan. The communication type for the marketing campaign was cellular. The last contact was on the 19th of February and lasted for 78 seconds. This was the 5th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 164 euros.###\nHence this label was No."
"The client is a 43-year-old single individual working in administration, with unknown education status. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in their account is 474 euros. The client was contacted via cellular communication on the 29th of January and the call lasted 571 seconds. This was the first contact during this campaign, and there were no previous contacts or information about the outcome of any previous marketing campaigns.###\nHence this label was No."
"The client is a 42-year-old divorced individual working in administration with secondary education. They do not have credit in default and have an average yearly balance of 146 euros. They have a housing loan but do not have a personal loan. The communication type during the marketing campaign was unknown. The client was last contacted on the 14th of May and the call lasted for 148 seconds. This was the second call made to the client during this campaign. There were no previous contacts with the client from previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 58-year-old retired married individual with unknown education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cell phone on the 20th of August, and the call lasted for 46 seconds. This was the 5th time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 0 euros.###\nHence this label was No."
"The client is a 54-year-old single individual working in the services sector with secondary education. They do not have any credit in default, housing loan, or personal loan. The client's average yearly balance is 8289 euros. They were contacted via an unknown communication type on the 26th of June for a duration of 133 seconds. This was the second time they were contacted during the current campaign, with no previous contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 36-year-old single technician with secondary education. They do not have credit in default and have an average yearly balance of 7503 euros. They have a housing loan but no personal loan. The communication type for contacting them is unknown. The last contact was made on the 4th of June for 25 seconds. This is the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 48-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in their bank account is 649 euros. They were last contacted on the 19th of June through an unknown communication type, with a call duration of 136 seconds. This was the second contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married housemaid with primary education. They do not have any credit in default but have housing and personal loans. Their average yearly balance is 188 euros. The bank contacted them via an unknown communication type on the 20th of June for a 10-second duration call. This was the 14th contact made to the client during this campaign. The client has not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 17th of November and had a call duration of 223 seconds. This was the first contact during this campaign, but they were previously contacted 96 days ago with 2 prior contacts, resulting in a failed outcome. The client has an average yearly balance of 4 euros.###\nHence this label was No."
"The client is a 34-year-old married technician with secondary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in their account is 7487 euros. The bank contacted them via cellular communication on the 7th of August, with a call duration of 534 seconds. This was the second contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old unemployed married individual with secondary education. They do not have credit in default but have a housing loan. They were contacted via cellular communication, with the last call lasting 332 seconds on the 19th of November. This was the second time they were contacted during this campaign, after 183 days from the previous contact, which resulted in a failure outcome. The client does not have a personal loan and has an average yearly balance of 0 euros.###\nHence this label was No."
"The client is a 48-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 15th of May. The call duration was 115 seconds. This was the first contact made to the client during this campaign. There is no information available about any previous marketing campaign outcome for this client. The client's average yearly balance is 1913 euros.###\nHence this label was No."
"The client is a 34-year-old married technician with secondary education. They do not have credit in default or any existing housing or personal loans. The average yearly balance is negative. The bank contacted the client via cellular communication on the 15th of May, and the call lasted for 207 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old married individual working in a management position with a tertiary education. They do not have credit in default and do not have any existing housing or personal loans. The average yearly balance in euros is 902. The client was contacted via cellular communication on the 8th of August and the call lasted for 75 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married technician with a secondary education. They do not have any credit in default and have a housing loan. They were contacted via an unknown communication type on the 12th of May. The call lasted 29 seconds, and this was the 8th contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and has an average yearly balance of 66 euros.###\nHence this label was No."
"The client is a 76-year-old married individual working in management with unknown education. They do not have any credit in default and have a housing loan but no personal loan. The bank contacted them via telephone, with the last call lasting 413 seconds on the 23rd of April. This was the third call made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 1780 euros.###\nHence this label was Yes."
"The client is a 47-year-old divorced individual working in management with tertiary education. They do not have credit in default but have a housing loan. Their average yearly balance is 84 euros and they do not have a personal loan. The communication type for the last contact is unknown, which lasted for 229 seconds on the 9th of May. This was the 5th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 49-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, do not have a housing loan but have a personal loan. The bank has contacted them via cellular communication on the 9th of July for a duration of 1439 seconds, as part of their 6th contact in the current campaign. The client has not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 44-year-old divorced individual working in the services sector with secondary education. They do not have any credit in default, but they have a housing loan. They were contacted via cellular communication on the 14th of May and the call lasted 263 seconds. This is the second time they have been contacted during this campaign, with 371 days passing since the previous contact. They do not have a personal loan. In the previous marketing campaign, the outcome was a failure. Their average yearly balance is 130 euros.###\nHence this label was No."
"The client is a 46-year-old married individual working in an administrative role, with secondary education. They do not have any credit in default and have a negative average yearly balance. They have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 23rd of May. The call lasted for 1034 seconds and this was the 9th contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default but have a housing loan. They have a negative average yearly balance. They were contacted via an unknown communication type during the month of May, with a call duration of 200 seconds on the 13th day of the month. This is the client's first contact in the current campaign, and there is no previous campaign history available. The outcome of the previous marketing campaign is unknown. Overall, the client seems to be financially unstable with a negative balance and a housing loan, but their marital status and job indicate some level of stability.###\nHence this label was No."
"The client is a 54-year-old married individual working as a blue-collar worker with a secondary level of education. They do not have any credit in default and have an average yearly balance of 233 euros. They have a housing loan but no personal loan. The communication type during the campaign was unknown. The client was last contacted on the 19th of May and the call duration was 220 seconds. This was the third contact made to the client during this campaign. There were no previous contacts with the client regarding marketing campaigns, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married technician with a secondary education. They do not have credit in default, a housing loan, or a personal loan. They were contacted via cellular communication on the 18th of November and the call lasted for 261 seconds. This was the first contact made during this marketing campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted. The client's average yearly balance is 1226 euros.###\nHence this label was No."
"The client is a 28-year-old single technician with secondary education. They do not have credit in default but have a housing loan. Their average yearly balance is 216 euros and they do not have a personal loan. The client was contacted via an unknown communication type on the 13th of May, with a call duration of 66 seconds. This is the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 43-year-old single individual working as an admin, with secondary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The contact was made via an unknown communication type on the 12th of May. The call lasted 457 seconds. This was the 4th contact made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 275 euros.###\nHence this label was No."
"The client is a 45-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default but have a housing loan. Their average yearly balance is negative at 1400 euros, and they do not have a personal loan. They were last contacted in May on the 16th day, with a call duration of 172 seconds. This was the fourth contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, and the communication type is also unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in euros is 512. The client was contacted via cellular communication, with the last call lasting 123 seconds on the 26th of August. This was the second call made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 26-year-old married individual working as a blue-collar worker with a secondary level of education. They do not have any credit in default and have an average yearly balance of 800 euros. They have a housing loan but no personal loan. The last contact was made on the 15th of May via an unknown communication type, lasting 219 seconds. This is the first time they have been contacted during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married technician with secondary education. They do not have credit in default, have a housing loan, but no personal loan. The bank contacted them via cellular communication and the last call lasted 97 seconds. This was the 4th call made to the client during this campaign, with 196 days passing since they were last contacted from a previous campaign. There were a total of 5 contacts before this campaign. The outcome of the previous marketing campaign was a failure. Additionally, the client's average yearly balance is 694 euros.###\nHence this label was No."
"The client is a 48-year-old single individual working in management with a tertiary education. They do not have any credit in default and have a personal loan. They do not have a housing loan. The bank reached out to them via a cellular phone call on the 7th of August, with a call duration of 126 seconds. This is the first contact made to the client during this campaign. The outcome of any previous marketing campaigns with this client is unknown. The client's average yearly balance is 399 euros.###\nHence this label was No."
"A 25-year-old single individual working in the services sector, with a secondary level of education and no credit in default, was contacted via cellular communication. They have a housing loan but no personal loan. During the current campaign, they were contacted once, resulting in a 282-second conversation. The previous marketing campaign outcome is unknown, and this is the first time they have been contacted. Their average yearly balance is 0 euros.###\nHence this label was No."
"This client is a 41-year-old married individual working in the administrative sector with secondary education. They do not have any credit in default but have a housing loan. They have been contacted via cellular communication, with the last call lasting 104 seconds on the 7th day of July. This was the 4th contact made to the client during this campaign, with no previous contacts. The client's average yearly balance is -396 euros, and they do not have a personal loan. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old self-employed individual who is married with a secondary level of education. They do not have any credit in default, do not have a housing loan but have a personal loan. The bank contacted them via cellular phone call on the 6th of August, and the call lasted 168 seconds. This was the third time the bank contacted this client during the current campaign, with no previous contacts. The outcome of the previous marketing campaign with this client is unknown. The client's average yearly balance is 3025 euros.###\nHence this label was No."
"This is a data entry for a 29-year-old single individual working in management with a tertiary education. They do not have credit in default and have a yearly balance of 2344 euros. They have a housing loan but no personal loan. The communication type used is cellular. The last contact was on the 9th of March and lasted for 265 seconds. This is the second contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual working in the services sector with unknown education status. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 233 seconds on the 18th day of May. This was the first contact made during this campaign. The outcome of any previous marketing campaigns is unknown. The client's average yearly balance is 15 euros.###\nHence this label was No."
"A 42-year-old single individual working in an administrative role, with secondary education, and no credit in default was contacted via cellular communication. They have a housing loan but no personal loan. With an average yearly balance of 1451 euros, they were contacted 4 times during this campaign, with the last contact lasting 251 seconds on the 4th day of May. There was no record of previous contact or outcome of prior marketing campaigns.###\nHence this label was Yes."
"The client is a 51-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 21,614 euros. The client was contacted via cellular communication on the 29th of August and the call duration was 47 seconds. This was the 20th contact made during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old divorced individual working in the services sector with secondary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is negative at -330 euros. The client was contacted by phone 2 times during this campaign, with the last contact lasting 207 seconds on the 27th of May. There were no previous contacts with the client for marketing purposes. The outcome of the previous marketing campaign is unknown, and the current contact communication type is also unknown.###\nHence this label was No."
"The client is a 48-year-old single individual working in the services sector with unknown education. They do not have credit in default and have an average yearly balance of 5095 euros. They have a housing loan but no personal loan. The type of contact communication is unknown, and the last contact was made on the 16th of June with a duration of 71 seconds. This is the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 33-year-old divorced individual working in administration with a secondary education. They do not have any credit in default and have an average yearly balance of 212 euros. They have a housing loan but do not have a personal loan. The communication type for the last contact is unknown, which lasted for 23 seconds on the 7th day of January. This was the first contact made during this campaign. There is no information on previous contacts or outcomes of past marketing campaigns.###\nHence this label was No."
"The client is a 39-year-old single technician with tertiary education and no credit in default. They have an average yearly balance of 139 euros and do not have a housing or personal loan. The client was contacted via telephone on the 19th of August and the call lasted for 328 seconds. This was the second time they were contacted during this campaign, with 79 days passing since they were last contacted from a previous campaign, which resulted in failure.###\nHence this label was No."
"A 29-year-old single technician with secondary education, who does not have credit in default, has an average yearly balance of 525 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 16th of April, with a call duration of 228 seconds. This is the second contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 29-year-old single student with a secondary education, who does not have credit in default, housing loan, or personal loan. They were contacted via cellular communication and the last call duration was 51 seconds on the 26th of February. This was the first contact made during this campaign, and there was no previous contact history. The outcome of the previous marketing campaign is unknown. The average yearly balance is 48 euros.###\nHence this label was No."
"The client is a 29-year-old married individual working in the services sector with primary education. They do not have any credit defaults and have a yearly balance of 321 euros. They have a housing loan but no personal loan. Their contact communication type is unknown, and they were last contacted on the 7th day of May. The last call duration was 196 seconds, and this was the second contact made during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old single administrative worker with secondary education and a credit default. They have an average yearly balance of 7 euros and do not have a housing or personal loan. The client was contacted via an unknown communication type on the 28th of May for 285 seconds, as part of the second contact in this campaign. There is no record of previous contact with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married individual working in a management position with a tertiary education. They do not have any credit in default but have a housing loan. They do not have a personal loan either. The client was contacted via an unknown communication type on the 28th of May. The call lasted for 154 seconds, and this was the second time they were contacted during this campaign. There is no record of any previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 71-year-old retired married individual with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 16th of September and the call lasted for 657 seconds. This was the second time they were contacted during this campaign. There is no information on previous contacts or the outcome of the previous campaign. The client's average yearly balance is 4847 euros.###\nHence this label was No."
"The client is a 38-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The client was contacted through an unknown communication type on the 8th of May. The call lasted for 784 seconds, and it was the first contact made during this campaign. There was no previous contact with the client from any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 4586 euros.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan but no personal loan. The average yearly balance in euros is 12409. The client was contacted via cellular communication on the 19th of November and the call duration was 140 seconds. This was the first contact during this campaign, with 2 previous contacts before. The outcome of the previous marketing campaign for this client was a failure, and 99 days had passed since the last contact.###\nHence this label was No."
"The client is a 70-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 13297. The client was contacted via a cellular communication type, with the last call lasting 579 seconds on the 2nd day of February. This was the second call made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 25-year-old single individual working in an administrative role with a secondary education was contacted for a direct marketing campaign. They do not have a credit default, housing loan, or personal loan. The contact communication type is unknown. The client was last contacted on the 26th of May for 293 seconds during which 1 contact was made. There were no previous contacts or information on the outcome of the previous campaign. The average yearly balance in euros is 96.###\nHence this label was No."
"The client is a 29-year-old single technician with a tertiary education. They do not have credit in default and have an average yearly balance of 433 euros. They have a housing loan but no personal loan. The communication type used during the marketing campaign is unknown. The client was last contacted on the 9th of May and the call lasted for 247 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, as the client was not previously contacted.###\nHence this label was No."
"The client is a 57-year-old married housemaid with primary education. They do not have credit in default, housing loan, or personal loan. They were contacted via an unknown communication type on the 9th of June. The call lasted 257 seconds, and this was the second time they were contacted during this campaign. There is no record of previous contact with the client or the outcome of any previous marketing campaign. The average yearly balance in euros is 0.###\nHence this label was No."
"The client is a 54-year-old married blue-collar worker with secondary education. They do not have credit in default but have housing and personal loans. The average yearly balance is 285 euros. The communication type used was telephone, and the last contact was made on the 30th of January, with a duration of 63 seconds. This is the 1st contact made during this campaign, with 5 previous contacts made before. The outcome of the previous marketing campaign was 'other'.###\nHence this label was No."
"The client is a 40-year-old self-employed married individual with secondary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is 1516 euros. The client was contacted via an unknown communication type on the 23rd of May, with a call duration of 373 seconds. This was the first contact made during this campaign. There is no information on previous marketing campaign outcomes or previous contacts with the client.###\nHence this label was No."
"The client is a 33-year-old blue-collar worker who is single. They have a secondary level of education and do not have any credit in default. Their average yearly balance is 697 euros, and they do not have a housing or personal loan. The client was contacted via cellular communication on the 6th of February and the call duration was 860 seconds. This was the second contact made during this campaign and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 37-year-old single individual working in administration with a secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 4th day of August. The call lasted for 236 seconds, and it was the 1st contact made during this campaign. The client was previously contacted 92 days ago during which 4 contacts were made, resulting in a marketing campaign failure. The average yearly balance is 115 euros.###\nHence this label was No."
"The client is a 56-year-old married individual working in management with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 819. They were contacted via an unknown communication type on the 9th of June and the call lasted for 55 seconds. This was the first contact made during this campaign with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old divorced technician with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, reaching them on the 2nd day of February for a duration of 123 seconds. This was the second time they were contacted during this campaign. There is no record of previous contact or outcome of a previous marketing campaign. The client's average yearly balance is 93 euros.###\nHence this label was No."
"The client is a 37-year-old married individual working in a blue-collar job with a secondary level of education. They do not have any credit in default, but they have a housing loan. They have an average yearly balance of 183 euros and do not have a personal loan. The last contact made with the client was on the 6th of May, and it lasted for 112 seconds. This was the 4th contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The communication type used for contact is also unknown.###\nHence this label was No."
"A 29-year-old married individual working in a blue-collar job with secondary education was contacted via cellular communication for a marketing campaign. They do not have any credit in default, housing loan, or personal loan. They had an average yearly balance of 358 euros. The last contact was made on the 21st of July and lasted for 88 seconds. This was the 5th contact made during this campaign, with no previous contacts. The outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 58-year-old divorced individual working in the services sector with secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is negative at -158 euros. The communication with the client was made via telephone, with the last contact lasting only 11 seconds on the 18th of July. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 33-year-old single individual, working in management with a tertiary education, was contacted via cellular communication. They have no credit in default, have a housing loan, but no personal loan. Their average yearly balance is 4782 euros. The last contact was on the 11th of August, with a duration of 217 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaigns is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual with an unknown job and education level. They do not have credit in default and have an average yearly balance of 124 euros. The client has a housing loan but no personal loan. The communication type used for contacting the client is unknown. The last contact was made on the 20th of May and lasted 37 seconds. This was the 13th contact made during this campaign, with no previous contacts made. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old married individual working in management with primary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 1910 euros. The contact communication type is unknown, and the last contact was on the 29th of May, with a duration of 413 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old divorced individual working in an administrative role with tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 3rd of December and the call lasted 284 seconds. This was the second time they were contacted during this campaign, with 171 days passing since the previous contact. The outcome of the previous marketing campaign was a failure. The client's average yearly balance is 4708 euros.###\nHence this label was Yes."
"The client is a 64-year-old retired married individual with tertiary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 5th of March and the call lasted 341 seconds. This was the 4th contact made during this campaign, with the previous contact made 179 days ago resulting in a successful outcome. The client's average yearly balance is 1644 euros.###\nHence this label was Yes."
"The client is a 59-year-old divorced housemaid with secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance is 122 euros. The client was contacted via cellular communication on the 15th of July and the call lasted 129 seconds. This was the first contact made during this campaign. There is no information on previous contact outcomes.###\nHence this label was No."
"The client is a 33-year-old single individual working in management with a secondary education. They do not have credit in default and have an average yearly balance of 1615 euros. They have a housing loan but no personal loan. The communication with the client was via cellular phone. The last contact was on the 14th of May, lasting 178 seconds. During this campaign, 8 contacts were made, and the client was contacted 174 days after the previous campaign. Before this campaign, 3 contacts were made, and the outcome of the previous campaign was a failure.###\nHence this label was No."
"The client is a 70-year-old retired married individual with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 14th day of May. The call lasted 338 seconds and it was the third time they were contacted during this campaign. They were last contacted 185 days ago for a previous campaign, where there were 2 prior contacts. The outcome of the previous campaign was a failure. Their average yearly balance is 1164 euros.###\nHence this label was No."
"A 45-year-old single individual, working as a blue-collar worker with secondary education, was contacted via cellular communication. They have no credit in default, but they have a housing loan. Despite having no personal loan, their average yearly balance is zero. The individual was previously contacted 192 days ago, with a previous marketing campaign outcome of failure. During the current campaign, they were contacted once, which resulted in a duration of 1472 seconds. Additionally, they had been contacted four times before the current campaign.###\nHence this label was Yes."
"The client is a 41-year-old married individual working in a management position with a tertiary education. They do not have any credit in default but have housing and personal loans. They were contacted via cellular communication on the 13th of May and the call lasted for 310 seconds. This was the second time they were contacted during this campaign. There is no information on any previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1204 euros.###\nHence this label was No."
"The client is a 35-year-old single individual working in management with unknown educational background. They do not have credit in default and do not have a housing loan, but have a personal loan. They were contacted via cellular communication, with the last call lasting 427 seconds on the 2nd day of February. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 342 euros.###\nHence this label was No."
"The client is a 55-year-old married individual working as an admin. They have a secondary level of education and do not have any credit in default. Their average yearly balance is 420 euros. They have a housing loan but no personal loan. The communication type for the last contact is unknown, which lasted 41 seconds. This is the third contact made during this campaign. The client was not contacted previously. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old self-employed individual who is single and has unknown education status. They do not have credit in default and have a negative average yearly balance. They have a housing loan but no personal loan. The communication type for contact is cellular. The last contact was on the 18th of May and lasted for 144 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married entrepreneur with secondary education. They do not have credit in default, a housing loan, but they do have a personal loan. The bank contacted them via a cellular phone call on the 7th of July, and the call lasted 224 seconds. This was the 4th contact made to the client during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 49-year-old married admin worker with secondary education. They do not have credit in default, have a housing loan but no personal loan. The contact was made through an unknown communication type on the 14th day of May. The call lasted 347 seconds, it was the first contact in the current campaign and there were no previous contacts. The outcome of the previous campaign is unknown. The average yearly balance is 387 euros.###\nHence this label was No."
"The client is a 33-year-old unemployed single individual with tertiary education. They do not have any credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 6th of May. The call lasted 124 seconds. This was the first time they were contacted during this marketing campaign. The outcome of any previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 35-year-old divorced individual working in management with tertiary education. They do not have credit in default and have housing and personal loans. They were contacted via cellphone on the 19th of November, and the call lasted 1554 seconds. This was the first contact made during this campaign, and there was no previous contact history. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 859 euros.###\nHence this label was Yes."
"The client is a 42-year-old married individual working in management with a tertiary education. They do not have credit in default and have an average yearly balance of 199 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 9th of July, and the call lasted 497 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old unemployed individual who is divorced and has tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank communicated with the client via cellular phone call on the 31st of July, with a call duration of 81 seconds. This was the 6th contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance in euros is 64.###\nHence this label was No."
"The client is a 32-year-old married individual working in a management position with a tertiary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 16th of May and the call lasted for 387 seconds. This was the first contact made during this campaign. There is no record of previous contact or outcome from a previous campaign.###\nHence this label was No."
"The client is a 58-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, but they have a housing loan. They have an average yearly balance of 128 euros and do not have a personal loan. The bank has contacted them via telephone on the 30th of July, and the call lasted 49 seconds. This was the 5th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default, but they have housing and personal loans. They were contacted via cellular communication on the 17th of November for a duration of 222 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1354 euros.###\nHence this label was No."
"The client is a 46-year-old single individual working in a management position with a tertiary education. They do not have credit in default and do not have any outstanding housing or personal loans. The bank contacted them via cellular communication in August and the call lasted for 40 seconds. This was the second time they were contacted during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 134 euros.###\nHence this label was No."
"The client is a 54-year-old divorced individual working as a blue-collar worker with secondary education. They do not have any credit in default and have an average yearly balance of 1145 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication and the last call lasted 178 seconds. This was the third contact made during this campaign. The client was not previously contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old self-employed individual who is single and has tertiary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 11th of May for a duration of 214 seconds. This was the first contact made with the client during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 137 euros.###\nHence this label was No."
"The client is a 57-year-old married individual working in the services sector with primary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 53 euros. The communication with the client was through a cellular phone call that lasted 86 seconds. This was the second contact made during this campaign, and there were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married technician with tertiary education, who does not have credit in default. They have an average yearly balance of 516 euros, a housing loan, and no personal loan. The bank contacted them via cellular communication on the 9th of February, with a call duration of 175 seconds. This is the 5th contact made during this campaign, with 12 days passed since the client was last contacted from a previous campaign. There was 1 contact made before this campaign. The outcome of the previous marketing campaign for this client was categorized as \"other.\"###\nHence this label was No."
"The client is a 45-year-old married individual working in an administrative role with secondary education. They do not have any credit in default and have an average yearly balance of 358 euros. They have a housing loan but no personal loan. The communication type for the marketing campaign was cellular. The client was last contacted on the 13th of May and the call duration was 134 seconds. This was the second contact made to the client during this campaign. There were no previous contacts with the client from previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in the services sector with secondary education. They do not have credit in default but have a housing loan. They have an average yearly balance of -315 euros and do not have a personal loan. The client was last contacted on the 8th of May through an unknown communication type and the call lasted for 56 seconds. This is the second time they have been contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old self-employed individual who is divorced and has a tertiary education. They do not have credit in default and have an average yearly balance of 745 euros. They have a housing loan and a personal loan. The client was last contacted via cellular communication on the 31st of July for 11 seconds, as part of a campaign where they were contacted 20 times. This is the first time they have been contacted for this specific campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The client was contacted via cellular communication on the 11th of August and the call lasted 101 seconds. This was the 5th contact made during this campaign. There were no previous contacts with the client before this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1161 euros.###\nHence this label was No."
"The client is a 30-year-old married technician with a secondary education. They do not have credit in default and have a yearly balance of 239 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 21st of November and the call lasted 302 seconds. This is the 2nd time they were contacted during this campaign, with 95 days passed since they were last contacted from a previous campaign. Prior to this campaign, they were contacted a total of 8 times and the outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 30-year-old unemployed married individual with secondary education. They do not have credit in default but have a housing loan. They have a negative average yearly balance. They were contacted via an unknown communication type, with the last call lasting 173 seconds on the 27th day of May. This was the first contact made during this campaign, and there is no record of previous contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 58-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default, do not have a housing loan but have a personal loan. The bank contacted them via telephone on the 29th of July and the call lasted for 55 seconds. This was the 16th contact made to the client during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3 euros.###\nHence this label was No."
"This is a young single student with secondary education who has no credit default, housing loan, or personal loan. They were contacted via cellular communication and had a successful previous marketing campaign result. They have a relatively low average yearly balance. The client was last contacted in October for 194 seconds, with a gap of 119 days from the previous campaign. Overall, they seem financially cautious and responsive to marketing efforts.###\nHence this label was Yes."
"The client is a 50-year-old married individual working in management with tertiary education. They do not have credit in default and have a housing loan. They have an average yearly balance of 5108 euros and do not have a personal loan. The client was contacted via cellular communication, with the last call lasting 406 seconds on the 18th of December. This was the first contact during this campaign, but they were contacted 182 days after the previous campaign, where there were 2 prior contacts. The outcome of the previous campaign was a failure.###\nHence this label was Yes."
"The client is a 42-year-old married individual working in an administrative role with secondary education. They do not have any credit in default but have housing and personal loans. They were contacted via cellular communication for a marketing campaign. The last contact was made on the 16th of April, with a duration of 102 seconds. This was the 2nd contact during this campaign and the 5th contact overall. The previous marketing campaign had a different outcome. The client's average yearly balance is 8238 euros.###\nHence this label was No."
"The client is a 57-year-old married technician with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The last contact was made on the 5th of May with an unknown communication type, lasting 10 seconds. This is the 4th contact made during this campaign. No previous contact was made with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1078 euros.###\nHence this label was No."
"A 46-year-old divorced individual, working in a management position with tertiary education, was contacted via cellular communication. They have no credit default, housing loan, or personal loan. The average yearly balance in euros is 194. The client was contacted once during this campaign, with the call lasting 97 seconds. The previous marketing campaign's outcome is unknown, and the client has not been contacted before.###\nHence this label was No."
"The client is a 35-year-old single technician with tertiary education. They do not have credit in default but have a housing loan. They have an average yearly balance of 756 euros and do not have a personal loan. The client was contacted through an unknown communication type on the 16th day of June for 14 seconds. This was the 14th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 33-year-old married individual working in a blue-collar job was contacted via cellular communication. They have a housing loan but no personal loan or credit in default. The last contact was made on the 12th of May, lasting 89 seconds. This was the third contact attempt in the current campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The individual's average yearly balance is in negative figures (-253 euros).###\nHence this label was No."
"The client is a 35-year-old married individual working as a blue-collar worker with a secondary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank communicated with them via cellular phone. The client was last contacted on the 31st of July for a very short duration of 14 seconds. This is the 32nd contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is in the negative at -172 euros.###\nHence this label was No."
"The client is a 67-year-old retired married individual with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication and the last contact was on the 16th of September, with a duration of 452 seconds. This is the 5th contact made during this campaign, with 4 previous contacts. The client was last contacted 195 days ago from a previous campaign, with the outcome being \"other\". The average yearly balance is 2048 euros.###\nHence this label was Yes."
"The client is a 28-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default and do not have any housing or personal loans. The client was contacted via cellular communication, and the last call duration was 205 seconds. This client has been contacted 7 times during this campaign but was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2909 euros, and the last contact was made on the 6th day of February.###\nHence this label was No."
"The client is a 35-year-old single individual working as a blue-collar employee with secondary education. They do not have any credit in default but have a housing loan. Their average yearly balance is negative. They do not have a personal loan. They were contacted via an unknown communication type, on the 30th of May, for 312 seconds during this campaign, which involved 7 contacts. This is the first time they have been contacted for this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 63-year-old retired individual who is married with a secondary level education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 17th of November and the call lasted for 168 seconds. This was the second time they were contacted during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 708 euros.###\nHence this label was No."
"The client is a 36-year-old unemployed individual who is married and has a secondary level of education. They do not have credit in default and have an average yearly balance of 608 euros. They have a housing loan but do not have a personal loan. The communication with the client was through a cellular phone, and the last contact was made on the 2nd of February, with a duration of 114 seconds. This is the first contact during this campaign, but there were 3 previous contacts from previous campaigns. The outcome of the previous marketing campaign was categorized as 'other'.###\nHence this label was No."
"The client is a 27-year-old single individual working in the services industry with secondary education. They do not have any credit in default but have housing and personal loans. The average yearly balance is 118 euros. The client was contacted via an unknown communication type on the 12th day of May. The call duration was 53 seconds, and this was the first contact made during the current campaign. There is no information on previous campaign contact outcomes.###\nHence this label was No."
"The client is a 43-year-old single admin worker with unknown education status. They do not have any credit in default and have a yearly balance of 87 euros. They have a housing loan but no personal loan. The communication type used for contacting them is unknown. The client was last contacted on the 7th of May for 328 seconds as part of a campaign where 2 contacts were made. There were no previous contacts with the client before this campaign, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married technician with a secondary education. They do not have credit in default, have a housing loan, but no personal loan. The average yearly balance is 367 euros. The client was contacted via an unknown communication type on the 6th day of May. The call duration was 140 seconds, and it was the first contact made during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default but have housing and personal loans. They were contacted via cellular communication, with the last call lasting 829 seconds on the 12th of May. This was the 7th contact made during this campaign, with no previous contacts made. The outcome of the previous marketing campaign is unknown. The average yearly balance is negative at -407 euros.###\nHence this label was Yes."
"The client is a 35-year-old married blue-collar worker with unknown education. They do not have any credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication in July for a duration of 1019 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaigns with this client is unknown. The client's average yearly balance is 1084 euros.###\nHence this label was No."
"This individual is a 38-year-old single administrative worker with secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 262 euros. They were contacted via cellular communication on the 3rd day of February and the call lasted for 315 seconds. This was the 2nd time they were contacted during this campaign, following up after 180 days from the previous campaign where they were contacted 6 times, resulting in a failure outcome.###\nHence this label was Yes."
"The client is a 36-year-old self-employed individual who is single and holds a tertiary education. They do not have credit in default and have an average yearly balance of 577 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication and the last call lasted for 33 seconds on the 15th day of May. This is the second time they have been contacted during this campaign, with 298 days passing since the previous contact. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 52-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit in default and have a housing loan. They were contacted via cellular communication on the 8th of May and the call lasted for 191 seconds. This is the second time they have been contacted during this campaign, with a gap of 368 days since they were last contacted from a previous campaign. The client did not take up a personal loan and had an average yearly balance of 26 euros. In the previous marketing campaign, the outcome was a failure.###\nHence this label was No."
"The client is a 32-year-old single individual working as a blue-collar worker with a secondary education. They do not have any credit in default, but they do have a housing loan. Their average yearly balance is 53 euros, and they do not have a personal loan. The bank contacted them via cellular communication, and the last call duration was 153 seconds. This client was last contacted 169 days ago from a previous campaign, where the outcome was a failure. Overall, they have been contacted 3 times in the past.###\nHence this label was No."
"The client is a 41-year-old unemployed single individual with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them by telephone on the last day of July, and the call lasted for 2 minutes. This was the second time they were contacted during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2171 euros.###\nHence this label was No."
"The client is a 42-year-old married blue-collar worker with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via an unknown communication type on the 20th of June. The call lasted 154 seconds, and it was the second contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 494 euros.###\nHence this label was No."
"A 48-year-old married individual working in management with primary education was contacted via cellular communication. They do not have credit in default, housing loan, or personal loan. They have an average yearly balance of 427 euros. The last contact was on the 17th of November, lasting 62 seconds. This was the first contact during this campaign, and there was no previous campaign contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old self-employed individual who is single and has a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 22nd of July and the call lasted for 423 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign with this client is unknown. The average yearly balance of the client is 192 euros.###\nHence this label was No."
"The client is a 52-year-old married individual working in management with primary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 17th of April, and the call lasted for 402 seconds. This was the first contact made during this campaign, but they were contacted twice before in previous campaigns, with the last contact being 345 days ago resulting in a failed outcome. The client's average yearly balance is 98 euros.###\nHence this label was No."
"The client is a 52-year-old married individual working in a management role with tertiary education. They do not have any credit in default and have a housing loan. They were contacted via cellular communication and the last call duration was 94 seconds. This is the 4th time they have been contacted during this campaign. Their average yearly balance is negative. They do not have a personal loan and have not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 38-year-old married individual working in administration, with a secondary education and no credit in default, was contacted via cellular communication. They have a housing loan but no personal loan. Their average yearly balance is 532 euros. The last contact was on the 23rd of July and lasted 95 seconds. This was the first contact during this campaign, with no previous contact history available. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 26-year-old single technician with secondary education. They do not have any credit in default and have a yearly balance of 1231 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 230 seconds on the 4th of September. This is their first contact during this campaign, but they were contacted 7 times before in previous campaigns. The outcome of the previous marketing campaign was successful, suggesting a positive interaction with the client.###\nHence this label was Yes."
"The client is a 59-year-old retired individual who is divorced. They have primary education and do not have any credit in default. With an average yearly balance of 7179 euros, they do not have a housing loan or personal loan. The communication type for contact is cellular, and the last contact was on the 5th of February, lasting 150 seconds. This client was contacted once during this campaign and had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old divorced individual working as an admin. They have a secondary education, no credit in default, and a yearly balance of 99 euros. They do not have a housing or personal loan. The communication type is unknown. The last contact was on the 14th of July and lasted 18 seconds. This is the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 19th of November for a duration of 625 seconds. This is the first time they have been contacted during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 5794 euros.###\nHence this label was No."
"The client is a 49-year-old married individual working in management with a tertiary education. They do not have credit in default and have a housing loan. Their average yearly balance is 734 euros and they do not have a personal loan. The bank contacted them via cellular communication, reaching out on the 7th of May for a duration of 42 seconds. This is the second time they have been contacted during the current campaign, with 2 previous contacts. The client was last contacted 324 days ago from a previous campaign, where the outcome was a failure.###\nHence this label was No."
"The client is a 25-year-old single individual working as an admin with secondary education. They have credit in default, a housing loan, but no personal loan. The average yearly balance is 53 euros. The contact communication type is unknown, and the last contact was on the 14th of May, with a duration of 313 seconds. This is the fourth contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 5th day of May, with a call duration of 275 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is -390 euros.###\nHence this label was No."
"The client is a 36-year-old married individual working in management with tertiary education. They do not have any credit in default, have a housing loan but no personal loan. They were contacted via cellular communication on the 20th of April, with the call lasting 142 seconds. This is the third contact made during this campaign, with the previous contact made 150 days ago. The outcome of the previous marketing campaign for this client was a failure.###\nHence this label was No."
"The client is a 49-year-old self-employed individual who is married with a tertiary level of education. They do not have any credit in default and have a yearly average balance of 99 euros. The client has a housing loan and a personal loan. The bank contacted them via cellular communication and the call lasted for 83 seconds. This was the first contact made during this marketing campaign. The client was last contacted on the 31st of August. The outcome of the previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 53-year-old married individual working in a management position with a tertiary education. They do not have any credit in default and do not have any housing or personal loans. The average yearly balance in euros is 2578. The communication type used for contacting the client is cellular. The last contact was made on the 19th of November, lasting for 299 seconds. This is the 4th contact made during this campaign, following up after 107 days from the previous campaign. The client was contacted twice before for this campaign, with the outcome of the previous marketing campaign being categorized as a failure.###\nHence this label was No."
"The client is a 34-year-old blue-collar worker who is single. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 381 euros, they have a housing loan but no personal loan. The bank communicated with the client via a cellular device and the last contact was on the 29th of January, with a duration of 83 seconds. This was the first contact during this campaign, and the client was last contacted 262 days ago from a previous campaign. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 36-year-old single individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 22nd of August. The client had an average yearly balance of 1520 euros. During this campaign, they were contacted twice, with the last call lasting 101 seconds. This is their first contact in this campaign, and their outcome from the previous campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old married technician with a secondary education. They do not have credit in default, but they have both a housing loan and a personal loan. Their average yearly balance is 344 euros. The client was contacted via an unknown communication type on the 28th of May. The call lasted 279 seconds, and this was the second contact made during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, with the last call lasting 684 seconds on the 30th of July. This was the second call made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, and the client had an average yearly balance of 0 euros.###\nHence this label was Yes."
"The client is a 59-year-old retired married individual with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 8th of July for a duration of 163 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 184 euros.###\nHence this label was No."
"The client is a 46-year-old married individual who works in management and has a tertiary education. They do not have any credit in default but have both a housing loan and a personal loan. The average yearly balance in euros is 1600. The communication type for contact was cellular, and the last contact was made on the 11th of August, with a duration of 1244 seconds. This was the first contact in the current campaign, and there was no previous contact history with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 40-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan. The client does not have a personal loan. The bank contacted the client via cellular communication on the 6th of May and the call lasted for 350 seconds. This was the second call made to the client during this campaign, after 344 days from the previous campaign where one call was made and it resulted in failure.###\nHence this label was No."
"The client is a 36-year-old single individual working in management with a tertiary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication. The last contact was made on the 28th of August, lasting 207 seconds. This client has been contacted 8 times during this campaign, with 98 days passing since they were last contacted from a previous campaign. They were contacted once before this campaign, which resulted in a failure outcome. Their average yearly balance is 490 euros.###\nHence this label was Yes."
"The client is a 40-year-old married student with secondary education. They do not have credit in default, a housing loan, or a personal loan. The communication type for contacting the client is unknown. The last contact was on the 20th of June, and it lasted 197 seconds. This was the 6th contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 260 euros.###\nHence this label was No."
"The client is a 33-year-old married individual working in the services sector with secondary education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via cellular communication on the 18th of May for a 16-second call. This call was part of the 6th contact made during this campaign, with 180 days since they were last contacted from a previous campaign. Prior to this campaign, they were contacted twice, with the outcome of the previous marketing campaign being categorized as 'other'. Their average yearly balance is 2533 euros.###\nHence this label was No."
"The client is a 34-year-old married individual working in management with tertiary education. They do not have credit in default, but have a housing loan. They do not have a personal loan. The average yearly balance is negative. They were contacted via cellular communication, with the last call lasting 126 seconds on the 8th of August. This is the second call made during this campaign to the client. The client has not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 60-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default, housing loan or personal loan. The average yearly balance in euros is 71. The client was contacted via an unknown communication type on the 5th of June and the call lasted for 185 seconds. This was the first contact made during this campaign. There was no previous campaign history recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 43-year-old married technician with secondary education and no credit in default. They have a housing loan but no personal loan. They were contacted via an unknown communication type on the 5th of May and the call lasted for 117 seconds. This was the first contact during this campaign. Previous marketing campaign outcome is unknown. The client's average yearly balance is 434 euros.###\nHence this label was No."
"The client is a 38-year-old individual with an unknown job status, who is single and has a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. During the marketing campaign, they were contacted via cellular communication. The last contact was made on the 11th of September and lasted for 260 seconds. This client has been contacted a total of 6 times (3 times during this campaign and 3 times in a previous campaign), with the previous campaign resulting in success. Their average yearly balance is 0 euros.###\nHence this label was Yes."
"The client is a 35-year-old blue-collar worker who is married and has a primary level of education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 14th day of May. The call lasted for 467 seconds, and this was the 6th contact made during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 602 euros.###\nHence this label was No."
"The client is a 40-year-old single individual working in a management role with a tertiary education. They do not have any credit in default, but they have a housing loan. They have an average yearly balance of 242 euros and do not have a personal loan. The client was contacted through an unknown communication type, with the last contact occurring on the 6th of May and lasting 221 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old married services worker with a secondary education. They do not have credit in default, have a housing loan, but no personal loan. They were contacted via cellular communication on the 17th of April for 179 seconds. This was their first contact during this campaign, and they have not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 120 euros.###\nHence this label was No."
"The client is 37 years old, works in management, is married, and has a tertiary education. They do not have credit in default, do not have a housing loan or personal loan. The bank communicated with them via cellular phone, contacting them on the 19th of August for 78 seconds. This was the second time they were contacted during this campaign. They were not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 115 euros.###\nHence this label was No."
"The client is a 27-year-old self-employed individual who is single and has a secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the last day of July, with the call lasting 80 seconds. This was the third contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. Additionally, the client's average yearly balance is 152 euros.###\nHence this label was No."
"The client is a 34-year-old single technician with a tertiary education. They do not have credit in default but have housing and personal loans. The average yearly balance is 144 euros. The communication with the client was through a cellular phone. The last contact was on the 21st of July, lasting 213 seconds. This is the 3rd contact during this campaign, with 16 previous contacts. The client was last contacted 89 days ago from a previous campaign, which resulted in failure.###\nHence this label was No."
"The client is a 35-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. The bank contacted them via cellular communication and the last call lasted 19 seconds. This was the 6th contact made during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
