"A 43-year-old male patient with asymptomatic chest pain has a resting blood pressure of 150 and a serum cholesterol level of 247. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results, and the maximum heart rate achieved is 171. The patient does not experience exercise-induced angina. They have an ST depression of 1.5 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 37-year-old male patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol levels. Their fasting blood sugar is normal, with a normal resting electrocardiogram. The patient achieved a high maximum heart rate without experiencing exercise-induced angina. There is no ST depression induced by exercise, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 62-year-old male who is asymptomatic for chest pain. His resting blood pressure is 110, with serum cholesterol level of 0. He does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram shows normal results. He achieved a maximum heart rate of 120 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 53-year-old female patient with atypical angina presented with normal resting blood pressure, serum cholesterol level of 216, and no fasting blood sugar > 120 mg/dl. Resting electrocardiogram results were normal, maximum heart rate achieved was 142. The patient experienced exercise-induced angina and had ST depression of 2.0 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar elevation. Resting electrocardiogram shows ST-T wave abnormality. Patient achieved a maximum heart rate of 120 without exercise-induced angina. There is a 1.5 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is downsloping. These factors can be used to predict the presence of heart disease.###\nHence this label was No."
"A 46-year-old female patient with no history of chest pain presents with normal resting blood pressure and cholesterol levels. Her fasting blood sugar is within normal range. Resting electrocardiogram shows normal results. She achieved a maximum heart rate of 90 during exercise without experiencing angina. There is no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping. Overall, the patient's data suggests a low risk of heart disease.###\nHence this label was No."
"A 45-year-old asymptomatic female patient with normal resting blood pressure and high serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 144 during exercise without experiencing angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. The fasting blood sugar level is below 120 mg/dl.###\nHence this label was No."
"A 55-year-old male patient with non-anginal chest pain, normal resting blood pressure and serum cholesterol levels. The patient does not have fasting blood sugar over 120 mg/dl and has ST-T wave abnormality in resting electrocardiogram. Despite reaching a maximum heart rate of 136, there was no exercise-induced angina. The patient experienced a slight ST depression of 0.2 induced by exercise, with an upsloping peak exercise ST segment.###\nHence this label was No."
"A 42-year-old male patient with asymptomatic chest pain and normal resting blood pressure was found to have no fasting blood sugar, a resting electrocardiogram showing normal results, a maximum heart rate of 99, and experienced exercise-induced angina. The patient showed no ST depression induced by exercise relative to rest and had a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 46-year-old male patient with asymptomatic chest pain has normal resting blood pressure (134 mmHg) and high serum cholesterol (310 mg/dl). They have a normal resting electrocardiogram and achieved a maximum heart rate of 126 bpm. The patient did not experience exercise-induced angina and showed no ST depression after exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain has a resting blood pressure of 134. Their fasting blood sugar level is higher than 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 86 and did not experience exercise-induced angina. They have a ST depression of 1.5 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old female patient with non-anginal chest pain, normal resting blood pressure (110), slightly elevated serum cholesterol (214), normal fasting blood sugar levels, a normal resting electrocardiogram, maximum heart rate reached at 158, no exercise-induced angina, 1.6 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 58-year-old male patient, with asymptomatic chest pain, has a resting blood pressure of 136 and serum cholesterol level of 203. Their fasting blood sugar is higher than 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved at 123. The patient experiences exercise-induced angina and has ST depression of 1.2 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat. These factors indicate a risk for heart disease in the patient.###\nHence this label was Yes."
"A 72-year-old male patient with non-anginal chest pain, resting blood pressure of 160, normal serum cholesterol levels, an electrocardiogram showing probable or definite left ventricular hypertrophy, maximum heart rate achieved of 114, no exercise-induced angina, ST depression of 1.6 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 64-year-old female patient with non-anginal chest pain presented with normal resting blood pressure and high serum cholesterol levels. She had a normal resting electrocardiogram and achieved a maximum heart rate of 133. The patient did not experience exercise-induced angina and had a slight ST depression of 0.2. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 69-year-old male patient with asymptomatic chest pain has a resting blood pressure of 140 and serum cholesterol level of 110. His fasting blood sugar is above 120 mg/dl, but his resting electrocardiogram is normal. He achieved a maximum heart rate of 109, experienced exercise-induced angina, and had ST depression of 1.5 relative to rest. The slope of his peak exercise ST segment is flat.###\nHence this label was Yes."
"A 56-year-old female patient with asymptomatic chest pain, resting blood pressure of 134, high serum cholesterol of 409, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, maximum heart rate achieved at 150, experienced exercise-induced angina, ST depression of 1.9 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. This data suggests a potential risk of heart disease due to the combination of these factors.###\nHence this label was Yes."
"A 51-year-old male patient with non-anginal chest pain, resting blood pressure of 125, serum cholesterol level of 245, and fasting blood sugar greater than 120 mg/dl. The patient has probable or definite left ventricular hypertrophy based on resting electrocardiogram results. His maximum heart rate achieved is 166 and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 2.4, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"The patient is a 36-year-old male who is asymptomatic but has high fasting blood sugar (>120 mg/dl). Despite normal resting electrocardiogram results, the patient experiences exercise-induced angina. The patient's blood pressure is 110 and serum cholesterol levels are at 0. The maximum heart rate achieved is 125. The patient shows 1.0 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 62-year-old asymptomatic male with normal resting blood pressure and high serum cholesterol levels. He has a normal fasting blood sugar level and a normal resting electrocardiogram. He experienced exercise-induced angina and a slight ST depression after exercise. His maximum heart rate achieved was 130, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 48-year-old male patient with asymptomatic chest pain has a resting blood pressure of 122 and a serum cholesterol level of 275. Their fasting blood sugar is higher than 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 150 during exercise, experiencing angina. They also had ST depression of 2.0 induced by exercise relative to rest, with a downsloping peak exercise ST segment. ###\nHence this label was Yes."
"A 50-year-old female patient with asymptomatic chest pain, high resting blood pressure of 160, normal resting electrocardiogram results, and a high maximum heart rate of 110. The patient does not experience exercise-induced angina and has a flat slope of the peak exercise ST segment. The patient has a fasting blood sugar level above 120 mg/dl but a serum cholesterol level of 0.###\nHence this label was Yes."
"A 63-year-old asymptomatic male patient with a resting blood pressure of 150 and normal electrocardiogram results. The patient experiences exercise-induced angina, with a maximum heart rate of 86. There is no fasting blood sugar > 120 mg/dl. The serum cholesterol level is 0. ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 46-year-old male patient with asymptomatic chest pain, high resting blood pressure (180), elevated serum cholesterol (280), normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram results, moderate maximum heart rate (120), no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 57-year-old male patient with non-anginal chest pain has a normal resting blood pressure of 105 and fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 148 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.3, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 53-year-old male patient with asymptomatic chest pain, resting blood pressure of 144, serum cholesterol of 300, fasting blood sugar > 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 128, experiencing exercise-induced angina, 1.5 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 57-year-old male with asymptomatic chest pain. His resting blood pressure is 140, and he has normal electrocardiogram results. He has fasting blood sugar > 120 mg/dl. The maximum heart rate achieved is 100, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old asymptomatic male with normal resting blood pressure and serum cholesterol levels of 198. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and he achieved a maximum heart rate of 110 without experiencing exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 62-year-old male with no apparent chest pain but high resting blood pressure. They have fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. Despite a relatively low maximum heart rate achieved, the patient does not experience exercise-induced angina. There is ST depression of 2.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 41-year-old male patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol of 214, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy based on resting electrocardiogram results, maximum heart rate achieved at 168, no exercise-induced angina, ST depression of 2.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 36-year-old male patient with atypical angina presented with normal resting blood pressure (120 mmHg) and slightly elevated serum cholesterol (267 mg/dl). His fasting blood sugar level was normal. Resting electrocardiogram results were normal. He achieved a maximum heart rate of 160 bpm without exercise-induced angina. The patient showed ST depression of 3.0 mm relative to rest during exercise, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 53-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 181, fasting blood sugar lower than 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 132, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
