"A 62-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a normal fasting blood sugar level and resting electrocardiogram results. They achieved a maximum heart rate of 146 during exercise without experiencing angina. However, they did show ST depression relative to rest of 1.8 during exercise, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 59-year-old male patient with typical angina chest pain has a resting blood pressure of 178 and serum cholesterol level of 270. Their resting electrocardiogram indicates probable or definite left ventricular hypertrophy. Despite a high maximum heart rate achieved at 145, the patient did not experience exercise-induced angina. However, post-exercise, there was significant ST depression relative to rest of 4.2, with a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 41-year-old male patient with no chest pain, normal resting blood pressure and serum cholesterol levels. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 111 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, with a peak exercise ST segment slope that is upsloping.###\nHence this label was No."
"A 40-year-old male patient with asymptomatic chest pain, resting blood pressure of 95, normal serum cholesterol levels, fasting blood sugar above 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. The patient achieved a maximum heart rate of 144 with no exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 45-year-old male patient with typical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. His fasting blood sugar is below 120 mg/dl, and his resting electrocardiogram shows a normal pattern. Despite achieving a maximum heart rate of 132 during exercise, he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 43-year-old female patient with non-anginal chest pain, normal resting blood pressure of 122, serum cholesterol level of 213, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 165, no exercise-induced angina, ST depression of 0.2 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar levels above 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 84. The patient experiences exercise-induced angina but has no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 71-year-old female patient with non-anginal chest pain, resting blood pressure of 110, serum cholesterol level of 265, fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 130, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 42-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120, high serum cholesterol level of 295, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 162 without exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, achieved a maximum heart rate of 128, experienced exercise-induced angina, had 1.5 ST depression induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 56-year-old male who experiences non-anginal chest pain. His resting blood pressure is 125, with normal resting electrocardiogram results. Despite having fasting blood sugar over 120 mg/dl, he does not have exercise-induced angina. The patient achieved a maximum heart rate of 98 and showed a -2.0 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 39-year-old male patient with atypical angina chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar greater than 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 120 and no exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 43-year-old male patient with no history of chest pain, normal resting blood pressure and cholesterol levels. The patient does not have fasting blood sugar levels over 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 120. The patient experiences exercise-induced angina and has a ST depression of 1.0 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 73-year-old female with non-anginal chest pain. She has a resting blood pressure of 160 and normal fasting blood sugar levels. Her resting electrocardiogram shows ST-T wave abnormality. She achieved a maximum heart rate of 121 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 29-year-old male patient with atypical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 170. The patient did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, with a upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 52-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. Their fasting blood sugar is within normal range and their resting electrocardiogram shows normal results. The patient achieved a high maximum heart rate during exercise, experienced exercise-induced angina, and had no ST depression relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 51-year-old male patient with no chest pain exhibited normal resting blood pressure and cholesterol levels. Their fasting blood sugar was below 120 mg/dl. Resting electrocardiogram results were normal, and the maximum heart rate achieved was 60. The patient did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 60-year-old female patient with non-anginal chest pain presented with normal resting blood pressure of 102, elevated serum cholesterol of 318, and fasting blood sugar below 120 mg/dl. Resting electrocardiogram results were normal, with a maximum heart rate achieved of 160 and no exercise-induced angina. The patient showed no ST depression during exercise and had an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 37-year-old male patient with non-anginal chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. They do not have fasting blood sugar over 120 mg/dl and show probable or definite left ventricular hypertrophy in the resting electrocardiogram. The patient reached a maximum heart rate of 165 without experiencing exercise-induced angina. They exhibited a 1.0 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"The patient is a 38-year-old male with non-anginal chest pain. His resting blood pressure is 145 and serum cholesterol is 292. Fasting blood sugar level is normal. Resting electrocardiogram results show normal findings. The maximum heart rate achieved is 130 and there is no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 67-year-old male patient is experiencing asymptomatic chest pain with resting blood pressure of 140 and serum cholesterol level of 219. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality, with a maximum heart rate reached at 122. The patient experiences exercise-induced angina and has ST depression of 2.0 relative to rest. The slope of the peak exercise ST segment is flat. These factors indicate a potential risk of heart disease in this individual.###\nHence this label was Yes."
"A 45-year-old female patient with atypical angina chest pain, normal resting blood pressure of 112, and serum cholesterol level of 160. She does not have fasting blood sugar over 120 mg/dl and shows normal results on resting electrocardiogram. Her maximum heart rate achieved is 138, and she does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"The patient is a 54-year-old male who is experiencing asymptomatic chest pain. His resting blood pressure is 130, serum cholesterol level is 0, and fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 110 during exercise, experienced exercise-induced angina, and showed ST depression of 3.0 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 62-year-old female patient with non-anginal chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 97. The patient did not experience exercise-induced angina and had a slight ST depression of 1.2 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat. Fasting blood sugar level was below 120 mg/dl.###\nHence this label was Yes."
"A 75-year-old male patient with asymptomatic chest pain, resting blood pressure of 170, serum cholesterol level of 203, fasting blood sugar exceeding 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 108, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 128, and serum cholesterol level of 212. He has a normal resting electrocardiogram, but experiences exercise-induced angina. His maximum heart rate achieved is 96, with no significant ST depression after exercise. The slope of the peak exercise ST segment is flat. No fasting blood sugar above 120 mg/dl.###\nHence this label was Yes."
"The patient is a 45-year-old male who is asymptomatic but has probable or definite left ventricular hypertrophy. His resting blood pressure is 104 and serum cholesterol level is 208. He does not have fasting blood sugar > 120 mg/dl. He experienced exercise-induced angina and had a maximum heart rate of 148. The ST depression induced by exercise relative to rest is 3.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 47-year-old male patient with no history of chest pain or angina, exhibiting normal resting blood pressure and cholesterol levels. The patient has a normal fasting blood sugar level and electrocardiogram results. Despite a slightly elevated heart rate of 143, the patient experiences no exercise-induced angina. The ST segment depression after exercise is minimal at 0.1 and shows an upsloping pattern, indicating a potentially lower risk of heart disease.###\nHence this label was No."
"A 52-year-old male patient with asymptomatic chest pain has a resting blood pressure of 108 and serum cholesterol level of 233. They have a fasting blood sugar level above 120 mg/dl. Resting electrocardiogram results show normal activity, and the maximum heart rate achieved is 147. The patient does not experience exercise-induced angina. Their ST depression induced by exercise relative to rest is 0.1, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 63-year-old male with asymptomatic chest pain. His resting blood pressure is 100, serum cholesterol level is 0. He has fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. The maximum heart rate achieved is 109. The patient does not experience exercise-induced angina. ST depression induced by exercise relative to rest is -0.9. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 43-year-old male patient with non-anginal chest pain, normal resting blood pressure (130), high serum cholesterol level (315), normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 162, no exercise-induced angina, ST depression of 1.9 induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 48-year-old male patient with atypical angina chest pain, normal resting blood pressure, slightly elevated serum cholesterol levels, no fasting blood sugar above 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a high maximum heart rate during exercise without experiencing angina. The ST depression induced by exercise relative to rest is minimal at 0.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 74-year-old male patient with non-anginal chest pain, resting blood pressure of 140, serum cholesterol level of 237, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 94, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 75-year-old male with asymptomatic chest pain. His resting blood pressure is 136, serum cholesterol is 225. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. His maximum heart rate achieved is 112. He experiences exercise-induced angina. ST depression induced by exercise relative to rest is 3.0. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 45-year-old male patient with atypical angina chest pain, normal resting blood pressure of 140, serum cholesterol level of 224, fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 122, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 63-year-old male patient with non-anginal chest pain, resting blood pressure of 130, normal serum cholesterol levels, no fasting blood sugar > 120 mg/dl, showing ST-T wave abnormality in resting electrocardiogram results, achieving a maximum heart rate of 111, experiencing exercise-induced angina, with no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, high resting blood pressure (165), elevated serum cholesterol (289), and fasting blood sugar > 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. Maximum heart rate achieved was 124, with no exercise-induced angina. ST depression induced by exercise relative to rest was 1.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 43-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, normal serum cholesterol levels, no fasting blood sugar > 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 140, experiencing exercise-induced angina, with 0.5 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 46-year-old male patient with asymptomatic chest pain has a resting blood pressure of 110 and serum cholesterol level of 238. They do not have fasting blood sugar greater than 120 mg/dl. Results of resting electrocardiogram show ST-T wave abnormality. The patient achieved a maximum heart rate of 140 and experienced exercise-induced angina. They have a 1.0 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 52-year-old male patient with atypical angina chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar above 120 mg/dl and show a normal resting electrocardiogram. Despite achieving a high maximum heart rate of 165, they did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The 61-year-old male patient is asymptomatic and has a resting blood pressure of 130. There is no fasting blood sugar greater than 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. The maximum heart rate achieved is 115, and there is no exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 62-year-old female patient with typical angina chest pain had a resting blood pressure of 160 and serum cholesterol level of 193. She did not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results showed normal readings. The patient achieved a maximum heart rate of 116 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 58-year-old male patient with atypical angina chest pain, resting blood pressure of 136, serum cholesterol of 164, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 99, experiencing exercise-induced angina, ST depression of 2.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure (200), and serum cholesterol (198). Fasting blood sugar is under 120 mg/dl. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 142, experienced exercise-induced angina, and had ST depression of 2.0 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 51-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate of 104, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old male patient with no fasting blood sugar higher than 120 mg/dl presented with asymptomatic chest pain. His resting blood pressure was 116, and his serum cholesterol level was normal. The resting electrocardiogram showed a normal result, with a maximum heart rate achieved at 124. The patient did not experience exercise-induced angina. He had a 1.0 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 48-year-old male patient with atypical angina chest pain, normal resting blood pressure, serum cholesterol level of 238, normal fasting blood sugar level, normal resting electrocardiogram results, maximum heart rate achieved at 118, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 31-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, high maximum heart rate achieved, experiencing exercise-induced angina, slight ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 60-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high fasting blood sugar level, normal electrocardiogram results, and a moderately high heart rate. The patient did not experience exercise-induced angina, showed a slight ST depression after exercise, and had an upsloping peak exercise ST segment.###\nHence this label was Yes."
"A 53-year-old female patient with asymptomatic chest pain has a resting blood pressure of 130 and a serum cholesterol level of 264. They do not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Their maximum heart rate achieved is 143, and they did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.4, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"The patient is a 54-year-old male with atypical chest pain. His resting blood pressure is high at 192, and serum cholesterol level is elevated at 283. He does not have fasting blood sugar above 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. Despite reaching a maximum heart rate of 195, he did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 41-year-old male patient with atypical angina chest pain has normal resting blood pressure and high serum cholesterol levels. Their fasting blood sugar is below 120 mg/dl, and the resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 170 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 37-year-old male patient with atypical angina chest pain, resting blood pressure of 130, serum cholesterol level of 283, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 98, no exercise-induced angina, no ST depression induced by exercise, and an upsloping peak exercise ST segment.###\nHence this label was No."
"The patient is a 61-year-old female with asymptomatic chest pain. She has a resting blood pressure of 145 and serum cholesterol level of 307. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 146 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The 36-year-old male patient with asymptomatic chest pain has normal resting blood pressure, zero serum cholesterol, and high fasting blood sugar. His resting electrocardiogram results are normal, and he achieved a maximum heart rate of 125. He experienced exercise-induced angina and had 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 63-year-old male patient with asymptomatic chest pain has normal resting blood pressure (130) and high serum cholesterol (308). Their fasting blood sugar is below 120 mg/dl. The resting electrocardiogram results are normal, with a maximum heart rate achieved of 138. The patient experiences exercise-induced angina and has an ST depression of 2.0 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 43-year-old male with asymptomatic chest pain. His resting blood pressure is 150, serum cholesterol level is 247. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 130 and experienced exercise-induced angina. His ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 59-year-old male with asymptomatic chest pain. His resting blood pressure is 140, and he has a normal level of serum cholesterol. He does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 117 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 58-year-old male with asymptomatic chest pain. They have a resting blood pressure of 125 and a serum cholesterol level of 300. Fasting blood sugar is normal. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 171 without exercise-induced angina. They had no ST depression during exercise relative to rest, and the peak exercise ST segment showed an upsloping slope.###\nHence this label was Yes."
"A 50-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 133, serum cholesterol level of 218, normal fasting blood sugar, a resting electrocardiogram showing normal results, achieving a maximum heart rate of 128 during exercise. The patient experienced exercise-induced angina, with ST depression of 1.1 relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old male patient with asymptomatic chest pain, normal resting blood pressure, serum cholesterol of 234, normal fasting blood sugar, normal resting electrocardiogram results, achieved a maximum heart rate of 140, experienced exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 41-year-old male patient with atypical angina presented normal resting blood pressure (125 mm Hg) and high serum cholesterol (269 mg/dl). Fasting blood sugar was normal, resting electrocardiogram results were normal, and the patient achieved a maximum heart rate of 144 bpm. The patient did not experience exercise-induced angina, and there was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 46-year-old male patient with atypical angina chest pain and normal resting blood pressure has a serum cholesterol level of 197. Their fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 156. The patient did not experience exercise-induced angina, and ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 49-year-old male patient with no symptoms of chest pain, normal resting blood pressure, and a serum cholesterol level of 206. The patient's fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal and the maximum heart rate achieved is 170. The patient did not experience exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, serum cholesterol level of 385, fasting blood sugar above 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram, maximum heart rate achieved at 135, no exercise-induced angina, 0.3 ST depression induced by exercise relative to rest, and an upsloping slope of peak exercise ST segment.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain, normal resting blood pressure (130), and slightly elevated serum cholesterol (263). The patient does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 140. The patient experiences exercise-induced angina and has a ST depression of 2.0 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 42-year-old male with non-anginal chest pain. \nHis resting blood pressure is 134, and serum cholesterol is 240. \nHe does not have fasting blood sugar > 120 mg/dl. \nResting electrocardiogram results are normal. \nHe achieved a maximum heart rate of 160 and did not experience exercise-induced angina. \nThe ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The 48-year-old male patient has no chest pain but experiences exercise-induced angina. His resting blood pressure is 140 and serum cholesterol level is 208. The resting electrocardiogram results are normal. He achieved a maximum heart rate of 159. During exercise, he had ST depression relative to rest of 1.5. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 44-year-old female patient with non-anginal chest pain, normal resting blood pressure, slightly elevated serum cholesterol levels, normal fasting blood sugar levels, normal resting electrocardiogram results, high maximum heart rate achieved, no exercise-induced angina, minor ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 62-year-old female patient with asymptomatic chest pain, resting blood pressure of 140, serum cholesterol of 268, no fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 160, with no exercise-induced angina. ST depression induced by exercise relative to rest is 3.6, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol level, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy shown on resting electrocardiogram, reached a maximum heart rate of 127 during exercise, experienced exercise-induced angina, had ST depression of 1.7 induced by exercise relative to rest, and showed a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain, high resting blood pressure of 170, elevated serum cholesterol level of 388, normal fasting blood sugar, showing ST-T wave abnormality in resting electrocardiogram. He achieved a maximum heart rate of 122 during exercise, experienced exercise-induced angina, and had 2.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat. These factors suggest a potential risk for heart disease in the patient.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. They have a normal resting electrocardiogram and a low maximum heart rate achieved. The patient did not experience exercise-induced angina but showed ST depression after exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 58-year-old male patient with atypical angina chest pain, normal resting blood pressure (130), and normal serum cholesterol levels (230). The patient has a normal fasting blood sugar level and resting electrocardiogram results. He achieved a maximum heart rate of 150 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 34-year-old male patient with typical angina chest pain, normal blood pressure, and cholesterol levels. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. Maximum heart rate achieved during exercise is 174, without any exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment shows an upsloping pattern.###\nHence this label was No."
"A 55-year-old male patient with non-anginal chest pain, resting blood pressure of 136, serum cholesterol of 245, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, achieving a maximum heart rate of 131, experiencing exercise-induced angina, ST depression of 1.2 relative to rest, and a flat slope of the peak exercise ST segment. These factors combined may indicate a possibility of heart disease in the patient.###\nHence this label was Yes."
"A 66-year-old male patient with asymptomatic chest pain has a resting blood pressure of 112 and a serum cholesterol level of 212. They do not have fasting blood sugar > 120 mg/dl. Their resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 132 during exercise, experienced exercise-induced angina, and had ST depression of 0.1 relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 55-year-old male patient with non-anginal chest pain, normal resting blood pressure, and slightly elevated serum cholesterol at 220. The patient does not have fasting blood sugar > 120 mg/dl and shows probable or definite left ventricular hypertrophy in resting electrocardiogram results. With a maximum heart rate of 134 and no exercise-induced angina, the patient exhibits no ST depression after exercise. The peak exercise ST segment slope is upsloping.###\nHence this label was No."
"A 57-year-old male patient with non-anginal chest pain, normal resting blood pressure of 105, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram, and a maximum heart rate of 148. The patient does not experience exercise-induced angina, with a slight ST depression of 0.3 induced by exercise. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 76-year-old male patient with non-anginal chest pain, normal blood pressure, low serum cholesterol levels, no fasting blood sugar above 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, achieved a maximum heart rate of 120 without exercise-induced angina. However, the patient showed significant ST depression of 3.5 induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain has a resting blood pressure of 125. Their fasting blood sugar is above 120 mg/dl, and their serum cholesterol level is 0. Resting electrocardiogram results show normal activity, with a maximum heart rate achieved at 119. The patient experiences exercise-induced angina and has a ST depression of 0.9 induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 36-year-old male patient with atypical angina visited the clinic. His resting blood pressure is 120, and serum cholesterol is 267. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results were normal, and he achieved a maximum heart rate of 160. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 3.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"In this example, we have a 67-year-old male patient who is experiencing asymptomatic chest pain. His resting blood pressure is 120, and serum cholesterol level is 229. He does not have fasting blood sugar level above 120 mg/dl. Resting electrocardiogram results show probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 129 and experienced exercise-induced angina. His ST depression induced by exercise relative to rest is 2.6, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The 61-year-old male patient experienced non-anginal chest pain and had a high resting blood pressure of 200. His serum cholesterol level was 0, indicating a potential issue. His fasting blood sugar was above 120 mg/dl. The resting electrocardiogram showed ST-T wave abnormality. Despite reaching a maximum heart rate of 70, the patient did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain has a resting blood pressure of 110 and normal electrocardiogram results. He has fasting blood sugar levels above 120 mg/dl and experiences exercise-induced angina. His serum cholesterol levels are not mentioned. The patient achieved a maximum heart rate of 108 and showed ST depression of 2.0 induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 36-year-old male patient with non-anginal chest pain has normal resting blood pressure and serum cholesterol levels. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and he achieved a maximum heart rate of 172. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 48-year-old female patient with non-anginal chest pain, normal resting blood pressure (120 mmHg), and serum cholesterol levels of 195. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 125 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 55-year-old female patient with asymptomatic chest pain, normal resting blood pressure and serum cholesterol levels. Resting electrocardiogram shows ST-T wave abnormality. The patient experiences exercise-induced angina and has a ST depression of 2.0 relative to rest. Maximum heart rate achieved is 130 with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 44-year-old male patient with atypical angina chest pain, normal resting blood pressure, serum cholesterol of 220, normal fasting blood sugar levels, normal resting electrocardiogram results, a maximum heart rate of 170, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain has a resting blood pressure of 164 and serum cholesterol levels of 176. His fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 90 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is at 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"This 38-year-old female patient presented with asymptomatic chest pain. Her resting blood pressure was 110, serum cholesterol levels were at 0, and fasting blood sugar was under 120 mg/dl. Resting electrocardiogram results showed normal activity. She achieved a maximum heart rate of 156 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 62-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a resting electrocardiogram showing ST-T wave abnormality, reached a maximum heart rate of 120 during exercise, and experienced exercise-induced angina. ST depression of 3.0 was induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old female patient with atypical angina has normal resting blood pressure and high serum cholesterol. She has a normal resting electrocardiogram and achieved a maximum heart rate of 162 during exercise. She did not experience exercise-induced angina, and her ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"The patient is a 58-year-old female with asymptomatic chest pain. Her resting blood pressure is 100, serum cholesterol is 248, and fasting blood sugar is less than 120 mg/dl. The resting electrocardiogram indicates probable or definite left ventricular hypertrophy. Her maximum heart rate achieved is 122, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"The patient is a 69-year-old male who is experiencing no chest pain but has abnormal resting electrocardiogram results. His blood pressure is at 130 mmHg and he has high levels of serum cholesterol. Although he has fasting blood sugar over 120 mg/dl, he does not experience exercise-induced angina. Despite this, he has a slight ST depression induced by exercise relative to rest. The slope of his peak exercise ST segment is flat, and his maximum heart rate achieved is 129.###\nHence this label was Yes."
"A 29-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 243, fasting blood sugar less than 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 160, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 69-year-old female patient with typical angina chest pain, normal resting blood pressure, and slightly elevated serum cholesterol levels. Resting electrocardiogram results are normal, and the patient achieved a maximum heart rate of 151 during exercise without experiencing angina. There was a 1.8 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping. Fasting blood sugar was below 120 mg/dl.###\nHence this label was No."
"A 64-year-old male patient with asymptomatic chest pain has normal resting blood pressure and elevated serum cholesterol. Their fasting blood sugar level is normal. The resting electrocardiogram results are normal, but the patient experiences exercise-induced angina. They achieved a maximum heart rate of 102 and had ST depression of 4.0 induced by exercise relative to rest, with a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old female patient with atypical angina, normal resting blood pressure of 122, high serum cholesterol of 320, normal fasting blood sugar, normal resting electrocardiogram results, a maximum heart rate of 155, no exercise-induced angina, no ST depression induced by exercise, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 48-year-old female patient with non-anginal chest pain, normal resting blood pressure of 130, and serum cholesterol level of 275. She does not have fasting blood sugar > 120 mg/dl, and her resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 139 and did not experience exercise-induced angina. She had a slight ST depression of 0.2 induced by exercise relative to rest, with an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 37-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 140, serum cholesterol level of 207, normal fasting blood sugar levels, normal resting electrocardiogram results, achieved a maximum heart rate of 130 during exercise. The patient experienced exercise-induced angina, with 1.5 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 52-year-old male with non-anginal chest pain. \nHe has high resting blood pressure (172 mmHg) and normal cholesterol levels. \nHis fasting blood sugar is above 120 mg/dl. \nResting electrocardiogram results are normal and he achieved a maximum heart rate of 162 bpm. \nHe did not experience exercise-induced angina. \nThe ST depression induced by exercise relative to rest is 0.5. \nThe slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 64-year-old male who experiences typical angina chest pain. His resting blood pressure is 110 and serum cholesterol level is 211. He does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. The maximum heart rate achieved is 144. He experiences exercise-induced angina and has ST depression of 1.8 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was No."
"The patient is a 56-year-old male who is experiencing asymptomatic chest pain. His resting blood pressure is 120, with a serum cholesterol level of 0. He has no fasting blood sugar > 120 mg/dl. The resting electrocardiogram results show ST-T wave abnormality. The maximum heart rate achieved is 100, and the patient experiences exercise-induced angina. The ST depression induced by exercise relative to rest is -1.0, with the slope of the peak exercise ST segment being downsloping.###\nHence this label was Yes."
"A 50-year-old male patient with no history of chest pain presents with normal resting blood pressure and low serum cholesterol levels. His fasting blood sugar is within normal range. Resting electrocardiogram results show normal activity. Despite a relatively low maximum heart rate achieved during exercise, the patient does not experience exercise-induced angina. There is no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping. Overall, the data suggests a low probability of heart disease in this patient.###\nHence this label was No."
"A 41-year-old female patient with atypical angina presented with normal resting blood pressure (105 mmHg) and serum cholesterol levels (198 mg/dl). Fasting blood sugar was below 120 mg/dl. Resting electrocardiogram showed normal results. The patient achieved a maximum heart rate of 168 bpm and did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 58-year-old male patient with atypical angina chest pain has a resting blood pressure of 120 and serum cholesterol level of 284. Their resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 160, did not experience exercise-induced angina, and had ST depression of 1.8 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 55-year-old male with asymptomatic chest pain. His resting blood pressure is 150, and serum cholesterol is 160. He does not have fasting blood sugar>120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 150, and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, normal serum cholesterol level, no fasting blood sugar elevation, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 99, experiencing exercise-induced angina, with ST depression of 0.5 relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 64-year-old male patient with asymptomatic chest pain, resting blood pressure of 120, serum cholesterol level of 246, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 96, experiencing exercise-induced angina, ST depression of 2.2 induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 62-year-old female patient with no history of chest pain, normal fasting blood sugar, and high blood pressure was diagnosed with probable or definite left ventricular hypertrophy based on resting electrocardiogram results. She achieved a maximum heart rate of 145 without experiencing exercise-induced angina. However, she displayed significant ST depression of 6.2 induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 42-year-old male patient with non-anginal chest pain, normal resting blood pressure of 160, and serum cholesterol level of 147. The patient has a normal resting electrocardiogram and achieved a maximum heart rate of 146 during exercise with no signs of exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is upsloping. Fasting blood sugar is not above 120 mg/dl.###\nHence this label was No."
"A 51-year-old female patient with non-anginal chest pain, normal resting blood pressure (130), and slightly elevated serum cholesterol (220). She does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, but she experiences exercise-induced angina. Her maximum heart rate achieved is 160, with ST depression of 2.0 induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 30-year-old female patient with typical angina chest pain, resting blood pressure of 170, serum cholesterol level of 237, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, achieved a maximum heart rate of 170, did not experience exercise-induced angina, had no ST depression induced by exercise, and displayed an upsloping peak exercise ST segment.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 150, and a serum cholesterol level of 276. The patient does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram results indicate probable or definite left ventricular hypertrophy. The maximum heart rate achieved is 112 and the patient experienced exercise-induced angina. ST depression induced by exercise relative to rest is 0.6, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 38-year-old male patient with no chest pain symptoms, normal resting blood pressure and cholesterol levels. Resting electrocardiogram results were normal, with a maximum heart rate of 170 achieved during exercise where no angina was induced. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 64-year-old male patient with asymptomatic chest pain, resting blood pressure of 120, normal serum cholesterol level, fasting blood sugar above 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 106, no exercise-induced angina, 2.0 ST depression induced by exercise, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 59-year-old male with asymptomatic chest pain. His resting blood pressure is high at 178, while his serum cholesterol level is normal. He has high fasting blood sugar levels and probable/left ventricular hypertrophy according to his resting electrocardiogram results. His maximum heart rate achieved during exercise is 120, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 64-year-old male with asymptomatic chest pain. He has a resting blood pressure of 141 and serum cholesterol level of 244. His fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 116 during exercise, and experienced angina during exercise. ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 39-year-old male patient with no typical chest pain symptoms, normal resting blood pressure and cholesterol levels. Results from resting electrocardiogram are normal. The patient achieved a maximum heart rate of 140 bpm with no exercise-induced angina. There was a slight ST depression of 1.2 mm after exercise, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure (130 mmHg) and serum cholesterol (242 mg/dl). Fasting blood sugar is not elevated. Resting electrocardiogram shows normal results. Maximum heart rate achieved is 91 bpm. Patient experiences exercise-induced angina but with only mild ST depression of 1.0. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 64-year-old female patient with no history of chest pain or angina visited a clinic for a regular check-up. Her resting blood pressure was at 130, with a serum cholesterol level of 303. The results from her resting electrocardiogram were normal, and her maximum heart rate achieved during exercise was 122. Despite experiencing no exercise-induced angina, she had a significant ST depression of 2.0 mm relative to rest. The slope of the peak exercise ST segment was flat. This data suggests that the patient may have a low risk of heart disease, but further evaluation may be necessary.###\nHence this label was No."
"A 67-year-old female with non-anginal chest pain has normal resting blood pressure and serum cholesterol levels. Her fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal and she achieved a maximum heart rate of 172. She did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 70-year-old male patient with atypical angina experienced no fasting blood sugar over 120 mg/dl. Resting blood pressure was 156 with a serum cholesterol level of 245. The resting electrocardiogram indicated probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 143 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the peak exercise ST segment showed an upsloping slope.###\nHence this label was No."
"The patient is a 60-year-old male who is experiencing asymptomatic chest pain. His resting blood pressure is at 125 and serum cholesterol levels are at 258. He does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 141 and experienced exercise-induced angina. He had ST depression of 2.8 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 49-year-old female patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol level of 207, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 135, no exercise-induced angina, no ST depression post-exercise, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 66-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 112, serum cholesterol level of 261, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate of 140, no exercise-induced angina, ST depression of 1.5 induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was Yes."
"This data represents a 61-year-old male patient with asymptomatic chest pain. He has a resting blood pressure of 140 and a serum cholesterol level of 207. The patient does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 138 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.9, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain has a resting blood pressure of 170. His fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He experiences exercise-induced angina and has a maximum heart rate of 105. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 77-year-old male with asymptomatic chest pain. His resting blood pressure is 125 and serum cholesterol is 304. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 162. He experiences exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 46-year-old male patient with no typical chest pain symptoms, normal resting blood pressure, elevated serum cholesterol levels, normal fasting blood sugar, an abnormal resting electrocardiogram showing ST-T wave abnormality. The patient achieved a maximum heart rate of 140 without experiencing exercise-induced angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 44-year-old male patient with atypical angina chest pain, normal resting blood pressure (120), slightly elevated serum cholesterol (263), normal fasting blood sugar levels, normal resting electrocardiogram results, and a high maximum heart rate of 173. The patient did not experience exercise-induced angina, showed no ST depression induced by exercise relative to rest (0.0), and had an upsloping peak exercise ST segment.###\nHence this label was No."
"A 65-year-old female patient with non-anginal chest pain has a resting blood pressure of 140 and high serum cholesterol levels. She has fasting blood sugar > 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 157 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.8, with a peak exercise ST segment showing upsloping.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain, normal fasting blood sugar, and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. Resting blood pressure is 122, serum cholesterol is 286, maximum heart rate achieved is 116, and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 3.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 55-year-old male patient with typical angina chest pain, normal resting blood pressure (140 mmHg), elevated serum cholesterol (295 mg/dl), normal fasting blood sugar levels, normal resting electrocardiogram results, and a maximum heart rate of 136 bpm. The patient did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 53-year-old male with atypical angina chest pain. His resting blood pressure is 130, and he has normal serum cholesterol levels. He does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 120, and he does not experience exercise-induced angina. The patient has a ST depression of 0.7 induced by exercise relative to rest, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was No."
"A 56-year-old male patient with non-anginal chest pain, normal resting blood pressure of 130, and serum cholesterol level of 167. The patient has fasting blood sugar below 120 mg/dl, a normal resting electrocardiogram, and reaches a maximum heart rate of 114. He does not experience exercise-induced angina and shows no ST depression induced by exercise relative to rest. The peak exercise ST segment is upsloping.###\nHence this label was No."
"A 56-year-old male patient with atypical angina chest pain, normal resting blood pressure, and cholesterol levels. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 140 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 70-year-old male with asymptomatic chest pain. His resting blood pressure is 140 and he has high fasting blood sugar. The resting electrocardiogram results are normal. He achieved a maximum heart rate of 157 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0 and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 50-year-old female patient with no typical chest pain symptoms, but with probable or definite left ventricular hypertrophy based on resting electrocardiogram results. She has normal resting blood pressure and slightly high serum cholesterol levels. Despite achieving a high maximum heart rate during exercise, she does not experience exercise-induced angina. Her ST depression induced by exercise relative to rest is normal (0.0), and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 66-year-old female patient with non-anginal chest pain presented with a resting blood pressure of 146 and serum cholesterol level of 278. Fasting blood sugar was below 120 mg/dl. Resting electrocardiogram indicated probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 152 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the peak exercise ST segment showed a flat slope.###\nHence this label was No."
"A 59-year-old male patient with non-anginal chest pain, normal resting blood pressure (130), high serum cholesterol (318), normal fasting blood sugar level, normal resting electrocardiogram results, achieved a maximum heart rate of 120 during exercise, experienced exercise-induced angina, with ST depression of 1.0 relative to rest, and a flat slope of the peak exercise ST segment. These factors suggest a possibility of heart disease in the patient.###\nHence this label was No."
"A 34-year-old female patient with atypical angina chest pain, normal resting blood pressure of 130, and serum cholesterol level of 161. Fasting blood sugar is below 120 mg/dl, resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 190 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 56-year-old female patient with asymptomatic chest pain has high resting blood pressure and cholesterol levels. They have probable or definite left ventricular hypertrophy based on resting electrocardiogram results. The patient experiences exercise-induced angina and significant ST depression during exercise relative to rest. The peak exercise ST segment shows a downsloping pattern, indicating a potential risk for heart disease.###\nHence this label was Yes."
"A 60-year-old male patient with non-anginal chest pain, resting blood pressure of 180, normal serum cholesterol level, no fasting blood sugar over 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. He achieved a maximum heart rate of 140 during exercise, experienced exercise-induced angina, and had 1.5 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 51-year-old male patient with atypical angina chest pain has normal resting blood pressure (125) and cholesterol levels (188). He does not have fasting blood sugar higher than 120 mg/dl and shows a normal resting electrocardiogram. With a maximum heart rate of 145 and no exercise-induced angina, his ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 63-year-old male with atypical angina chest pain and resting blood pressure of 139. His serum cholesterol level is 217, and he has high fasting blood sugar (>120 mg/dl). The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 128 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"This is a 41-year-old male with atypical angina chest pain. His resting blood pressure is 110, serum cholesterol is 235. Fasting blood sugar is normal. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 153 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 62-year-old male patient with non-anginal chest pain has a resting blood pressure of 120 and serum cholesterol level of 220. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 86 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 44-year-old female patient with no history of chest pain visited the clinic. Her resting blood pressure was 120, and serum cholesterol level was 218. She had normal fasting blood sugar levels. The electrocardiogram showed ST-T wave abnormality. Her maximum heart rate achieved during exercise was 115, and she did not experience exercise-induced angina. She had no ST depression induced by exercise and showed an upsloping pattern in the peak exercise ST segment.###\nHence this label was No."
"A 65-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. They have a normal fasting blood sugar level, a maximum heart rate of 140, and experience exercise-induced angina. The patient has a significant ST depression of 4.0 induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 34-year-old female patient with atypical angina chest pain has normal resting blood pressure and serum cholesterol levels. She does not have fasting blood sugar levels above 120 mg/dl. Her resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 192 without experiencing exercise-induced angina. She has a slight ST depression of 0.7 induced by exercise relative to rest, with an upsloping peak exercise ST segment.###\nHence this label was No."
"A 51-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, normal serum cholesterol levels, fasting blood sugar > 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 163, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 61-year-old male patient, asymptomatic, with resting blood pressure of 138 and serum cholesterol of 166. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 125 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 3.6, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 37-year-old asymptomatic male patient with normal resting blood pressure and high serum cholesterol (315 mg/dl). The patient has a normal resting electrocardiogram, a maximum heart rate of 158, and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 47-year-old female patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. She does not have fasting blood sugar higher than 120 mg/dl. The resting electrocardiogram results are normal. Despite achieving a maximum heart rate of 98, she experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 71-year-old female patient with asymptomatic chest pain, normal resting blood pressure and cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 125. The patient does not experience exercise-induced angina. ST depression of 1.6 is induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure, low serum cholesterol level, and no fasting blood sugar elevation. Resting electrocardiogram results are normal, with a maximum heart rate of 115 bpm. The patient experiences exercise-induced angina and has a slight ST depression of 1.2 mm relative to rest. The slope of the peak exercise ST segment is flat. These factors suggest a moderate risk of heart disease in this individual.###\nHence this label was Yes."
"A 46-year-old female patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, achieved a maximum heart rate of 152, experienced exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 74-year-old male patient with asymptomatic chest pain, high resting blood pressure (150 mmHg), elevated serum cholesterol levels (258 mg/dl), presence of fasting blood sugar > 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. The patient achieved a maximum heart rate of 130 bpm, experienced exercise-induced angina, and had a significant ST depression of 4.0 mm relative to rest. The slope of the peak exercise ST segment was downsloping. These indicators suggest a possibility of heart disease in the patient.###\nHence this label was Yes."
"A 35-year-old female patient with typical angina chest pain, normal resting blood pressure, and low serum cholesterol levels. The resting electrocardiogram shows ST-T wave abnormality. She achieved a high maximum heart rate of 185 during exercise, without experiencing angina. There was no ST depression induced by exercise, and the peak exercise ST segment shows an upsloping pattern.###\nHence this label was No."
"A 61-year-old male patient experiencing non-anginal chest pain has a resting blood pressure of 150 and serum cholesterol level of 243. The patient has high fasting blood sugar (>120 mg/dl), normal resting electrocardiogram results, and a maximum heart rate of 137. The patient also experiences exercise-induced angina, with 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 46-year-old male patient with atypical angina chest pain, normal resting blood pressure of 140, and slightly elevated serum cholesterol of 275. The patient has a normal resting electrocardiogram, reaches a maximum heart rate of 165 during exercise, and experiences exercise-induced angina. Despite this, there is no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 55-year-old male patient with atypical angina type chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, achieved a high maximum heart rate of 155, did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 54-year-old male patient with atypical angina chest pain has a resting blood pressure of 132 and serum cholesterol of 182. They have a normal fasting blood sugar level and show ST-T wave abnormality in resting electrocardiogram results. The patient achieved a maximum heart rate of 141 without experiencing exercise-induced angina. They have a slight ST depression of 0.1 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 46-year-old asymptomatic male patient with normal resting blood pressure, no fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 113. The patient experienced exercise-induced angina, with ST depression induced by exercise relative to rest at 1.5, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol levels. Resting electrocardiogram shows ST-T wave abnormality. He experiences exercise-induced angina and has a minor ST depression during exercise. The slope of the peak exercise ST segment is flat. Despite these, the maximum heart rate achieved is only 96.###\nHence this label was No."
"A 45-year-old male patient with non-anginal chest pain, normal resting blood pressure (130), and serum cholesterol level (236). The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 144. He did not experience exercise-induced angina and had a slight ST depression of 0.1 induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130 and serum cholesterol of 603. They have high fasting blood sugar, a normal resting electrocardiogram, and achieved a maximum heart rate of 125 during exercise. The patient experienced exercise-induced angina and had an ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 130 during exercise, and experienced exercise-induced angina. The ST depression induced by exercise relative to rest was 3.0, and the slope of the peak exercise ST segment was flat. Fasting blood sugar level was below 120 mg/dl.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 128, normal serum cholesterol, fasting blood sugar > 120 mg/dl, showing ST-T wave abnormality in resting electrocardiogram. He achieved a maximum heart rate of 148 during exercise, experienced exercise-induced angina, and had ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 55-year-old male patient with non-anginal chest pain, normal blood pressure, and cholesterol levels. Resting electrocardiogram shows ST-T wave abnormality. Maximum heart rate achieved during exercise was 136, with no exercise-induced angina. The patient had a slight ST depression of 0.2 post-exercise, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 35-year-old male patient with atypical angina chest pain has normal resting blood pressure, moderately elevated serum cholesterol levels, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, a maximum heart rate of 140, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old male patient with atypical angina chest pain, normal resting blood pressure, serum cholesterol level of 253, normal fasting blood sugar, normal resting electrocardiogram results. The patient achieved a maximum heart rate of 174 without exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the peak exercise ST segment showed upsloping. These factors may be used to predict the presence of heart disease in the patient.###\nHence this label was No."
"The patient is a 53-year-old male who is asymptomatic but has a high resting blood pressure of 142 and slightly elevated serum cholesterol of 226. They do not have fasting blood sugar greater than 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 111 during exercise, experienced exercise-induced angina, and showed no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 59-year-old female patient with asymptomatic chest pain has a high resting blood pressure of 174 and slightly elevated serum cholesterol levels at 249. Their fasting blood sugar is within normal range. Resting electrocardiogram shows normal results and the patient achieved a maximum heart rate of 143 during exercise. They experienced exercise-induced angina and showed no ST depression after exercise relative to rest. The peak exercise ST segment slope was flat.###\nHence this label was Yes."
"A 74-year-old female patient with atypical angina chest pain, resting blood pressure of 120, serum cholesterol level of 269, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved of 121, exercise-induced angina present, ST depression of 0.2 induced by exercise relative to rest, and upsloping peak exercise ST segment.###\nHence this label was No."
"The patient is a 61-year-old male who experiences typical angina chest pain. His resting blood pressure is 142 and serum cholesterol level is 200. He has fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. Despite having a maximum heart rate of 100, the patient does not experience exercise-induced angina. He has a ST depression of 1.5 induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 60-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130 and a serum cholesterol level of 186. They have a fasting blood sugar level over 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 140 and experienced exercise-induced angina. They also had ST depression of 0.5 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old male patient with non-anginal chest pain, resting blood pressure of 105, and serum cholesterol of 240. The patient does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 154 and experienced exercise-induced angina. ST depression induced by exercise relative to rest was 0.6, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 57-year-old male patient with atypical angina chest pain, high resting blood pressure (180), elevated serum cholesterol (285), fasting blood sugar > 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 120 bpm, no exercise-induced angina, 0.8 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 52-year-old male patient with atypical angina chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar, normal electrocardiogram results, high maximum heart rate achieved, no exercise-induced angina, slight ST depression after exercise, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 41-year-old male patient with no fasting blood sugar above 120 mg/dl, experiencing no exercise-induced angina. The patient has asymptomatic chest pain, normal resting electrocardiogram results, a resting blood pressure of 112, serum cholesterol level of 250, maximum heart rate achieved at 142, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 55-year-old male patient with non-anginal chest pain, normal resting blood pressure (110), slightly elevated serum cholesterol (277), normal fasting blood sugar levels, normal resting electrocardiogram results, high maximum heart rate achieved (160), no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, normal serum cholesterol levels, no fasting blood sugar > 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. He achieved a maximum heart rate of 100 during exercise, experienced exercise-induced angina, with 1.0 ST depression relative to rest and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 46-year-old male patient with non-anginal chest pain, normal resting blood pressure, low serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, a maximum heart rate of 116 bpm, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 50-year-old male presenting with asymptomatic chest pain. His resting blood pressure is 140, serum cholesterol is 231, and fasting blood sugar is not higher than 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 140, experienced exercise-induced angina, and exhibited a ST depression of 5.0 relative to rest. The slope of the peak exercise ST segment is flat.\n###\nHence this label was Yes."
"A 55-year-old male patient with atypical angina chest pain, normal resting blood pressure of 140, serum cholesterol level of 196, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results. He achieved a maximum heart rate of 150, did not experience exercise-induced angina, and showed no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 55-year-old female patient with atypical angina chest pain has a resting blood pressure of 130 and a serum cholesterol level of 394. Their fasting blood sugar is below 120 mg/dl, and their resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 150 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 38-year-old female patient with asymptomatic chest pain, resting blood pressure of 105, normal electrocardiogram results, and fasting blood sugar above 120 mg/dl. She achieved a maximum heart rate of 166 without exercise-induced angina. The patient had a serum cholesterol level of 0 and showed a ST depression of 2.8 induced by exercise relative to rest, with an upsloping peak exercise ST segment.###\nHence this label was Yes."
"A 61-year-old male patient with non-anginal chest pain, normal resting blood pressure of 120, high serum cholesterol of 337, normal fasting blood sugar levels, normal resting electrocardiogram results, achieving a maximum heart rate of 98. The patient experiences exercise-induced angina, with no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 43-year-old female patient with asymptomatic chest pain, high blood pressure, high cholesterol, and fasting blood sugar > 120 mg/dL. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient experiences exercise-induced angina and has ST depression of 3.0. The peak exercise ST segment shows a flat slope. The maximum heart rate achieved was 136. This combination of factors may indicate a risk of heart disease in the patient.###\nHence this label was Yes."
"A 44-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, achieving a maximum heart rate of 135, without exercise-induced angina. The patient showed no ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 43-year-old male patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol. They have a high maximum heart rate of 181 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 125, serum cholesterol level of 249, and fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient experienced exercise-induced angina, with a maximum heart rate of 144. ST depression induced by exercise relative to rest is 1.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 43-year-old asymptomatic male patient with a resting blood pressure of 140, serum cholesterol level of 288, normal resting electrocardiogram results, a maximum heart rate of 135, and experiencing exercise-induced angina. The patient has no fasting blood sugar > 120 mg/dl and shows ST depression of 2.0 relative to rest with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 50-year-old male who is asymptomatic but has high resting blood pressure and slightly elevated serum cholesterol. The resting electrocardiogram is normal, but the patient experiences exercise-induced angina. The maximum heart rate achieved is 140. There is no fasting blood sugar over 120 mg/dl. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 60-year-old female patient with asymptomatic chest pain, resting blood pressure of 150, serum cholesterol of 258, no fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 157 with no exercise-induced angina. ST depression induced by exercise relative to rest is 2.6, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 52-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. The fasting blood sugar level is below 120 mg/dl. Resting electrocardiogram results are normal. The maximum heart rate achieved is 169, and there is no exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 46-year-old female patient with no history of chest pain presents with normal resting blood pressure and cholesterol levels. The electrocardiogram results are normal, and the maximum heart rate achieved during exercise is 90. The patient did not experience exercise-induced angina, and there was no ST depression noted. The slope of the peak exercise ST segment is upsloping. This data indicates a relatively healthy cardiovascular profile for the patient.###\nHence this label was No."
"A 44-year-old male patient, asymptomatic for chest pain, with a resting blood pressure of 110 and serum cholesterol level of 197. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 177 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, with an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 68-year-old male who is asymptomatic but has ST-T wave abnormality on resting electrocardiogram. He has a resting blood pressure of 135 and achieved a maximum heart rate of 120 during exercise. The patient experienced exercise-induced angina and has a upsloping ST segment on peak exercise.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain, resting blood pressure of 134, fasting blood sugar > 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 86, no exercise-induced angina, 1.5 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 51-year-old female patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol level. She does not have fasting blood sugar over 120 mg/dl. Her resting electrocardiogram results are normal, and she achieved a maximum heart rate of 142. She experienced exercise-induced angina and had 1.2 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 58-year-old female patient with atypical angina presented with high resting blood pressure of 180 and elevated serum cholesterol of 393. Resting electrocardiogram results were normal, but the patient experienced exercise-induced angina. Maximum heart rate achieved was 110, with ST depression of 1.0 relative to rest. The peak exercise ST segment showed a flat slope.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain has a resting blood pressure of 136 and serum cholesterol level of 220. His fasting blood sugar is below 120 mg/dl, and his resting electrocardiogram shows normal results. He achieved a maximum heart rate of 140 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 3.0, and the slope of the peak exercise ST segment is flat. Overall, these factors indicate a potential risk for heart disease in this patient.###\nHence this label was Yes."
"A 59-year-old male patient with non-anginal chest pain, normal resting blood pressure, serum cholesterol level of 213, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 100, no exercise-induced angina, no ST depression induced by exercise, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 63-year-old male patient with typical angina chest pain, resting blood pressure of 145, serum cholesterol level of 233, fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 150, no exercise-induced angina, ST depression of 2.3 induced by exercise relative to rest, and downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"This is a 48-year-old male patient with non-anginal chest pain. \nHis resting blood pressure is 102, and his serum cholesterol level is 0. \nHe has fasting blood sugar > 120 mg/dl and ST-T wave abnormality in resting electrocardiogram results. \nHis maximum heart rate achieved is 110, and he experiences exercise-induced angina. \nThe ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 67-year-old male patient with asymptomatic chest pain, high blood pressure, elevated serum cholesterol levels, and abnormal fasting blood sugar. The resting electrocardiogram shows ST-T wave abnormality. The patient experiences exercise-induced angina but has no ST depression relative to rest. The peak exercise ST segment is flat, and the maximum heart rate achieved is 130.###\nHence this label was Yes."
"A 58-year-old female patient with asymptomatic chest pain, resting blood pressure of 170, serum cholesterol of 225, fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 146, experienced exercise-induced angina, 2.8 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 51-year-old male patient with asymptomatic chest pain, resting blood pressure of 132, serum cholesterol level of 227, fasting blood sugar above 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 138, no exercise-induced angina, 0.2 ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment. These factors can help predict the possibility of heart disease in the patient.###\nHence this label was No."
"A 52-year-old male patient with asymptomatic chest pain, resting blood pressure of 95, normal resting electrocardiogram, and fasting blood sugar > 120 mg/dl. He experienced exercise-induced angina, with a maximum heart rate of 82. The patient had no serum cholesterol, and ST depression induced by exercise relative to rest was 0.8. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 48-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. The patient has a normal resting electrocardiogram, experienced exercise-induced angina, and had a slight ST depression induced by exercise. The maximum heart rate achieved was 103, and the slope of the peak exercise ST segment was flat. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was Yes."
"The patient is a 65-year-old male with asymptomatic chest pain. His resting blood pressure is 150 and serum cholesterol level is 235. His fasting blood sugar is not higher than 120 mg/dl. Resting electrocardiogram results are normal. He achieved a maximum heart rate of 120 during exercise, and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 48-year-old female patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol levels, normal resting electrocardiogram results, and a maximum heart rate of 130. She experienced exercise-induced angina and had a slight ST depression of 1.0 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. His fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows normal results, and he achieved a maximum heart rate of 123. The patient experienced exercise-induced angina and had a 1.2 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 66-year-old male patient with asymptomatic chest pain, resting blood pressure of 120, serum cholesterol of 302, no fasting blood sugar over 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 151, no exercise-induced angina, 0.4 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain has a resting blood pressure of 115. His serum cholesterol level is normal. He has fasting blood sugar greater than 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 82, and he does not experience exercise-induced angina. ST depression induced by exercise relative to rest is -1.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"The patient is a 56-year-old male who is asymptomatic but has high blood pressure and high cholesterol levels. His resting electrocardiogram is normal, but he experiences exercise-induced angina. Despite this, he achieves a maximum heart rate of 126. The patient also has ST segment depression and a flat slope during peak exercise. Additionally, his fasting blood sugar levels are above 120 mg/dl.###\nHence this label was Yes."
"A 48-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 128, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 68-year-old female patient with non-anginal chest pain, normal resting blood pressure, and moderate serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 115 and did not experience exercise-induced angina. ST depression relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol level of 254, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved of 147, no exercise-induced angina, ST depression of 1.4 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 43-year-old female patient with atypical angina presented with normal resting blood pressure and slightly elevated serum cholesterol levels. Resting electrocardiogram showed normal results, and the patient achieved a maximum heart rate of 118. She did not experience exercise-induced angina, and her ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, resting blood pressure of 142, serum cholesterol level of 228, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved of 149, experiencing exercise-induced angina, with 2.5 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. He has a normal resting electrocardiogram but experiences exercise-induced angina. His maximum heart rate achieved is 96, and he shows ST depression of 2.0 induced by exercise relative to rest with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 51-year-old female patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol level of 256, no fasting blood sugar > 120 mg/dl, displaying probable or definite left ventricular hypertrophy on resting electrocardiogram. She achieved a maximum heart rate of 149, did not experience exercise-induced angina, and had ST depression of 0.5 induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 40-year-old male patient with asymptomatic chest pain, resting blood pressure of 120, high serum cholesterol levels (466), fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 152, experiencing exercise-induced angina, with a 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"This 48-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. He does experience exercise-induced angina and has ST depression of 3.0 relative to rest. His maximum heart rate achieved is 102, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain, normal resting blood pressure (140), slightly high serum cholesterol levels (274), normal fasting blood sugar levels, a normal resting electrocardiogram, a high maximum heart rate achieved (154), experiencing exercise-induced angina, with 2.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 52-year-old female with non-anginal chest pain. Her resting blood pressure is 136, serum cholesterol level is 196, and fasting blood sugar is below 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. Her maximum heart rate achieved is 169, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.1, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 32-year-old male patient with atypical angina chest pain, normal resting blood pressure of 125, and high serum cholesterol of 254. He has a normal resting electrocardiogram, maximum heart rate achieved is 155 with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 56-year-old male who experiences typical angina chest pain. His resting blood pressure is 120, and his serum cholesterol level is 193. He does not have fasting blood sugar above 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 162 and did not experience exercise-induced angina. His ST depression induced by exercise relative to rest is 1.9, and the slope of the peak exercise ST segment is flat. Overall, this data indicates a detailed profile of the patient's heart health and potential risks for heart disease.###\nHence this label was No."
"The patient is a 60-year-old male who is asymptomatic and has a resting blood pressure of 160. They have normal resting electrocardiogram results and a maximum heart rate of 149. Fasting blood sugar is greater than 120 mg/dl, but there is no exercise-induced angina. The patient has a serum cholesterol level of 0 and a flat slope of the peak exercise ST segment with a 0.4 ST depression induced by exercise relative to rest.###\nHence this label was Yes."
"A 38-year-old male patient with asymptomatic chest pain has normal resting blood pressure and low serum cholesterol levels. They do not have fasting blood sugar higher than 120 mg/dl. Resting electrocardiogram results are normal, and the patient achieved a maximum heart rate of 134. They experienced exercise-induced angina and had ST depression of 2.5 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 52-year-old male patient with non-anginal chest pain, has a resting blood pressure of 140 and a serum cholesterol level of 259. They do not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 170, and the patient did not experience exercise-induced angina. They have no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 68-year-old male patient with non-anginal chest pain, normal resting blood pressure of 118, serum cholesterol level of 277, fasting blood sugar under 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 151, no exercise-induced angina, ST depression of 1.0 relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 64-year-old male patient with non-anginal chest pain, normal resting blood pressure of 140, high serum cholesterol of 335. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 158 during exercise without experiencing angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"The patient is a 32-year-old male with asymptomatic chest pain. His resting blood pressure is 118, and serum cholesterol is high at 529. He does not have fasting blood sugar over 120 mg/dl and has a normal resting electrocardiogram. His maximum heart rate achieved is 130, and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 38-year-old male patient with asymptomatic chest pain has normal resting blood pressure (110 mm Hg) and elevated serum cholesterol levels (289 mg/dl). They have a normal resting electrocardiogram and a maximum heart rate of 105 bpm. The patient experiences exercise-induced angina and has ST depression of 1.5 mm relative to rest. The slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 50-year-old male patient with asymptomatic chest pain, resting blood pressure of 144, serum cholesterol level of 349. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 120, experienced exercise-induced angina, and had 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 48-year-old male patient experienced non-anginal chest pain and had a resting blood pressure of 124. Their serum cholesterol level was 255, with fasting blood sugar levels higher than 120 mg/dl. Resting electrocardiogram results were normal, and the patient achieved a maximum heart rate of 175 without exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar level above 120 mg/dl. The resting electrocardiogram showed normal results. The maximum heart rate achieved was 83 and there was no exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 48-year-old male patient with non-anginal chest pain, normal resting blood pressure of 110, serum cholesterol level of 211, normal fasting blood sugar, normal resting electrocardiogram results, achieved a maximum heart rate of 138 without exercise-induced angina. The patient showed no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 37-year-old female patient with atypical angina visited the clinic. Her resting blood pressure was 120, serum cholesterol level was 260. She had a normal resting electrocardiogram and achieved a maximum heart rate of 130 during exercise. She did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 47-year-old male patient with asymptomatic chest pain has a resting blood pressure of 150 and serum cholesterol level of 226. His fasting blood sugar is below 120 mg/dl, and his resting electrocardiogram shows normal results. He achieved a maximum heart rate of 98 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 45-year-old female patient with atypical angina chest pain has normal resting blood pressure and serum cholesterol levels. Her fasting blood sugar is below 120 mg/dl and electrocardiogram results are normal. She achieved a maximum heart rate of 170 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. This data suggests a relatively healthy cardiovascular profile.###\nHence this label was No."
"A 54-year-old female patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. She does not have fasting blood sugar over 120 mg/dl. Her resting electrocardiogram results are normal, but she experiences exercise-induced angina. She achieved a maximum heart rate of 105 bpm during exercise. There is ST depression of 1.5 mm induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat. These factors suggest a possible risk of heart disease in this patient.###\nHence this label was Yes."
"A 35-year-old male patient with atypical angina chest pain had normal resting blood pressure and slightly elevated serum cholesterol. His fasting blood sugar was normal, and his resting electrocardiogram showed no abnormalities. He achieved a maximum heart rate of 168 during exercise without experiencing angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 62-year-old male patient with asymptomatic chest pain has a resting blood pressure of 160 and serum cholesterol level of 254. The patient's fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 108, and the patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 3.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 53-year-old male patient with non-anginal chest pain, normal resting blood pressure, serum cholesterol level of 195, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate of 140, no exercise-induced angina, no ST depression after exercise, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 53-year-old female patient with non-anginal chest pain, resting blood pressure of 128, serum cholesterol level of 216, no fasting blood sugar over 120 mg/dl, showing probable or definite left ventricular hypertrophy in resting electrocardiogram results. She achieved a maximum heart rate of 115 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 70-year-old male patient, experiencing no chest pain but with high resting blood pressure of 170. Their cholesterol levels are normal at 192. The electrocardiogram shows an ST-T wave abnormality. Despite reaching a maximum heart rate of 129, the patient suffers from exercise-induced angina. They have a significant ST depression of 3.0 post-exercise and a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 39-year-old male patient with atypical angina chest pain, normal resting blood pressure of 190, and serum cholesterol level of 241. The patient has a normal resting electrocardiogram, a maximum heart rate of 106, and did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping. The fasting blood sugar level was below 120 mg/dl. This data suggests a relatively healthy individual with no significant signs of heart disease.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain, resting blood pressure of 128, serum cholesterol of 259, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 130, experiencing exercise-induced angina, 3.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 52-year-old male patient with non-anginal chest pain, normal resting blood pressure, fasting blood sugar below 120 mg/dl, normal electrocardiogram results, achieving a maximum heart rate of 110 bpm. The patient experiences exercise-induced angina, with ST depression of 2.0 relative to rest, and a downsloping peak exercise ST segment.###\nHence this label was Yes."
