"A 54-year-old female patient with asymptomatic chest pain, resting blood pressure of 127, high serum cholesterol of 333, fasting blood sugar > 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 154, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. This data suggests a potential risk for heart disease.###\nHence this label was Yes."
"A 52-year-old male patient with typical angina chest pain had a resting blood pressure of 118 and serum cholesterol of 186. Their fasting blood sugar level was below 120 mg/dl. Resting electrocardiogram showed probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 190 without any exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 42-year-old male patient with non-anginal chest pain presented normal resting blood pressure and low serum cholesterol levels. They had a normal resting electrocardiogram and achieved a maximum heart rate of 146. The patient did not experience exercise-induced angina and showed no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping. Overall, the data suggests a relatively healthy cardiovascular profile for this individual.###\nHence this label was No."
"A 54-year-old male patient with non-anginal chest pain has normal resting blood pressure and slightly elevated serum cholesterol. Their fasting blood sugar is normal, and their resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 150 during exercise, experienced exercise-induced angina, and had ST depression of 1.5 relative to rest. The peak exercise ST segment showed a flat slope. This combination of factors may indicate a potential risk for heart disease.###\nHence this label was Yes."
"A 60-year-old female patient with typical angina chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. She has a maximum heart rate of 171 bpm and did not experience exercise-induced angina. Her ST depression during exercise relative to rest was 0.9, and the slope of the peak exercise ST segment was upsloping. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"The patient is a 63-year-old male who is asymptomatic but has a resting blood pressure of 150. Despite having a fasting blood sugar > 120 mg/dl and ST-T wave abnormality in resting electrocardiogram results, the patient does not experience exercise-induced angina. With a maximum heart rate of 154 and ST depression of 3.7 induced by exercise relative to rest, the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"The 39-year-old female patient experienced non-anginal chest pain, with normal resting blood pressure (110) and serum cholesterol levels (182). She had a normal fasting blood sugar level, but showed ST-T wave abnormality in resting electrocardiogram results. Despite reaching a high maximum heart rate of 180, she did not experience exercise-induced angina. Her ST depression induced by exercise relative to rest was 0.0, and she exhibited an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 66-year-old female with asymptomatic chest pain. She has a high resting blood pressure of 178 and elevated serum cholesterol levels of 228. Her fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results show normal activity. Despite reaching a maximum heart rate of 165 during exercise, she experienced angina. She also had a mild ST depression of 1.0 induced by exercise and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 32-year-old male patient with atypical angina chest pain has normal resting blood pressure of 125 and slightly high serum cholesterol of 254. His fasting blood sugar is normal, resting electrocardiogram shows regular results, and he achieved a maximum heart rate of 155. The patient did not experience exercise-induced angina and had no ST depression during exercise compared to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 62-year-old male who experiences atypical angina chest pain. His resting blood pressure is 128 and serum cholesterol level is 208. He has fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy is observed in his resting electrocardiogram. The maximum heart rate achieved is 140, and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 60-year-old male with non-anginal chest pain. His resting blood pressure is 140, and serum cholesterol is 185. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 155, did not experience exercise-induced angina, and had ST depression of 3.0 during exercise compared to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 46-year-old male patient with asymptomatic chest pain, normal resting blood pressure (120), elevated serum cholesterol level (249), no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy based on resting electrocardiogram results, achieved a maximum heart rate of 144 without exercise-induced angina. The ST depression induced by exercise relative to rest was 0.8, showing an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old female patient with typical angina chest pain, high blood pressure of 150, elevated serum cholesterol of 283, fasting blood sugar above 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 162, did not experience exercise-induced angina, and showed 1.0 ST depression relative to rest. The slope of the peak exercise ST segment is upsloping. These factors suggest a risk for heart disease in this patient.###\nHence this label was No."
"This is a 52-year-old male patient with atypical angina chest pain. \nHis resting blood pressure is high at 160, but his serum cholesterol level is within normal range at 196. \nHe has normal resting electrocardiogram results and achieved a maximum heart rate of 165. \nThere was no exercise-induced angina present, and the ST depression induced by exercise relative to rest was 0.0. \nThe slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol level of 230, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results. The patient achieved a maximum heart rate of 105, experienced exercise-induced angina, had ST depression of 1.0 induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The 56-year-old male patient presented with asymptomatic chest pain, normal resting blood pressure of 140, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram results were normal, with a maximum heart rate of 121. The patient experienced exercise-induced angina and had an ST depression of 1.8 induced by exercise relative to rest. The peak exercise ST segment showed an upsloping slope.###\nHence this label was Yes."
"A 64-year-old male patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol, no fasting blood sugar issues, probable or definite left ventricular hypertrophy in resting electrocardiogram, moderate maximum heart rate achieved, experiencing exercise-induced angina, with ST depression of 2.2 induced by exercise relative to rest, showing a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 44-year-old male presenting with asymptomatic chest pain. His resting blood pressure is 135, serum cholesterol is 491, and fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal findings. The maximum heart rate achieved is 135, and there is no exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 74-year-old male patient with non-anginal chest pain, normal resting blood pressure and serum cholesterol levels. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 116 without exercise-induced angina. There was a slight ST depression of 0.2 induced by exercise relative to rest, with an upsloping peak exercise ST segment.###\nHence this label was No."
"A 65-year-old male patient with asymptomatic chest pain, normal resting blood pressure (136), serum cholesterol level of 248, no fasting blood sugar > 120 mg/dL, normal resting electrocardiogram results, maximum heart rate achieved at 140, experiencing exercise-induced angina, ST depression of 4.0 induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, a slightly below average maximum heart rate, experiencing exercise-induced angina, mild ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 52-year-old male patient with no history of chest pain or blood sugar issues. Resting blood pressure and serum cholesterol levels are within normal range. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 150 during exercise without experiencing angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 31-year-old male who is asymptomatic but experiences exercise-induced angina. His resting blood pressure is 120 and serum cholesterol is elevated at 270. Fasting blood sugar level is normal. Resting electrocardiogram shows normal results. The patient achieves a maximum heart rate of 153. ST depression induced by exercise relative to rest is 1.5. The slope of the peak exercise ST segment is flat. These factors indicate a potential risk for heart disease in this patient.###\nHence this label was Yes."
"A 42-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 136, high serum cholesterol of 315, normal fasting blood sugar levels, normal resting electrocardiogram results, maximum heart rate achieved of 125, experiencing exercise-induced angina, with ST depression of 1.8 induced by exercise relative to rest and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 32-year-old male patient with atypical angina chest pain, normal resting blood pressure of 110, serum cholesterol level of 225, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, a high maximum heart rate of 184, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 45-year-old male patient with typical angina chest pain has normal resting blood pressure and slightly elevated cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 132 during a test. The patient did not experience exercise-induced angina and showed a slight ST depression after exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 45-year-old male with asymptomatic chest pain. \nHis resting blood pressure is 115 and serum cholesterol is 260. \nHe does not have fasting blood sugar > 120 mg/dl. \nResting electrocardiogram shows probable or definite left ventricular hypertrophy. \nHe achieved a maximum heart rate of 185 and did not experience exercise-induced angina. \nST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 67-year-old male patient with asymptomatic chest pain has a resting blood pressure of 125 and a serum cholesterol level of 254. They have fasting blood sugar levels above 120 mg/dl and normal resting electrocardiogram results. The patient achieved a maximum heart rate of 163 without experiencing exercise-induced angina. They demonstrated a slight ST depression of 0.2 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 66-year-old female patient with typical angina chest pain presented with normal resting blood pressure, slightly elevated serum cholesterol levels, and a normal resting electrocardiogram. She achieved a maximum heart rate of 114 without experiencing exercise-induced angina. However, she displayed ST depression of 2.6 induced by exercise relative to rest, with a downsloping peak exercise ST segment. fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 58-year-old male patient with no typical chest pain symptoms, normal resting blood pressure and cholesterol levels. The patient has ST-T wave abnormality on resting electrocardiogram, a maximum heart rate of 110, and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 44-year-old male patient with atypical angina chest pain, normal resting blood pressure (130), and slightly elevated serum cholesterol (215). The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 135, and did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 53-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 106. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 54-year-old male with asymptomatic chest pain and normal resting blood pressure. His fasting blood sugar level is below 120 mg/dl. The resting electrocardiogram shows normal results. He achieved a maximum heart rate of 155 during exercise without experiencing angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 69-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, normal serum cholesterol, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 129, no exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly high serum cholesterol. They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 154 and experienced exercise-induced angina. They had a 2.0 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 48-year-old male patient with asymptomatic chest pain has a resting blood pressure of 160 and a serum cholesterol level of 355. The patient has a normal resting electrocardiogram and a maximum heart rate of 99. They experience exercise-induced angina and have ST depression of 2.0 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 54-year-old male patient with atypical angina chest pain, normal resting blood pressure of 160, high serum cholesterol of 305, fasting blood sugar below 120 mg/dl, normal electrocardiogram results, and a high maximum heart rate of 175. The patient did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 56-year-old male patient with atypical angina chest pain has a resting blood pressure of 124 and a serum cholesterol level of 224. Their fasting blood sugar is above 120 mg/dl. The resting electrocardiogram shows normal results, and the patient achieved a maximum heart rate of 161. They did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 56-year-old male patient with typical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 193, no fasting blood sugar of over 120 mg/dl, and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. His maximum heart rate achieved was 162, did not experience exercise-induced angina, and had ST depression of 1.9 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 44-year-old male patient with no history of chest pain or fasting blood sugar > 120 mg/dl. Resting blood pressure is at 130, and serum cholesterol level is 209. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 127 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment slopes upwards. Symptoms suggest a low risk of heart disease in this patient.###\nHence this label was No."
"A 59-year-old male patient with non-anginal chest pain, normal resting blood pressure, and slightly elevated serum cholesterol levels. The patient has fasting blood sugar > 120 mg/dl, normal electrocardiogram results, and achieved a maximum heart rate of 134. There was no exercise-induced angina, but there was ST depression of 2.2 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 56-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 240, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 169, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 63-year-old male who is asymptomatic but has high resting blood pressure and cholesterol levels. They do not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The patient experiences exercise-induced angina. They have a high maximum heart rate achieved. The ST depression induced by exercise relative to rest is 3.0. The slope of the peak exercise ST segment is flat. This data suggests a potential risk of heart disease despite presenting as asymptomatic.###\nHence this label was Yes."
"The patient is a 63-year-old male who is asymptomatic but has a resting blood pressure of 96 and high serum cholesterol of 305. Their resting electrocardiogram shows ST-T wave abnormality. They experienced exercise-induced angina despite reaching a maximum heart rate of 121. The ST depression induced by exercise relative to rest was 1.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 125, serum cholesterol level of 258, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy shown in resting electrocardiogram results, maximum heart rate achieved at 141, experiencing exercise-induced angina, ST depression of 2.8 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old female patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 230, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 140, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 30-year-old female patient with typical angina chest pain, resting blood pressure of 170, serum cholesterol level of 237, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 170, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 46-year-old male patient with non-anginal chest pain, normal resting blood pressure (120), and serum cholesterol levels (230). They have a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 150. The patient did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 54-year-old female with atypical angina chest pain. Her resting blood pressure is 150, serum cholesterol level is 230, and fasting blood sugar is not above 120 mg/dl. Resting electrocardiogram results are normal. She achieved a maximum heart rate of 130 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"This 53-year-old male patient has atypical angina chest pain. His resting blood pressure is 120 and serum cholesterol is 181. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal with a maximum heart rate of 132. The patient does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 52-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and high serum cholesterol level. The patient does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 94. The patient experiences exercise-induced angina and has ST depression of 2.5 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 42-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, high serum cholesterol levels (358), normal resting electrocardiogram results, a maximum heart rate of 170, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment. The patient does not have fasting blood sugar greater than 120 mg/dl.###\nHence this label was No."
"This patient is a 48-year-old male who presented with asymptomatic chest pain. His resting blood pressure is 132, and his serum cholesterol level is 272. He has a normal fasting blood sugar level. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 139 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 65-year-old male who is asymptomatic but has ST-T wave abnormality on resting electrocardiogram. His blood pressure is 145, fasting blood sugar is high, and maximum heart rate achieved during exercise is 67. He does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.7, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal activity. He achieved a maximum heart rate of 105 without exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 71-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol level of 221, normal fasting blood sugar level, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 115, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 41-year-old male with non-anginal chest pain. His resting blood pressure is 112 and serum cholesterol is 250. Fasting blood sugar is normal. Resting electrocardiogram results show normal. He achieved a maximum heart rate of 179 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 54-year-old male who experienced atypical angina chest pain. His resting blood pressure is high at 160, while his serum cholesterol level is 195. He does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram showed ST-T wave abnormality. His maximum heart rate achieved was 130, and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 1.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 47-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. She has a normal resting electrocardiogram, a maximum heart rate of 98, and experiences exercise-induced angina. The patient has a 2.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 128, fasting blood sugar > 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 148, experiencing exercise-induced angina, with ST depression of 1.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol level of 289, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy seen in resting electrocardiogram, maximum heart rate achieved of 145, experienced exercise-induced angina, ST depression of 0.8 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. This data suggests a possible heart disease condition that may require further evaluation and monitoring.###\nHence this label was Yes."
"A 77-year-old male patient with asymptomatic chest pain has a resting blood pressure of 125 and serum cholesterol level of 304. They do not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 162 and experienced exercise-induced angina. They had no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 39-year-old male patient with no typical chest pain symptoms, normal resting blood pressure, slightly elevated serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, a maximum heart rate of 132, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment. This patient's overall heart disease risk appears to be relatively low based on these parameters.###\nHence this label was No."
"A 58-year-old male with non-anginal chest pain, normal resting blood pressure, slightly elevated serum cholesterol, no fasting blood sugar issues, shows probable or definite left ventricular hypertrophy on resting electrocardiogram. His maximum heart rate achieved is 165, denies exercise-induced angina, and exhibits ST depression of 2.5 post-exercise with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 118. The patient experiences exercise-induced angina but has no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 70-year-old male patient, with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. They do not have fasting blood sugar over 120 mg/dl. Their resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 92 during exercise, experienced angina, and had no ST depression induced by exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 57-year-old female patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, no fasting blood sugar above 120 mg/dl, probable or definite left ventricular hypertrophy based on resting electrocardiogram results, a high maximum heart rate achieved, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 125, normal electrocardiogram results, fasting blood sugar > 120 mg/dl, maximum heart rate achieved at 110, no exercise-induced angina, slight ST depression of 0.1 induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 50-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 120, serum cholesterol level of 0, no fasting blood sugar > 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. He achieved a maximum heart rate of 156, experienced exercise-induced angina, with ST depression of 0.0 relative to rest, and a peak exercise ST segment that was upsloping.###\nHence this label was Yes."
"The patient is a 64-year-old male with asymptomatic chest pain. Resting blood pressure is 141, serum cholesterol is 244, and fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 116, with exercise-induced angina present. ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 53-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, maximum heart rate achieved of 135, experiencing exercise-induced angina, ST depression of 1.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 115, normal serum cholesterol levels, fasting blood sugar > 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 82, no exercise-induced angina, -1.0 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a maximum heart rate of 174, did not experience exercise-induced angina, and showed ST depression of 1.6 during exercise relative to rest. The resting electrocardiogram result was normal, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 66-year-old male patient with asymptomatic chest pain, resting blood pressure of 112, serum cholesterol level of 212, and no fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 132, experienced exercise-induced angina, and had ST depression of 0.1 relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 58-year-old male patient with atypical angina chest pain presents with resting blood pressure of 126 and normal electrocardiogram results. The patient has fasting blood sugar > 120 mg/dl, experiences exercise-induced angina, and has a ST depression of 2.0 induced by exercise relative to rest. The maximum heart rate achieved is 110, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 48-year-old female patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. She has a normal resting electrocardiogram and reached a maximum heart rate of 130 during exercise, experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 54-year-old female patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, moderate maximum heart rate achieved, experiencing exercise-induced angina, with moderate ST depression induced by exercise relative to rest and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 34-year-old female patient with atypical angina chest pain, normal resting blood pressure (130), and serum cholesterol (161). Fasting blood sugar is normal, resting electrocardiogram results are normal, and the maximum heart rate achieved is high at 190. The patient does not experience exercise-induced angina. There is no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 52-year-old male patient with asymptomatic chest pain has a resting blood pressure of 170 and serum cholesterol level of 223. His resting electrocardiogram results are normal and he achieved a maximum heart rate of 126. He experienced exercise-induced angina and displayed 1.5 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment. Fasting blood sugar is below 120 mg/dl.###\nHence this label was Yes."
"A 63-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no fasting blood sugar over 120 mg/dl, normal electrocardiogram results, and a maximum heart rate of 98. The patient experiences exercise-induced angina but has no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 62-year-old male patient, experiencing non-anginal chest pain, has normal resting blood pressure (130) and cholesterol levels (231). Their fasting blood sugar is below 120 mg/dl, with a normal resting electrocardiogram. The maximum heart rate achieved is 146, and the patient does not have exercise-induced angina. There is a 1.8 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The 38-year-old male patient presented with atypical angina chest pain. His resting blood pressure was 140, and serum cholesterol was 297. Fasting blood sugar was normal. Resting electrocardiogram showed normal results. He achieved a maximum heart rate of 150 without exercise-induced angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 45-year-old male patient with non-anginal chest pain, normal resting blood pressure (135), and serum cholesterol levels (192). The patient has fasting blood sugar below 120 mg/dl, normal electrocardiogram results, maximum heart rate achieved at 110, and no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The 54-year-old male patient has no chest pain symptoms and normal resting blood pressure. His serum cholesterol level is 216. He does not have high fasting blood sugar. The resting electrocardiogram results are normal, and his heart rate reached a maximum of 105. He did not experience exercise-induced angina. There was ST depression of 1.5 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The 55-year-old female patient has atypical angina chest pain. She has a resting blood pressure of 135 and serum cholesterol level of 250. Her fasting blood sugar is below 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 161 and did not experience exercise-induced angina. There was a 1.4 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 54-year-old female patient with atypical angina presented with normal resting blood pressure, slightly elevated serum cholesterol levels, and a normal electrocardiogram. She achieved a maximum heart rate of 150 without experiencing exercise-induced angina. However, she displayed ST depression of 1.5mm induced by exercise relative to rest, with a flat slope of the peak exercise ST segment. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 60-year-old female patient with non-anginal chest pain has normal resting blood pressure and serum cholesterol levels. They have high fasting blood sugar levels, a normal resting electrocardiogram, and a maximum heart rate of 96. The patient does not experience exercise-induced angina and shows no ST depression post-exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"An active 69-year-old male patient with non-anginal chest pain, resting blood pressure of 142, and serum cholesterol level of 271. Fasting blood sugar is below 120 mg/dl, with probable or definite left ventricular hypertrophy shown on resting electrocardiogram. The maximum heart rate achieved is 126, with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.3, and the peak exercise ST segment shows an upsloping pattern.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain had a resting blood pressure of 130 and serum cholesterol level of 283. Their fasting blood sugar was above 120 mg/dl. Resting electrocardiogram indicated probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 103 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest was 1.6, and the slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"This patient is a 62-year-old male with asymptomatic chest pain. His resting blood pressure is 120, and serum cholesterol is 267. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 99. The patient experiences exercise-induced angina and has ST depression of 1.8 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, high maximum heart rate achieved, experiencing exercise-induced angina, significant ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. These factors suggest a potential risk of heart disease.###\nHence this label was Yes."
"A 62-year-old male patient with atypical angina chest pain has a resting blood pressure of 140 and serum cholesterol level of 271. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal activity, with a maximum heart rate of 152. The patient does not experience exercise-induced angina. They have ST depression of 1.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The 55-year-old male patient experiences non-anginal chest pain and has a resting blood pressure of 133. Their serum cholesterol level is 185, with a normal fasting blood sugar level. The resting electrocardiogram shows ST-T wave abnormality, and their maximum heart rate achieved is 136. The patient does not experience exercise-induced angina and has a slight ST depression of 0.2 relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 61-year-old female with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol level of 294, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 120, experiencing exercise-induced angina, 1.0 ST depression induced by exercise, and flat slope of peak exercise ST segment.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol level of 186, fasting blood sugar greater than 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved of 140, experiencing exercise-induced angina, ST depression of 0.5 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 34-year-old female patient with atypical angina chest pain, normal resting blood pressure of 118, serum cholesterol level of 210, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 192, no exercise-induced angina, 0.7 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 66-year-old male patient with non-anginal chest pain has a resting blood pressure of 110 and serum cholesterol level of 213. Their fasting blood sugar is above 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 99 and experienced exercise-induced angina. They exhibit 1.3 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 54-year-old male with asymptomatic chest pain. His resting blood pressure is 110, and serum cholesterol is 206. He does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 108, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 57-year-old male presenting with asymptomatic chest pain. Resting blood pressure is 139, serum cholesterol is 277, and fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 118. The patient experiences exercise-induced angina and has an ST depression of 1.9 relative to rest. The slope of the peak exercise ST segment is flat. These factors indicate a possible heart disease risk.###\nHence this label was Yes."
"A 51-year-old male patient with typical angina chest pain, normal blood sugar levels, and probable or definite left ventricular hypertrophy shown in the resting electrocardiogram. He experienced exercise-induced angina, reached a maximum heart rate of 125, and had ST depression of 1.4 induced by exercise relative to rest with an upsloping ST segment during peak exercise.###\nHence this label was No."
"The patient is a 61-year-old male with asymptomatic chest pain. His resting blood pressure is 130, and he has normal resting electrocardiogram results. His maximum heart rate achieved is 77, and he does not experience exercise-induced angina. The patient has a fasting blood sugar level > 120 mg/dl. He has ST depression of 2.5 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 45-year-old female patient with no history of chest pain or fasting blood sugar issues, displays normal resting electrocardiogram results, a moderately elevated blood pressure of 132, high serum cholesterol level of 297, and a relatively high maximum heart rate of 144. She experiences no exercise-induced angina, and shows no ST depression after exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 60-year-old asymptomatic male patient with normal resting blood pressure and cholesterol levels. Their fasting blood sugar is normal. Resting electrocardiogram results are normal, with a maximum heart rate of 133. The patient experiences exercise-induced angina and has an ST depression of 2.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The 59-year-old male patient has typical angina chest pain. Resting blood pressure is high at 160 and serum cholesterol level is elevated at 273. The patient does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. Maximum heart rate achieved during exercise is 125, and there is no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 67-year-old female with non-anginal chest pain, normal blood sugar levels, and probable or definite left ventricular hypertrophy shown on resting electrocardiogram. She has a resting blood pressure of 115 and high serum cholesterol levels of 564. Despite achieving a maximum heart rate of 160 during exercise, she did not experience angina. ST depression of 1.6 relative to rest was observed, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 54-year-old male experiencing non-anginal chest pain. His resting blood pressure is 133, and serum cholesterol level is 203. Fasting blood sugar is not above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 137, and he does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 69-year-old male patient with typical angina chest pain, high resting blood pressure of 160, and serum cholesterol level of 234. The patient has fasting blood sugar levels above 120 mg/dl and shows probable or definite left ventricular hypertrophy in resting electrocardiogram results. Despite reaching a maximum heart rate of 131, the patient did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was minimal at 0.1, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 53-year-old female patient with non-anginal chest pain has a resting blood pressure of 128 and serum cholesterol level of 216. She does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram indicates probable or definite left ventricular hypertrophy. Her maximum heart rate achieved is 115, and she does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 64-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol level of 223, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 128, no exercise-induced angina, 0.5 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 62-year-old male who is asymptomatic but has high resting blood pressure. His serum cholesterol levels are unknown. He has fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. Despite a relatively low maximum heart rate of 78 bpm, the patient does not experience exercise-induced angina. He has ST depression of 2.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 50-year-old male who is asymptomatic for chest pain. \nHis resting blood pressure is 145 and serum cholesterol level is 264.\nHe has normal fasting blood sugar levels and resting electrocardiogram results.\nThe maximum heart rate achieved is 150 and he did not experience exercise-induced angina. \nThere is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 34-year-old male patient with typical angina chest pain, normal resting blood pressure (118), and cholesterol levels (182). The patient does not have fasting blood sugar > 120 mg/dl and shows probable or definite left ventricular hypertrophy on the resting electrocardiogram. He achieved a maximum heart rate of 174 without exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 45-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 144 without exercise-induced angina. ST depression relative to rest is minimal at 0.1. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male patient with atypical angina chest pain, normal resting blood pressure (130), and slightly elevated serum cholesterol (251). They have normal fasting blood sugar levels and resting electrocardiogram results. The patient achieved a maximum heart rate of 110 during exercise, did not experience exercise-induced angina, and showed no ST depression post-exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 41-year-old female patient with atypical angina presented with normal resting blood pressure, slightly elevated serum cholesterol, no fasting blood sugar above 120 mg/dl, and ST-T wave abnormality on resting electrocardiogram. She achieved a maximum heart rate of 142 without exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 62-year-old female patient with typical angina chest pain, normal resting blood pressure, and serum cholesterol levels. Resting electrocardiogram results are normal, with a maximum heart rate of 116. The patient did not experience exercise-induced angina and had no ST depression induced by exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, serum cholesterol level of 264, fasting blood sugar over 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 119 during exercise, experienced angina, with no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. This data suggests a possible heart condition that may require further evaluation and treatment.###\nHence this label was Yes."
"This is a 59-year-old male patient with asymptomatic chest pain. His resting blood pressure is 120, serum cholesterol level is 0, and fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results, maximum heart rate achieved is 115, and there is no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 64-year-old asymptomatic male with normal resting blood pressure and cholesterol levels. They have fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 106 without experiencing exercise-induced angina. They have ST depression of 2.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 42-year-old male with asymptomatic chest pain. His resting blood pressure is 140, and his serum cholesterol level is 226. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal. He achieved a maximum heart rate of 178 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 70-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol level of 322, with no fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 109, did not experience exercise-induced angina, had ST depression of 2.4 induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old female patient with no history of chest pain, normal blood sugar levels, and an abnormal ST-T wave on resting electrocardiogram. She experienced exercise-induced angina, with a moderate ST depression of 2.0 post-exercise. Her resting blood pressure was 128, serum cholesterol level was 205, maximum heart rate achieved was 130, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 49-year-old male patient with asymptomatic chest pain has normal resting blood pressure and elevated serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 132 during exercise. The patient did not experience exercise-induced angina and had 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 67-year-old male patient with asymptomatic chest pain, resting blood pressure of 100, and high serum cholesterol level of 299. The patient does not have fasting blood sugar exceeding 120 mg/dl and shows probable or definite left ventricular hypertrophy on the resting electrocardiogram. Despite reaching a maximum heart rate of 125 during exercise, the patient experiences angina. ST depression induced by exercise relative to rest is 0.9, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 66-year-old male who is asymptomatic but has probable or definite left ventricular hypertrophy. His resting blood pressure is 120 and serum cholesterol level is 302. He does not have fasting blood sugar > 120 mg/dl and does not experience exercise-induced angina. His maximum heart rate achieved is 151. ST depression induced by exercise relative to rest is 0.4 and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 39-year-old male patient with atypical angina chest pain, normal resting blood pressure of 130, serum cholesterol level of 215, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 120, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 53-year-old asymptomatic male with normal resting blood pressure and cholesterol levels. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal. He achieved a maximum heart rate of 155 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 63-year-old male with non-anginal chest pain. His resting blood pressure is 130, and he has high fasting blood sugar levels. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 160 and did not experience exercise-induced angina. The patient has ST depression of 3.0 relative to rest and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 55-year-old male with atypical angina chest pain. His resting blood pressure is 140, and he has no fasting blood sugar over 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 150 and did not experience exercise-induced angina. His ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 51-year-old male patient with atypical angina chest pain has normal resting blood pressure and cholesterol levels. They have a fasting blood sugar level below 120 mg/dl and a normal resting electrocardiogram. The patient achieved a maximum heart rate of 145 without any exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 53-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. They have a normal resting electrocardiogram, a relatively low maximum heart rate, and experience exercise-induced angina. Their ST depression induced by exercise is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 53-year-old male with atypical angina chest pain. His resting blood pressure is 130, and he has no fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 120 and did not experience exercise-induced angina. His ST depression induced by exercise relative to rest is 0.7, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was No."
"The patient is a 65-year-old male who experiences typical angina chest pain. His resting blood pressure is 140 and serum cholesterol is 252. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results show normal activity. His maximum heart rate achieved is 135 and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.3, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 69-year-old male who experiences non-anginal chest pain. His resting blood pressure is 140, and his serum cholesterol level is 254. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The maximum heart rate achieved is 146, and he does not experience exercise-induced angina. He has ST depression of 2.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 51-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. He does not have fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, and a maximum heart rate of 60. There is no exercise-induced angina present, and the ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 62-year-old male patient with asymptomatic chest pain, normal resting blood pressure (135), elevated serum cholesterol (297), normal fasting blood sugar levels, normal resting electrocardiogram results, achieving a maximum heart rate of 130. The patient experiences exercise-induced angina, with a 1.0 ST depression induced by exercise relative to rest and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old female patient with atypical angina presented with normal resting blood pressure (160 mmHg) and high serum cholesterol levels (312 mg/dl). Fasting blood sugar was normal, resting electrocardiogram showed no abnormalities, and the maximum heart rate achieved was 130 bpm. The patient did not experience exercise-induced angina, had no ST depression after exercise, and showed an upsloping ST segment during peak exercise.###\nHence this label was No."
"The patient is a 65-year-old male with asymptomatic chest pain. His resting blood pressure is 140, serum cholesterol is 306, and fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results show normal findings. He achieved a maximum heart rate of 87 and experienced exercise-induced angina. His ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 62-year-old male patient with typical angina chest pain, resting blood pressure of 120, fasting blood sugar above 120 mg/dl, and probable or definite left ventricular hypertrophy in resting electrocardiogram results. He achieved a maximum heart rate of 134 without exercise-induced angina. His ST depression induced by exercise relative to rest was -0.8, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 57-year-old male patient with non-anginal chest pain, resting blood pressure of 150, low serum cholesterol level of 126, fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, a high maximum heart rate of 173, no exercise-induced angina, slight ST depression of 0.2 induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 60-year-old female with asymptomatic chest pain. They have a resting blood pressure of 158 and serum cholesterol of 305. Their resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 161 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 49-year-old male patient with non-anginal chest pain, normal resting blood pressure of 115, serum cholesterol level of 265, normal fasting blood sugar, normal resting electrocardiogram results, and a maximum heart rate of 175. The patient did not experience exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 54-year-old male with non-anginal chest pain. His resting blood pressure is 120, and serum cholesterol is 217. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, and he achieved a maximum heart rate of 137. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 60-year-old female patient with non-anginal chest pain, normal resting blood pressure (102), high serum cholesterol (318), normal fasting blood sugar levels, normal resting electrocardiogram results, reached a maximum heart rate of 160 during exercise without experiencing angina, showed no ST depression induced by exercise relative to rest, and had an upsloping peak exercise ST segment.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no serum cholesterol, normal fasting blood sugar, normal resting electrocardiogram, achieving a maximum heart rate of 86, experiencing exercise-induced angina, showing 2.0 ST depression induced by exercise relative to rest, and displaying a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The 55-year-old male patient has asymptomatic chest pain and a resting blood pressure of 120. His serum cholesterol level is 226, and fasting blood sugar is normal. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 127 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.7, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 48-year-old male patient with asymptomatic chest pain, normal resting blood pressure and high serum cholesterol levels. The patient's fasting blood sugar is normal, but they experience exercise-induced angina. Their resting electrocardiogram results are normal, with a maximum heart rate of 103. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat. These factors suggest a potential risk for heart disease in this patient.###\nHence this label was Yes."
"This data represents a 41-year-old male patient with asymptomatic chest pain. His resting blood pressure is 120, and serum cholesterol is high at 336. He has normal resting electrocardiogram results and achieved a maximum heart rate of 118. The patient experienced exercise-induced angina, with ST depression of 3.0 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 48-year-old male patient with non-anginal chest pain, normal resting blood pressure of 110, serum cholesterol level of 211, fasting blood sugar below 120 mg/dl, normal electrocardiogram results, maximum heart rate achieved at 138, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 51-year-old female patient presented with non-anginal chest pain, resting blood pressure of 140, and serum cholesterol levels of 308. The patient had no fasting blood sugar > 120 mg/dl and showed probable or definite left ventricular hypertrophy on resting electrocardiogram. She achieved a maximum heart rate of 142, did not experience exercise-induced angina, and had an ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 38-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. She has a normal resting electrocardiogram and achieved a maximum heart rate of 156 during exercise, without experiencing angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat. The fasting blood sugar level was not above 120 mg/dl, indicating a lower risk of heart disease.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain, resting blood pressure of 138, serum cholesterol of 271, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 182, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment. This data suggests a detailed profile of the individual's heart health and provides valuable insights for potential disease prediction.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain, resting blood pressure of 125, serum cholesterol of 300, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram, maximum heart rate achieved of 171, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and upsloping slope of the peak exercise ST segment. These factors suggest a comprehensive profile that can be used to predict the presence of heart disease in the patient.###\nHence this label was Yes."
"The patient is a 75-year-old male with asymptomatic chest pain. His resting blood pressure is 136, serum cholesterol level is 225, and fasting blood sugar is not elevated. Resting electrocardiogram results show normal activity. He achieved a maximum heart rate of 112 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 3.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 46-year-old male presents with typical angina chest pain, resting blood pressure of 140, serum cholesterol level of 272, normal resting electrocardiogram results, and a maximum heart rate achieved of 175. The patient has fasting blood sugar levels above 120 mg/dl and does not experience exercise-induced angina. There is ST depression of 2.0 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 51-year-old male patient with non-anginal chest pain, normal resting blood pressure, high serum cholesterol level, normal fasting blood sugar, normal resting electrocardiogram results, reaching a maximum heart rate of 127 during exercise with induced angina, showing 1.7 ST depression relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 43-year-old male who is asymptomatic but has a resting blood pressure of 140. Their serum cholesterol level is 0, fasting blood sugar is below 120 mg/dl, and they show ST-T wave abnormality on their resting electrocardiogram. They achieved a maximum heart rate of 140 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.5, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 48-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 175. The patient did not have fasting blood sugar > 120 mg/dl or exercise-induced angina. There was ST depression of 2.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 69-year-old male with asymptomatic chest pain. His resting blood pressure is 145 and serum cholesterol level is 289. He has high fasting blood sugar (>120 mg/dl) and ST-T wave abnormality on resting electrocardiogram. His maximum heart rate achieved is 110 and he experiences exercise-induced angina. The patient has ST depression of 1.8 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"This 43-year-old female patient has asymptomatic chest pain and high resting blood pressure. Their cholesterol level is elevated at 341, with fasting blood sugar > 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. Despite reaching a maximum heart rate of 136, the patient experiences exercise-induced angina. They exhibit ST depression of 3.0 post-exercise and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 43-year-old female patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 201, no fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved of 165, no exercise-induced angina, no ST depression induced by exercise relative to rest (0.0), and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 56-year-old male patient with non-anginal chest pain, resting blood pressure of 170, normal serum cholesterol levels, no fasting blood sugar over 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, maximum heart rate achieved at 123, experiencing exercise-induced angina, 2.5 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 43-year-old male patient with typical angina chest pain has a resting blood pressure of 120 and a serum cholesterol level of 291. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 155 without exercise-induced angina. Their ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 65-year-old female with non-anginal chest pain, normal resting blood pressure, and slightly elevated serum cholesterol of 269. She has a normal resting electrocardiogram and achieved a maximum heart rate of 148 without exercise-induced angina. There was a minor ST depression of 0.8 induced by exercise relative to rest, with an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 60-year-old male patient, asymptomatic for chest pain, with resting blood pressure of 140 and serum cholesterol level of 293. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 170 and did not experience exercise-induced angina. There was a 1.2 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old female patient with atypical angina chest pain has a resting blood pressure of 130 and serum cholesterol level of 253. Their fasting blood sugar is normal, and an ST-T wave abnormality is observed on their resting electrocardiogram. The patient achieved a maximum heart rate of 155 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment shows an upsloping pattern.###\nHence this label was No."
"The patient is a 54-year-old male who is asymptomatic for chest pain. He has a resting blood pressure of 130 and normal resting electrocardiogram results. His fasting blood sugar is above 120 mg/dl. He experiences exercise-induced angina and has a ST depression of 3.0 relative to rest. His serum cholesterol level is not provided. He achieves a maximum heart rate of 110 and shows a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 41-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120, high serum cholesterol of 295, normal fasting blood sugar levels, a normal resting electrocardiogram, a maximum heart rate of 170, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 51-year-old male who is asymptomatic. His resting blood pressure is 140, with a serum cholesterol level of 298. He does not have fasting blood sugar > 120 mg/dl. His resting electrocardiogram results are normal. He achieved a maximum heart rate of 122 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 4.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 67-year-old male who is asymptomatic. \nHis resting blood pressure is 120 and serum cholesterol is 237. \nHe does not have fasting blood sugar > 120 mg/dl. \nHis resting electrocardiogram results are normal. \nHis maximum heart rate achieved is 171 and he does not experience exercise-induced angina. \nHe has a ST depression of 1.0 induced by exercise relative to rest. \nThe slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 68-year-old male patient with non-anginal chest pain, normal resting blood pressure, and slightly elevated serum cholesterol level. The patient has a healthy fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 151 during exercise with no induced angina. There was a 1.0 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"An elderly 68-year-old male with non-anginal chest pain has high resting blood pressure of 180 and elevated serum cholesterol of 274. He has probable or definite left ventricular hypertrophy based on his resting electrocardiogram. Despite reaching a maximum heart rate of 150 during exercise, he experienced angina. The ST segment depression induced by exercise relative to rest was 1.6, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 57-year-old male patient, asymptomatic, with normal resting blood pressure and cholesterol levels. Fasting blood sugar is above 120 mg/dl. Resting electrocardiogram is normal, with a maximum heart rate of 100. The patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar above 120 mg/dl. The resting electrocardiogram results are normal, and the patient achieved a maximum heart rate of 126. They experienced exercise-induced angina and had ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat. This patient's data suggests a possibility of heart disease.###\nHence this label was No."
"A 74-year-old male patient with asymptomatic chest pain, normal resting blood pressure (155), elevated serum cholesterol (310), normal fasting blood sugar levels, normal electrocardiogram results, achieving a maximum heart rate of 112. The patient experienced exercise-induced angina, with ST depression of 1.5 relative to rest and a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. They have a normal resting electrocardiogram and a low maximum heart rate. The patient does not experience exercise-induced angina but shows ST depression after exercise. The slope of the peak exercise ST segment is flat. Overall, the patient's data suggests a risk for heart disease, warranting further evaluation and monitoring.###\nHence this label was Yes."
"A 51-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 126, no exercise-induced angina, ST depression of 2.2 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The 65-year-old male patient with asymptomatic chest pain has a resting blood pressure of 144 and a serum cholesterol level of 312. They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results suggest probable or definite left ventricular hypertrophy. The patient experienced exercise-induced angina and had a maximum heart rate of 113. They showed ST depression of 1.7 induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 53-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate of 120, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 63-year-old female with asymptomatic chest pain. She has normal resting blood pressure and high serum cholesterol levels. Her fasting blood sugar is normal, and her resting electrocardiogram shows no abnormalities. She achieved a high maximum heart rate during exercise, experienced angina, and had ST depression induced by exercise. The slope of her peak exercise ST segment was flat.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 128, serum cholesterol level of 223, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 119, exercise-induced angina present, 2.0 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old male patient with asymptomatic chest pain has normal resting blood pressure (128) and serum cholesterol levels (212). They have a normal resting electrocardiogram, with a maximum heart rate of 96. The patient experiences exercise-induced angina, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 45-year-old female patient with atypical angina chest pain has a resting blood pressure of 112 and a serum cholesterol level of 160. They do not have fasting blood sugar over 120 mg/dl. Their resting electrocardiogram results are normal, and they achieved a maximum heart rate of 138 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 51-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, heart rate of 104 bpm, no exercise-induced angina, no ST depression induced by exercise, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 66-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol level of 228, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 138, no exercise-induced angina, ST depression of 2.3 induced by exercise relative to rest, and upsloping peak exercise ST segment.###\nHence this label was No."
"A 64-year-old male patient with non-anginal chest pain has normal resting blood pressure of 125 and slightly elevated serum cholesterol of 309. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results appear normal, and they achieve a maximum heart rate of 131 during exercise. The patient experiences exercise-induced angina, with ST depression of 1.8 relative to rest. The slope of the peak exercise ST segment is flat. These factors suggest a potential risk for heart disease in this individual.###\nHence this label was Yes."
"A 42-year-old male patient with non-anginal chest pain has a resting blood pressure of 120 and serum cholesterol level of 240. His fasting blood sugar is higher than 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 194. The patient does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.8, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was No."
"A 35-year-old male patient with non-anginal chest pain, normal resting blood pressure, and low serum cholesterol levels. The resting electrocardiogram showed ST-T wave abnormality. The patient achieved a maximum heart rate of 153 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest was minimal at -0.1. The slope of the peak exercise ST segment was upsloping. Overall, the data suggests a relatively low risk of heart disease in this patient.###\nHence this label was No."
"A 62-year-old male patient with non-anginal chest pain, normal resting blood pressure, no serum cholesterol level given, normal fasting blood sugar, normal resting electrocardiogram results, a maximum heart rate of 72, experiencing exercise-induced angina, with no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain, high resting blood pressure of 155, elevated serum cholesterol levels at 342. Fasting blood sugar level is above 120 mg/dl, normal resting electrocardiogram results, with a maximum heart rate of 150. The patient experiences exercise-induced angina, ST depression of 3.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 52-year-old female with non-anginal chest pain has a resting blood pressure of 136 and serum cholesterol level of 196. She does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. Her maximum heart rate achieved is 169 and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.1, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 58-year-old male patient with non-anginal chest pain, resting blood pressure of 105, serum cholesterol level of 240, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, achieving a maximum heart rate of 154, experiencing exercise-induced angina, with ST depression of 0.6 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels, no fasting blood sugar over 120 mg/dl. Their resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 115 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 39-year-old male with asymptomatic chest pain, normal resting blood pressure of 118, serum cholesterol level of 219, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, a maximum heart rate of 140, no exercise-induced angina, 1.2 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 52-year-old male patient with no chest pain symptoms, normal resting blood pressure and cholesterol levels. The patient had a normal fasting blood sugar level and electrocardiogram results. He achieved a maximum heart rate of 168 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest was 1.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 138, no exercise-induced angina, minor ST depression of 0.5 induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 74-year-old male patient with non-anginal chest pain, resting blood pressure of 140, serum cholesterol level of 237, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 94, no exercise-induced angina, ST depression induced by exercise relative to rest at 0.0, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 40-year-old male patient with non-anginal chest pain, normal resting blood pressure of 130, and serum cholesterol level of 215. Fasting blood sugar level is normal. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 138 without exercise-induced angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 55-year-old male who is asymptomatic for chest pain. His resting blood pressure is 140 and serum cholesterol levels are normal. He does not have fasting blood sugar levels above 120 mg/dl. His resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 83 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 57-year-old female patient with asymptomatic chest pain, resting blood pressure of 180 and serum cholesterol level of 347. The patient does not have fasting blood sugar >120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 126. The patient experiences exercise-induced angina and has ST depression of 0.8 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 46-year-old male patient with non-anginal chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar above 120 mg/dl. Their resting electrocardiogram results are normal, and they achieved a maximum heart rate of 116 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 50-year-old female with atypical angina chest pain. Her resting blood pressure is 110, serum cholesterol is 202, and fasting blood sugar is normal. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 145. She does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol levels. They do not have fasting blood sugar greater than 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 132. The patient experiences exercise-induced angina and has a ST depression of 1.2 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 55-year-old male patient with no history of chest pain, normal blood sugar levels, and an abnormal resting electrocardiogram showing ST-T wave abnormalities. He reached a maximum heart rate of 92 during exercise, experienced no exercise-induced angina, and had a slight ST depression of 0.3 relative to rest. The slope of his peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 53-year-old male patient with non-anginal chest pain visited the clinic. His resting blood pressure was 105 and serum cholesterol level was normal. He had a normal resting electrocardiogram and his maximum heart rate achieved was 115. The patient did not experience exercise-induced angina, and his ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 64-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. She has a normal resting electrocardiogram, achieved a maximum heart rate of 140 during exercise, and experienced angina. There was a slight ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat. Fasting blood sugar was below 120 mg/dl.###\nHence this label was Yes."
"A 45-year-old male patient with asymptomatic chest pain, resting blood pressure of 142, serum cholesterol of 309, no fasting blood sugar over 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 147, experienced exercise-induced angina, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 40-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. He has a fasting blood sugar level below 120 mg/dl. His resting electrocardiogram results are normal, and he achieved a maximum heart rate of 188 during exercise without experiencing angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"This is a 40-year-old male patient with non-anginal chest pain. His resting blood pressure is 130 and serum cholesterol is 281. Fasting blood sugar is normal. Resting electrocardiogram results show normal activity. He achieved a maximum heart rate of 167 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 39-year-old male patient with non-anginal chest pain had a resting blood pressure of 160 and a serum cholesterol level of 147. The patient had fasting blood sugar > 120 mg/dl. Resting electrocardiogram results were normal, with a maximum heart rate achieved of 160. The patient did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 69-year-old male with non-anginal chest pain. His resting blood pressure is 140 and he has fasting blood sugar higher than 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 118 and he does not experience exercise-induced angina. He has ST depression of 2.5 induced by exercise relative to rest, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"The patient is a 61-year-old male who presented with asymptomatic chest pain. His resting blood pressure is 125, with serum cholesterol level at 292. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 115 and experienced exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 62-year-old female patient with no history of chest pain, normal fasting blood sugar level, and probable or definite left ventricular hypertrophy as per resting electrocardiogram results. The patient's blood pressure is at 140, cholesterol levels at 394, and achieved a maximum heart rate of 157. There was no exercise-induced angina observed. However, the ST depression induced by exercise relative to rest was 1.2, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 55-year-old female patient with atypical angina chest pain, normal resting blood pressure of 122, high serum cholesterol of 320, normal fasting blood sugar levels, normal resting electrocardiogram results, a maximum heart rate of 155, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 65-year-old male who is asymptomatic and has normal resting blood pressure. Their serum cholesterol level is 0, fasting blood sugar is under 120 mg/dl, and their resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 93 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 53-year-old male with non-anginal chest pain, resting blood pressure of 130, serum cholesterol level of 197. They have high fasting blood sugar (>120 mg/dl), probable or definite left ventricular hypertrophy based on resting electrocardiogram. The patient achieved a maximum heart rate of 152 without exercise-induced angina. They had a 1.2 ST depression induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain has a resting blood pressure of 140 and serum cholesterol of 311. Their resting electrocardiogram is normal, with a maximum heart rate of 120. The patient experiences exercise-induced angina and has a ST depression of 1.8 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 51-year-old female patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol levels. She does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 142. The patient experiences exercise-induced angina and has ST depression of 1.2 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 70-year-old male patient with atypical angina chest pain presents with a resting blood pressure of 156 and serum cholesterol level of 245. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The maximum heart rate achieved is 143, and there is no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They have a normal resting electrocardiogram, a maximum heart rate of 110, and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 50-year-old female patient with no known heart disease risk factors presented with asymptomatic chest pain. Her resting blood pressure was 110, and serum cholesterol level was elevated at 254. Fasting blood sugar level was normal. Resting electrocardiogram suggested probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 159 without experiencing exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 61-year-old female patient with no fasting blood sugar (>120 mg/dl) was diagnosed with asymptomatic chest pain. She had a resting blood pressure of 145 and a serum cholesterol level of 307. The resting electrocardiogram showed probable or definite left ventricular hypertrophy. Despite experiencing exercise-induced angina, she achieved a maximum heart rate of 146. The ST depression induced by exercise relative to rest was 1.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 60-year-old male with non-anginal chest pain. His resting blood pressure is 141, and serum cholesterol level is 316. He has fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 122 and experienced exercise-induced angina. His ST depression induced by exercise relative to rest is 1.7, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The 47-year-old male patient has asymptomatic chest pain and resting blood pressure of 110. His serum cholesterol level is 275. He does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 118. He experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 74-year-old female patient with atypical angina chest pain, resting blood pressure of 120, serum cholesterol level of 269, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 121, experienced exercise-induced angina, with 0.2 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 68-year-old male with asymptomatic chest pain. His resting blood pressure is 138, serum cholesterol level is 0, and fasting blood sugar is normal. Resting electrocardiogram results are normal, with a maximum heart rate of 130. He experiences exercise-induced angina and has an ST depression of 3.0. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 50-year-old female patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 244. Fasting blood sugar is not higher than 120 mg/dl. Resting electrocardiogram shows normal results. The maximum heart rate achieved is 162, and there is no exercise-induced angina. ST depression induced by exercise relative to rest is 1.1. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The 45-year-old male patient has atypical angina chest pain. \nHis resting blood pressure is 128 and serum cholesterol is 308. \nHe does not have fasting blood sugar > 120 mg/dl. \nThe resting electrocardiogram shows probable or definite left ventricular hypertrophy. \nHe achieved a maximum heart rate of 170 and did not experience exercise-induced angina. \nThere was no ST depression induced by exercise relative to rest. \nThe slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 50-year-old male who is experiencing no chest pain but has restings blood pressure of 133 and serum cholesterol levels of 218. Their electrocardiogram results are normal, and they have achieved a maximum heart rate of 128. The patient experiences exercise-induced angina and has an ST depression of 1.1 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 35-year-old female patient with no typical chest pain symptoms, normal resting blood pressure and cholesterol levels. She has a normal resting electrocardiogram and achieved a high maximum heart rate during exercise without experiencing angina. There was a slight ST depression induced by exercise relative to rest, with an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 48-year-old female patient with atypical angina presented normal resting blood pressure (120) and high serum cholesterol levels (284). She had a fasting blood sugar level below 120 mg/dl and a maximum heart rate of 120. There was no exercise-induced angina, and ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 62-year-old male patient with non-anginal chest pain has a resting blood pressure of 120 and serum cholesterol level of 220. The patient does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 86 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, with a peak exercise ST segment slope that is upsloping.###\nHence this label was No."
"A 42-year-old female patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol of 209. She has a maximum heart rate of 173 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat. Fasting blood sugar is below 120 mg/dl.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain, normal blood pressure, slightly elevated serum cholesterol, no fasting blood sugar above 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, achieved a maximum heart rate of 142 during exercise, experienced exercise-induced angina, showed 1.2 ST depression induced by exercise relative to rest, and had a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 47-year-old male with non-anginal chest pain. He has a resting blood pressure of 140 and serum cholesterol level of 193. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 145 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain has a resting blood pressure of 150 and a serum cholesterol level of 213. Their fasting blood sugar is over 120 mg/dl, but their resting electrocardiogram shows normal results. The maximum heart rate achieved is 125, and they experience exercise-induced angina. They also have ST depression of 1.0 relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"This 62-year-old male patient is asymptomatic and has normal resting blood pressure. They do not have fasting blood sugar greater than 120 mg/dl. The patient's resting electrocardiogram results are normal, with a maximum heart rate achieved of 120. They experience exercise-induced angina and have a slight ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 29-year-old male patient presenting with atypical angina chest pain. Resting blood pressure is 140, serum cholesterol level is 263. Fasting blood sugar is normal. Resting electrocardiogram shows normal results. Maximum heart rate achieved is 170, with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old male patient with non-anginal chest pain, resting blood pressure of 150, and serum cholesterol level of 232. The patient does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 165 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 1.6, and the peak exercise ST segment slope was upsloping.###\nHence this label was No."
"A 42-year-old male patient with non-anginal chest pain, normal resting blood pressure (120 mmHg) and slightly elevated serum cholesterol (228 mg/dl). The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 152 bpm, and experienced exercise-induced angina. ST depression of 1.5 was induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. Resting electrocardiogram shows ST-T wave abnormality. The patient experiences exercise-induced angina and has a minor ST depression induced by exercise. Maximum heart rate achieved is 96 and the peak exercise ST segment slope is flat. No fasting blood sugar > 120 mg/dl. These factors suggest a potential risk for heart disease.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130 and a serum cholesterol level of 202. The patient has fasting blood sugar levels over 120 mg/dl and a normal resting electrocardiogram. He achieved a maximum heart rate of 112 during exercise, experienced exercise-induced angina, and had a 2.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 37-year-old female with atypical angina chest pain. Her resting blood pressure is 120, serum cholesterol is 260, and fasting blood sugar is normal. Resting electrocardiogram results show normal findings. She achieved a maximum heart rate of 130 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 43-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. They do not have fasting blood sugar levels over 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 120. The patient experiences exercise-induced angina and has a 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 59-year-old male patient with typical angina chest pain has normal resting blood pressure and serum cholesterol levels. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results, and the patient achieved a maximum heart rate of 162. They did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.8, and the slope of the peak exercise ST segment is upsloping. This data suggests a relatively healthy cardiovascular profile for the patient.###\nHence this label was Yes."
"A 51-year-old male with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar elevation. Resting electrocardiogram shows normal results. Maximum heart rate achieved is 107, with no exercise-induced angina. ST depression relative to rest is 0.0, and the peak exercise ST segment slope is upsloping.###\nHence this label was No."
"A 58-year-old female patient with asymptomatic chest pain, resting blood pressure of 170, serum cholesterol of 225, fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved of 146, exercise-induced angina present, ST depression of 2.8 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. This data suggests potential risk factors for heart disease.###\nHence this label was Yes."
"A 57-year-old female patient with typical angina chest pain, normal resting blood pressure, high serum cholesterol level, normal fasting blood sugar, normal resting electrocardiogram results, low maximum heart rate achieved, no exercise-induced angina, slight ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 56-year-old male patient with non-anginal chest pain, normal resting blood pressure, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram results were normal, and the maximum heart rate achieved was 98. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest was -2.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 63-year-old male patient with asymptomatic chest pain has a resting blood pressure of 160 and serum cholesterol level of 267. The patient has a fasting blood sugar level over 120 mg/dl, with ST-T wave abnormality on resting electrocardiogram. He achieved a maximum heart rate of 88 and experienced exercise-induced angina. The patient also has ST depression of 2.0 relative to rest and a flat slope of the peak exercise ST segment. These factors suggest a risk of heart disease in the individual.###\nHence this label was Yes."
"A 37-year-old female patient with non-anginal chest pain, normal resting blood pressure of 130, serum cholesterol level of 211, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 142, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 49-year-old male patient with atypical angina chest pain, normal resting blood pressure of 100, serum cholesterol level of 253, no fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved of 174, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 43-year-old male patient with no chest pain, normal resting blood pressure, and cholesterol levels. They do not have fasting blood sugar over 120 mg/dl. Their electrocardiogram results are normal, and they achieved a maximum heart rate of 145. The patient experienced exercise-induced angina and had an ST depression of 2.0 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 44-year-old female with non-anginal chest pain, normal resting blood pressure (118), and slightly elevated serum cholesterol (242). She has normal fasting blood sugar levels and resting electrocardiogram results. Her maximum heart rate achieved is 149, and she does not experience exercise-induced angina. There is a slight ST depression of 0.3 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The 52-year-old female patient presents with asymptomatic chest pain. Her resting blood pressure is 130, with a serum cholesterol level of 180. She has normal resting electrocardiogram results and achieved a maximum heart rate of 140. The patient experiences exercise-induced angina and has an ST depression of 1.5 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 61-year-old male patient with asymptomatic chest pain has a resting blood pressure of 134. Their serum cholesterol level is normal. They have high fasting blood sugar levels. The resting electrocardiogram shows ST-T wave abnormality. The patient reached a maximum heart rate of 86 without experiencing exercise-induced angina. They have ST depression of 1.5 relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
