"A 43-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal electrocardiogram results, maximum heart rate of 122, no exercise-induced angina, ST depression of 1.5, and downsloping peak exercise ST segment, suggesting a possible heart disease.###\nHence this label was Yes."
"The patient is a 44-year-old male who is asymptomatic for chest pain. His resting blood pressure is 135, and serum cholesterol level is high at 491. Fasting blood sugar is normal. Resting electrocardiogram results are normal. He achieved a maximum heart rate of 135 without exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 53-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar elevation. The resting electrocardiogram results are normal, with a maximum heart rate of 106. The patient did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 34-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and cholesterol levels. The patient has fasting blood sugar levels above 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved during exercise is 154. The patient did not experience exercise-induced angina. There is a slight ST depression induced by exercise relative to rest (0.2), and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"In this example, we have a 45-year-old male patient with asymptomatic chest pain. His resting blood pressure is 130, and serum cholesterol is 219. He does not have fasting blood sugar above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 130. The patient experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 28-year-old male patient with atypical angina chest pain, resting blood pressure of 130, serum cholesterol level of 132, no fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 185 without experiencing exercise-induced angina. His ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 57-year-old male patient with atypical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 141 during exercise without experiencing angina. There was a slight ST depression of 0.3 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 58-year-old male patient with non-anginal chest pain, resting blood pressure of 150, serum cholesterol level of 219, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate of 118, experienced exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 45-year-old female patient with atypical angina presented with normal resting blood pressure (112), serum cholesterol levels of 160, and a fasting blood sugar level below 120 mg/dl. Resting electrocardiogram showed normal results, with a maximum heart rate achieved at 138. The patient did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 54-year-old male patient with non-anginal chest pain, normal fasting blood sugar levels, and probable or definite left ventricular hypertrophy in resting electrocardiogram. Resting blood pressure is 150, serum cholesterol is 232. Maximum heart rate achieved is 165 without exercise-induced angina. ST depression induced by exercise relative to rest is 1.6, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male patient with atypical angina chest pain. Resting blood pressure is 125, serum cholesterol is 220. Fasting blood sugar is normal. Resting electrocardiogram results are normal. Maximum heart rate achieved is 144. The patient does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.4. The slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar > 120 mg/dl. Resting electrocardiogram results showed to be normal. The patient experienced exercise-induced angina and had an ST depression of 2.0 relative to rest. The slope of the peak exercise ST segment was flat, and the maximum heart rate achieved was 86.###\nHence this label was Yes."
"The patient is a 60-year-old female with asymptomatic chest pain. She has a resting blood pressure of 158 and a serum cholesterol level of 305. Her resting electrocardiogram shows probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 161 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 110. The patient experienced exercise-induced angina, with an ST depression of 3.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 61-year-old male patient with typical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. Their fasting blood sugar is below 120 mg/dl, resting electrocardiogram results are normal, and they achieved a maximum heart rate of 145. The patient did not experience exercise-induced angina. They had an ST depression of 2.6 induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 40-year-old male patient with atypical angina chest pain, normal resting blood pressure (140), and slightly elevated serum cholesterol (289). Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. Maximum heart rate achieved is 172 bpm, with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male patient with non-anginal chest pain has normal resting blood pressure and cholesterol levels. The patient's resting electrocardiogram shows ST-T wave abnormality, and the maximum heart rate achieved during exercise is 140. The patient did not experience exercise-induced angina and showed no ST depression relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 44-year-old male patient with asymptomatic chest pain, resting blood pressure of 110, serum cholesterol level of 197, no fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy as per resting electrocardiogram results. The patient achieved a maximum heart rate of 177, did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 63-year-old female patient with non-anginal chest pain visited the doctor. She had a resting blood pressure of 135 and a serum cholesterol level of 252. Her resting electrocardiogram showed probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 172 and did not experience exercise-induced angina. Her ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 65-year-old male patient with asymptomatic chest pain, high blood pressure of 150, elevated serum cholesterol of 236, fasting blood sugar above 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 105, experienced exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 62-year-old female patient with asymptomatic chest pain, resting blood pressure of 140, serum cholesterol level of 268, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 160, no exercise-induced angina, ST depression of 3.6 induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with typical angina chest pain, normal resting blood pressure (140), high serum cholesterol (295), normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 136, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 47-year-old female patient with atypical angina chest pain, normal resting blood pressure of 140, serum cholesterol level of 257, no fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 135, no exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 63-year-old female patient with asymptomatic chest pain, resting blood pressure of 150, high serum cholesterol of 407, no fasting blood sugar > 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. Maximum heart rate achieved was 154 with no exercise-induced angina. ST depression induced by exercise relative to rest was 4.0, and the slope of the peak exercise ST segment was flat. This data suggests a potential risk for heart disease in the patient.###\nHence this label was Yes."
"The patient is a 67-year-old male who is asymptomatic but has probable or definite left ventricular hypertrophy. His resting blood pressure is 160, serum cholesterol level is 286, and maximum heart rate achieved is 108. He experiences exercise-induced angina, with ST depression of 1.5 relative to rest and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar above 120 mg/dl and show a normal resting electrocardiogram. The patient achieved a maximum heart rate of 115 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 35-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has no fasting blood sugar above 120 mg/dl and exhibits ST-T wave abnormality on resting electrocardiogram. Despite achieving a maximum heart rate of 153 during exercise, the patient did not experience angina. The ST segment depression induced by exercise relative to rest is -0.1, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old male patient with atypical angina chest pain, resting blood pressure of 192, and serum cholesterol of 283. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved during exercise is 195, without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 62-year-old male patient with atypical angina chest pain, resting blood pressure of 120, serum cholesterol level of 254, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 93, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 38-year-old male patient with asymptomatic chest pain has a resting blood pressure of 135 and normal resting electrocardiogram results. His fasting blood sugar is above 120 mg/dl. He achieved a maximum heart rate of 150 without any exercise-induced angina. The patient showed no ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, normal serum cholesterol levels, high fasting blood sugar (>120 mg/dl), ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 130, experiencing exercise-induced angina, with 1.1 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 45-year-old male patient with non-anginal chest pain, normal resting blood pressure of 110, and serum cholesterol level of 0. Fasting blood sugar is under 120 mg/dl. Resting electrocardiogram shows normal results. Maximum heart rate achieved is 138. The patient does not experience exercise-induced angina. ST depression induced by exercise relative to rest is -0.1. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
