"A 54-year-old male patient with typical angina chest pain, normal resting blood pressure, and serum cholesterol level. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and reached a maximum heart rate of 137 during exercise. There was no exercise-induced angina, but there was a 2.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 60-year-old male patient with non-anginal chest pain, resting blood pressure of 140, serum cholesterol of 185, no high fasting blood sugar, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. The patient achieved a maximum heart rate of 155 without experiencing exercise-induced angina. ST depression of 3.0 was observed during exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old female patient, experiencing atypical angina chest pain, with normal resting blood pressure and high serum cholesterol levels. They have normal fasting blood sugar levels and resting electrocardiogram results. The patient achieved a maximum heart rate of 155 during exercise, did not experience exercise-induced angina, and had no ST depression induced by exercise. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, fasting blood sugar > 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved of 130, exercise-induced angina present, 1.1 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 38-year-old male patient with non-anginal chest pain, normal resting blood pressure and high cholesterol levels. The patient has a normal resting electrocardiogram, a maximum heart rate of 130, and did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 47-year-old female patient with atypical angina, normal resting blood pressure (140 mmHg) and slightly elevated serum cholesterol levels (257 mg/dl). She has a normal fasting blood sugar level, a maximum heart rate of 135 bpm, and did not experience exercise-induced angina. Her ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain has a resting blood pressure of 135 and a serum cholesterol level of 204. They have fasting blood sugar over 120 mg/dl and show ST-T wave abnormality on resting electrocardiogram. The patient achieved a maximum heart rate of 126 and experienced exercise-induced angina. They have 1.1 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 42-year-old male experiencing typical angina chest pain. \nHis resting blood pressure is 148 mmHg and serum cholesterol level is 244 mg/dl. \nHe does not have fasting blood sugar > 120 mg/dl. \nResting electrocardiogram shows probable or definite left ventricular hypertrophy. \nHis maximum heart rate achieved is 178 bpm and he does not experience exercise-induced angina. \nST depression induced by exercise relative to rest is 0.8. \nThe slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 39-year-old male patient with non-anginal chest pain, normal blood sugar levels, probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 182 without exercise-induced angina. His ST depression post-exercise was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 46-year-old male patient with non-anginal chest pain, normal resting blood pressure (120), and serum cholesterol levels (230). Fasting blood sugar level is below 120 mg/dl. Resting electrocardiogram results are normal. Maximum heart rate achieved during exercise is 150, and there is no exercise-induced angina. There is no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"This is a 67-year-old male patient with asymptomatic chest pain. His resting blood pressure is 125, and serum cholesterol level is 254. He has high fasting blood sugar (>120 mg/dl) and a normal resting electrocardiogram. His maximum heart rate reached 163, and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 57-year-old male patient with atypical angina experienced normal resting blood pressure and high serum cholesterol levels. The patient had fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, and achieved a maximum heart rate of 140. There was no exercise-induced angina, and the ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain, resting blood pressure of 100, normal serum cholesterol levels, fasting blood sugar higher than 120 mg/dl. The resting electrocardiogram showed ST-T wave abnormality. His maximum heart rate achieved was 133, did not have exercise-induced angina, and showed ST depression of -2.6 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 59-year-old male patient with typical angina chest pain has a resting blood pressure of 160 and a serum cholesterol level of 273. They do not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 125 and did not experience exercise-induced angina. They exhibited no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 34-year-old female patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 190 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 45-year-old female patient with asymptomatic chest pain, normal resting blood pressure (132), slightly high serum cholesterol (297), normal fasting blood sugar levels, a normal resting electrocardiogram, a maximum heart rate of 144, no exercise-induced angina, no ST depression induced by exercise, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 52-year-old female patient with non-anginal chest pain presented normal resting blood pressure (125) and slightly elevated serum cholesterol levels (272). She had a fasting blood sugar level below 120 mg/dl and showed a normal resting electrocardiogram. Despite achieving a relatively high maximum heart rate of 139, she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 36-year-old male patient with atypical angina chest pain has normal resting blood pressure and elevated serum cholesterol levels. They have a high maximum heart rate of 160. The patient does not experience exercise-induced angina, but shows ST depression of 3.0 post-exercise. The slope of the peak exercise ST segment is flat. The fasting blood sugar level is below 120 mg/dl.###\nHence this label was Yes."
"A 67-year-old female patient with asymptomatic chest pain has normal resting blood pressure and elevated serum cholesterol. They have a normal resting electrocardiogram result and achieved a maximum heart rate of 142 without experiencing exercise-induced angina. The patient had a slight ST depression of 0.3 induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 58-year-old male with asymptomatic chest pain. \nHis resting blood pressure is 135, and serum cholesterol level is 222. \nHe does not have fasting blood sugar over 120 mg/dl. \nResting electrocardiogram results are normal. \nHis maximum heart rate achieved is 100, and he does not experience exercise-induced angina. \nThe ST depression induced by exercise relative to rest is 0.0. \nThe slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 59-year-old male patient with typical angina chest pain, high resting blood pressure (178 mmHg), elevated serum cholesterol level (270 mg/dl), no fasting blood sugar over 120 mg/dl, probable or definite left ventricular hypertrophy based on resting electrocardiogram results, achieved a maximum heart rate of 145, did not experience exercise-induced angina, showed significant ST depression of 4.2 induced by exercise relative to rest, and had a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. He has a maximum heart rate of 98 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. The fasting blood sugar level is not greater than 120 mg/dl.###\nHence this label was Yes."
"This 54-year-old male patient has atypical angina chest pain. His resting blood pressure is 108, and serum cholesterol level is 309. He has normal results in the resting electrocardiogram. The maximum heart rate achieved is 156, and there is no exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. The fasting blood sugar level is less than 120 mg/dl.###\nHence this label was No."
"The patient is a 51-year-old female with non-anginal chest pain. Her resting blood pressure is 130, and serum cholesterol is 256. She does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. Her maximum heart rate achieved is 149, and she did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.5. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 150, serum cholesterol level of 213, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 125, experiencing exercise-induced angina, with 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 43-year-old male patient with asymptomatic chest pain, resting blood pressure of 132, and serum cholesterol level of 247. The patient has fasting blood sugar higher than 120 mg/dl and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. He achieved a maximum heart rate of 143 during exercise, reported exercise-induced angina, and exhibited a slight ST depression of 0.1 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 53-year-old male patient with non-anginal chest pain, resting blood pressure of 155, serum cholesterol level of 175 mg/dl, elevated fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 160 bpm, no exercise-induced angina, 0.3 ST depression relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 36-year-old male patient showing no chest pain, with normal resting blood pressure and cholesterol levels. Fasting blood sugar is higher than 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 125. Patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain has a resting blood pressure of 136 and a serum cholesterol level of 203. His fasting blood sugar is above 120 mg/dl, but his resting electrocardiogram shows normal results. Despite experiencing exercise-induced angina, he achieved a maximum heart rate of 123. The ST depression induced by exercise relative to rest is 1.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 69-year-old male with asymptomatic chest pain. His resting blood pressure is 130 and his serum cholesterol level is 0. He has fasting blood sugar levels over 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 129 and there is no exercise-induced angina. He has 1.0 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 54-year-old male patient with non-anginal chest pain, resting blood pressure of 125, serum cholesterol of 273, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, maximum heart rate achieved at 152, no exercise-induced angina, 0.5 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 53-year-old male patient with asymptomatic chest pain and high resting blood pressure of 154. Fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient experiences exercise-induced angina and has a moderate ST depression of 1.5. Maximum heart rate achieved during exercise is 140, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 40-year-old female patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 130, no exercise-induced angina, 2.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. These factors indicate a potential risk of heart disease that should be monitored closely.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, low maximum heart rate achieved, no exercise-induced angina, moderate ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old male patient with atypical angina chest pain, resting blood pressure of 192, serum cholesterol level of 283, no fasting blood sugar > 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. The patient achieved a maximum heart rate of 195, did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and exhibited an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 56-year-old female patient with atypical angina chest pain, resting blood pressure of 140, serum cholesterol level of 294, no fasting blood sugar over 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, maximum heart rate achieved at 153, no exercise-induced angina, ST depression of 1.3 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 54-year-old male patient, asymptomatic chest pain, with resting blood pressure of 110 and serum cholesterol level of 206. Fasting blood sugar is normal. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. Patient experienced exercise-induced angina, with maximum heart rate achieved at 108. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat. These factors suggest a potential risk of heart disease in the patient.###\nHence this label was Yes."
"A 44-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, average maximum heart rate, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 42-year-old female patient with non-anginal chest pain, normal resting blood pressure of 120, serum cholesterol level of 209. She has a resting electrocardiogram showing normal results. Her maximum heart rate achieved is 173, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 57-year-old male patient with non-anginal chest pain had a resting blood pressure of 128 and serum cholesterol level of 229. Their resting electrocardiogram suggested probable or definite left ventricular hypertrophy. Despite reaching a maximum heart rate of 150 during exercise, the patient did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.4, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 65-year-old male with typical angina chest pain, resting blood pressure of 138, and serum cholesterol of 282. The fasting blood sugar level is above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The maximum heart rate achieved is 174, and there was no exercise-induced angina. The ST depression induced by exercise relative to rest is 1.4, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 56-year-old male patient with non-anginal chest pain, resting blood pressure of 170, no fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 123, experienced exercise-induced angina, and had ST depression of 2.5 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 45-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130 and a serum cholesterol level of 219. They do not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 130 and experienced exercise-induced angina. They have a ST depression of 1.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 67-year-old male patient with asymptomatic chest pain has normal resting blood pressure (120) and slightly elevated serum cholesterol (237). They have a normal resting electrocardiogram and a low maximum heart rate of 71. The patient did not experience exercise-induced angina and had a slight ST depression of 1.0 induced by exercise. The slope of the peak exercise ST segment was flat. Overall, the patient shows some potential risk factors for heart disease that may warrant further evaluation.###\nHence this label was Yes."
"A 43-year-old female patient with atypical angina chest pain, normal resting blood pressure and serum cholesterol levels. The patient has a normal resting electrocardiogram with a maximum heart rate of 165 bpm. There is no fasting blood sugar > 120 mg/dl and no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old female patient with atypical angina chest pain has a resting blood pressure of 130 and serum cholesterol level of 253. She does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. Her maximum heart rate achieved is 155, and she does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 51-year-old female who is asymptomatic for chest pain. Her resting blood pressure is 130, and serum cholesterol level is 305. She does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results show normal findings. She achieved a maximum heart rate of 142 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"This is a 67-year-old female with non-anginal chest pain. Her resting blood pressure is 152, and serum cholesterol is 277. She has normal resting electrocardiogram results and achieved a maximum heart rate of 172 during exercise. She did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 56-year-old male patient with typical angina chest pain has a resting blood pressure of 120 and a serum cholesterol level of 193. They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 162 and did not experience exercise-induced angina. They showed ST depression of 1.9 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 52-year-old male patient with no symptoms of chest pain, normal resting blood pressure, and average serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. Maximum heart rate achieved during exercise is 150 bpm, with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 44-year-old male who is asymptomatic but has probable or definite left ventricular hypertrophy based on resting electrocardiogram results. His resting blood pressure is 110, serum cholesterol is 197, and fasting blood sugar level is less than 120 mg/dl. He achieved a maximum heart rate of 177 during exercise, did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 49-year-old male patient with asymptomatic chest pain, normal resting blood pressure and slightly elevated serum cholesterol levels. He does not have fasting blood sugar over 120 mg/dl. His resting electrocardiogram results are normal and he achieved a maximum heart rate of 140 during exercise. He experienced exercise-induced angina and showed a 1.0 ST depression relative to rest. The slope of the peak exercise ST segment was flat. These factors indicate a potential risk for heart disease in this patient.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. He does not have fasting blood sugar over 120 mg/dl. His resting electrocardiogram results are normal, and he achieved a maximum heart rate of 168. He experienced exercise-induced angina but with no ST depression relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 32-year-old male patient with atypical angina chest pain, normal resting blood pressure of 125, serum cholesterol level of 254, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 155, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 54-year-old male patient with non-anginal chest pain, resting blood pressure of 150, serum cholesterol of 232, no fasting blood sugar over 120 mg/dl, showing probable or definite left ventricular hypertrophy in resting electrocardiogram results. Maximum heart rate achieved was 165 without exercise-induced angina. ST depression induced by exercise relative to rest was 1.6, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 59-year-old male patient with non-anginal chest pain has normal resting blood pressure and no serum cholesterol. The patient has fasting blood sugar above 120 mg/dl, a maximum heart rate of 175, and did not experience exercise-induced angina. There is a ST depression of 2.6 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 43-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar level, normal resting electrocardiogram results, high maximum heart rate achieved, no exercise-induced angina, slightly elevated ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 48-year-old male with asymptomatic chest pain has a resting blood pressure of 122 and a serum cholesterol level of 222. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 186 and did not experience exercise-induced angina. His ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male patient with non-anginal chest pain, resting blood pressure of 140, serum cholesterol level of 211, fasting blood sugar above 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 165 without exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 54-year-old male patient with non-anginal chest pain, normal resting blood pressure of 120, serum cholesterol level of 217, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 137, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"The patient is a 64-year-old male with non-anginal chest pain. His resting blood pressure is 125, and serum cholesterol is 309. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. His maximum heart rate achieved is 131, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.8, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 41-year-old male patient with atypical angina chest pain, normal resting blood pressure and serum cholesterol levels. Resting electrocardiogram results are normal and the patient achieved a maximum heart rate of 182. There is no fasting blood sugar > 120 mg/dl, no exercise-induced angina, and ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 56-year-old male patient with non-anginal chest pain, normal resting blood pressure, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram results were normal, with a maximum heart rate of 98. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest was -2.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 60-year-old female with typical angina chest pain. \nHer resting blood pressure is 150 and serum cholesterol level is 240. \nShe does not have fasting blood sugar > 120 mg/dl. \nResting electrocardiogram results are normal. \nHer maximum heart rate achieved is 171 and she does not experience exercise-induced angina. \nThe ST depression induced by exercise relative to rest is 0.9. \nThe slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
