"The individual has donated blood once, 4 months ago, giving a total of 250cc. They have been donating for 4 months in total.###\nHence this label was No."
"The individual donated blood once 11 months ago, giving a total of 250 c.c. They have been donating for 11 months in total.###\nHence this label was No."
"The individual donated blood once 16 months ago, giving a total of 250cc of blood. They have been donating for a total of 16 months.###\nHence this label was No."
"The individual donated blood 5 times in the past, with the most recent donation being 4 months ago. Over a period of 23 months since the first donation, they have donated a total of 1250 c.c. of blood.###\nHence this label was Yes."
"This individual has donated blood on 6 occasions, with the most recent donation occurring 4 months ago. They have donated a total of 1500 c.c. of blood over a period of 35 months since their first donation.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 14 months ago. The total amount of blood donated is 1250 cubic centimeters. This person has been donating blood for 26 months.###\nHence this label was No."
"The individual donated blood 4 times, with the most recent donation being 2 months ago. They have donated a total of 1000 c.c. of blood over a period of 16 months since their first donation.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation occurring 2 months ago. The total amount of blood donated is 1250 c.c. and they have been donating for 11 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 4 times in total, with the most recent donation being 14 months ago. The total amount of blood donated is 1000 c.c. and they have been donating for 38 months.###\nHence this label was No."
"The individual donated blood 6 times, with the last donation being 11 months ago. In total, they have donated 1500 c.c. of blood over a period of 28 months since their first donation.###\nHence this label was No."
"The individual has not donated blood in the last 23 months. They have donated blood 3 times, totaling 750 c.c. of blood. The individual has been donating blood for 39 months.###\nHence this label was No."
"The individual has donated blood very recently, only 1 month ago. They have donated a total of 14 times, with a combined amount of 3500 cubic centimeters. They have been donating for quite some time, as it has been 95 months since their first donation.###\nHence this label was No."
"The individual has donated blood 14 times, with the most recent donation being 2 months ago. Over the course of 57 months, they have donated a total of 3500 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood 2 months ago for the 2nd time, contributing a total of 500 c.c. This person has been donating for 23 months.###\nHence this label was No."
"The individual has not donated blood in 14 months. They have donated blood a total of 2 times, amounting to 500 c.c. The first donation was made 14 months ago.###\nHence this label was No."
"The individual has donated blood 16 times, with the most recent donation occurring 15 months ago. The total amount of blood donated is 4000 c.c. and they have been donating for a period of 82 months.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation taking place 2 months ago. The total amount of blood donated is 500 c.c. and they have been donating for a total of 11 months.###\nHence this label was Yes."
"The individual has donated blood once, 3 months ago, contributing a total of 250 c.c. The first donation was also 3 months ago.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250 cubic centimeters. Their last donation was 21 months ago and they have been donating for a total of 21 months.###\nHence this label was No."
"The individual donated blood 3 times, with the most recent donation being 4 months ago. Over the course of 25 months, they have donated a total of 750 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood 2 times in total, with the last donation being 21 months ago. The total amount of blood donated was 500 c.c. and the first donation was made 23 months ago.###\nHence this label was No."
"The individual donated blood 5 times in total, with the most recent donation being 10 months ago. Over the course of 38 months, they have donated a total of 1250 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood twice in the past, with the last donation being 23 months ago. They have donated a total of 500 c.c. of blood over a period of 23 months since their first donation.###\nHence this label was No."
"The individual has donated blood four times in total, with the most recent donation being 14 months ago. Over the course of 40 months, they have donated a total of 1000 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood 2 times in total, with the most recent donation being 4 months ago. Over a period of 29 months since the first donation, they contributed a total of 500 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood 2 months ago for the first time, and has donated a total of 250cc of blood in 1 donation.###\nHence this label was No."
"The individual has donated blood 12 times in total, with the most recent donation occurring 4 months ago. Over the course of 34 months since their first donation, they have donated a total of 3000 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood once 14 months ago, giving a total of 250cc of blood. This was their first donation and they have not donated since then. The goal is to predict whether they will consent to donate blood again in the future.###\nHence this label was No."
"The individual has donated blood recently, only 1 month ago, and has a total of 7 donations in their history. The total amount of blood donated is 1750 cubic centimeters. They have been donating blood for a relatively long time, 57 months since their first donation.###\nHence this label was No."
"The individual last donated blood 23 months ago, has donated blood once, totaling 250 c.c., and has been donating for 23 months.###\nHence this label was No."
"The individual donated blood 3 times in total, with the last donation being 4 months ago. They have donated a total of 750 c.c. of blood over a period of 16 months since their first donation.###\nHence this label was No."
"The individual donated blood once, which amounted to 250cc. Their last donation was 11 months ago, and they have been donating for a total of 11 months.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation being 2 months ago. In total, they have donated 1750 c.c. of blood over the course of 77 months since their first donation.###\nHence this label was No."
"This individual donated blood 4 times in total, with the most recent donation being 2 months ago. They have donated a total of 1000 c.c. of blood over a period of 16 months since their first donation.###\nHence this label was No."
"The individual donated blood 2 months ago for the 2nd time, contributing a total of 500 cubic centimeters of blood. They have been donating for a period of 11 months.###\nHence this label was Yes."
"The individual has donated blood at least four times in the past, with the most recent donation being 23 months ago. They have donated a total of 1000 c.c. of blood over a period of 87 months since their first donation.###\nHence this label was No."
"The individual has donated blood three times in total, with the most recent donation taking place 21 months ago. Over 750 c.c. of blood has been donated by this person since they started donating 38 months ago.###\nHence this label was No."
"The individual donated blood once 14 months ago, giving a total of 250 c.c. The individual has been donating blood for 14 months.###\nHence this label was No."
"The individual donated blood once 16 months ago, giving a total of 250 c.c. The first donation was also 16 months ago.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation being 4 months ago. Over the course of 34 months since their first donation, they have donated a total of 2000 cubic centimeters of blood.###\nHence this label was Yes."
"The individual has donated blood once, 14 months ago, with a total of 250 c.c. donated. They have been donating for 14 months since their first donation.###\nHence this label was No."
"This individual donated blood 5 times, with the most recent donation occurring 2 months ago. Over the course of 34 months since first donating, they have given a total of 1250 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood 9 times, with the most recent donation being 8 months ago. They have donated a total of 2250 c.c. of blood over a period of 64 months since their first donation.###\nHence this label was No."
"The individual donated blood 2 times, with the most recent donation being 4 months ago. They have donated a total of 500cc of blood over a period of 59 months since they first started donating.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation being 4 months ago. In total, they have donated 1750 c.c. of blood over a period of 58 months since their first donation.###\nHence this label was No."
"The individual donated blood once 23 months ago, giving a total of 250cc. They have been donating for 23 months since their first donation.###\nHence this label was No."
"The individual has donated blood a total of 7 times, with the most recent donation being 4 months ago. Over the course of 82 months since their first donation, they have donated a total of 1750 c.c. of blood.###\nHence this label was No."
"The individual has donated blood 5 times, with the most recent donation occurring 11 months ago. In total, they have donated 1250 cubic centimeters of blood over a period of 33 months since their first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 c.c. four months ago, and it was their first time donating.###\nHence this label was Yes."
"The individual donated blood once 9 months ago, giving a total of 250cc. Since first donating 9 months ago, they have not donated again.###\nHence this label was No."
"The individual has donated blood 6 times, with the last donation being 3 months ago. They have donated a total of 1500 c.c. of blood over a period of 21 months since their first donation.###\nHence this label was No."
"The individual donated blood 11 times, with the most recent donation being 2 months ago. In total, they have donated 2750 cubic centimeters of blood over a period of 26 months since their first donation.###\nHence this label was No."
"The individual has donated blood 12 times in total, with the most recent donation being 2 months ago. Over the course of 70 months since their first donation, they have donated a total of 3000 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood 3 times, with the most recent donation being 2 months ago. In total, they have donated 750 c.c. of blood since they started donating 4 months ago.###\nHence this label was Yes."
"This individual donated blood 7 times, with the most recent donation being 14 months ago. Overall, they have donated a total of 1750 c.c. of blood over the course of 45 months since their first donation.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation being 4 months ago. They have donated a total of 2000 c.c. of blood over the course of 21 months since they first started donating.###\nHence this label was No."
"The individual has donated blood seven times, with the most recent donation occurring 16 months ago. In total, they have donated 1750 c.c. of blood over the course of 38 months since their first donation.###\nHence this label was No."
"The individual donated blood 2 times in total, with the last donation done 16 months ago. The total amount of blood donated is 500 c.c. and this person has been donating for 16 months since the first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250cc, 4 months ago. This was the first time they donated blood.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 2 months ago. The total amount of blood donated is 1250 c.c., and they have been donating for 16 months since their first donation.###\nHence this label was No."
"The individual donated blood 11 months ago for the first time, and has donated a total of 250 c.c. of blood in one donation.###\nHence this label was No."
"The individual donated blood 3 times in total, with the most recent donation occurring 4 months ago. Over the 34 months since the first donation, they have donated a total of 750 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood once 23 months ago, giving a total of 250 c.c. Since then, they have not donated any blood and this was their first time donating.###\nHence this label was No."
"This individual has donated blood 7 times, with the most recent donation being 4 months ago. The total amount donated is 1750 cubic centimeters, and they have been donating for a period of 62 months.###\nHence this label was No."
"The individual donated blood 6 times in total, with the most recent donation being 11 months ago. Over the course of 58 months since the first donation, they donated a total of 1500 c.c. of blood.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the most recent donation being 2 months ago. They have donated a total of 1000 cubic centimeters of blood over the course of 26 months since their first donation.###\nHence this label was No."
"The individual donated blood once 16 months ago, a total of 250 c.c. Since it was their first donation, they have been donating for 16 months.###\nHence this label was No."
"The individual has donated blood 6 times, with the most recent donation being 4 months ago. In total, they have donated 1500 cubic centimeters of blood over a period of 43 months since their first donation.###\nHence this label was No."
"The individual has donated blood three times in total, with the most recent donation occurring 23 months ago. They have donated a total of 750 c.c. of blood over a period of 89 months since their first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250cc, 21 months ago. It has been 21 months since they made their first donation.###\nHence this label was No."
"The individual has donated blood 2 times in the past, with the most recent donation being 11 months ago. In total, they have donated 500 c.c. of blood over a period of 26 months since their first donation.###\nHence this label was No."
"The individual donated blood 4 times, with the most recent donation being 23 months ago. In total, they have donated 1000 c.c. of blood over the course of 45 months since their first donation.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 4 months ago. They have donated a total of 1250 cubic centimeters of blood over the course of 26 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood recently, with only 2 months since their last donation. They have a history of being a regular donor, with a total of 21 donations made over time. In total, they have donated 5250 cubic centimeters of blood. Their first donation was 52 months ago, indicating they have been donating for over 4 years consistently.###\nHence this label was Yes."
"The individual last donated blood 14 months ago, has donated blood 8 times in total (with a total of 2000 c.c. donated), and has been donating blood for 26 months.###\nHence this label was No."
"This individual has donated blood 5 times, with the most recent donation being 4 months ago. Over a period of 14 months since their first donation, they have contributed a total of 1250 c.c. of blood.###\nHence this label was Yes."
"This individual donated blood 3 times, with the most recent donation being 14 months ago. Over a period of 31 months since their first donation, they have donated a total of 750 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood once, giving a total of 250cc, just 2 months after their first donation, and it has been 2 months since their last donation.###\nHence this label was No."
"The individual donated blood once four months ago, giving a total of 250 cubic centimeters. This was their first donation, and they have not donated since then.###\nHence this label was No."
"The individual donated blood 2 times, with the last donation being 11 months ago. In total, they donated 500 c.c. of blood over a period of 38 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood twice in the past, with the most recent donation occurring 3 months ago. The total amount of blood donated is 500 cubic centimeters. The individual has been donating blood for 23 months.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation occurring 4 months ago. Over the course of 74 months, they have donated a total of 1250 c.c. of blood.###\nHence this label was No."
"The individual has donated blood 10 times, with the most recent donation being 4 months ago. Over the course of 28 months, they have donated a total of 2500 c.c. of blood.###\nHence this label was Yes."
"The individual donated blood 5 times in total, with the most recent donation being 14 months ago. They have donated a total of 1250 cubic centimeters of blood over a period of 74 months since their first donation.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the last donation occurring 7 months ago. Over the course of 35 months since their first donation, they have contributed a total of 1250 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood once 38 months ago, giving a total of 250cc. Since then, they have not donated again and it has been 38 months since their first donation.###\nHence this label was No."
"The individual donated blood 4 times in total, with the last donation being 2 months ago. They have donated a total of 1000 c.c. of blood over a period of 16 months since their first donation.###\nHence this label was No."
"The individual donated blood once 11 months ago. They donated a total of 250 c.c. of blood. This was their first donation, as they have been donating for 11 months.###\nHence this label was No."
"The individual donated blood once two months ago, giving a total of 250 cubic centimeters. This was their first donation, and they have been a donor for only two months.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 2 months ago. They have donated a total of 1250 c.c. of blood. The time since their first donation is 16 months.###\nHence this label was Yes."
"The individual last donated blood 16 months ago and has donated a total of 10 times, giving a total of 2500 cubic centimeters of blood. They have been donating blood for the past 89 months.###\nHence this label was No."
"This individual donated blood 4 times in total, with the most recent donation having occurred 2 months ago. They have donated a total of 1000 cubic centimeters of blood over a period of 16 months since their first donation.###\nHence this label was No."
"The individual has donated blood three times in the past, with the most recent donation being 16 months ago. In total, they have donated 750 cubic centimeters of blood. They have been donating blood for the past 21 months.###\nHence this label was No."
"The individual donated blood 2 times in total, with the most recent donation being 23 months ago. Over the span of 28 months since the first donation, the individual has donated a total of 500 c.c. of blood.###\nHence this label was No."
"The individual donated blood once 14 months ago, giving a total of 250cc. This was their first donation, and it has been 14 months since then.###\nHence this label was No."
"The individual has donated blood 6 times in total, with the most recent donation being 2 months ago. Over the course of 26 months since their first donation, they have donated a total of 1500 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood 2 times in the past, with the most recent donation occurring 4 months ago. The total amount of blood donated is 500 c.c. and they have been donating for a period of 46 months.###\nHence this label was No."
"The individual last donated blood 16 months ago, has donated blood 4 times in total which amounts to 1000cc, and has been donating for 33 months since the first donation.###\nHence this label was No."
"The individual has donated blood 6 times in total, with the most recent donation being 4 months ago. They have donated a total of 1500 c.c. of blood over the past 35 months since their first donation.###\nHence this label was No."
"The individual has donated blood five times, with the most recent donation occurring 11 months ago. They have donated a total of 1250 cubic centimeters of blood over the past 18 months.###\nHence this label was No."
"The individual has donated blood a total of 4 times, with the most recent donation being 4 months ago. The total amount of blood donated is 1000 cubic centimeters. They have been donating blood for 34 months.###\nHence this label was Yes."
"The individual has donated blood twice in the past, with the most recent donation being 2 months ago. Over a period of 22 months since their first donation, they have donated a total of 500 cubic centimeters of blood.###\nHence this label was No."
"This individual donated blood 3 times in the past, with the most recent donation being 11 months ago. They have donated a total of 750 cubic centimeters of blood over a period of 37 months since their first donation.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation being 2 months ago. The total amount of blood donated is 500 c.c. Their first donation was 11 months ago.###\nHence this label was No."
"The individual has donated blood four times in total. The last donation was 14 months ago, and they have been donating for a period of 22 months. The total amount of blood donated is 1000 cubic centimeters.###\nHence this label was Yes."
"The individual has donated blood 5 times in total, with the most recent donation being 3 months ago. Over the course of 26 months since their first donation, they have donated a total of 1250 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation being 2 months ago. The total amount of blood donated is 500 cubic centimeters. They have been donating blood for a total of 10 months.###\nHence this label was No."
"The individual has donated blood once in the past, approximately 21 months ago, giving a total of 250 cubic centimeters. They have been donating blood for 21 months in total.###\nHence this label was No."
"The individual donated blood 9 months ago for the 9th time, totaling 2250 c.c. of blood. They have been donating for 16 months.###\nHence this label was No."
"The individual donated blood once four months ago, giving a total of 250 cubic centimeters. This was also the first time they donated blood.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the most recent donation occurring 2 months ago. The total amount of blood donated is 1000 cubic centimeters. The individual has been donating blood for 16 months.###\nHence this label was No."
"The individual has not donated blood for 21 months since their last donation, has donated blood 2 times in total, totaling 500 c.c. of blood, and has been donating blood for 35 months since their first donation.###\nHence this label was No."
"The individual donated blood 10 times in total, with the most recent donation being 2 months ago. The total amount of blood donated is 2500 cubic centimeters. The individual has been donating blood for the past 49 months.###\nHence this label was No."
"The individual has donated blood on 11 occasions, with the most recent donation being 2 months ago. The total amount of blood donated is 2750 cubic centimeters. The individual has been donating blood for 79 months.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250 c.c., 4 months ago for the first time. They have not donated blood since then.###\nHence this label was Yes."
"The individual donated blood 2 times, with the most recent donation being 9 months ago. The total amount of blood donated is 500 c.c. and they have been donating for 11 months.###\nHence this label was No."
"The individual donated blood once, giving a total of 250cc, 4 months ago. They have been donating for 4 months.###\nHence this label was No."
"The individual has donated blood 10 times, with the last donation being 7 months ago. In total, they have donated 2500 c.c. of blood over a period of 47 months since their first donation.###\nHence this label was No."
"The individual has last donated blood 23 months ago, has donated blood a total of 5 times which amounts to 1250 c.c., and has been donating blood for 33 months since the first time.###\nHence this label was No."
"The individual has donated blood 6 times, with the most recent donation being 4 months ago. They have donated a total of 1500 c.c. of blood over the past 38 months since their first donation.###\nHence this label was Yes."
"The individual donated blood 4 times in total, with the last donation being 23 months ago. The total amount of blood donated is 1000 cubic centimeters. They have been donating blood for 53 months.###\nHence this label was No."
"The individual has donated blood 6 times in the past, with the most recent donation being 4 months ago. Overall, they have donated a total of 1500 cubic centimeters of blood. They have been donating blood for 35 months.###\nHence this label was Yes."
"The individual donated blood once four months ago, contributing 250cc in total. They have been donating for a total of four months.###\nHence this label was No."
"The individual has donated blood twice in the past, with the last donation being 9 months ago. They have donated a total of 500cc of blood over a period of 26 months since their first donation.###\nHence this label was No."
"The individual last donated blood 4 months ago and has donated a total of 4 times, amounting to 1000 cubic centimeters of blood. They have been donating blood for 46 months.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation being 11 months ago. They have donated a total of 1750 c.c. of blood over a period of 62 months since their first donation.###\nHence this label was Yes."
"The individual donated blood 7 times in the past, with the most recent donation being 2 months ago. The total amount donated is 1750 cubic centimeters over a period of 77 months since the first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250cc, and their last donation was 4 months ago. They have been donating for a total of 4 months.###\nHence this label was Yes."
