"The client is a 33-year-old single individual working in the services sector with tertiary education. They do not have any credit in default and their average yearly balance is 1268 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 451 seconds on the 6th day of May. This was the second time they were contacted during this campaign, with 350 days passing since they were last contacted from a previous campaign. The outcome of the previous marketing campaign was 'other'.###\nHence this label was No."
"The client is a 44-year-old married technician with unknown education. They do not have credit in default, but they do have a housing loan. Their average yearly balance is 1127 euros and they do not have a personal loan. The communication type used for contact is unknown. The client was last contacted on the 19th of June and the call duration was 118 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and do not have a housing loan, but they do have a personal loan. They were contacted via telephone on the 10th of July and the call lasted for 160 seconds. This was the third time they were contacted during this campaign. The client had not been previously contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 888 euros.###\nHence this label was No."
"A 38-year-old married individual working in management with a tertiary education was contacted via an unknown communication type for a marketing campaign. They do not have a housing or personal loan, and do not have credit in default. Their average yearly balance is 14352 euros. The last contact was for 8 seconds on the 6th of September, and it was the first contact in this campaign. The outcome of any previous marketing campaigns is unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, have a housing loan, but no personal loan. The average yearly balance in euros is 1176. The contact communication type is unknown. The client was last contacted on the 21st of May and the call lasted for 166 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 9th of May. The call lasted for 266 seconds, it was the first contact during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 457 euros.###\nHence this label was No."
"The client is a 31-year-old single individual working in management with a tertiary education. They do not have any credit in default and have an average yearly balance of 4319 euros. They have a housing loan but do not have a personal loan. The communication type for contact is cellular. The last contact was made on the 29th of March and lasted for 515 seconds. This is the second contact during this campaign and they were last contacted 334 days ago from a previous campaign. There were 5 contacts before this campaign, which resulted in a failure outcome.###\nHence this label was No."
"The client is a 52-year-old married individual working in management with a secondary level education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 335. The communication type for the contact was cellular. The last contact was made on the 21st of October and lasted for 411 seconds. This was the second time they were contacted during this campaign, with 182 days passing since the previous contact. The outcome of the previous marketing campaign was a failure.###\nHence this label was Yes."
"The client is a 37-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit default, housing loan, or personal loan. The average yearly balance in their account is 934 euros. They were contacted via an unknown communication type on the 9th of May and the call duration was 258 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old unemployed married individual with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance in euros is 0. The client was contacted via an unknown communication type on the 20th of June and the call lasted 158 seconds. This was the first contact made during this campaign. Previous marketing campaign outcomes are unknown.###\nHence this label was No."
"The client is a 35-year-old divorced individual working in the services sector with a secondary level of education. They do not have any credit in default and have an average yearly balance of 394 euros. They have a housing loan but no personal loan. The communication type for contacting the client is unknown. The last contact was made on the 23rd of May for 154 seconds. This was the first contact made during this campaign. There is no information on previous contacts or outcomes of past marketing campaigns.###\nHence this label was No."
"This is a record of a 47-year-old married individual working in a management role with unknown education status. They do not have credit in default and do not have a housing or personal loan. The bank contacted them via cellular communication and reached out on the 28th of January for a 65-second conversation. This was the second time they were contacted during this campaign, with no previous contact history available. The outcome of the previous marketing campaign is unknown. The individual's average yearly balance is 1128 euros.###\nHence this label was No."
"The client is a 32-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default, have a housing loan but no personal loan. The average yearly balance is 8 euros. The client was contacted via an unknown communication type on the 16th of May, with a call duration of 265 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 40-year-old married technician with tertiary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them through an unknown communication type on the 8th of May for a duration of 135 seconds. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 103 euros.###\nHence this label was No."
"The client is a 36-year-old married individual working in the services sector with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 1024 euros. The contact was made via an unknown communication type on the 18th day of June. The call lasted for 111 seconds and it was the second contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married individual working in a management position with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 25th of August and the call lasted for 115 seconds. This was the 6th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 42 euros.###\nHence this label was No."
"The client is a 31-year-old married individual working in the services sector with secondary education. They do not have any credit in default but have housing and personal loans. They were contacted via cellular communication and the last call duration was 230 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1062 euros. The last contact was made on the 6th of April.###\nHence this label was No."
"The client is a 38-year-old single individual working in administration with an unknown education level. They do not have credit in default but have a housing loan. They were contacted via cellular communication and the last call lasted for 64 seconds on the 15th day of May. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous campaign is unknown, and they do not have a personal loan. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 49-year-old divorced blue-collar worker with secondary education. They do not have any credit in default, housing loan, but have a personal loan. The client was contacted via cellular communication, with the last call lasting 1226 seconds on the 4th day of February. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not contacted before. The client's average yearly balance is 10613 euros.###\nHence this label was Yes."
"The client is a 28-year-old student who is single and has a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 118. The communication type for the campaign was cellular. The client was last contacted on the 31st of May and the call duration was 85 seconds. During this campaign, 2 contacts were made with the client. The client was last contacted 35 days ago from a previous campaign, where 5 contacts were made. The outcome of the previous marketing campaign was categorized as \"other.\"###\nHence this label was No."
"The client is a 45-year-old unemployed individual who is divorced and has a secondary level education. They do not have credit in default and have a yearly average balance of 728 euros. They have a housing loan and a personal loan. The bank contacted them via cellular communication, with the last call lasting 156 seconds on the 6th day of May. This was the second call made to the client during this campaign, with 169 days passing since they were last contacted from a previous campaign. The outcome of the previous marketing campaign for this client was a failure.###\nHence this label was No."
"The client is 39 years old and unemployed, with a single marital status and secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The average yearly balance is negative at -53 euros. The communication type during the contact is unknown. The last contact was on the 28th of May, and the call lasted 189 seconds. This is the third contact made during this campaign and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is 32 years old, works as a blue-collar worker, and is married. They have a secondary level of education and do not have any credit in default. Their average yearly balance is 169 euros. They have a housing loan but do not have a personal loan. The communication type for the marketing campaign was cellular. The last contact was made on the 14th of May, with a duration of 291 seconds. This was the second contact made to the client during this campaign. There were no previous contacts with the client from earlier campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via cellular communication and had a previous marketing campaign that resulted in failure. The client has an average yearly balance of 218 euros. The last contact was made on the 10th of August and lasted 162 seconds. This was the 1st contact during this campaign and the 4th contact overall. The previous contact from a different campaign occurred 161 days ago.###\nHence this label was No."
"The client is a 27-year-old student who is single and has an unknown level of education. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication. The last contact was on the 12th of August and lasted 126 seconds. This was the second time they were contacted during this campaign, with 524 days passing since they were last contacted from a previous campaign. The outcome of the previous marketing campaign with this client was a failure.###\nHence this label was No."
"The client is a 45-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have housing and personal loans. The client was last contacted via an unknown communication type on the 28th day of May for 47 seconds. This was the first contact made during this campaign, and there was no previous contact. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 156 euros.###\nHence this label was No."
"The client is an 80-year-old retired married individual with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication. The last contact was made on the 29th of October and lasted for 746 seconds. This was the second contact made during this campaign, following up after 86 days from the previous campaign where one contact was made. The outcome of the previous campaign was categorized as 'other'. The client's average yearly balance is 997 euros.###\nHence this label was Yes."
"The client is a 37-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 5th of June for a duration of 657 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 4321 euros.###\nHence this label was Yes."
"A 45-year-old self-employed married individual with a secondary education level was contacted via cellular communication. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is 1051 euros. The last contact was on the 4th day of August, lasting 96 seconds. This was the first contact made during this campaign, and there was no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old married individual working in an admin role with a secondary education. They do not have any credit in default and have an average yearly balance of 265 euros. They have a housing loan but no personal loan. The communication type for the last contact is unknown, which occurred on the 23rd of May and lasted 329 seconds. This was the second contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old single individual working in an administrative role with a secondary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 3rd day of June. The call duration was 722 seconds, and this was the second time they were contacted during this campaign. There is no record of previous contact with the client or the outcome of any previous marketing campaigns. The client's average yearly balance is 527 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with primary education. They do not have credit in default but have housing and personal loans. The average yearly balance is negative. The communication type used for contact was cellular, with the last call lasting 172 seconds. This client was contacted 2 times during this campaign, with 310 days passing since they were last contacted from a previous campaign. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 38-year-old married individual working in the services sector with primary education. They have credit in default and a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 17th of July, with a call duration of 169 seconds. This was the 7th contact made during this campaign. It is the first time this client has been contacted by the bank. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 34-year-old married technician with a secondary education. They do not have credit in default, housing, or personal loans. The bank contacted them via cellular communication on the 28th of August and the call lasted 183 seconds. This was the 10th contact made during this campaign and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 0 euros.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 3rd of February and the call lasted for 1776 seconds. This was the second contact made during this campaign. The client had not been contacted before for any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1308 euros.###\nHence this label was Yes."
"The client is a 22-year-old single individual working as an admin, with secondary education and no credit in default. They have an average yearly balance of 114 euros and do not have any housing or personal loans. They were contacted via cellular communication on the 30th of March and the call lasted for 517 seconds. This was the first contact made during this campaign, and there was no previous contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 36-year-old married individual working in management with a tertiary education. They do not have credit in default, do not have a housing loan or personal loan. The client was contacted via an unknown communication type on the 27th of May. The duration of the last contact was 95 seconds. This was the first contact made during this campaign. No previous contact had been made with the client. The outcome of the previous marketing campaign is unknown. The average yearly balance is in a negative value of -825 euros.###\nHence this label was No."
"The client is a 33-year-old married entrepreneur with secondary education. They do not have any credit in default but have both a housing loan and a personal loan. Their average yearly balance is negative. The last contact was made on the 27th of May, with a duration of 421 seconds. This was the third contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The communication type for this contact was unknown.###\nHence this label was No."
"The client is a 31-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have a housing loan. Their average yearly balance is 873 euros, and they do not have a personal loan. The client was contacted through an unknown communication type, with the last call lasting 145 seconds on the 23rd day of May. This was the 4th contact made during the current campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old single individual working in management with a tertiary education. They do not have any credit in default and have a housing loan. They were contacted via an unknown communication type on the 21st of May. The client's average yearly balance is 1216 euros, and they do not have a personal loan. During the current campaign, they have been contacted 3 times for a duration of 53 seconds each time. There is no record of previous contact with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old single individual working in the services sector with a secondary level education. They do not have any credit in default and their average yearly balance is 193 euros. They have a housing loan but no personal loan. The last contact was made on the 30th of May through an unknown communication type, with a duration of 288 seconds. This is the second time they have been contacted during this campaign, and they have not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 21st of July, with a call lasting 145 seconds. This was the third contact made during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 54-year-old married technician with secondary education. They do not have credit in default but have a housing loan. They have an average yearly balance of 1455 euros and do not have a personal loan. The last contact was made on the 18th of June, and it lasted for 90 seconds. This is the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, as well as the contact communication type.###\nHence this label was No."
"The client is a 39-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 13th of August for 69 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 52 euros.###\nHence this label was No."
"The client is a 48-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 425 euros and do not have a personal loan. The client was contacted via telephone on the 9th of July and the call lasted for 693 seconds. This was the second time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 36-year-old single individual working in the services sector with primary education. They do not have any credit in default, housing loan, or personal loan. Their average yearly balance is 183 euros. They were contacted via an unknown communication type on the 12th of June, with a call duration of 167 seconds. This is the 5th contact made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old unemployed single individual with secondary education. They do not have any credit in default, but they have a housing loan. Their average yearly balance is 500 euros and they do not have a personal loan. The bank contacted them via cellular communication on the 18th of May and the call lasted 184 seconds. This was the second contact made during this campaign, with the previous contact made 350 days ago during which there were also 2 contacts. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 33-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication, reaching out on the 5th of May. The call lasted 272 seconds, and this was the second time they were contacted during this campaign, with a gap of 336 days since they were last contacted from a previous campaign. The outcome of the previous marketing campaign was a failure. The client's average yearly balance is 931 euros.###\nHence this label was No."
"The client is a 43-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default and have an average yearly balance of 3 euros. They have a housing loan but no personal loan. The bank contacted them via telephone on the 13th of May, with a call duration of 26 seconds. This is the first contact during this campaign, but they were previously contacted 174 days ago, with 2 contacts made before. The outcome of the previous campaign was a failure.###\nHence this label was No."
"The client is a 39-year-old single individual working in the services sector with secondary education. They do not have any credit in default, but they have a housing loan. Their average yearly balance is 322 euros, and they do not have a personal loan. The client was last contacted via cellular communication on the 11th of May and the call lasted for 35 seconds. This was the second time they were contacted during this campaign, with the previous contact taking place 350 days ago, resulting in a failed outcome.###\nHence this label was No."
"The client is a 39-year-old married technician with secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 12th of May. The call duration was 495 seconds. This was the first contact made during this campaign. There is no information about any previous marketing campaign outcome. The client's average yearly balance is 504 euros.###\nHence this label was No."
"A married 49-year-old technician with a secondary education and no credit in default was contacted via an unknown communication type. They do not have a housing or personal loan. With an average yearly balance of 662 euros, they were last contacted on the 18th of June for 47 seconds, as part of the second contact in the current campaign. There was no previous contact or information on the outcome of a previous campaign.###\nHence this label was No."
"The client is a 25-year-old student who is single and has tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 3rd of December and the call lasted 110 seconds. This was the second time they were contacted during this campaign, with the previous contact being 183 days ago. The outcome of the previous marketing campaign was successful as the client agreed to subscribe to a term deposit.###\nHence this label was No."
"The client is a 55-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellphone on the 8th of May and had a 156-second conversation. This was the 4th time they were contacted during this campaign. There were no previous contacts with the client. The outcome of the previous campaign is unknown. The client's average yearly balance is 1569 euros.###\nHence this label was No."
"This data describes a 31-year-old single individual working in an administrative role with tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 2004. The communication type for the marketing campaign was cellular. The last contact was on the 19th of November and lasted 117 seconds. This was the first contact made during this campaign for this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married technician with tertiary education. They do not have credit in default but have housing and personal loans. They were contacted via cellular communication on the 23rd of July for 232 seconds. This was the first contact made during this campaign. There is no information on previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual working in the services sector with a secondary level of education. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 2600. The contact communication type is unknown, and the last contact was made on the 5th of June for 27 seconds. This is the second time they have been contacted during this campaign. There is no information on previous contacts or outcomes of previous marketing campaigns.###\nHence this label was No."
"The client is a 44-year-old married individual working in management with tertiary education. They do not have credit in default but have a housing loan. Their average yearly balance is 1646 euros and they do not have a personal loan. The bank contacted them via cellular communication, with the call lasting for 292 seconds. This is the 6th contact made during this campaign, with 251 days passed since the client was last contacted. There was 1 previous contact with the client resulting in a failure outcome in the marketing campaign.###\nHence this label was No."
"The client is a 33-year-old blue-collar worker who is married and has a primary level of education. They do not have any credit in default and have an average yearly balance of 494 euros. They have a housing loan but no personal loan. The communication with the client was done via cellular phone. The last contact was on the 7th of May and lasted 159 seconds. This was the first contact during this campaign, and the previous campaign outcome was a failure. The client was last contacted 346 days ago, and there were 2 contacts before this campaign.###\nHence this label was No."
"A 56-year-old married individual, working in a managerial role with a tertiary education, was contacted via cellphone. They have no credit default, a housing loan, or a personal loan. Their average yearly balance is €12,356. The last contact was made on the 26th of May, lasting 410 seconds. This was the 1st contact in the current campaign, following 5 previous contacts. The outcome of the previous campaign was 'other'.###\nHence this label was Yes."
"The client is a 57-year-old retired married individual with primary education. They do not have credit in default, housing loan, or personal loan. The contact communication type is unknown. The client was last contacted on the 25th of June and the call lasted 259 seconds. This was the second time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 52-year-old divorced technician with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in August. The client was last contacted on the 8th of the month, with a call duration of 117 seconds. This is the second time they have been contacted during this campaign. There is no record of previous contact with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 5102 euros.###\nHence this label was No."
"The client is a 39-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default and do not have housing or personal loans. They were contacted via cellular communication and the last call lasted for 201 seconds on the 18th of November. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 111 euros.###\nHence this label was No."
"The client is a 47-year-old married technician with a primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 8th of May for 51 seconds. This was the first contact during this campaign. There is no record of previous contacts or the outcome of any previous marketing campaigns. The client's average yearly balance is 1280 euros.###\nHence this label was No."
