"The client is a 33-year-old single individual working in the services sector with a tertiary education. They do not have any credit in default and have an average yearly balance of 1268 euros. They have a housing loan but no personal loan. The communication with the client was done via a cellular phone. The client was last contacted on the 6th of May and the call lasted for 451 seconds. This was the second time they were contacted during this campaign, with 1 contact made previously. The previous marketing campaign's outcome was classified as 'other'.###\nHence this label was No."
"The client is a 44-year-old married technician with unknown education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 1127 euros. The contact communication type is unknown. The last contact was on the 19th of June and lasted 118 seconds. This is the 4th contact made during this campaign for this client, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, do not have a housing loan but have a personal loan. They were contacted via telephone on the 10th of July and the call lasted for 160 seconds. This was the third contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 888 euros.###\nHence this label was No."
"The client is a 38-year-old married individual working in management with a tertiary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 14352. The last contact was made on the 6th of September, with a duration of 8 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The communication type used for contact is also unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance in euros is 1176. The communication type for the last contact is unknown, which occurred on the 21st of May and lasted for 166 seconds. This was the second contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 9th of May. The call duration was 266 seconds. This was the first contact made to the client during this campaign. The outcome of any previous marketing campaign with the client is unknown. The client's average yearly balance is 457 euros.###\nHence this label was No."
"The client is a 31-year-old single individual working in management with a tertiary education. They do not have credit in default and have an average yearly balance of 4319 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 515 seconds on the 29th of March. This was the 2nd call made during this campaign and the client was previously contacted 334 days ago as part of another campaign, where 5 contacts were made. The outcome of the previous campaign was classified as a failure.###\nHence this label was No."
"This client is a 52-year-old married individual working in management with a secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication, and their last contact duration was 411 seconds. This client was last contacted on the 21st of October and 182 days had passed since they were last contacted in a previous campaign. They have been contacted once before in the current campaign, and the outcome of the previous marketing campaign was a failure.###\nHence this label was Yes."
"The client is a 37-year-old married individual working as a blue-collar. They have a secondary level education and do not have any credit in default. Their average yearly balance is 934 euros, and they do not have a housing loan or personal loan. The contact communication type is unknown, and the last contact was made on the 9th of May, with a duration of 258 seconds. This is the second contact during this campaign, as the client was not contacted previously. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old unemployed married individual with secondary education, who does not have credit in default. They have a yearly balance of 0 euros and have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 20th of June and the call lasted 158 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaigns is unknown.###\nHence this label was No."
"The client is a 35-year-old individual working in the services sector, who is divorced. They have a secondary level of education and do not have any credit in default. Their average yearly balance is 394 euros. They have a housing loan but do not have a personal loan. The communication type used for contacting the client is unknown. The last contact was made on the 23rd day of the month of May and lasted for 154 seconds. This was the first contact performed during this campaign for this client. There was no previous contact with this client from a previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old married individual working in management with an unknown level of education. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via cellular phone, and the last call lasted for 65 seconds on the 28th of January. This was the second call made to the client during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 1128 euros.###\nHence this label was No."
"The client is a 32-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default but have a housing loan. They were contacted via an unknown communication type on the 16th day of May, and the call lasted for 265 seconds. This was the first and only contact made during this campaign. The outcome of any previous marketing campaign with the client is unknown. The client does not have a personal loan and has an average yearly balance of 8 euros.###\nHence this label was No."
"The client is a 40-year-old married technician with tertiary education. They do not have any credit in default. They have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 8th of May. The call lasted 135 seconds, and this was the second contact made to the client during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 103 euros.###\nHence this label was No."
"The client is a 36-year-old married individual working in the services sector with secondary education. They do not have credit in default and have a housing loan. Their average yearly balance is 1024 euros, and they do not have a personal loan. The client was contacted via an unknown communication type on the 18th of June. The call lasted for 111 seconds, and it was the second contact during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married individual working in a management position with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 25th of August and the call lasted for 115 seconds. This was the 6th contact made to the client during this campaign. There were no previous contacts with the client for marketing purposes. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 42 euros.###\nHence this label was No."
"The client is a 31-year-old married individual working in the services sector with secondary education. They do not have credit in default and have housing and personal loans. They were contacted via cellular communication and had a previous contact duration of 230 seconds on the 6th of April. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1062 euros.###\nHence this label was No."
"The client is a 38-year-old single individual working in an administrative role with unknown education status. They do not have credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 15th of May for a short call lasting 64 seconds. This was the second time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 49-year-old blue-collar worker who is divorced and has a secondary level of education. They do not have credit in default, do not have a housing loan but have a personal loan. The average yearly balance in euros is 10613. The communication with the client was done via cellular phone, and the last contact was on the 4th of February, with a call duration of 1226 seconds. This client was contacted only once during this campaign and has not been contacted before. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"A 28-year-old single student with tertiary education was contacted via cellular communication for a marketing campaign. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 118. The last contact was made on the 31st of May and lasted for 85 seconds. This was the 2nd contact during this campaign, with 5 contacts made in previous campaigns. The outcome of the previous marketing campaign was classified as 'other'.###\nHence this label was No."
"The client is 45 years old, unemployed, and divorced with a secondary level education. They do not have credit in default and have a yearly balance of 728 euros. They have a housing loan and a personal loan. The bank contacted them via cellular communication, with the last call lasting 156 seconds on the 6th day of May. This was the second contact made during this campaign, following up after 169 days from the previous campaign where they were contacted once. The outcome of the previous campaign was a failure.###\nHence this label was No."
"The client is a 39-year-old unemployed single individual with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The contact communication type is unknown. The client was last contacted on the 28th of May, and the call lasted for 189 seconds. This was the third contact made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is -53 euros.###\nHence this label was No."
"The client is a 32-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 14th of May. The call duration was 291 seconds, and this was the second call made to the client during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 169 euros.###\nHence this label was No."
"The client is a 33-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. The average yearly balance is 218 euros. The communication type is cellular. The last contact was on the 10th of August with a duration of 162 seconds. This is the 1st contact during this campaign, after 161 days since the client was last contacted from a previous campaign where there were 4 contacts. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"A 27-year-old student who is single was contacted via cellphone in August. They have an unknown level of education and do not have any credit in default. With an average yearly balance of 598 euros, they do not have a housing or personal loan. The previous marketing campaign with this client was a failure, with a last contact duration of 126 seconds. This is the second time they have been contacted, with 524 days passing since the last campaign.###\nHence this label was No."
"The client is a 45-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit in default and have a housing and personal loan. The client was contacted via an unknown communication type on the 28th of May. The call lasted for 47 seconds. This was the first time they were contacted during this campaign. Data regarding previous marketing campaigns for this client is unknown.###\nHence this label was No."
"The client is an 80-year-old retired married individual with primary education and no credit in default. They have an average yearly balance of 997 euros and do not have a housing or personal loan. The client was contacted via cellular communication, with the last call lasting 746 seconds on the 29th of October. This was the second contact during this campaign, with 86 days passing since the client was last contacted from a previous campaign. The outcome of the previous marketing campaign was categorized as \"other.\"###\nHence this label was Yes."
"The client is a 37-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default, a housing loan, or a personal loan. They were contacted via cellular communication on the 5th of June and the call lasted 657 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 4321 euros.###\nHence this label was Yes."
"The client is a 45-year-old self-employed individual who is married and has a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 4th of August. The call lasted for 96 seconds. This was the first time they were contacted during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1051 euros.###\nHence this label was No."
"A 29-year-old married individual working in administration with secondary education was contacted by phone for a marketing campaign by a Portuguese bank. They do not have credit in default, have a housing loan, but no personal loan. The contact communication type is unknown. The call lasted for 329 seconds and this was the 2nd time they were contacted during this campaign. The previous outcome of the marketing campaign with this client is unknown. The client had an average yearly balance of 265 euros. The call took place on the 23rd of May and it was the first contact after an unspecified number of days since the client was last contacted.###\nHence this label was No."
"The client is a 31-year-old single administrative worker with a secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The communication type used for contacting the client is unknown. The client was last contacted on the 3rd of June and the call duration was 722 seconds. This is the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 527 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default but have housing and personal loans. The average yearly balance is negative at -169 euros. The bank contacted them via cellular communication, with the last call lasting 172 seconds on the 14th of May. This was the 2nd call during this campaign and the client was previously contacted 310 days ago, with 1 contact before that. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 38-year-old married individual working in the services sector with primary education. They have credit in default and a low average yearly balance of 1 euro. They have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 169 seconds on the 17th of July. This was the 7th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, with the last call lasting 183 seconds on the 28th of August. This client has been contacted 10 times during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married individual working in a management position with a tertiary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via telephone, with the last call lasting 1776 seconds on the 3rd of February. This was the 2nd time they were contacted during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign for this client is unknown. Their average yearly balance is 1308 euros.###\nHence this label was Yes."
"The client is a 22-year-old single administrative worker with a secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 30th of March for 517 seconds. This was the first contact made during this campaign, and there was no previous campaign contact history. The outcome of the previous marketing campaign for this client is unknown. Their average yearly balance is 114 euros.###\nHence this label was Yes."
"The client is a 36-year-old married individual working in a management position with a tertiary education. They do not have any credit in default, housing loan, or personal loan. Their average yearly balance is -825 euros. They were contacted via an unknown communication type on the 27th of May, with a call duration of 95 seconds. This is their first contact during this campaign, and there is no record of previous contacts or outcomes from previous campaigns.###\nHence this label was No."
"The client is a 33-year-old married entrepreneur with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via an unknown communication type on the 27th of May. The client's average yearly balance is negative. During this campaign, they were contacted 3 times, with the last contact lasting 421 seconds. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old married individual working as a blue-collar worker with a secondary education. They do not have any credit in default but have a housing loan. Their average yearly balance is 873 euros, and they do not have a personal loan. The client was contacted via an unknown communication type on the 23rd of May. The call duration was 145 seconds, and this was the 4th contact during this campaign with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 41-year-old single individual working in a management position with a tertiary education was contacted by phone regarding a banking institution's term deposit. They do not have any credit in default and have a housing loan. They were contacted three times during this campaign, with the last contact lasting 53 seconds on the 21st day of May. The client had not been previously contacted for a campaign. The outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 1216 euros, and they do not have a personal loan. The communication type for contact is listed as unknown.###\nHence this label was No."
"A 29-year-old single individual working in the services sector, with secondary education, and no credit in default was contacted for a banking marketing campaign. They have a housing loan but no personal loan. They were contacted via an unknown communication type in May, with the call lasting 288 seconds on the last day of the month. This was the second contact made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign with this client is unknown. The individual's average yearly balance is 193 euros.###\nHence this label was No."
"A married 35-year-old blue-collar worker with primary education, no credit in default, no housing loan, and no personal loan was contacted via cellular communication. The client was last contacted on the 21st of July for 145 seconds, making it the third contact in the current campaign. This client has not been contacted before for previous campaigns, and the outcome of the last marketing campaign is unknown. The client currently has an average yearly balance of 0 euros.###\nHence this label was No."
"The client is a 54-year-old married technician with secondary education. They do not have credit in default, but they have a housing loan. They do not have a personal loan. The contact was made through an unknown communication type. The client was last contacted on the 18th of June for 90 seconds, in which 4 contacts were made during this campaign. It is unknown if the client was contacted in a previous campaign. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 39-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via a cellular phone call on the 13th of August, with a call duration of 69 seconds. This was the first contact made during this campaign, so the client was not previously contacted. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"A 48-year-old married blue-collar worker with a secondary education level, having no credit in default, a yearly average balance of 425 euros, a housing loan, and no personal loan, was contacted via telephone on the 9th of July. The call lasted for 693 seconds, and this was the second contact made during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old single individual working in the services sector with primary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 183. The client was contacted via an unknown communication type and the last call duration was 167 seconds. This is the 5th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"This data represents a 31-year-old unemployed single individual with secondary education. They do not have any credit in default and have an average yearly balance of 500 euros. They have a housing loan but no personal loan. They were contacted via cellular communication on the 18th of May and the call lasted for 184 seconds. This client has been contacted 2 times during the current campaign and 2 times in the previous campaign, with the last contact being 350 days ago. The outcome of the previous marketing campaign for this client was a failure.###\nHence this label was No."
"A 33-year-old married individual working as a blue-collar worker with secondary education was contacted via cellular communication. They have an average yearly balance of 931 euros and do not have any credit default or personal loan, but have a housing loan. The last marketing campaign they were involved in resulted in failure. They were last contacted on the 5th of May for 272 seconds, after 336 days from the previous campaign contact. In total, they have been contacted 2 times during this campaign and once before.###\nHence this label was No."
"The client is a 43-year-old married individual who works as a blue-collar worker with a secondary education. They do not have credit in default and have a housing loan. They were last contacted via telephone on the 13th of May for 26 seconds. This was the first contact made during this campaign, but they were previously contacted 2 times before. The outcome of the previous marketing campaign was a failure, and 174 days had passed since they were last contacted. The client does not have a personal loan and has an average yearly balance of 3 euros.###\nHence this label was No."
"The client is a 39-year-old single person working in the services sector with a secondary level of education. They do not have any credit in default and their average yearly balance is 322 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 11th of May, with a call duration of 35 seconds. This was the second time they were contacted during this campaign, with the previous contact being 350 days ago and resulting in failure.###\nHence this label was No."
"The client is a 39-year-old married technician with a secondary level education. They do not have any credit in default and have a yearly average balance of 504 euros. They have a housing loan but no personal loan. The last contact was made on the 12th of May for 495 seconds, and this was the first contact during this campaign. Previous marketing campaign outcome is unknown, and the communication type used is also unknown.###\nHence this label was No."
"The client is a 49-year-old married technician with a secondary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in their bank account is 662 euros. The client was contacted via an unknown communication type on the 18th of June and the call lasted for 47 seconds. This was the second contact made during this campaign, with zero previous contacts. The outcome of the previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 25-year-old student who is single and has a tertiary education. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 3rd of December. The call lasted for 110 seconds. This was the second time they were contacted during this campaign, with the previous contact being 183 days ago and resulting in a successful outcome. The client's average yearly balance is 1189 euros.###\nHence this label was No."
"The client is a 55-year-old married individual working in a blue-collar job with a secondary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via a cellular phone call on the 8th of May, with a call duration of 156 seconds. This is the 4th time they have been contacted during this campaign. The client was not previously contacted before this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1569 euros.###\nHence this label was No."
"A 31-year-old single individual working as an admin with a tertiary education was contacted via cellular communication regarding a term deposit. They have no credit in default, housing loan, or personal loan. Their average yearly balance is 2004 euros. The call duration was 117 seconds and it was the first contact made during this campaign. The client was last contacted on the 19th of November, with no previous contact history recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married technician with tertiary education. They do not have any credit in default, but they have housing and personal loans. They were contacted via cellular communication on the 23rd of July and the call lasted for 232 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual working in the services sector with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 2600 euros. The last contact was made on the 5th of June for 27 seconds. This is the second contact during this campaign. There was no previous campaign contact with the client, and the outcome of the previous marketing campaign is unknown. The communication type for contact is also unknown.###\nHence this label was No."
"A 44-year-old married individual working in management with a tertiary education was contacted via cellular communication. They have an average yearly balance of 1646 euros and currently have a housing loan. They were previously contacted 251 days ago, with a last call duration of 292 seconds. This client was previously contacted only once before, resulting in a failure outcome. During the current campaign, they have been contacted 6 times. They do not have a personal loan or credit in default.###\nHence this label was No."
"The client is a 33-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cell phone on the 7th of May, and the call lasted for 159 seconds. This was the first contact during this campaign, but they were contacted twice in a previous campaign where the outcome was a failure. The client's average yearly balance is 494 euros.###\nHence this label was No."
"The client is a 56-year-old married individual in a management job with tertiary education. They do not have any credit in default but have a housing loan. They were contacted via cellular communication on the 26th of May, with the call lasting 410 seconds. This is the 1st contact during this campaign, following 5 previous contacts. The client was last contacted 551 days ago from a previous campaign where the outcome was not successful in getting them to subscribe to a term deposit.###\nHence this label was Yes."
"The client is a 57-year-old retired individual who is married with a primary education. They do not have any credit in default, housing loan, or personal loan. The communication type during the marketing campaign was unknown. The client was last contacted on the 25th of June and the call lasted for 259 seconds. This was the second contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 37.###\nHence this label was No."
"The client is a 52-year-old divorced technician with secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 5102. The contact communication type is cellular. The last contact was on the 8th of August and lasted for 117 seconds. This was the second contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 39-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 18th of November, with a call duration of 201 seconds. This was the second time they were contacted during this campaign, and they were not previously contacted in a previous campaign. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 111 euros.###\nHence this label was No."
"A 47-year-old married technician with primary education, who does not have credit in default and does not have housing or personal loans. They were contacted via cellular communication and the call lasted 51 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. They had an average yearly balance of 1280 euros. The call took place on the 8th of May.###\nHence this label was No."
