"This individual is a 58-year-old single male, working as a skilled employee/official. He has a checking account with a balance between 0 and 200 DM, with a credit history of always paying back credits on time. The purpose of his loan is for business, with a credit amount of 15945 DM. He has savings of less than 100 DM and has been employed for less than 1 year. His installment rate is 3% of his disposable income, with no other installment plans or debts. He resides in a rental property with 4 years of residence. He has no other debtors or guarantors and no existing credits at this bank. He is responsible for providing maintenance for one person and owns a telephone registered under his name. Additionally, he is a foreign worker with an unknown property status.###\nHence this label was No."
"The individual is a 27-year-old single male with a stable job for over 7 years. He has a good credit history, with existing credits paid back on time. He is looking to borrow a relatively small amount for a radio/television purchase. He has some savings and owns a car or other property. He has been living in his current residence for 4 years and has no other major financial commitments. He is an unskilled resident with no other installment plans or debts. He has 2 existing credits at the bank and is responsible for providing maintenance for one person. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female in her twenties, working as a skilled employee or official. She has been living in her current residence for four years, has one existing credit at the bank, and no other debtors or guarantors. She has a small amount of credit history, with existing credits paid back on time. She has a steady income, but a low installment rate in relation to her disposable income. Her purpose for the credit is furniture/equipment, and she has some savings in a lower range. She does not have any other installment plans or a telephone. She is a foreign worker and has one person dependent on her for maintenance.###\nHence this label was No."
"This individual is a 23-year-old single male with a job as an unskilled resident. He has been living in his own home for 2 years and has no other debtors or guarantors. He has a good credit history with other existing credits, and his existing checking account balance is between 0 and 200 DM. His purpose for the credit is radio/television, and he has a savings account with 500 to 1000 DM. He has been employed for 1 to 4 years and has no other installment plans. He has two existing credits at this bank and one person to provide maintenance for. He has no telephone but is a foreign worker.###\nHence this label was No."
"This individual is a 26-year-old divorced or separated or married female, unemployed or unskilled non-resident, who has been living in a rented house for 1 year. She has no existing credits at the bank other than the 2 she currently holds. She has been at her current job for less than one year. She has no other debtors or guarantors, and does not have a telephone. She has no other installment plans and less than 1 person relies on her for maintenance. She has no savings but has a checking account with a balance between 0 and 200 DM. She has no credits taken but has paid back all credits duly in the past. She is looking for a car loan (new) worth 1778 DM. Her monthly installment rate is 2% of disposable income. She owns real estate and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and a credit history described as critical with other existing credits. They are seeking a loan for education purposes, with a credit amount of 936 DM. Their savings fall within the range of 500 to 1000 DM. They have been employed for at least 7 years and have a low installment rate relative to their disposable income. The individual is a 52-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years, own a car or other property, and have no other installment plans. They work as a skilled employee or official and are responsible for one dependent. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual is a 44-year-old skilled female who is divorced/separated/married, with no checking account and unknown/no savings account. She has been employed for less than a year and owns a car or other property. She has existing credits that have been paid back duly, with no other debtors/guarantors. She has one dependent and resides in her own home. Her purpose for the credit is for a radio/television, and she has no other installment plans. She has two existing credits at the bank and a low installment rate in percentage of disposable income. She has a telephone registered under her name and is a foreign worker.###\nHence this label was No."
"This individual is a 26-year-old divorced/separated/married female, employed as a skilled employee/official for 1 to less than 4 years. She has no checking account, but maintains a savings account with less than 100 DM. She has been living in her current residence for 2 years, renting a property. She has no other debtors/guarantors, no other installment plans, and does not have a telephone. She has one existing credit at the bank, and is liable to provide maintenance for one person. She has a good credit history of repaying existing credits duly. She is seeking a loan for furniture/equipment amounting to 1388, and is a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account and has a stable employment history of over 7 years. They have paid back existing credits on time and are looking to finance a radio/television purchase. The credit amount requested is 2753, with savings between 100 and 500 DM. They have no other installment plans and own their own home. The individual is a single male, 35 years old, with a co-applicant as another debtor. They have one existing credit at the bank and work as a skilled employee/official. The individual has been at their current residence for 4 years and has one person dependent on them for maintenance. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has paid back existing credits duly. They are looking to buy a used car with a credit amount of 6579. Their savings account/bonds hold less than 100 DM. Currently unemployed, they have been residing at their present location for 2 years. With no other debtors/guarantors, they have unknown/no property. A 29-year-old single male, they have an installment rate of 4% of disposable income. They have no other installment plans or existing credits at the bank. Their housing is free, and they work in a management/self-employed/highly qualified job. They are liable to provide maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account, with a credit history of always paying back existing credits on time. The purpose of the credit is for repairs, with a relatively small amount of credit being requested. They have a small amount of savings, have been employed for less than a year, and have a low installment rate. The individual is a single male, has no other debtors or guarantors, and has been residing at their current place for a year. They have no property, are of a relatively young age, and have no other installment plans. They live in a rented house, have one existing credit at the bank, and work in an unskilled residential job. They are responsible for providing maintenance for one other person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a divorced/separated/married female, aged 45, who has been employed for less than 1 year as a skilled employee/official. She has a good credit history with existing credits paid back duly till now. She has a checking account balance between 0 and 200 DM, with savings less than 100 DM. She owns real estate and has been living at the same residence for 1 year. She has no other installment plans or telephone. She has a guarantor and no other debtors/guarantors. She has one existing credit at the bank and is the sole provider for one dependent. Additionally, she does not have any foreign worker status. The purpose of her credit application is for a radio/television and the credit amount requested is 2329.###\nHence this label was Yes."
"The individual does not have a checking account and has a good credit history with existing credits paid back on time. The purpose of the credit is for a new car. They have a moderate amount of savings. The individual has been employed for 1 to 4 years and has a low installment rate. They are a single male with a guarantor, living in a rented property. They have one existing credit at the bank and work as a skilled employee. The individual is 26 years old, has been living at their current residence for 2 years, and has two people to provide maintenance for. They do not have any other installment plans, a telephone, or foreign worker status.###\nHence this label was Yes."
"The individual in this dataset is a 25-year-old single male with a stable job (1 to 4 years of employment). He has a checking account with less than 0 DM, a credit history showing critical accounts, and existing credits elsewhere. The purpose of the credit is for a radio/television. He has savings of less than 100 DM and owns real estate. With an installment rate of 4 and no other installment plans, he has 2 existing credits at this bank. He is an unskilled resident with no other debtors or guarantors, and he has been living in his current residence for 4 years. He does not have a telephone but is a foreign worker. He is responsible for providing maintenance for one person.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM balance and a good credit history with critical accounts/other credits. They are seeking a new car loan with a credit amount of 1602. They have savings of less than 100 DM and have been employed for over 7 years. Their disposable income installment rate is 4% and they are a married/widowed male. They have no other debtors/guarantors, have lived in their current residence for 3 years, and own a car or other property. At 30 years old, they have no other installment plans, own their own home, and have 2 existing credits at the bank. They are a skilled employee/official with 1 person liable for maintenance. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 41, with no checking account. She has been employed for at least 7 years in a management/self-employed/highly qualified employee/officer role. Currently renting a residence and has been living there for 2 years. The purpose of the credit (3868 DM) is for a used car. She has less than 100 DM in her savings account. She has no other debtors/guarantors, other installment plans, or existing credits at this bank. The installment rate is 4% of disposable income. She is the sole provider for one person and has a telephone registered under her name. Additionally, she is a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 30, with less than 1 year of current employment. He has a good credit history with a slight delay in payment in the past. His existing checking account balance is between 0 and 200 DM, and he has saved between 100 and 500 DM. The purpose of the credit is for a radio/television. He owns a home, has no other debtors/guarantors, and has no other significant property. He has two existing credits at this bank and his installment rate is 4% of disposable income. He has been living at his current residence for 3 years and has no other installment plans besides for stores. His job is in management or as a self-employed highly qualified employee/officer. He is responsible for providing maintenance for one person and does not have a telephone. He is also a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history with all credits at the bank paid back duly. They took a loan for a radio/television for 15 months. They have savings between 100 and 500 DM. They have been employed for at least 7 years and have a low installment rate. The person is a 34-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own a car or other property. They have one existing credit at the bank and work as an unskilled resident. The individual is responsible for providing maintenance for 2 people. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial situation with existing credits paid back on time. They are looking to purchase furniture/equipment and have a moderate credit amount. They have substantial savings and have been employed for 1 to 4 years. With no other debtors or guarantors, they have been living in their current residence for 2 years. As a single male, they have a good credit history and own a car or other property. At 28 years old, they have a steady job as a skilled employee and are responsible for one person. They have no other installment plans or telephone, but are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has had their account for 36 months. Their credit history is categorized as critical with other existing credits outside of this bank. The purpose of the credit is for furniture/equipment, with a credit amount of 5371 DM. They have savings of less than 100 DM, have been employed for 1 to 4 years, and have a 3% installment rate based on disposable income. The individual is a single male, with a guarantor for other debtors. They have been living at their current residence for 2 years and have a property agreement related to building society savings or life insurance. At 28 years old, they have no other installment plans, own their own house, and have 2 existing credits at this bank. The individual is a skilled employee/official with 1 person liable for maintenance, no telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female in their mid-twenties, who has been employed for over 7 years as a skilled employee/official. They have a stable living situation, owning their own home for the past 4 years. With a good credit history and a modest credit amount for furniture/equipment, they manage their finances responsibly with no other debts or installment plans. They have some savings and a low installment rate in relation to their disposable income. Overall, they appear to be a reliable and financially cautious individual with a positive credit risk assessment.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee, having been employed for 4 to 7 years. He lives in his own real estate property and has been at his current residence for 3 years. With a good credit history and two existing credits at the bank, he has no other installment plans and no other debtors or guarantors. He has a moderate credit amount and some savings in his account. At 29 years old, he has a low installment rate and is responsible for providing maintenance for one person. He does not have a telephone and is not a foreign worker.###\nHence this label was Yes."
"The individual is a 57-year-old male, single, who has been employed for at least 7 years. He has a good credit history with existing credits paid back on time. He has a small credit amount of 709 DM and savings of less than 100 DM. He lives in his own real estate property for 4 years and has no other debtors or guarantors. He has one existing credit at the bank and works in an unskilled resident job. He has no telephone and is a foreign worker. Overall, he appears to be a responsible and financially stable individual with a low credit risk.###\nHence this label was No."
"This individual is a 27-year-old divorced/separated/married female, working as a skilled employee/official. She has been in her current employment for less than a year and resides in her own home for the past one year. She has a good credit history of paying back existing credits duly till now and has a small credit amount of 2389 DM for the purpose of purchasing a radio/television. Her existing checking account balance is less than 0 DM, with savings of less than 100 DM. She has no other debtors or guarantors, no telephone, and no other people to provide maintenance for. She has one existing credit at the bank and her installment rate is 4% of disposable income. She has another installment plan at stores and the property she owns is a car or other type not specified. She is also a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 56-year-old divorced/separated/married female who has no checking account. She has been working in her current employment for less than 1 year and resides in her own home for the past 2 years. She has 1 existing credit at the bank and is a skilled employee/official. The purpose of her credit is for education, with a credit amount of 1538. She has savings of less than 100 DM and no other debts or guarantors. She has no other installment plans, no telephone, and is a foreign worker. Overall, she appears to be a responsible individual with a stable financial situation.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and has a credit history of paying back existing credits on time. They took a loan for a radio/television purpose, amounting to 1881 DM. Their savings account balance is less than 100 DM, and they have been employed for 1 to less than 4 years. With an installment rate of 2% of disposable income, they are a divorced/separated/married female. They have no other debtors or guarantors, have been living at their current residence for 2 years, and own a car or some other property not specified. At the age of 44, they have no other installment plans, rent their housing, hold one existing credit at this bank, work as an unskilled resident, and are responsible for one person's maintenance. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with a moderate credit amount, a long employment history, and a good credit history. They are taking a loan to buy a new car and have some savings. They are a single male with a guarantor and own their own home. With a steady job as a skilled employee, they have two existing credits and are responsible for one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual is a female who is divorced, separated, or married, with a stable job as a skilled employee/official. She has been in her current residence for 4 years and has been employed for at least 7 years. She has 1 existing credit at the bank and is the sole provider for 1 person. She owns her own home and has a telephone registered under her name. She has no other debtors/guarantors, installment plans, or savings over 100 DM. She is a foreign worker and has a good credit history of paying back credits promptly. The purpose of her credit is for a radio/television, with a credit amount of 1967 DM to be paid back in 24 months.###\nHence this label was Yes."
"The individual has no checking account and has been employed for 4 to 7 years. They are applying for a new car loan, with a credit amount of 2463. Their savings range from 100 to less than 500 DM. They have been living in their current residence for 3 years. The individual is a 27-year-old married/widowed male, with no other debtors or guarantors. They have a building society savings agreement/life insurance and own their own home. The individual has two existing credits at the bank and is a skilled employee/official. They have one dependent and a registered telephone. Additionally, they are a foreign worker with no other installment plans and a 4% installment rate.###\nHence this label was Yes."
"This individual has no checking account and an existing credit history with critical accounts or other credits. They are seeking a loan for a radio/television. With a credit amount of 2331 and no savings account, they have been employed for at least 7 years. The installment rate is low at 1%, and they are a male, single applicant with a co-applicant for debt. They have been living at their current residence for 4 years, own real estate, and are 49 years old with no other installment plans. They have one existing credit at the bank, hold a skilled job, and are responsible for providing maintenance for one person. They have a telephone registered under their name, and they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has a credit history of paying back existing credits on time, and is looking to purchase a used car. They have savings of less than 100 DM and have been employed for 1 to 4 years. The credit amount requested is 2924. They have a guarantor and have been living at their current residence for 4 years. The individual is a 63-year-old single male with a skilled job. They have one existing credit at the bank and two people for whom they provide maintenance. They own their own home, have other installment plans with a bank, and have a telephone registered in their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a good credit history with existing credits paid back on time. They are taking a loan for a new car, with a credit amount of 1820. They have savings of less than 100 DM and have been employed for 1 to 4 years. Their installment rate is 2% of disposable income. The individual is a married/widowed male, aged 30, with no other debtors or guarantors. They have been living in their current residence for 2 years and have a building society savings agreement. They have no other installment plans, own their own home, and have one existing credit at the bank. The individual is in a management or self-employed position, and is responsible for one person's maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and has been employed for 4 to less than 7 years. They have no savings account, but have existing credits elsewhere. The purpose of the credit is for a radio/television. They have a credit amount of 1347 and an installment rate of 4% of disposable income. The individual is a 27-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own their own home. Their property includes a building society savings agreement/life insurance. They have no other installment plans or debts and work as a skilled employee/official. The individual is responsible for one person. They have two existing credits at this bank, own a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with less than 0 DM in their existing checking account. They have a history of delays in paying off debts, but currently have a high credit amount for a business purpose. They hold some savings between 0-100 DM and have been employed for over 7 years. With a low installment rate, they are responsible for their own housing and have no other debts or guarantors. Being a single male, they have no other installment plans and are a skilled employee. At the age of 63, they have been residing at their current address for 4 years and have 2 existing credits at the bank. They have no one else dependent on them, own a telephone registered under their name, and are a foreign worker.###\nHence this label was No."
"The individual is a 55-year-old unemployed single male with a good credit history. He has one existing credit at the bank and is seeking a car loan of 9283 DM. He has savings of less than 100 DM and no other property. His installment rate is 1% of disposable income, and he has been living in his current residence for 2 years. He works in a management position and has no other debtors or guarantors. He has a telephone registered under his name and is a foreign worker. He has no other installment plans and is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has no checking account and an existing credit history of paying back credits on time. They are seeking a loan for business purposes, with a credit amount of 3914. Their savings account status is unknown and they have been employed for 1 to 4 years. The installment rate is 4% of disposable income. They are a divorced/separated male, with no other debtors or guarantors. They have been residing in their current residence for 2 years and own real estate. At 38 years old, they have a job as a skilled employee/official. They have one existing credit at the bank and are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a credit history of repaying existing credits on time. They are seeking a loan for a new car, with a credit amount of 1364. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a low installment rate as a percentage of disposable income and are a divorced/separated/married female. They have no other debtors or guarantors and have been living in their current residence for 4 years. They own a property and are 64 years old. They have no other installment plans, own their own home, and have one existing credit at the bank. They are a skilled employee/official, have one person they provide maintenance for, have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account, has a good credit history with existing credits paid back duly, and is looking to use a loan for a radio/television. They have savings between ... < 100 DM and have been employed for less than a year. The credit amount they are requesting is 1938. They are a divorced/separated male, have no other debtors or guarantors, and have been living at their current residence for 3 years. Their property includes a building society savings agreement/life insurance. At 32 years old, they have no other installment plans, own their own home, and have one existing credit at the bank. They work as a skilled employee/official and have one person they provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a male who is single and works as a skilled employee. He has been at his current job for less than a year. He lives in his own house and has been at his current residence for 4 years. He has no other debtors or guarantors. His existing checking account has a balance between 0 and 200 DM, and his savings account has a balance between 100 and 500 DM. His credit history shows a critical account with other credits existing outside of this bank. The purpose of his credit is for buying a radio/television. He has taken a loan of 1216 DM for a duration of 24 months with an installment rate of 4%. He has no specific property and uses the bank for other installment plans. At this bank, he has 2 existing credits and is liable for providing maintenance to 2 people. He is a foreign worker and does not have a telephone.###\nHence this label was No."
"The individual has no checking account and has a good credit history with existing credits paid back duly. They are looking to finance a new car with a credit amount of 3556. Their savings account status is unknown. They have been employed for 1 to 4 years and have a moderate installment rate. The individual is a 29-year-old single male, with no other debtors or guarantors. They have been residing in their own house for 2 years and have no specific property. They have no other installment plans, one existing credit at the bank, and work as a skilled employee or official. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with at least 200 DM, a good credit history, and a credit amount of 2251 for furniture/equipment. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. The installment rate is 1% of disposable income. The person is a female who is divorced/separated/married, with no other debtors or guarantors. They have lived in their current residence for 2 years, own a car or other property, and are 46 years old. They have no other installment plans, own their own home, have one existing credit at the bank, work as an unskilled resident, and have 1 person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for 1 to 4 years and have a single existing credit at the bank. They are looking to finance a used car with a credit amount of 11054 for a duration of 36 months. The person is a 30-year-old single male with no other debtors or guarantors. They live in their own house for 2 years and have no other installment plans. Their job status is a management/self-employed/highly qualified employee/officer. They have one dependent and own a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 44-year-old single male with a stable job and a good credit history. He has a moderate credit amount and a savings account with less than 100 DM. He has been living in his own real estate property for 4 years and has one existing credit at the bank. He has two dependents and a telephone registered under his name. Overall, he appears to be a responsible borrower with a secure financial standing.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 62, with no existing checking account. They have been employed for at least 7 years as a skilled employee/official. The purpose of the credit is for a new car, with a credit amount of 3757 and a duration of 24 months. They have savings of less than 100 DM, no other installment plans, and reside in a free housing. They have one co-applicant as a debtor/guarantor, one existing credit at the bank, and have been living at their current residence for 4 years. Their monthly installment rate is 4% of disposable income. They have one person for whom they provide maintenance. They have a telephone registered under their name and are a foreign worker. Their credit history shows a record of paying back existing credits duly till now, and they have unknown/no property.###\nHence this label was Yes."
"This individual has a stable financial standing with a checking account of less than 0 DM and savings of less than 100 DM. They have been employed for over 7 years and have paid back existing credits on time. The purpose of their credit is for a radio/television. They are a single male, aged 39, with no other installment plans and no telephone. They have a guarantor and own their residence. Their job is a skilled employee/official with one existing credit at the bank. They have been living at their current residence for 3 years and have 2 people dependent on them for maintenance. Additionally, they have a building society savings agreement or life insurance and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a critical credit history with existing credits elsewhere. They are taking out a small loan for a new car, with moderate savings. They have been employed for 1-4 years, have no other debtors or guarantors, and own their own home. The individual is a divorced/separated/married female aged 52, with no other installment plans, and no telephone. They have two existing credits at this bank and work as an unskilled resident with one dependent. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has been repaying existing credits on time. They are taking out a loan for a radio/television, with a credit amount of 1282. They have savings between 100 and 500 DM, have been employed for 1 to 4 years, and have a 4% installment rate. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 2 years, own a car or other property, and are 32 years old. They have no other installment plans, own their own home, have one existing credit at the bank, work as an unskilled resident, and are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual is a 22-year-old married/widowed male, working in an unskilled resident job. They have been living in their own house for one year and have one existing credit at the bank. They have no other debtors or guarantors and no other installment plans. Their existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. They have a good credit history with existing credits paid back duly. The purpose of the credit is for repairs, totaling 454 DM. They have had their present employment for less than a year and their present residence for 1 year. They have an installment rate of 3% of disposable income and own a building society savings agreement/life insurance property. They have no telephone and are a foreign worker. They are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has a moderate amount of money in their checking account. They have a good credit history with other institutions and are taking out a small loan for retraining. They do not have any savings. They have been employed for a few years and have a low percentage of their income going towards installments. The individual is a divorced or separated female, living in their own home. They have a moderate amount of credits at the bank and work as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Despite not being from the country, they are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history with existing credits paid back duly. They have a small amount of money in their checking and savings accounts. They have been employed for 1 to 4 years, have a low installment rate, and own a car or other property. They are a 22-year-old single male with no other debtors or guarantors. They have been residing at their current location for 2 years. They have one existing credit at the bank and work as a skilled employee or official. They have no other installment plans, own their housing, and are a foreign worker. They do not have a telephone and are responsible for providing maintenance for one person.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, a credit history of paying back existing credits on time, and is looking to finance a new car. They are borrowing 3651 DM, have savings of at least 1000 DM, and have been employed for 1 to less than 4 years. Their disposable income installment rate is 1%, and they are a single male with no other debtors or guarantors. They have been living in their current residence for 3 years and own a building society savings agreement or life insurance. At 31 years old, they have no other installment plans, own their home, and have one existing credit at this bank. They are a skilled employee/official with 2 people liable for maintenance and no telephone. As a foreign worker, they are considered a good credit risk.###\nHence this label was Yes."
"The individual has no checking account and has a credit history of delay in paying off in the past. They are looking to finance a used car with a credit amount of 8613. Their savings account/bonds are equal to or greater than 1000 DM. They have been employed for 1 to less than 4 years and have a moderate installment rate. The individual is a single male, has no other debtors/guarantors, and has been residing in their current location for 2 years. They own their own home and have no other installment plans. The individual works as a skilled employee/official and is responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit duration of 42 months. Their credit history shows critical accounts/other existing credits. The purpose of the credit is for furniture/equipment, with a credit amount of 4042. They have savings between 500 and 1000 DM, and have been employed for 1 to 4 years. The installment rate in percentage of disposable income is 4, and they are a single male. There are no other debtors/guarantors involved. They have been residing in their current residence for 4 years and own real estate. The individual is 36 years old, with no other installment plans and no housing expenses as they own their own home. They have 2 existing credits at the bank and are a skilled employee/official. They are liable for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a single male skilled employee with a stable job, owning a real estate property. He has been living in his current residence for 2 years and has one existing credit at the bank. He has a moderate credit history with existing credits paid back on time. He has no other installment plans and no telephone. He has a guarantor and no foreign worker status. His existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. He is looking to use credit for a radio or television purchase, with a credit amount of 1414 DM. He is 33 years old and has a low installment rate relative to his disposable income. Overall, he seems financially stable with a moderate credit risk.###\nHence this label was Yes."
"This individual is a 29-year-old divorced or separated or married female, unemployed or working in an unskilled non-resident position. She has no savings account and no property but owns her own house. She has one existing credit at the bank and has been living at her current residence for 2 years. She has no other debtors or guarantors and does not have a telephone. She is responsible for providing maintenance for one person. She has a checking account balance between 0 and 200 DM, has paid back all previous credits at this bank duly, and is looking to finance domestic appliances. She has taken a credit amount of 3990 DM for a duration of 36 months, with an installment rate of 3%. She has another installment plan with a bank and is a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old single male with existing credits paid back duly. They have a good credit history and have been in their current employment for 4 to 7 years. They are looking to buy a new car and need a loan of 3763 DM. They do not have any savings account but own real estate for housing. The individual has one co-applicant and no other debtors. They have been living in their current residence for 2 years and have one existing credit at the bank. Their job is categorized as unskilled-resident, and they have no other installment plans. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a good credit history, and has paid back existing credits on time. They are currently unemployed and seeking a loan of 1823 DM for the purpose of purchasing a radio/television. Their savings account has less than 100 DM and they have no other debtors or guarantors. They are a single male, 30 years old, and own their own home. They have one existing credit at the bank, work in a management position, and are responsible for providing maintenance for two people. They have no telephone but are a foreign worker.###\nHence this label was No."
"This individual is unemployed with no current checking account. They have a critical credit history with other existing credits, but not at this bank. The purpose of the credit is for a radio/television. They have a small credit amount of 1098 and savings below 100 DM. The person is a 65-year-old divorced/separated/married female with no other debtors or guarantors. They have been residing in their current home for 4 years and own a car or other property not specified. They have 2 existing credits at this bank, are unemployed and unskilled, and are liable for providing maintenance to one person. They do not have any other installment plans, own their housing, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying existing credits back duly. They are applying for a loan to purchase furniture/equipment. The amount requested is 2978 DM. They have savings between 500 and 1000 DM, have been employed for 1 to 4 years, and have a low installment rate in percentage of disposable income. The applicant is a 32-year-old single male with no other debtors or guarantors. They have been living at their current residence for 2 years and own a car or other property. They have no other installment plans, own their residence, and have one existing credit at the bank. The applicant is a skilled employee/official, liable to provide maintenance for one person, has a registered telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual has a current checking account with a balance of less than 0 DM, has been employed for less than a year, and pays all credits back on time. They are requesting credit to purchase furniture/equipment, and have savings between 500 and 1000 DM. With an installment rate of 4%, their credit amount is 3349. They are a single male, aged 30, with no other debtors or guarantors. They live in a free housing situation and have been at their current residence for 4 years. They hold a skilled job, have no other installment plans, and own no property. They have one other credit at the bank, with two people dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a 26-year-old divorced/separated/married female with a stable job tenure of 1 to less than 4 years. She has a good credit history with existing credits paid back on time. With a moderate credit amount of 1113 DM, she has savings of less than 100 DM and owns real estate. She has been living at the same residence for 4 years and has one existing credit at the bank. Additionally, she has two dependents for whom she provides maintenance. She does not have any other installment plans, and she does not have a telephone. As a foreign worker, she has a guarantor for any other debts.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account, with a credit history of critical accounts or other existing credits. They are seeking a loan for business purposes, with a credit amount of 2442 DM. Their savings are less than 100 DM, and they have been employed for at least 7 years. The installment rate for their disposable income is 4%. The individual is a 43-year-old single male, with no other debtors or guarantors. They have been residing in their current residence for 4 years and own a car or other property. They have 4 existing credits at this bank and work in a managerial or highly qualified position. They have 2 people they provide maintenance for, own a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account, has existing credits paid back on time, and has been employed for less than a year. They are married or widowed, have no savings account, and have been living at their current residence for 4 years. They are 26 years old, have no other debtors or guarantors, and have no other installment plans. They live in rented housing, have one existing credit at the bank, and work as a skilled employee. They are liable for one person's maintenance, have a telephone registered under their name, and are a foreign worker. They are looking to borrow 2445 credits for a used car, with an installment rate of 2% of disposable income.###\nHence this label was Yes."
"This individual has no checking account and an unknown savings account. They have had their present employment for at least 7 years and are seeking credit for a business purpose. They have a critical credit history with other existing credits. The credit amount requested is 7629, with an installment rate of 4%. They are male, divorced/separated, aged 46, and own a car or other property. They have no other debtors or guarantors, two existing credits at this bank, and live in their own residence for 2 years. They have a job in management/self-employment/highly qualified employee/officer. There are two people liable to provide maintenance for them. They have a bank installment plan, no telephone, and are a foreign worker.###\nHence this label was Yes."
