"The individual has no checking account and an unknown or nonexistent savings account. They have been employed for 7 years or more and have a stable income. They took a loan for a radio/television, amounting to 700 credits, with an installment rate of 4%. Being a single male, they have no other debtors or guarantors. The individual resides in a free housing arrangement and has been at the current address for 4 years. They have 2 existing credits at the bank and work as a skilled employee/official. At the age of 36, they have no other installment plans, no telephone, and are a foreign worker. Only one person is dependent on them for maintenance.###\nHence this label was Yes."
"The individual is a single male, employed for 4-7 years as a skilled employee/official. They have no other debtors or guarantors, own a car or other property, and have been living at their current residence for 1 year. They have 2 existing credits at the bank and no other installment plans. Their existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. They have been managing their existing credits well and have a good credit history. The purpose of the credit is for education, with a credit amount of 2273. They are 32 years old, with an installment rate of 3% of disposable income. They have 2 people liable for maintenance, no telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been in their current employment for 1 to less than 4 years. They took a loan for a radio/television, amounting to 1360 credits, with a duration of 15 months. Their savings are less than 100 DM and they have a building society savings agreement/life insurance as property. Being a single male, they have no other debtors/guarantors and currently own their own home. With an installment rate of 4%, they have no other installment plans and no telephone. At 31 years old, they are a skilled employee/official, with 2 existing credits at the bank and 1 person to provide maintenance for. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 23-year-old female who has been in her current employment for 1 to less than 4 years. She has a checking account with less than 0 DM, no savings account, and a history of delay in paying off debts. The purpose of her credit is for education, and the credit amount is 8471. She has been living in her current residence for 2 years and has 2 existing credits at the bank. She is a skilled employee/official, divorced/separated/married, and has no other debtors or guarantors. She has no other installment plans, rents her housing, and has a telephone registered under her name. She is also a foreign worker with one person liable for maintenance.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has had existing credits paid back on time, and has been employed for 1 to 4 years. They are looking to purchase a new car with a credit amount of 4380. Their savings range from 100 to less than 500 DM and they have no other debts or guarantors. The individual is male, single, 35 years old, and has no other installment plans. They own their own home and have been at their current residence for 4 years. They have one existing credit at the bank and work as an unskilled resident. The individual is responsible for maintaining 2 people and has a registered telephone under their name. They are also a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM, with a credit history showing critical accounts/other credits at different banks. They are looking to finance a new car with a credit amount of 3676. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. The installment rate for disposable income is 1. The individual is a 37-year-old single male with no other debtors/guarantors. They have been living in their current residence for 3 years and own real estate. They have no other installment plans and rent their housing. The individual holds 3 existing credits at their bank and works as a skilled employee/official. They are responsible for providing maintenance for 2 people and do not have a telephone. The individual is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a critical credit history with other existing credits. They are seeking a new car with a credit amount of 2080. They have savings between 500 and 1000 DM, and have been employed for 1 to 4 years. Their disposable income installment rate is 1%, and they are a married/widowed male in their mid-20s. They have no other debtors or guarantors, own their own home, and have one existing credit at a bank. They are a skilled employee/official with one dependent. They do not have any other installment plans, and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history, and has been repaying existing credits on time. They are borrowing 7882 DM for furniture/equipment. Their savings amount is less than 100 DM and they have been employed for 4 to 7 years. They have a low installment rate of 2% of disposable income. The individual is a 45-year-old single male with a guarantor. They have been living in their current residence for 4 years and their housing is free. They have no other installment plans, one existing credit at the bank, and work as a skilled employee/official. They are responsible for providing maintenance for two people. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual is a divorced or separated or married female, aged 23, working as a skilled employee or official with 1 to 4 years of employment history. They have a checking account with less than 0 DM, savings of 500 to less than 1000 DM, and own a car or another type of property not specified. They have been residing at their current residence for 4 years, have 2 existing credits at the bank, and no other debtors or guarantors. They have no other installment plans, no telephone, and are a foreign worker. Their credit history shows a critical account or other existing credits, and they are seeking a loan for furniture or equipment. The credit amount requested is 4281, with an installment rate of 1% of disposable income. They have 1 person liable for maintenance.###\nHence this label was No."
"This individual has a checking account with less than 0 DM. They have a credit history of delaying payments in the past and are seeking a loan for business purposes. The credit amount requested is 2145. They have savings of less than 100 DM and have been employed for 4 to less than 7 years. The individual has a low installment rate of 2% of disposable income and is a single male. There are no other debtors or guarantors involved. They have been living at their current residence for 1 year and own a car or another property. The individual is 24 years old with no other installment plans, and they have 2 existing credits at the bank. They hold a skilled job position and are liable to provide maintenance for one person. They have a registered telephone and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a stable employment history of at least 7 years. They have paid back existing credits on time, and currently, have a credit for purchasing a radio/television. They have moderate savings, own a car or another type of property, and live in their own residence. They are a 31-year-old single male with no other debtors or guarantors. With one existing credit, they have a manageable installment rate on their disposable income. They are a skilled employee/official with two dependents, and they have a registered telephone under their name. Additionally, they are a foreign worker with a good credit amount of 3430.###\nHence this label was Yes."
"This individual has a positive credit history with existing credits paid back on time. They have a checking account balance of less than 0 DM and savings of less than 100 DM. The person has been employed for 4-7 years and works as a skilled employee/official. They are a divorced/separated/married female, with a guarantor for other debts. The purpose of the credit is for a radio/television. The individual owns a real estate property and lives there for 1 year. They have no other installment plans, no telephone, and no dependents. At 25 years old, this person has 1 existing credit at the bank and has a foreign worker status.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has had it for over 7 years. They have a good credit history with critical accounts and other credits existing. The purpose of the credit is for a new car. The credit amount requested is 1343 DM and they have savings of less than 100 DM. They have no other installment plans or debtors/guarantors. The individual is a 46-year-old single male, employed as a skilled employee/official, owning real estate, with two existing credits at the bank. They have been residing at their current residence for 4 years and have 2 dependents. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are borrowing money to purchase furniture/equipment, with a credit amount of 3422. Their savings are below 100 DM and they have been employed for over 7 years. They have no other debtors/guarantors and have been living in their current residence for 4 years. They have a building society savings agreement/life insurance as property, are single, male, and employed as a skilled employee/official. They have one existing credit at the bank, with a low installment rate. They own their own home and have a telephone registered under their name. They are a foreign worker and have 2 people liable for maintenance.###\nHence this label was Yes."
"This individual is a 27-year-old divorced or separated or married female, working as a skilled employee or official. She has been at her current job for less than a year and owns her own home. She has a checking account with less than 0 DM, savings of less than 100 DM, and a credit history of paying back existing credits on time. She is looking to take out a new car loan of 3123 DM, with an installment rate of 4% of her disposable income. She has no other debts, no other installment plans, and no telephone. She has been living at her current residence for 1 year and is a foreign worker. She has one existing credit at the bank and one person she is financially responsible for.###\nHence this label was No."
"This individual has no checking account and a credit history of a critical account or other existing credits. They are taking a loan for a new car, with a credit amount of 1028 and savings of less than 100 DM. Currently employed for 1 to less than 4 years, they have a manageable installment rate of 4% of disposable income. The applicant is a divorced/separated/married female, living in their own home with 3 dependents. They have no other debtors or guarantors, and own real estate. A skilled employee, aged 36, with no other installment plans and no telephone. They have 2 existing credits at the bank and are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has never taken credits before, but has always paid back any credits duly. They are requesting a loan for repairs, with a credit amount of 2613. Their savings amount is less than 100 DM. They have been employed for 1 to less than 4 years and have a 4% installment rate in relation to their disposable income. The individual is a 27-year-old single male, with no other debtors or guarantors. They have resided in their current location for 2 years and own their own home. They have 2 existing credits at the bank, a skilled job, and are responsible for providing maintenance for one person. They do not have any other installment plans, own a car or another type of property not specified, and have no telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had a critical account/other credits existing in the past. They are seeking credit for business purposes, with a credit amount of 4526. Their savings are less than 100 DM, and they have been employed for 1 to 4 years. They have a moderate installment rate in percentage of disposable income. The individual is a 74-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years, own real estate, and have no other installment plans. The individual has 1 existing credit at this bank and works in a management/self-employed/highly qualified employee/officer position. They have 1 person they are liable to provide maintenance for. They have a telephone registered under their name, and they are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 28-year-old divorced/separated/married female. She has a good credit history with existing credits paid back duly till now. She has a status of existing checking account with a balance of >= 200 DM and a savings account with a balance of < 100 DM. The purpose of the credit is for a radio/television. She has been employed for 1 to < 4 years and has an installment rate of 3% of disposable income. She owns real estate for housing, has no other debtors or guarantors, and has no other installment plans. She has one existing credit at the bank, works as an unskilled resident, and is responsible for providing maintenance for one person. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual is a 25-year-old divorced or separated or married female, working as an unskilled resident. They have been employed for 1 to 4 years and have been living in their own real estate property for 2 years. They have one existing credit at the bank and have no other debtors or guarantors. They are not involved in any other installment plans and do not have a telephone. They do not have anyone else depending on them for maintenance. They are a foreign worker. Their credit history shows that they have paid back existing credits duly. They have a good credit risk based on their financial attributes and profile.###\nHence this label was Yes."
"This individual does not have a checking account and has a history of delay in paying off debts. They are taking out a loan to purchase a used car, with a credit amount of 4679. Their savings are less than 100 DM. They have been employed for 4 to 7 years and have a moderate installment rate. The person is a 35-year-old single male. They have no other debtors or guarantors and have been residing in their current home for 3 years. They own their own home and have two existing credits at the bank. The individual works as an unskilled resident and is responsible for one other person's maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a 24-month credit history of repaying existing credits on time. They are looking to borrow credit for a new car, with a credit amount of 1249. Their savings account/bonds hold less than 100 DM.\nThey have been employed for less than a year and have a low installment rate of 4% of disposable income. The individual is a 28-year-old married/widowed male.\nThey have no other debtors/guarantors and have been living in their own real estate property for 2 years. They have no other installment plans, one existing credit at the bank, and work as a skilled employee/official. They are liable to provide maintenance for one person and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for at least 7 years and have one existing credit at the bank. The credit history is considered critical, with no other credits at this bank. The purpose of the credit is for business. They live in a rented house and have been at their current residence for 4 years. With an installment rate of 4%, the credit amount is 1264. The individual is a 57-year-old single male, working as an unskilled resident, with no other debtors or guarantors. They have no other installment plans, no telephone, and are a foreign worker. They are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has no checking account and unknown or no savings account. They have been in their current employment for at least 7 years and have a good credit history of repaying existing credits on time. The purpose of their credit is for education. They live in their own real estate property for 4 years and have no other installment plans. With an installment rate of 1%, they have a low credit amount of 3832. The individual is a 64-year-old single male, working as an unskilled resident. They have one existing credit at the bank and no other debtors or guarantors. They do not have a telephone but are a foreign worker. They are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has a stable financial standing with a moderate duration in their current job. They are looking to make a relatively small credit purchase for a radio/television, which suggests they may value entertainment. The person is responsible with their finances, as they have some savings and own real estate. They are single, have no other debtors or guarantors, and do not have any other significant financial obligations. This individual is a skilled employee with a good credit history, and appears to be a reliable and self-sufficient individual.###\nHence this label was Yes."
"The individual is a married/widowed male, aged 40, with a stable job of unskilled - resident for over 7 years. He has 2 existing credits at the bank and has been living in his own real estate property for 3 years. His existing checking amount is between 0 and 200 DM, with savings of less than 100 DM. The purpose of his credit is for a radio/television, with a credit amount of 1155. He has a guarantor for other debtors/guarantors, no telephone, and no other people to provide maintenance for. Additionally, he has no foreign worker status and a low installment rate of 3% of disposable income with an installment plan through the bank.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a loan for business purposes, with a credit amount of 1950. Their savings amount is less than 100 DM. They have been employed for 4 to 7 years and have a low installment rate. The individual is a 34-year-old single male with no other debtors or guarantors. They have been residing in their current home for 1 year and own a car or other property. They have two existing credits at the bank and work as a skilled employee or official. They are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a critical credit history with other existing credits. They are looking to finance a radio/television purchase with a credit amount of 3074. Their savings account status is unknown. They have been employed for 1 to 4 years and have a low installment rate relative to their disposable income. The individual is a 33-year-old single male with no other debtors or guarantors. They have resided in their current residence for 2 years and own real estate. With no other installment plans, they have 2 existing credits at this bank. The individual is a skilled employee, responsible for providing maintenance for 2 people. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been timely repaying existing credits. They took a loan for a radio/television, with a credit amount of 2753. Their savings amount is between 100 and 500 DM. They have been employed for at least 7 years and have a low installment rate. The person is a single male, their co-applicant is responsible for other debts, and they have been living in their current residence for 4 years. They own a car or another property, are 35 years old, and have no other installment plans. They have one existing credit at the bank, work as a skilled employee/official, and are liable for one person's maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female, aged 44, with a stable job and a high income. She has been living in her current residence for 2 years and has no other debtors or guarantors. She has a good credit history with one existing credit paid back duly. She has a significant amount of credit amounting to 12579 DM for a used car purchase. She has savings of less than 100 DM and no other property. She has no other installment plans and lives in a free housing situation. She has a telephone registered under her name and is a foreign worker.###\nHence this label was No."
"This individual is a 21-year-old single male, working as an unskilled resident for 1 to 4 years. He has a good credit history with existing credits paid back on time, and currently has a building society savings agreement/life insurance as property. His existing checking account balance is less than 0 DM, with a credit duration of 12 months and a credit amount of 1289 DM for the purpose of furniture/equipment. He has savings of less than 100 DM and no other installment plans. He resides in his own house for 1 year, with no telephone and a guarantor for other debtors/guarantors. He has one existing credit at the bank, and one person dependent on him for maintenance. Additionally, he is a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and a critical credit history with other credits at a different institution. They are looking to finance furniture/equipment with a credit amount of 1402. Their savings range from 500 to less than 1000 DM and they have been employed for 4 to less than 7 years. They have a moderate installment rate and are female, divorced/separated/married. They have no other debtors or guarantors and have been residing in their current location for 4 years. They own a car or other property not specified, and are 37 years old with no other installment plans. They rent their housing and have one existing credit at this bank. They are a skilled employee/official with one dependent. They have a telephone registered in their name, and are a foreign worker.###\nHence this label was Yes."
