"This individual is a 50-year-old single male with a stable job as a skilled employee/official. He has been with his current employer for over 7 years and has no other debtors or guarantors. He lives in a residence for free and has one existing credit at the bank. His credit history shows a delay in paying off debts in the past. He is looking to borrow a credit amount of 6224 DM for education purposes, with savings of less than 100 DM. He has no other installment plans or telephone. With no specified property, he is considered to have unknown/no property. Despite having no telephone, he is open to communication as a foreign worker.###\nHence this label was No."
"This individual has no checking account and has had existing credits paid back duly till now. They are looking to purchase a radio/television and require a credit amount of 3077. Their savings account/bonds hold less than 100 DM. They have been employed for 1 to 4 years and have a 2% installment rate in percentage of disposable income. A 52-year-old single male, they have no other debtors or guarantors. They have been residing in their current home for 4 years, own a car or other property, and have no other installment plans. As a skilled employee/official, they have one existing credit at the bank. They are responsible for one person's maintenance and have a registered telephone under their name. They are also a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and an existing credit history of paying back credits on time. They are looking to finance furniture/equipment with a credit amount of 929. Their savings account status is unknown, and they have been employed for 4 to less than 7 years. The installment rate is 4% of disposable income. The individual is a single male, with no other debtors/guarantors, owning a car or other property not specified. They are 31 years old, have installment plans with stores, and own their housing. They have one existing credit at the bank and are a skilled employee/official. They are liable for 1 person and have a registered telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and unknown savings. They have a history of delays in paying off debts. The purpose of the credit is for a used car. With a credit amount of 8947 and an installment rate of 3%, the individual has been employed for 4 to 7 years. They are a single male, with no other debtors or guarantors. Living in their own house for 2 years, they have one existing credit at the bank. Aged 31, they have a management job and two dependents. They have a telephone and are a registered foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has been repaying existing credits on time, and is looking to finance a used car. They have a savings account with less than 100 DM and have been employed for 1 to less than 4 years. With an installment rate of 3% of disposable income, the individual is a single male with a guarantor. They have been living in their current residence for 4 years and own their house. At 63 years old, they have no property and use a bank for other installment plans. The individual is a skilled employee or official with 1 existing credit at the bank and 2 dependents. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and an unknown savings account status. They have been employed for at least 7 years and have a high credit amount of 13756 for a new car. With a good credit history but unknown property status, the 63-year-old single male has been residing for 4 years in a free housing arrangement. They have one existing credit at the bank, work in a high-ranking job, and can be contacted via telephone. Despite having no other debtors or guarantors, the individual is able to provide maintenance for one person and is a registered foreign worker.###\nHence this label was Yes."
"The individual is a divorced/separated male, aged 37, with a steady job as a skilled employee/official. He has been living in his own home for 2 years and has a checking account balance between 0 and 200 DM. His credit history shows critical accounts/other existing credits, and he is looking to take out a new car loan worth 3878 DM. He has savings between 100 and 500 DM and no other debts or guarantors. He has one other credit at the bank and no other installment plans. His installment rate is 4% of his disposable income, and he has a single dependent. He owns a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with other existing credits. They took a loan for a radio/television, amounting to 1740 DM, with savings of less than 100 DM. They have been employed for over 7 years and have a low installment rate of 2%. The person is a married/widowed male, with no other debtors or guarantors. They have been living in real estate for 2 years, are 30 years old, and have no other installment plans. They reside in a rented house, work as a skilled employee/official, and have one person to provide maintenance for. They do not have a telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a young married/widowed male, aged 20, who has been employed for 1 to less than 4 years as a skilled employee/official. He has no existing debtors/guarantors, no other installment plans or telephone, and does not have a savings account. He owns his own home and has been living at his current residence for 4 years. He has one existing credit at the bank and is responsible for providing maintenance for one person. He is a foreign worker with good credit history, intending to use a credit amount of 2996 for furniture/equipment.###\nHence this label was No."
"The individual in this dataset does not have a checking account and an unknown or no savings account. They have been employed for 1 to less than 4 years as a skilled employee/official. They are male, married or widowed, and own a house. The purpose of the credit is for furniture/equipment, and the credit amount is 2069. They have no other debts or guarantors, and no installment plans. They have been residing at their current residence for 1 year, are 26 years old, and have 1 person liable for maintenance. The individual has 2 existing credits at the bank, and their installment rate is 2% of disposable income. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has had a critical account or other credits at a different bank. They are taking out a loan for a radio or television, with a credit amount of 2831. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a 4% installment rate, are a female who is divorced, separated, or married, and have no other debtors. They have been living at their current residence for 2 years, own a car or other property, and are 33 years old. They have no other installment plans, own their own home, have one existing credit at a bank, are a skilled employee/official, and have one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of delaying payments in the past. They are taking out a new car loan for 24 months with a credit amount of 2538. Their savings account has less than 100 DM and they have been employed for over 7 years. They have a low monthly installment rate and are a single male. They have no other debtors or guarantors. The individual has been residing in their current home for 4 years and owns a car or other property. They are 47 years old and have no other installment plans. They have 2 existing credits at the bank and work as an unskilled resident. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual in this example does not have an existing checking account and has been paying back existing credits duly. They are looking to finance furniture/equipment with a credit amount of 1388. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. With an installment rate of 4% of disposable income, the person is a divorced/separated/married female. They have no other debtors/guarantors and have been residing at their current residence for 2 years. Their property is real estate and they are 26 years old with no other installment plans. They live in a rented house, have 1 existing credit at the bank, and are a skilled employee/official. They are liable for providing maintenance for 1 person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, no previous credit history, and has been employed for 1 to 4 years. They are looking to finance a radio/television purchase with a credit amount of 6199 DM. Their savings is less than 100 DM and they have no other debtors or guarantors. They live in a rented property, have been at their current residence for 2 years, and are a single, 28-year-old male. They have two existing credits at the bank, work as a skilled employee/official, and have one person they are financially responsible for. They do not have any other installment plans, own a building society savings agreement/life insurance, and have a registered telephone under their name. They are also a foreign worker.###\nHence this label was No."
"This individual has no existing checking account and unknown savings. They have been employed for 4 to 7 years and have a stable income. The purpose of their credit is for a radio or television. They are a single male, 36 years old, with no other debtors or guarantors. They own their own home and have multiple credits at this bank. The individual is a skilled employee, with one dependent. They do not have any other installment plans and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has no previous credits, and has always paid back debts on time. They are looking to finance a new car, seeking a credit amount of 950. Their savings are less than 100 DM, and they have been employed for at least 7 years. With a moderate 4% installment rate, the person is a 33-year-old single male with no other debtors. They have been residing in their current location for 3 years and own a car or other property. This individual has two existing credits at the bank, works as a skilled employee, and is responsible for two dependents. They rent their housing, have no other installment plans, no telephone, and are a foreign worker.###\nHence this label was No."
"This individual has a checking account with balance less than 0 DM and has a good credit history. They are taking a loan of 2359 DM for furniture/equipment, with savings between 100 and 500 DM. Currently unemployed, they have been in their current residence for 1 year. Aged 33, male, divorced/separated, they have no other debtors or guarantors. They own a house and have one existing credit at the bank. Employed as a skilled worker, they are responsible for one dependent. They do not have any other installment plans, own a telephone, are a foreign worker, and have a stable financial profile.###\nHence this label was No."
"This individual has no checking account and is unemployed. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a new car. They have savings of less than 100 DM and own real estate. Despite being unemployed, they are divorced/separated/married and are responsible for one dependent. They have one existing credit at the bank and are registered under their own name for telephone services. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has been in their current employment for 1 to less than 4 years, and pays their existing credits on time. They are looking to buy a radio/television and have savings of less than 100 DM. The credit amount they are seeking is 1835. They are a female who is divorced/separated/married, aged 25, and own their own home. They have no other debtors or guarantors, and no other installment plans. They have been residing at their current residence for 2 years and have 2 existing credits at the bank. They work as a skilled employee/official, with one person dependent on them for support. They have a telephone registered under their name, are a foreign worker, and have a good credit history.###\nHence this label was No."
"The individual has a checking account with less than 0 DM, has had existing credits repaid on time, and is looking for a loan for education. They have a credit amount of 7476 DM and savings of less than 100 DM. They have been employed for 4 to 7 years, have a moderate installment rate, are a single male, and have no other debtors or guarantors. They have been living at their current residence for 1 year, have unknown or no property, and are 50 years old. They have no other installment plans, live in free housing, have one existing credit at the bank, are in a high-ranking job, and have one person dependent on them for maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are looking to finance a used car, with a credit amount of 1236. Their savings fall within the range of 500 to 1000 DM and they have been employed for 1 to 4 years. With a low installment rate, they are a single 50-year-old male. They have no other debtors or guarantors, and have been living at their current residence for 4 years. Their property includes a building society savings agreement/life insurance. They have no other installment plans, rent their housing, and work as a skilled employee/official. They are liable for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and no previous credit history. They are looking to purchase a new car for which they need a credit amount of 5003. They have an unknown or non-existent savings account. The individual has been employed for 1 to less than 4 years and has a low installment rate as a percentage of their disposable income. Their personal status is female, divorced/separated/married. They have no other debtors or guarantors. They have been residing at their current residence for 4 years and own their own home. They have a building society savings agreement/life insurance as property. The individual is 29 years old, holds a skilled employee/official job, and has one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has less than 0 DM in their existing checking account and has a credit history of paying back existing credits on time. They are seeking a new car loan worth 1403 DM, with savings of less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate as a percentage of their disposable income. The applicant is a divorced, separated, or married female, with no other debtors or guarantors. They have been residing at their current residence for 4 years and own a car or other property. At 28 years old, they have no other installment plans, rent their housing, and hold one existing credit at their bank. The individual is a skilled employee or official, has one person dependent on them, does not have a telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 30 and working as a skilled employee/official. She has a job for less than a year and has been living in her current residence for 1 year. She owns a car or other property, with savings between 500 and 1000 DM. She has no existing credits at this bank and is the sole provider for one person. She does not have any other debtors/guarantors, installment plans, or a telephone. She is a foreign worker with no previous credits, taking a new car loan for 8358 DM with a 48-month duration and a 1% installment rate based on her disposable income.###\nHence this label was Yes."
"This individual is a 23-year-old unemployed single male with no savings account. He has been unemployed for some time and has a good credit history of paying back existing credits duly. He is looking to take out a new car loan for a credit amount of 14555 DM. He does not have any other installment plans and lives in his own house. He has one existing credit at the bank and no other debtors or guarantors. He has a telephone registered under his name and is a foreign worker. Overall, he seems to have a stable financial status despite being unemployed.###\nHence this label was No."
"This individual has a large amount of money in their existing checking account (>= 200 DM) and has a credit history of repaying previous credits on time. They are borrowing money to purchase a new car. The credit amount is 947 DM and they have less than 100 DM in savings. They have been employed for 4 to less than 7 years and their installment rate is 4% of disposable income. The individual is a 38-year-old single male. They have no other debtors or guarantors, and have been living at their current residence for 3 years. They have unknown or no property, and their only other installment plan is with the bank. They live in a free housing arrangement and have one existing credit with the bank. The individual is a skilled employee/official and has 2 people for whom they provide maintenance. They do not have a telephone and are a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old unemployed female who is divorced/separated/married. She has a good credit history with existing credits paid back duly. She is looking to finance a radio/television, with a credit amount of 3758 DM. She has some savings between 500 and 1000 DM and has been unemployed for some time. She has no other debts or guarantors and lives in a rented house. She has one existing credit at the bank, no other installment plans, and no telephone. She is a foreign worker and has been living at her current residence for 4 years. She is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female, working in an unskilled-resident job, with a monthly installment rate of 2% of disposable income. She has been living in her current residence for 4 years and has one existing credit at the bank. Her checking account balance is between 0 and 200 DM, with savings of less than 100 DM. She is seeking credit for a radio/television, with a duration of 13 months and a credit amount of 2101. She has a guarantor for other debtors/guarantors, owns her own home, and has no other installment plans. She does not have a telephone but is a foreign worker. She is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has over 200 DM in their existing checking account and has had their current employment for at least 7 years. They have a critical credit history with other existing credits, but not at this bank. The purpose of their credit is for a radio/television. They have no savings account, but have a building society savings agreement or life insurance. At 49 years old, they are single and male. They have 2 existing credits at this bank and reside in their own home. Their job is unskilled-resident. They have one person to provide maintenance for and are a foreign worker without a telephone.###\nHence this label was Yes."
"This individual has no checking account and a good credit history. They are looking to borrow money for a new car, with a credit amount of 1393. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a low installment rate, are a single male, and have a guarantor for their debts. They have been living at their current residence for 2 years and own real estate. At 31 years old, they have no other installment plans, no other debtors/guarantors, and own their own home. They have one existing credit at the bank, a skilled job, and are responsible for one person's maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a credit history showing critical accounts or other existing credits. They are seeking a new car, with a credit amount of 2171. Their savings are less than 100 DM and they have been employed for 1 to 4 years. With an installment rate of 4% of disposable income, they are a single male with no other debtors. They have been living in their current residence for 4 years and have a building society savings agreement or life insurance. At 38 years old, they have one existing credit at the bank, an unskilled-resident job, and are liable for one person's maintenance. They own their own home, have a bank installment plan, no telephone, and are not a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a stable credit history with existing credits paid back on time. They are taking a 12-month loan to purchase a used car, with a credit amount of 1413. They have savings of at least 1000 DM and have been employed for 4 to 7 years. Their disposable income installment rate is 3%, and they are a 55-year-old single male with no other debtors or guarantors. They have been living in their own home for 2 years and have a building society savings agreement. They have no other installment plans and work as a skilled employee or official. They are responsible for one dependent and do not have a telephone. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old divorced or separated or married female, working in a management or self-employed or highly qualified employee or officer position for 1 to less than 4 years. She has no other debtors or guarantors, and currently resides in a rented housing with 2 existing credits at the bank. She has a Duration in month of 24 and a Credit amount of 11560, with savings of less than 100 DM. The installment rate in percentage of disposable income is 1, and she has no other installment plans. She has been living at her present residence for 4 years, with no telephone and no other people being liable for maintenance. She is a foreign worker with a good credit history, seeking credit for a used car.###\nHence this label was No."
"This individual has no checking account and has never taken credits before or has always paid them back on time. They are borrowing 4165 credits for a business purpose. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. Their disposable income installment rate is 2%. The person is a 36-year-old single male with no other debtors or guarantors. They have been residing in their current home for 2 years, own a car or other property not specified, and have installment plans with stores. They have 2 existing credits at the bank, are a skilled employee/official, and have 2 people dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, a good credit history with existing credits outside of this bank, and wants a new car. They have saved less than 100 DM, have been employed for at least 7 years, and have a low installment rate. The person is a single male, has a guarantor, has lived in their current residence for 4 years, and has savings in a building society/life insurance. At 43 years old, they have one existing credit at this bank and work as a skilled employee/official. They have one dependent and a registered telephone. Additionally, they rent their housing and have a bank installment plan. They are also a foreign worker.###\nHence this label was No."
"This individual is a divorced/separated/married female, aged 33, who has been at her current residence for 4 years. She has a stable job as a skilled employee/official and has been employed for 1-4 years. She has 2 existing credits at the bank, a good credit history of repaying all credits duly, and no other debtors/guarantors. Her existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. She is looking to use a credit amount of 3244 for furniture/equipment, with an installment rate of 1 and a bank installment plan. She owns her own home, has a telephone registered under her name, and is a foreign worker. She is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has a good credit history with existing credits paid back duly. They have a moderate amount of credit in the range of 0 to 200 DM. The purpose of the credit is for a radio or television. They have some savings less than 100 DM and have been employed for over 7 years. Their living situation is in their own home and they have been at their current residence for 4 years. This person is a 27-year-old single male with no other debtors or guarantors. They have no other installment plans and do not have a telephone. In terms of possessions, they own a car or another type of property not specified. They have two existing credits at the bank and work in an unskilled occupation as a resident. Additionally, they are responsible for providing maintenance for one other individual. Despite not having a telephone, they are a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of credit in their checking account (< 0 DM) and has had their account for 1 to 4 years. They have a good credit history with other accounts outside of this bank. The purpose for the credit is education. The individual has savings below 100 DM and has been living at their current residence for 3 years. They have no other property and are a single male. Their income allows them to pay 4% of their disposable income towards installments. They have a steady job as a skilled employee or official. The individual has one existing credit at this bank and no other debtors or guarantors. They reside in their own home, have a telephone registered in their name, and are capable of maintaining themselves and one other person. Additionally, they have a foreign worker status.###\nHence this label was No."
"This individual has no checking account and a credit history with critical accounts or other existing credits. They are requesting a loan for a radio or television. The credit amount is 6070, with savings of less than 100 DM. They have been employed for at least 7 years and have a moderate installment rate. The individual is a 33-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own a car or other property. They have no other installment plans and no other liabilities besides providing maintenance for one person. The individual is a skilled employee with two existing credits at the bank. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old single male with a stable job, having worked at the same place for 1 to 4 years. He has good credit history, with all previous credits at his bank paid back duly. He currently has a modest amount in his savings account. His reason for taking out credit is to purchase a radio or television. He lives in his own real estate property, where he has resided for 4 years. He has one existing credit at the bank and no other debtors or guarantors. His monthly installment rate is 4% of his disposable income, and he has no other installment plans. He works as an unskilled resident, with 1 person depending on him for maintenance. He does not own a telephone but is a foreign worker in Germany.###\nHence this label was Yes."
"The individual has an existing checking account with a balance between 0 and 200 DM. They have a credit history of delayed payments in the past. The purpose of the credit is for a new car. The credit amount is 2899. They have unknown or no savings account. The individual has been employed for 7 or more years. Their installment rate is 4% of disposable income. They are a single male. There are no other debtors or guarantors. They have owned their current residence for 4 years. The individual is 43 years old. They have no other installment plans and own their housing. They have 1 existing credit at the bank. The individual is a skilled employee or official. They have 2 people liable for maintenance. They do not have a telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated male, aged 31, with a stable income for 1 to 4 years. He has a small amount in his savings account (< 100 DM) and has been residing in his own home for 2 years. He has paid back all previous credits on time and currently has one existing credit. He has a low installment rate on his disposable income and no other installment plans or debtors/guarantors. He works as an unskilled resident and is liable to provide maintenance for one person. He does not have a telephone but is a foreign worker. The purpose of his credit application is for furniture/equipment, and the amount requested is 1521 DM.###\nHence this label was Yes."
"The individual has a checking account balance of at least 200 DM and a credit history of repaying existing credits on time. They are taking a loan of 2251 for furniture/equipment, with savings of less than 100 DM. They have been employed for 1 to less than 4 years, with a low installment rate. The applicant is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 2 years and own a car or other property. At 46 years old, they have no other installment plans, own their own home, and have one existing credit at the bank. The individual has an unskilled job and one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old single male, working as a skilled employee or official, with a stable job held for 1 to 4 years. He has a checking account with less than 0 DM, savings of less than 100 DM, and owns a car or another type of property. He has paid back existing credits duly, has no other debtors or guarantors, and resides in his own home for 2 years. He is requesting credit for furniture/equipment, with a duration of 18 months and a credit amount of 2462. He has no other installment plans, no telephone, and no other people to provide maintenance for. Additionally, he is a foreign worker and has a low installment rate in percentage of disposable income.###\nHence this label was No."
"This individual has no checking account and a credit history with other existing credits, categorized as critical. They are seeking a credit for education purposes, with a duration of 48 months. The credit amount is 6110 DM, with savings below 100 DM. They have been employed for 1 to 4 years and have a low installment rate relative to their disposable income. The individual is a 31-year-old single male, with no other debtors or guarantors. They have been residing at their current residence for 3 years and have unknown or no property. Their housing is for free and they have one existing credit at the bank. The individual is a skilled employee/officer with one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a single male with a stable job and no other debtors or guarantors. He has been living in his current residence for 4 years and owns his own home. With a good credit history and existing credits paid back on time, he is seeking a business loan for a specific purpose. Despite having a modest amount in savings, he has a steady income and a responsible attitude towards managing his finances. At 39 years old, he is considered a good credit risk according to the attributes provided.###\nHence this label was Yes."
"The individual has no checking account and has been repaying existing credits on time. They are looking to finance a used car with a credit amount of 8588. They have savings between 100 and 500 DM. Their employment has been stable for over 7 years. With a moderate installment rate, they are a single, male individual with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. At 45 years old, they have no other installment plans, own their housing, and have one existing credit. Their job status is at a high level, and they are responsible for providing maintenance for one person. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset has less than 0 DM in their existing checking account and has been in their present employment for less than 1 year. They have paid back existing credits duly, are a skilled employee/official, and are female, divorced/separated/married. They are looking to purchase furniture/equipment with a credit amount of 7721. They do not have any savings account, other debtors/guarantors, or other installment plans. They own their own home and have been residing at their current residence for 2 years. They have one existing credit at the bank and one person dependent on them for maintenance. They are 30 years old, have a telephone registered under their name, and are not a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM. They have a critical credit history with other existing credits. The purpose of the credit is for a new car. The credit amount is 2241. They have savings of less than 100 DM and have been employed for less than a year. Their installment rate is 1% of disposable income. The individual is a single male, has no other debtors/guarantors, and has been living at their current residence for 3 years. They own real estate and are 48 years old with no other installment plans. They rent their housing and have 2 existing credits at the bank. The individual's occupation is unskilled-resident, with 2 people to provide maintenance for. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual is a 26-year-old divorced/separated/married female, working as a skilled employee/official. She has no existing checking account, with a credit history of consistently paying back existing credits. Her purpose for this credit is radio/television, with a credit amount of 3181. She has savings of less than 100 DM and has been employed for less than a year. Living in her own house, she has no other debtors or guarantors and no other installment plans. With a 4% installment rate, she has been residing at her current address for 4 years. She has one existing credit at this bank and is responsible for one person's maintenance. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"The individual is a 25-year-old single male, employed for less than a year as a skilled employee/official. They have no existing credits at the bank, own a car or another property, and have been living at their current residence for 3 years. Their checking account balance is less than 0 DM, with an installment rate of 2% of disposable income. They have no savings account and no other debtors/guarantors. The purpose of the credit is for business, with a credit amount of 8072. They have an unknown credit history and no other installment plans. They have 1 person to provide maintenance for, do not have a telephone, but are a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old married/widowed male, working in an unskilled-resident job for less than a year. He has a checking account with a balance between 0 and 200 DM and less than 100 DM in savings. He has no other debtors or guarantors, owns his own home, and has a building society savings agreement/life insurance as his property. He has one existing credit at the bank and has been living at his current residence for 1 year. He has no other installment plans, no telephone, and is a foreign worker. He has taken out a credit for repairs amounting to 454 DM, with an installment rate of 3% of his disposable income. He has paid back all existing credits duly till now and is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has a credit history of repaying existing credits on time. They took a loan for a radio/television, amounting to 709 DM. Their savings account contains less than 100 DM and they have been employed for at least 7 years. The installment rate for the loan is 4% of their disposable income. They are a 57-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and own real estate. They have one other credit at the bank and work as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a 34-year-old unemployed divorced/separated/married female with one dependent. She has a checking account with a balance between 0 and 200 DM, savings under 100 DM, and a credit history of delayed payments. The purpose of the credit is for furniture/equipment. She has been residing in her own home for 2 years and has a building society savings agreement/life insurance. With a credit amount of 2064 DM and an installment rate of 3%, she has no other debts or guarantors. She holds a management/self-employed/highly qualified employee/officer position and has a registered telephone. Additionally, she is a foreign worker.###\nHence this label was No."
"The individual is a 32-year-old female, divorced/separated/married, with 1 child to provide for. She has been employed for 1-4 years in a managerial/self-employed/highly qualified role. She owns a home and has been living at the same residence for 2 years. She has 1 existing credit at the bank and a credit amount of 18424 DM. She has no other debtors/guarantors and has a savings account with less than 100 DM. She has no other installment plans but has a building society savings agreement/life insurance. She has a telephone registered under her name and is not a foreign worker. She has a good credit history, having paid back all credits duly. Her purpose for the credit is categorized as others.###\nHence this label was No."
"This individual is a 29-year-old single male with a short employment history. They have a small amount of credit for furniture/equipment, with a moderate monthly installment rate. They have no savings but own their own home. They have one existing credit and no other debtors. They have been residing at their current residence for 2 years and have a job as an unskilled resident. They have no telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old divorced/separated/married female, working as a skilled employee/official for at least 7 years. She has a stable income, with a low installment rate relative to her disposable income. She has no other debtors or guarantors and has been living in a rented house for 4 years. She holds a building society savings agreement/life insurance and has no other installment plans. She has a good credit history, with existing credits paid back duly till now. She has < 0 DM in her existing checking account and < 100 DM in savings. She took a credit amount of 652 for furniture/equipment. She has 1 existing credit at this bank and is the sole provider for 1 person. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual has no existing checking account and has been employed for 4 to 7 years. They are applying for a car loan amounting to 3850 with a duration of 18 months. Their credit history is categorized as critical with other existing credits. They have savings less than 100 DM and own their own house. The individual is a 27-year-old single male, with no other debtors or guarantors. They have two existing credits at their current bank and work as a skilled employee or official. They have no other installment plans or telephone. They have been residing in their current residence for 1 year and have 1 person dependent on them for maintenance. They are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a steady job as a skilled employee. He has been living for four years in a residence he obtained for free. He has one existing credit at the bank, which he has been repaying diligently. He has no other debts or guarantors and no other installment plans. He does not have a telephone but is a foreign worker. At the age of 42, he has managed to save less than 100 DM and has a checking account with a balance between 0 and 200 DM. He is seeking a loan of 6288 DM for education purposes, with an installment rate of 4% of his disposable income.###\nHence this label was No."
"The individual does not have an existing checking account and has been in their current job for 1 to less than 4 years. They took a loan for a new car, with a credit amount of 7228. They have savings of less than 100 DM and have no other installment plans. The person is a 39-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own their own home. The individual has 2 existing credits at this bank, works as an unskilled resident, and is responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with balance less than 0 DM and has a credit history of paying back existing credits on time. They are taking a loan for a radio/television, with a credit amount of 6758. They have savings less than 100 DM and have been employed for 1 to 4 years. Their monthly installment rate is 3% of disposable income. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 2 years and their property includes a car or other assets not specified. The individual is 31 years old, with no other installment plans and owns their own home. They have one existing credit at the bank, and are a skilled employee/official. They are liable for providing maintenance to one person, have a registered telephone under their name, and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and an unknown savings account. They have been employed for at least 7 years and have one existing credit at the bank. They took a loan for a new car, with a credit amount of 5045 and a duration of 15 months. Their credit history is categorized as critical with other existing credits. They are a 59-year-old divorced, separated, or married female. They have no other debtors or guarantors and no other installment plans. They have been residing in their own home for 4 years and have a skilled job. They have no one else to provide maintenance for and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual, a divorced/separated/married female in her late 20s, has no checking account but a savings account with less than 100 DM. She has been employed for 1 to 4 years as a skilled employee/official, and owns a car or other property. She has two existing credits at the bank, pays a low installment rate, and has one person she is financially responsible for. She took out a small credit amount for a radio/television, and lives in her own home. She has no other debts, installment plans, or guarantors. She has had the same residence for 1 year, has a telephone registered under her name, and is considered a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been repaying existing credits on time. They are seeking a loan for a radio/television. The credit amount requested is 776 and savings are less than 100 DM. They have been employed for 1 to 4 years and have a moderate installment rate. The individual is a married/widowed male, owns real estate, and is 28 years old. They have no other debtors/guarantors, other installment plans, or telephone. The individual has one existing credit at the bank, a skilled job, and is responsible for one person’s maintenance. They have been living in their current residence for 2 years and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been repaying existing credits on time, have been employed for 1 to 4 years, and have a stable income. The purpose of their loan is to buy a new car. They are a single male, age 68, with no other debtors or guarantors. They have been living in their current residence for 4 years and have a good credit history. They have 2 existing credits at the bank and work as a skilled employee. They have no other installment plans, live in a rented house, and have no telephone. They are responsible for providing maintenance for one person and are a foreign worker.###\nHence this label was No."
"This individual does not have a checking account and has a stable employment history of 7 years or more. They have no savings, unknown property, and no other installment plans. The purpose of the credit is for business, and the credit history is considered critical with other existing credits. They are a 57-year-old single male, with no other debtors or guarantors. They live in a rented house with one dependent. The individual holds a job as an unskilled resident and does not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female in her early forties, with no existing checking account but a stable job held for at least seven years. She is looking to finance a used car, currently renting a home and has been at her current residence for two years. With a good credit history, she has a modest amount of savings and is responsible for one dependent. Additionally, she has two existing credits at the bank, no other installment plans, and a manageable financial situation with an installment rate of 4%. She owns a car or other property and has a registered telephone line under her name. Finally, she is a foreign worker, indicating a level of international mobility and adaptability.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for at least 7 years as a skilled employee or official. Their credit history is critical with other existing credits. The purpose of the credit is for a radio/television. They have no other debtors or guarantors, and they own real estate. The individual is a 47-year-old single male with a telephone registered under their name. They have one existing credit at this bank and one person they are liable to provide maintenance for. They are a foreign worker and have been living in their current residence for 1 year.###\nHence this label was Yes."
"This individual is a 21-year-old female, divorced/separated/married, with no checking or savings account. She has been employed for less than a year as a skilled employee/official. Currently, she is living in a rented house with 2 years of residence. She has one existing credit, with no other debts or guarantors. The purpose of the credit is for a radio/television, with a credit amount of 1126. She has a low installment rate and no other installment plans. She has a telephone registered under her name and is a foreign worker. Overall, she has a good credit history of paying back existing credits duly.###\nHence this label was Yes."
"This individual has no checking account and is seeking a loan for a new car. They have a credit history of critical account/other credits existing, with a credit amount of 10127. Their savings account holds between 500 and less than 1000 DM. They have been employed for 1 to less than 4 years and have a moderate installment rate. The individual is a 44-year-old single male with no other debtors or guarantors. They have been living at their current residence for 2 years and have unknown/no property. Their other installment plans are with a bank, and they live in a free housing situation. The individual is a skilled employee/official with one existing credit at this bank. They are responsible for one person’s maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a 21-year-old single male with less than 0 DM in their existing checking account. They have been in their current employment for 1 to less than 4 years as an unskilled resident. The purpose of their credit is for furniture/equipment, with a credit amount of 1289 DM. They have a savings account with less than 100 DM, and own a building society savings agreement/life insurance property. The individual has one existing credit at the bank and no other installment plans. They have a guarantor and no telephone. As a foreign worker, they have been living in their current residence for 1 year and are the sole provider for maintenance.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM balance, a good credit history, and has been repaying existing credits on time. They are looking to finance a radio/television. Their credit amount is 1936, and they have no savings. They have been employed for 4 to less than 7 years, with a low installment rate. The individual is a married/widowed male, with no other debtors or guarantors. They have been living at their current residence for 4 years, own a car or another property not specified, and are 23 years old. They have no other installment plans, rent their housing, and have two existing credits at the bank. The individual has an unskilled-resident job, is responsible for one person's maintenance, does not have a telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account with less than 0 DM. They have a good credit history of paying back all credits duly. The purpose of the credit is for furniture/equipment. With a credit amount of 7119, they have savings of less than 100 DM. Present employment is in the range of 1 to 4 years, and the installment rate is 3% of disposable income. Personal status is a single male, with no other debtors/guarantors. They have been residing at their current residence for 4 years and have unknown/no property. At the age of 53, they have no other installment plans, reside in a free housing situation, and have 2 existing credits at the bank. The individual is a skilled employee/official, with 2 people liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a divorced or separated or married female, aged 21, with no existing checking account. They have been employed for 4 to 7 years as a skilled employee or official. The purpose of the credit is for a radio/television and the credit amount is 10144. Their savings range from 100 to less than 500 DM. They have no other debtors or guarantors and no other installment plans. They reside in their own real estate, have been at their current residence for 4 years, and have a telephone registered under their name. They have one existing credit at the bank, pay back their existing credits duly, and have a 2% installment rate in percentage of disposable income. Additionally, they have 1 person liable to provide maintenance for, and they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an existing credit history of paying back credits on time. They are looking to purchase a new car, requiring a credit amount of 1283. They have no savings account and have been employed for 4-7 years. With a manageable installment rate, they are a divorced/separated/married female in their mid-twenties. They have no other debtors or guarantors, currently reside in a rented property, and have one existing credit at the bank. As a skilled employee, they have no other installment plans and no telephone. Overall, they seem financially stable and responsible, with a good credit risk profile.###\nHence this label was Yes."
"The individual has a stable financial status with a moderate amount in their existing checking account and a small amount in savings. They have a good credit history and have been diligent in repaying existing credits. The purpose of the credit is for a radio/television. The individual has been employed for 4-7 years and has a steady income. They have no other debtors or guarantors and live in a rental property. The individual is a single, 24-year-old male with no other installment plans and no telephone. They have one existing credit at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a loan for a radio/television, with a credit amount of 4594. Their savings are less than 100 DM and they have been employed for less than a year. They have a low installment rate, are a single male, and have no other debtors or guarantors. They have been living at their current residence for 2 years, own a car or other property, and are 32 years old. They have no other installment plans, own their own home, and have one existing credit at the bank. They are a skilled employee/official and have one person they provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a 35-year-old unemployed single male with a good credit history, looking to borrow 1050 DM for furniture/equipment. He has no other debts, owns his own home, and has been at his current residence for 1 year. He has 2 existing credits at the bank, a stable job in management, and 1 person dependent on him for maintenance. He has a savings account with less than 100 DM and pays 4% of his disposable income towards installments. He has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of delays in paying off debts. They took out a loan for a used car, with a credit amount of 8613. They have savings of at least 1000 DM and have been employed for 1 to less than 4 years. Their disposable income installment rate is 2%. The individual is a 27-year-old single male with no other debtors or guarantors. They have been living in their own place for 2 years and own a car or other property not listed. They have two existing credits at the bank and work as a skilled employee or official. They are the sole provider for one person. They do not have any other installment plans, own a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has been unemployed for some time. They have a credit history of a critical account/ other credits existing, and their purpose for the credit is repairs. The credit amount is 3394 DM, and they have savings of less than 100 DM. They are male, single, 65 years old, and have a co-applicant as another debtor/guarantor. They have been residing in their current home for 4 years and own it. They have 2 existing credits at this bank, unemployed/unskilled job status, and 1 person liable for maintenance. They have no other installment plans, no telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account. They have a credit history of delays in paying off in the past and are looking to use the credit for business purposes. The credit amount is 2145 DM. They have savings of less than 100 DM, have been employed for 4 to 7 years, and have a low installment rate as a percentage of disposable income. The individual is a 24-year-old single male with no other debtors or guarantors. They have been living in their current residence for 1 year and own a car or other property. They have two existing credits at the bank and work as a skilled employee/official. Only one person is liable for maintenance, they have a telephone registered under their name, and they are a foreign worker.###\nHence this label was No."
"The individual is a single male, aged 24, working as an unskilled resident with less than 1 year at their current employment. They have a checking account with less than 0 DM, savings of less than 100 DM, and no other installment plans. They own their house and have 1 existing credit at the bank. The individual has a co-applicant and no telephone. They have been living at their current residence for 1 year. Their credit history shows existing credits paid back duly till now. The purpose of the credit is for furniture/equipment, with a credit amount of 1747 DM. They have a building society savings agreement/life insurance as their property. The individual has an installment rate of 4% of disposable income and is responsible for providing maintenance for 1 person. They are not a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old female who is divorced or separated or married. She has been employed for at least 7 years as a skilled employee or official. She owns a building society savings agreement or life insurance property and has been residing in her current home for 4 years. She has no other debtors or guarantors and no other installment plans. She has 2 existing credits at this bank and lives with one dependent. She has no telephone and is a foreign worker. She has a good credit history with a credit amount of 4272 for the purpose of furniture or equipment. She has savings of less than 100 DM and a low installment rate in percentage of disposable income. Overall, she appears to be a responsible individual with a stable financial background.###\nHence this label was Yes."
"The individual has a checking account balance of less than 0 DM and has been in their current employment for between 4 to 7 years. They have paid back previous credits on time and are looking to purchase furniture/equipment with a credit amount of 2212. They have no savings account, are a single male, and have no other debtors or guarantors. The individual owns their own home, has one existing credit at the bank, and works as a skilled employee/official. They are 39 years old, have no other installment plans, and have one person dependent on them for maintenance. The individual has a telephone registered in their name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a credit history of critical account/other credits existing. They are looking to finance furniture/equipment with a credit amount of 1402. They have savings between 500 and 1000 DM, have been employed for 4 to 7 years, and have a 3% installment rate. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 4 years, own a car or other property, and are 37 years old. They have no other installment plans, rent their housing, and have one existing credit at the bank. The individual is a skilled employee/official, with one person dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 28-year-old married/widowed male, currently unemployed but holding a management position or self-employed. He has been living in his own residence for 2 years and has 2 existing credits at the bank. His existing checking account balance is between 0 and 200 DM, with savings below 100 DM. He is applying for a car loan amounting to 5234 DM for a new car. He has no other debtors or guarantors, no other installment plans, and no telephone. This individual is a foreign worker and is responsible for providing maintenance for one person.###\nHence this label was No."
"The individual has a checking account balance of at least 200 DM and has been with their current employer for 4 to less than 7 years. They have a good credit history of repaying all credits at the bank on time. The purpose of their credit is for a radio/television. They do not have any savings account. Their installment rate is 4% of their disposable income. They are a single male with no other debtors or guarantors. They have been living at their current residence for 4 years and own a car or other property. They are 49 years old and have other installment plans with a bank. Their housing status is 'own'. They have one existing credit at the bank and work in an unskilled-resident job. They have one person for whom they provide maintenance and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a loan for a radio/television. They have been employed for at least 7 years and have a stable financial background with no savings account. The individual is a single male, 58 years old, and owns a car or other property. They have no other debtors or guarantors, no other installment plans, and own their own home. The individual has one existing credit at the bank and is a skilled employee/official. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM, has a credit history of repaying existing credits on time, and wants a new car. They have savings between 100 and 500 DM, have been employed for 1 to 4 years, and have a low installment rate. They are a female who is divorced, separated, or married, with no other debtors/guarantors, and have lived in their current residence for 1 year. They own a car or other property, are 28 years old, have installment plans with a bank, and own their own home. They have one existing credit at the bank, a job in management/self-employment/highly qualified employee/office role, and are responsible for providing maintenance for one person. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying back existing credits duly. They are taking a loan for the purpose of buying a radio/television. The credit amount is 2284, and they have savings of less than 100 DM. They have been employed for 4 to 7 years and have a low installment rate in percentage of disposable income. The individual is a 28-year-old single male with no other debtors or guarantors. They have owned their own home for 2 years and have one existing credit at the bank. The individual is a skilled employee/offical with one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female with no checking account. She has been employed for less than a year, resides in a rental property, and has one existing credit at the bank. The credit history shows that she has paid back previous credits on time. She is looking to purchase furniture/equipment with a credit amount of 601. She has savings of less than 100 DM and no other debts or guarantors. She has been living at her current residence for 3 years and has 2 people dependent on her for maintenance. She has a low installment rate and no other installment plans. She is an unskilled resident worker with no telephone, but is a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old married/widowed male, working in a skilled position for less than a year. They have one existing credit at the bank and have been living in a rented property for three years. They have no other debtors or guarantors and no other installment plans. Their credit history shows that they have paid back existing credits on time. They have savings between 500 and 1000 DM, with a checking account balance between 0 and 200 DM. They are seeking a loan for a radio/television, with a credit amount of 3213. Their installment rate is 1%, and they have no telephone but are a foreign worker. They are responsible for providing maintenance for one person. Their property is in real estate.###\nHence this label was Yes."
"This individual has a stable financial standing with a checking account balance of < 0 DM and over 7 years of employment. They are requesting a loan for a new car, with a moderate credit amount of 1602. They have savings below 100 DM and own a property. The individual is a 30-year-old married male, with no other debtors or guarantors. They have been living at their current residence for 3 years and have two existing credits at a bank. The individual is a skilled employee and is responsible for one dependent. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM, with a credit history of a critical account/other credits existing. They are taking a loan to purchase a radio/television, with a credit amount of 1169. Their savings account or bonds are unknown/no savings account. They have been employed for at least 7 years and have an installment rate of 4% of disposable income. The individual is male and single, with no other debtors/guarantors. They have owned their own home for 4 years and their property is real estate. At 67 years old, they have no other installment plans and no other outstanding credits at this bank. They are a skilled employee/official with one person being liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual does not have an existing checking account and has been in their current employment for 1 to 4 years. They are looking to purchase furniture/equipment with a credit amount of 4042. They have savings between 500 and 1000 DM and reside in their own real estate. The person is a 36-year-old single male with no other debtors or guarantors. They have been living at their current residence for 4 years and have a stable job as a skilled employee/official. The individual has 2 existing credits at this bank and no other installment plans. They have a telephone registered under their name and are a foreign worker. They are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for 1 to less than 4 years and have a steady income. The purpose of their credit is for a radio/television. They live in their own home which is real estate. They are a single male, 33 years old, with no other debtors or guarantors. They have two existing credits at the bank and two people they are liable to provide maintenance for. They work as a skilled employee/official. They do not have a telephone, but are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit risk based on the following attributes:\n- They have a moderate amount of money in their existing checking account.\n- The credit history shows critical accounts with other existing credits.\n- They are looking to purchase a new car.\n- The credit amount requested is relatively low.\n- They have some savings.\n- They have been employed for over 7 years.\n- The installment rate of their disposable income is reasonable.\n- They are a single male.\n- They have no other debtors or guarantors.\n- They have lived at their current residence for 4 years.\n- They own a car or some other property.\n- They are 36 years old.\n- They have installment plans with a bank.\n- They own their own home.\n- They have only one existing credit at this bank.\n- They are a skilled employee.\n- They have 2 people they are liable to provide maintenance for.\n- They have a registered telephone under their name.\n- They are a foreign worker.###\nHence this label was No."
"The individual is a young single male with a stable job and no other debtors or guarantors. He has a modest credit amount and savings, and has been living in his own residence for a year. He does not have any other installment plans or a telephone. He is a skilled employee with one existing credit at the bank and is the sole provider for one person. Additionally, he is a foreign worker.###\nHence this label was Yes."
"The individual is a female, divorced/separated/married, aged 35, with a skilled job and 1-4 years of current employment. She has a checking account balance of less than 0 DM, with a credit history of paying back existing credits on time. The purpose of the credit is for a new car, with a credit amount of 1381. She has no savings account, no other debtors or guarantors, and no other installment plans. She lives in her own home, has been at her current residence for 2 years, and has a building society savings agreement or life insurance. She has a 4% installment rate relative to her disposable income, 1 existing credit at this bank, and 1 person she is financially responsible for. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual has less than 0 DM in their existing checking account and has had the same employment for at least 7 years. They took a loan of 5302 DM for a new car, with a savings account balance of less than 100 DM. They have been living in their current residence for 4 years, are a 36-year-old single male with no other debtors or guarantors. They have no other installment plans, live in a house for free, and have a job in management or a highly qualified position. They have 3 existing credits at the bank and are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, aged 44, with no existing checking account and unknown/ no savings account. She has been employed for less than a year as a skilled employee/official and owns a car or other property. She has two existing credits at the bank, has no other debtors/guarantors, no other installment plans, and is responsible for one person's maintenance. She has been living in her current residence for one year and has a telephone registered under her name. She has a good credit history with existing credits paid back duly, and is seeking a loan for a radio/television with a credit amount of 5943. She is a foreign worker and is considered a good credit risk.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM and has had it for 4 to 7 years. They have a good credit history with other existing credits, and they are looking to finance a new car. The credit amount requested is 939 DM, and they have between 500 to 1000 DM in savings. They have been employed for 4 to 7 years and have a moderate installment rate. The individual is a married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 2 years, own real estate, and are 28 years old. They have no other installment plans, own their housing, and have 3 existing credits at this bank. The individual is a skilled employee/official with one dependent, has a telephone registered under their name, and is a foreign worker.###\nHence this label was No."
"This individual is a 26-year-old single male, working as a skilled employee. He has been employed for 1 to 4 years and has one existing credit at the bank. He has been residing in his own home for 2 years and has no other debtors or guarantors. His existing checking account has less than 0 DM, with savings of less than 100 DM. He is paying off existing credits diligently, with a credit amount of 8229 for a used car. He has no other installment plans, no phone, but is a foreign worker. He has two people to support.###\nHence this label was No."
"This individual has no checking account and is seeking a car loan. They have a good credit history with existing credits paid back on time. They are a single male, aged 45, with no savings account. They have been employed for at least 7 years as a skilled employee/official. They have one ongoing credit at a bank, with a moderate disposable income installment rate. They live in a residence for free and have no property. They have two dependents and no other debtors/guarantors. They have another installment plan with a bank and no telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a good credit history with a stable income and savings. They have a moderate credit amount for purchasing a used car. They have been employed for 4-7 years in a managerial position. The individual is a single male with no other debtors or guarantors. They have been living in their current residence for 4 years and have a good credit score. The individual is responsible for providing maintenance for two people. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account, has had existing credits paid back duly, and has been employed for at least 7 years. They are looking to finance furniture/equipment with a credit amount of 1262. They have no savings account, one existing credit at the bank, and own their housing. They are male, divorced/separated, 49 years old, unskilled-resident, with one person being liable for maintenance. They have a building society savings agreement/life insurance, no other debtors/guarantors, and no other installment plans. They have lived at their current residence for 4 years, have a telephone registered under their name, are a foreign worker, and have a 2% installment rate in percentage of disposable income.###\nHence this label was Yes."
"This individual is a married/widowed male, aged 26, with a stable job as a skilled employee/official. He has been living in his own house for 3 years and has a good credit history of repaying previous credits on time. His existing checking account has less than 0 DM, and he has savings of less than 100 DM. He has had his current job for 1 to 4 years, and his monthly installment rate is 4% of his disposable income. The purpose of his credit is for a radio/television, with a credit amount of 1345. He has no other debtors or guarantors, one existing credit at the bank, and no other installment plans. He has no telephone but is a foreign worker.###\nHence this label was No."
"The individual in this dataset is a 38-year-old unemployed female, who is divorced/separated/married, and owns her own home. She does not have a checking account but has some savings (< 100 DM) and a small credit history with critical accounts. She is looking to finance a new car with a credit amount of 926. She has no other debts or guarantors and no other installment plans. She has been residing in her current location for 2 years and has one existing credit at the bank. She does not have a telephone but is a foreign worker. Overall, she is a cautious credit risk with stable financial behavior.###\nHence this label was Yes."
"This individual has a current checking account balance of less than 0 DM and has been employed for at least 7 years. They took a loan for a new car, with a credit amount of 731 DM to be repaid in 8 months at an installment rate of 4%. Their savings account holds less than 100 DM. They reside in their own home, which is real estate, for the past 4 years. The person is a 47-year-old single male, with no other debtors or guarantors, and no other installment plans. They have two existing credits at the bank and work as an unskilled resident with one person dependent on them. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial background with existing credits paid back duly, and a small amount of credit in their checking account. They are looking to borrow a relatively small sum for a new car, with moderate savings. They have been employed for less than a year and have a low installment rate. The individual is a 36-year-old single male with no other debtors or guarantors. They have been living in their own real estate property for 3 years and have a stable job as a skilled employee. The individual has no other installment plans, no telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial situation with a moderate duration of 36 months for their credit. They have a critical credit history with existing accounts, but their current purpose for credit is for a radio or television. The credit amount requested is 2337 DM. They have some savings and have been employed for at least 7 years. Their installment rate is 4% of their disposable income. The individual is a 36-year-old single male with no other debtors or guarantors. They have been residing in their own real estate for 4 years. They have no other installment plans or telephone. They have one existing credit at the bank and work as a skilled employee / official. They are responsible for providing maintenance for one person and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 26-year-old single male with no existing checking account. They have been employed for at least 7 years as a skilled employee or official. They live in their own home and have been at their current residence for 2 years. The purpose of their credit is for a radio/television. They have a credit amount of 1934 and their savings amount is less than 100 DM. They have 2 existing credits at the bank and no other installment plans. There are no other debtors or guarantors associated with their credit. They have a low installment rate of 2% of their disposable income. They are a foreign worker, with no telephone, and are responsible for 1 other individual. Their property status is unknown with no other significant attributes mentioned in the data.###\nHence this label was Yes."
"This individual is a divorced or separated or married female, aged 24, with no checking account and unknown savings. They have been employed for 4 to 7 years in an unskilled resident job. Their credit history shows existing credits paid back duly. The purpose of their credit is for a used car, with a credit amount of 4811 and an installment rate of 2%. They have no other debtors or guarantors, one existing credit at the bank, and reside in a rented property. They have been at their current residence for 4 years, have no telephone, and are a foreign worker. Additionally, they have installment plans at stores and one person dependent on them for maintenance.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM, has been employed for at least 7 years, and has existing credits paid back on time. They are seeking a loan for education purposes and have a credit amount of 1905. Their savings are less than 100 DM, and they have no other debtors or guarantors. The individual is a single male in their 40s, with no other installment plans and living in a rented house. They have one existing credit at the bank and work in a high-level job. They have been living at their current residence for 4 years, with one dependent. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with no existing credits and a moderate credit amount. They have savings below 100 DM and have been employed for 1 to 4 years. Their personal status is divorced/separated/married and they have no other debtors or guarantors. They own a car or other property, live in their own house, and have a single existing credit. They are a skilled employee/official, aged 42, with no other installment plans and one person dependent on them. They have a registered telephone and are a foreign worker. The overall profile suggests a responsible and financially stable individual with good credit risk potential.###\nHence this label was No."
"The individual is a 46-year-old divorced/separated/married female, who has no checking account and has been employed for less than a year. She has a good credit history with a delay in paying off in the past. The purpose of the credit is for a used car, with a credit amount of 3594 DM. She has savings of less than 100 DM and a building society savings agreement/ life insurance property. She has no other debtors or guarantors, and no other installment plans. She lives in her own house for 2 years and has two existing credits at this bank. She works as an unskilled resident and is liable to provide maintenance for one person. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old single male with more than 4 but less than 7 years of employment history. He has a checking account with a balance of less than 0 DM and has one existing credit that has been paid back promptly. His current credit purpose is to purchase a new car, requiring a credit amount of 3763. He does not have any savings, but owns real estate and lives in his own home. He has no other installment plans or telephone. He has one co-applicant as a guarantor, no other debtors, and is an unskilled resident. Additionally, he has been residing in his current location for 2 years and is responsible for providing maintenance for one person. He is not a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account. They have been employed for 4 to 7 years. Their credit history is categorized as critical with other existing credits. The purpose of the credit is for a used car. They have savings of less than 100 DM and own a car or other property. The individual is a 35-year-old single male, with no other debtors or guarantors. They have been residing at their current residence for 3 years. They have 2 existing credits at the bank and work as a skilled employee/official. The individual has no other installment plans and owns their own home. They have a credit amount of 2346 with an installment rate of 4%. They have 1 person for whom they provide maintenance and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has been employed for 1 to less than 4 years. They took a loan for a new car amounting to 2134 credits and have less than 100 DM in their savings account. They have no other ongoing credits in this bank and have 3 existing credits. The individual is a 48-year-old single male, a skilled employee/officer, and has been residing in their own property for 4 years. They have no other debtors or guarantors, no other installment plans, and no one else to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job, who has been living in his own house for 2 years. He has one existing credit at the bank and no other debts or guarantors. He has no savings account but is a good credit risk based on his history of paying back credits duly. He is a skilled employee in the 1-4 years of employment range, with a monthly installment rate of 4% of his disposable income. Despite not having a telephone, he is considered a reliable borrower.###\nHence this label was Yes."
"This individual has no checking account and a credit history of critical account/ other credits existing. They borrowed 936 DM for education purposes. They have savings between 500 and 1000 DM, have been employed for over 7 years, and have a 4% installment rate. The individual is a 52-year-old single male, has no other debtors/guarantors, and has lived in their current residence for 2 years. They own a car or other property, have no other installment plans, and their housing is self-owned. They have 2 existing credits at this bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a 26-year-old divorced/separated/married female who has been working in the same job for at least 7 years as a skilled employee/official. She has a checking account with a balance of less than 0 DM, no savings account, and pays her existing credits on time. She has one existing credit at the bank and is renting a property where she has been living for 4 years. She is looking to borrow 2812 credits for a used car, with an installment rate of 2% of her disposable income. She has no other debtors/guarantors or installment plans, and does not have a telephone. She is a foreign worker and is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee/official. He has been living in his own property for 2 years and has one existing credit at the bank. His existing checking account balance is between 0 and 200 DM, and he has savings of less than 100 DM. He has a good credit history with all existing credits paid back duly. The purpose of his credit is for a radio/television, and the credit amount is 1414. He has no other installment plans or telephone. He is 33 years old, with a 1-4 year employment history, and an installment rate of 4% of disposable income. He has a guarantor for other debtors/guarantors and does not have any dependents. Additionally, he is not a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and a good credit history with other existing credits. They are taking a loan for business purposes with a credit amount of 1412. Their savings are less than 100 DM, and they have been employed for 1 to less than 4 years. The installment rate is 4% of disposable income. The person is a female, divorced/separated/married, with a guarantor for other debts. They have been residing in their current place for 2 years and own real estate. At 29 years old, they have no other installment plans and no current housing expenses. They have two existing credits at this bank, hold a managerial job, and have one dependent. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and no savings account. They have existing credits paid back duly, with a credit amount of 2662 for a new car. They have been employed for 4 to less than 7 years as a single male. They have no other debtors or guarantors, own their own home, and have 1 existing credit at the bank. They are a skilled employee/official, aged 32, with no other installment plans. They have been residing at their current residence for 3 years and have no telephone. They are a foreign worker.###\nHence this label was Yes."
"The individual is a married/widowed male, aged 27, with a stable job as a skilled employee/official. He has a good credit history with existing credits paid back duly. The purpose of the credit is for business, with a credit amount of 1391 DM. He has savings of less than 100 DM and a checking account balance between 0 and 200 DM. He has been employed for 1 to 4 years and owns real estate. The individual has no other debtors/guarantors and no other installment plans. He lives in his own house with a telephone registered under his name. He has one existing credit at the bank and no one else to provide maintenance for. Additionally, he is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and is unemployed. They have a good credit history with existing credits paid back duly. The purpose of their credit is for business. They have savings of less than 100 DM and a credit amount of 4844. The person is a 33-year-old single male with no other debtors or guarantors. They have been at their current residence for 2 years and have one existing credit at the bank. Their job position is in management/self-employed/highly qualified employee/officer. They have a bank installment plan, rent housing, and a telephone registered under their name. They are also a foreign worker with one person liable for providing maintenance.###\nHence this label was No."
"This individual is a skilled female employee, divorced or separated, aged 21, with a stable job held for 1-4 years. She has no telephone, one co-applicant, and has been residing in a rented property for 4 years. She has no other installment plans, one existing credit at the bank, and no savings account/bonds. The credit history shows that she has paid back existing credits duly. She is requesting credit for furniture/equipment, with a credit amount of 3441 DM to be repaid in 30 months. She has a good credit rating with a foreign worker status.###\nHence this label was No."
"The individual has a moderate amount of savings in their checking account, has been employed at their current job for 1 to 4 years, and has a good credit history with all loans paid back on time. They are looking to finance furniture or equipment. They have a large credit amount of 3496 DM and a high savings account balance. The individual is a 34-year-old single male with one existing credit at the bank. They have a stable job as a skilled employee/official and own their own home. They have two dependents and a registered telephone. Additionally, they have no other debtors/guarantors and are a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has had their account for at least 7 years. They are taking out a loan for a new car, with a credit amount of 1199 DM. They have savings of less than 100 DM and have been living in their current residence for 4 years. The individual is a 60-year-old single male, with no other debtors or guarantors. They have two existing credits at this bank and work as an unskilled resident. They own their own home and have no other installment plans or telephone. They have one person they are liable to provide maintenance for and are a foreign worker.###\nHence this label was No."
"This individual has a stable financial status with existing savings and a good credit history. They are looking to make a moderate-sized purchase related to furniture or equipment, which indicates responsible spending. The person is a young single male with a steady job, owning a property and living independently. They have one ongoing credit at the bank and minimal financial burdens. Overall, this individual seems to be a reliable and self-sufficient credit risk.###\nHence this label was No."
"This individual has no checking account and a credit history of critical account/other credits existing. They are looking to finance a radio/television purchase with a credit amount of 1655. Their savings are less than 100 DM and they have been employed for at least 7 years. The monthly installment rate is 2% of disposable income. The individual is a 63-year-old single male, with no other debtors or guarantors. They have lived in their current residence for 4 years and own real estate. They have no other installment plans, 2 existing credits at this bank, and work as an unskilled resident. They are responsible for providing maintenance for one person. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a history of critical accounts/other existing credits. The purpose of the credit is for radio/television. They have a credit amount of 2743 with savings of less than 100 DM. The individual has been employed for over 7 years and has a 4% installment rate. They are a single male, without any other debtors/guarantors, and have been living in their current residence for 2 years. The individual owns a car or other property, is 29 years old, with no other installment plans. They reside in their own home, have 2 existing credits at this bank, and work as a skilled employee/official. They have 1 person to provide maintenance for, no telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been in their current employment for 1 to 4 years. They have a stable living situation, owning their own home for 2 years. The purpose of the credit is for a business. The person is a 74-year-old single male in a management position. They have a good credit history with other existing credits. The credit amount is 4526 with savings of less than 100 DM. They have no other debtors and no other installment plans. They have real estate as their property and one existing credit at the bank. They are the sole provider for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 20-year-old divorced/separated/married female, working as a skilled employee/official with less than 1 year of employment. She has no checking account and no savings account. She is renting a place to live and has been at her current residence for 4 years. She has one existing credit, with a good credit history of paying back credits on time. The purpose of her credit is for a used car, with a credit amount of 4675. She has no other debtors or guarantors, no other installment plans, and no telephone. She is a foreign worker with no one else to provide maintenance for.###\nHence this label was Yes."
"The individual has a checking account balance of at least 200 DM and has a credit history of repaying previous credits on time. The purpose of the loan is for a radio/television. They are borrowing 5152 DM and have savings of less than 100 DM. They have been employed for between 4 to 7 years and their disposable income installment rate is 4%. The individual is a 25-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. They have one existing credit at the bank and work as a skilled employee/official. They are the sole provider for one person and do not have a telephone. Additionally, they have a bank installment plan, own their housing, and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history with existing credits paid back on time. The purpose of the credit is for education. They have savings of less than 100 DM and have been employed for less than 1 year. The installment rate is 4% of disposable income. They are a divorced/separated/married female, have no other debtors/guarantors, and have lived at their current residence for 4 years. Their property includes a building society savings agreement/life insurance. At 53 years old, they have no other installment plans, own their own home, and have one existing credit at this bank. They are a skilled employee/official with one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 19-year-old female who is divorced/separated/married and has been employed for less than a year. She does not have a checking account but has existing credits that have been paid back duly. She is looking to finance furniture/equipment with a credit amount of 1980. Her savings are less than 100 DM, and she has a co-applicant as a guarantor. She has been living in her current residence for 2 years and has no other installment plans. She rents her housing and holds a skilled job. She has two existing credits at this bank and is responsible for one person's maintenance. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a checking account balance of less than 0 DM, with a credit history of consistently repaying existing credits. They are seeking a loan for furniture/equipment, with a credit amount of 7882. Their savings amount is less than 100 DM.\n\nThey have been employed for 4 to 7 years, with a low installment rate of 2% of disposable income. The individual is male, single, and has a guarantor for other debts. They have been living in their current residence for 4 years and have a property tied to building society savings agreement/life insurance.\n\nAt the age of 45, this individual has no other installment plans, lives in a free housing situation, and has one existing credit at the bank. They work as a skilled employee/official and are responsible for providing maintenance to 2 people. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with a moderate credit amount of 1308 DM for repairs, with savings under 100 DM. They have a long-term employment of at least 7 years and have been paying back existing credits on time. A single male living in his own home, he is responsible for one dependent. With a good credit history, he has two existing credits and no other debtors or guarantors. At 38 years old, he holds an unskilled resident job and owns a car or other property. He has been residing at his current address for 4 years and does not have a telephone. Additionally, he is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a loan for furniture/equipment amounting to 1984. Their savings account/bonds hold less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate. The person, a 47-year-old single male, has no other debtors/guarantors and has been living in their current residence for 4 years, with unknown/ no property. They have two existing credits at the bank and work as a skilled employee/official. There is no telephone, and they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying back existing credits on time. They are looking to purchase a used car with a credit amount of 8133. They have savings of less than 100 DM and have been employed for 1 to 4 years. Their disposable income installment rate is 1%. They are a divorced, separated, or married female. They have no other debtors or guarantors and have lived at their current residence for 2 years. Their property includes a building society savings agreement or life insurance. At 30 years old, they have one existing credit at the bank and work as a skilled employee or official. They are responsible for providing maintenance for one person and own their own home. They have a bank installment plan, no telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual is a 28-year-old married/widowed male, currently unemployed with a stable residence. They have 2 existing credits, no other debtors or guarantors, and no other installment plans. The purpose of their credit is for a new car, with a credit amount of 4249 DM. They have savings of less than 100 DM and no telephone. Their job is in management/self-employment/highly qualified employee/officer category. They are a foreign worker and have one person who depends on them for maintenance.###\nHence this label was No."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are looking to borrow a small amount for a new car. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. Their personal status is a divorced or separated male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. At 49 years old, they have no other installment plans, one existing credit at the bank, and work as an unskilled resident. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account, has a good credit history, and is looking to purchase a new car. They have a small credit amount of 3527 and an unknown savings account status. Currently employed for less than a year, they have a low installment rate and are a single male. They have no other debtors or guarantors, have been living at their current residence for 3 years, and own their own home. With one existing credit at the bank, they are in a management/self-employed position and are responsible for two dependents. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history with critical accounts/other credits existing. They are borrowing 2096 credits for education purposes. Their savings amount is less than 100 DM and they have been employed for 4 to 7 years. They have a low installment rate in percentage of disposable income. The individual is a 49-year-old single male with no other debtors or guarantors. They have been living in their own real estate property for 3 years. The individual has one existing credit at the bank and is in an unskilled-resident job. They have 2 dependents and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has been employed for 1 to 4 years. They are looking to buy a new car, with a credit amount of 1163. They have savings between 500 and 1000 DM and own real estate for housing. The person is a 44-year-old single male, considered a skilled employee or official. They have no other debts or guarantors, with no other installment plans. They have one existing credit at the bank and have been living at their current residence for 4 years. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and unknown savings. They have been repaying existing credits on time. The purpose of the credit is for a new car. The individual has been employed for 1 to less than 4 years as a single male skilled employee. They own their own home and have been residing there for 2 years. They have no other debtors or guarantors and no other installment plans. The individual is 29 years old and has one existing credit at the bank. They have no telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a good credit history, with existing credits paid back on time. They are looking to finance a new car, with a credit amount of 3757. They have savings of less than 100 DM and have been employed for at least 7 years. Their disposable income installment rate is at 4%, and they are a divorced/separated/married female. They have a co-applicant as a debtor/guarantor and have been living at their current residence for 4 years. They have no property, are 62 years old, and have no other installment plans. They live in a free housing arrangement, hold a skilled job, and are responsible for providing maintenance for one person. They own a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account and has been in their current employment for 1 to 4 years. They have a critical credit history with other existing credits. The purpose of the credit is for education. They have savings between 100 and 500 DM, own a car or another property not specified, and reside in their own home for 3 years. The individual is a divorced or separated or married female, aged 31, with no other debtors or guarantors. They have no other installment plans, one existing credit at the bank, and work as a skilled employee or official. They have no telephone and are a foreign worker. They have an installment rate of 4% of disposable income and are liable for providing maintenance to one individual.###\nHence this label was Yes."
"This individual has no existing checking account and has been making timely payments on existing credits. They are looking to purchase a radio/television and require a credit amount of 2141. Their savings range from 100 to less than 500 DM and they have been employed for 4 to less than 7 years. They have no other debtors or guarantors, own their own home, and have no other installment plans. The individual is a 35-year-old single male with a skilled job, one existing credit at the bank, and one person to provide maintenance for. They have been residing at their current residence for 1 year, own unknown/no property, and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been repaying existing credits on time. They are seeking a loan for furniture/equipment, amounting to 2835 credits. They have savings between 500 and 1000 DM and have been employed for over 7 years. With a low installment rate of 3%, they are a single male in their early 50s with no other debtors or guarantors. They have been residing in their own home for 4 years and have a building society savings agreement/life insurance. With a stable job as a skilled employee/official, they have no other installment plans and no telephone. They are a foreign worker with one dependent.###\nHence this label was Yes."
"The individual has a current checking account with less than 0 DM, with a credit history of repaying existing credits on time. They are looking to finance furniture/equipment, with a credit amount of 5179. Their savings are less than 100 DM and have been employed for 4 to 7 years. They have no other debtors or guarantors, have been residing in the current location for 2 years, and own property under a building society savings agreement/life insurance. The individual is a 29-year-old single male, with no other installment plans, living in their own house. They have one existing credit at the bank, work as a skilled employee/official, and provide maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and a credit history showing critical accounts or other existing credits. They are seeking a loan for a radio/television. Their credit amount is 1851, with savings below 100 DM. They have been employed for 4 to less than 7 years and have a 4% installment rate. The individual is a married/widowed male, with a guarantor as other debtors. They have lived at their current residence for 2 years and own a car or other property. At 33 years old, they have no other installment plans and own their home. They have 2 existing credits at this bank, are a skilled employee/official, and have 1 person dependent on them for maintenance. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old divorced/separated/married female, working as a skilled employee/official with 4-7 years of employment. She has a stable financial status with existing credits paid back duly, a small credit amount of 3509 DM, and savings of less than 100 DM. She owns real estate and lives in her own home. She has no other installment plans, one existing credit at the bank, and one person to provide maintenance for. She has been living at her current residence for 1 year and has no telephone. Additionally, she has a guarantor and is a foreign worker.###\nHence this label was Yes."
"This individual is a financially stable, mature and responsible female who has been employed for a long time. She has a good credit history and has paid back all credits on time. She is using the credit to purchase a used car and has a moderate credit amount. She has some savings and no other debts or guarantors. She lives in a property for free, has a bank installment plan, and has a telephone. She is a foreign worker and has two dependents.###\nHence this label was No."
"This individual is a married/widowed male, aged 26, with a stable job as a skilled employee/official. He has been living in his own home for 2 years and has a good credit history with existing credits paid back duly. The purpose of his credit application is for business. He has a moderate credit amount of 907 DM and some savings. He has a checking account with a balance between 0 and 200 DM, and his income allows him to comfortably afford a 3% installment rate. He has no other debts or guarantors, no other installment plans, and owns real estate. He has one existing credit at the bank and one person dependent on him for maintenance. He has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a good credit history, and is looking to finance a new car. They have savings of less than 100 DM and have been employed for less than a year. With a manageable installment rate, they are a divorced/separated/married female in their late 20s. They have no other debtors or guarantors, own their own home, and have one existing credit at the bank. They work as a skilled employee/official and are responsible for providing maintenance for one person. The individual does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual is a 22-year-old divorced/separated/married female who has been in her current employment for less than a year. She has a checking account balance of less than 0 DM and a savings account with less than 100 DM. She has one existing credit at the bank and is a skilled employee/official. She has been living in her current residence for 4 years and has no other installment plans or debtors/guarantors. She is renting her housing and has no telephone. She is a foreign worker and has 1 person for whom she is liable to provide maintenance. Based on her credit history of paying back existing credits duly, her purpose for borrowing is for a radio/television. She is seeking a credit amount of 1366 with an installment rate of 3% of disposable income. Her property includes a building society savings agreement/life insurance.###\nHence this label was No."
"The individual is a single male skilled employee, aged 41, who has been employed for over 7 years. He has a good credit history with no other debts or guarantors. He owns his own home and has been living there for 1 year. He has a moderate amount of credit, with one existing credit at the bank. He has no other installment plans and his savings are less than 100 DM. He has a telephone registered under his name and is a foreign worker. Overall, he appears to be a responsible individual with a stable financial situation.###\nHence this label was Yes."
"This individual does not have a checking account and has been in their current employment for less than a year. They are requesting a loan for the purpose of purchasing a radio or television. The credit amount they are seeking is 5103. Their savings amount is less than 100 DM. They have been residing in their current residence for 3 years and do not own any property. They are a 47-year-old married/widowed male, with no other debtors or guarantors. They have three existing credits at the bank, no other installment plans, and live in a free housing. They are a skilled employee/official with one person being liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a credit history showing critical accounts/other existing credits, and is looking to make a purchase for radio/television. They are employed for 4 to less than 7 years, have savings of less than 100 DM, and a credit amount of 385. Additionally, they are female, divorced/separated/married, own real estate for housing, and have no other installment plans. They have been living at their current residence for 3 years, are 58 years old, and have no other debtors/guarantors. They have 4 existing credits at the bank, work as an unskilled resident, and have 1 person for whom they provide maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM, with a credit history of a critical account or other credits existing elsewhere. They are seeking a loan for repairs, with a credit amount of 1288. They have savings between 100 and 500 DM and have been employed for at least 7 years. Their installment rate is 3% of disposable income. The individual is a 48-year-old single male with one guarantor for their debts. They have lived in their current residence for 4 years and own real estate. They have no other installment plans and own their housing. The individual is a skilled employee/officer with 2 existing credits at this bank. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a stable credit history with existing credits paid back duly. They took a loan for a radio/television, with a credit amount of 1473. Their savings are less than 100 DM, and they have been employed for less than a year. The installment rate is 3% of disposable income. The individual is a married/widowed male, aged 39, with no other debtors or guarantors. They have been living in their own real estate property for 4 years. They have no other installment plans and no other existing credits at this bank. The individual is a skilled employee/official, with one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with no existing credits and a moderate amount of money in their checking account. They have a good credit history of paying back all credits duly on time. The purpose of the credit is for a business venture. They have a significant credit amount of 12204 DM. Their savings account status is unknown or non-existent. They have been employed for 1 to 4 years and have a low installment rate in terms of disposable income. The individual is a single male with no other debtors or guarantors. They have been residing at their current location for 2 years and own a car or other property. At 48 years old, they have a bank installment plan, own their housing, and hold a management or self-employed job. They are responsible for one person's maintenance. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"The individual in this example has a checking account with a balance between 0 and 200 DM, a credit history of paying back existing credits on time, and is taking a loan for a radio/television. They have savings of less than 100 DM, have been employed for less than a year, and have a low installment rate. The individual is a 26-year-old married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 3 years, own real estate, and have no other installment plans. The individual has one existing credit at the bank, an unskilled-resident job, and is responsible for providing maintenance for one person. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"The individual has a moderate amount of money in their existing checking account. They have a history of delays in paying off debts. The purpose of the credit is for business. They are borrowing 6967 DM. They have some savings. They have been employed for 4-7 years and have a moderate installment rate. The individual is a single male in their mid-30s with no other debtors or guarantors. They have been living at their current residence for 4 years and own a car. They have no other installment plans and rent their housing. They have one existing credit at the bank and work in a management position. They are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 29, who has been employed for 1 to 4 years as a skilled employee/official. She has a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and no other debtors/guarantors. She has been living in her own home for 2 years, with no other installment plans and no telephone. She has one existing credit at the bank and is the sole provider for one person. She is not a foreign worker. Her credit history shows that she has paid back existing credits duly till now. The purpose of her loan is for furniture/equipment, with a credit amount of 959 DM and an installment rate of 1%.###\nHence this label was No."
"This individual is a 27-year-old single male with a stable job as a skilled employee/official. He has had his current checking account for less than 1 year, with a good credit history of paying back all credits on time. He is looking to purchase furniture/equipment, for which he requires a credit amount of 3552. He has some savings below 100 DM and has been at his current job for 4-7 years. Additionally, he has no other debtors/guarantors and no other loans except for the one he is applying for. He owns his own house and has been residing there for 4 years. He has no telephone but has a bank installment plan. He is responsible for providing maintenance for one person and is a foreign worker.###\nHence this label was No."
"The individual is a 67-year-old divorced or separated or married female, with a stable job in management or as a self-employed or highly qualified employee or officer. She has been living in her own home for 4 years and has 2 existing credits at the bank. She has a good credit history with existing credits paid back duly. Her present employment has been stable for 4 to 7 years. She has no other debtors or guarantors, no other installment plans, and has savings of less than 100 DM. The individual has a telephone registered under her name and is a foreign worker. She is looking to acquire credit for education purposes, with a credit amount of 1199 and an installment rate of 4%. She is liable to provide maintenance for one person.###\nHence this label was Yes."
"This individual has no checking account and has had existing credits paid back on time. They are looking to use the credit for a used car, with a credit amount of 2848. They have savings between 100 and 500 DM and have been employed for 1 to 4 years. Their personal status is a single male, with a co-applicant as a guarantor. They have been living in their current residence for 2 years and own real estate as their property. At 32 years old, they have no other installment plans, own their housing, and have one existing credit at the bank. They are a skilled employee/official with two dependents to provide for and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history of paying back existing credits on time. They are taking out a loan for the purpose of purchasing a radio or television. The credit amount is 2299 DM. They have savings between 500 and 1000 DM, with stable employment for at least 7 years. The installment rate is 4% of disposable income. The individual is a 39-year-old single male, with no other debtors or guarantors. They have been residing in their current home for 4 years and own a car or other property. They have no other installment plans, own their house, and have one existing credit at the bank. The individual is a skilled employee or official, with one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a modest amount of money in their existing checking account, has a short credit history with other creditors, and is borrowing money for educational purposes. They have a substantial amount of savings, a stable job for over 7 years, and a low percentage of their income goes towards loan installments. This person is a single male, with no other debtors or guarantors, and has been living at their current residence for 3 years. They have no specified property, are 32 years old, and have no other installment plans. Their housing is free, they have two existing credits at their bank, and they are a skilled employee. They are responsible for providing maintenance for two people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual in this data has a checking account balance of at least 200 DM and has been at their current employment for over 7 years. They have paid back existing credits on time and are looking to take a new car loan. With a credit amount of 1240, their savings fall between 100 and 500 DM. They are a divorced, separated, or married female, aged 48, with no other debtors or guarantors. They have been living in their current residence for 4 years, with no property of their own. They have one existing credit at the bank and work as an unskilled resident with 2 people dependent on them for maintenance. They do not have any other installment plans, own a house for free, do not have a telephone, and are a foreign worker.###\nHence this label was No."
"This individual is a 25-year-old female who is divorced/separated/married. She has no checking account but has been making existing credits payments on time. She has been working for 1 to 4 years and has her own car or other property. Her credit amount is 2394, and she has no savings account. She has no other debtors/guarantors and no other installment plans. She lives in her own house with one other person and has one existing credit at the bank. She is a skilled employee/official, and she is a foreign worker. She does not have a telephone.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history of paying existing credits on time. They are looking to finance a new car with a credit amount of 3518. Their savings are below 100 DM and they have been employed for 1 to 4 years. The installment rate is 2% of disposable income. The person is a 26-year-old single male with a guarantor. They have been living at their current residence for 3 years and have a building society savings agreement/life insurance. The individual has no other installment plans, lives in a rented house, and has one existing credit at the bank. They are a skilled employee/official with one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a moderate amount of money in their existing checking account, has not taken any previous credits or has paid them back on time. They are undergoing retraining for a duration of 12 months. The purpose of the credit is clear but modest at 1410 DM. They have some savings, have been employed for 1-4 years and have a low installment rate. The individual is a single male with no other debtors or guarantors. They have been residing in their current residence for 2 years, own real estate, and are 31 years old. They do not have any other installment plans, own their home, have one existing credit at the bank, and work as an unskilled resident. They have one dependent and a registered telephone under their name. Lastly, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has had it for 6 months, and has a critical credit history with other existing credits. They are seeking a loan for furniture/equipment with a credit amount of 3384 DM. They have savings of less than 100 DM and have been employed for 1 to 4 years. Their installment rate is 1% of disposable income.\nThe individual is a divorced/separated male aged 44, with no other debtors or guarantors. They have been living in their current residence for 4 years, owning real estate. They have no other installment plans, live in a rented house, and have one existing credit at the bank.\nTheir occupation is in management/self-employment/highly qualified employee/officer, with one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a divorced or separated or married female, aged 55, with a stable job in management/self-employment/highly qualified employee/officer for over 7 years. She has no other debtors/guarantors, no savings account, and owns her own home. She has been living at her current residence for 4 years and has one existing credit at the bank. She has a good credit history of paying back existing credits duly. She has no other installment plans, no dependents, and is a foreign worker. She has a telephone registered under her name and is looking to finance furniture/equipment with a credit amount of 1424 over a 12-month period at an installment rate of 3%.###\nHence this label was Yes."
"This individual is a 20-year-old married/widowed male, working as a skilled employee/official for 1-4 years. He has a good credit history with a delay in paying off in the past. Currently, he has a savings account with less than 100 DM and no existing checking account balance. He lives in a rented house and has been at the same residence for 4 years. His credit amount is 585 DM, with an installment rate of 4% of his disposable income. He has no other installment plans, no telephone, and is a foreign worker. Additionally, he has one co-applicant and is responsible for one person's maintenance. He has 2 existing credits at the bank and his property is real estate.###\nHence this label was Yes."
"The individual is a 25-year-old female who is divorced/separated/married. She has been working at her current job for less than a year and owns her own home. She has a checking account with a balance between 0 and 200 DM, and a savings account with less than 100 DM. She has paid back all existing credits on time, and is seeking a new car with a credit amount of 1355. She has no other debtors or guarantors, and no other installment plans. She has been residing at her current place for 4 years, has one existing credit at the bank, and is unskilled but a resident at her job. She is responsible for providing maintenance for one person and has a registered telephone under her name. She is also a foreign worker.###\nHence this label was No."
"This individual is a 21-year-old female who is divorced/separated/married. She has no checking account and unknown/no savings account. She has been employed for 1 to less than 4 years as a skilled employee/official. She lives in her own home and has been at her current residence for 2 years. She has no other debtors/guarantors and no other installment plans. She has one existing credit at the bank and a credit history of paying back existing credits duly. The purpose of her credit is for a radio/television, and the credit amount is 886. Her installment rate is 4% of disposable income. She is the sole provider for maintenance and does not have a telephone. She is a foreign worker.###\nHence this label was Yes."
"The individual in this example has a checking account with a balance of at least 200 DM, a credit history of paying back existing credits on time, and has been employed for 1 to less than 4 years. They took out a credit of 1881 DM for the purpose of buying a radio/television, and have savings of less than 100 DM. The person is a 44-year-old divorced, separated, or married female, with no other debtors or guarantors. They have been living in their current residence for 2 years, do not have any other installment plans, and rent their housing. The individual has one existing credit at the bank, is an unskilled resident, and is liable to provide maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 25, with a steady job as a skilled employee/official. He has been living in his own real estate property for 2 years. His existing checking account balance is between 0 and 200 DM, with a savings account balance less than 100 DM. He has 2 existing credits at his current bank and has been employed for 4 to 7 years. The duration of his credit is 39 months, with a credit amount of 4933. He has no other installment plans and no telephone. He has a guarantor and is responsible for providing maintenance for one person. Additionally, he is a foreign worker.###\nHence this label was No."
"The individual is a female who is divorced/separated/married, aged 30, working as a skilled employee/official for 1-4 years. She has a stable income with a checking account balance of less than 0 DM and savings of less than 100 DM. Currently, she owns a house and has a building society savings agreement/life insurance. She has one existing credit and a co-applicant. She has been living at her current residence for 3 years and has no other installment plans or telephone. She is a foreign worker with no other people dependent on her financially. Her credit history shows that she has paid back existing credits on time. The purpose of her credit application is for furniture/equipment, with a credit amount of 1620 and an installment rate of 2%.###\nHence this label was Yes."
"The individual has no checking account and has been paying their existing credits on time. They are borrowing money to purchase a radio/television, with a credit amount of 2397. They have savings between 500 and 1000 DM, and have been employed for at least 7 years. The installment rate is 3% of their disposable income. The individual is a single male, has no other debtors or guarantors, and has been living at their current residence for 2 years. They own a car or other property and are 35 years old. They have another installment plan with a bank and own their own housing. They have 2 existing credits at this bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a divorced or separated female, aged 24, with a stable job as a skilled employee. She has been living in her own property for 4 years and has no other debts or dependents. She has one existing credit, with a good credit history of timely repayments. Her current financial status shows she has some savings below 100 DM and a moderate credit amount of 1237. She has no other installment plans and does not have a telephone. She has resided in her current location for 4 years and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been employed for at least 7 years. They are seeking a loan for furniture/equipment, with a credit amount of 3331. Their savings are below 100 DM and they have been residing at their current location for 4 years. They are a 42-year-old single male with no other debtors or guarantors. The individual has one existing credit at the bank and works as a skilled employee/official. They own their own home, have no telephone, and have one person dependent on them for maintenance. Additionally, they have a building society savings agreement/life insurance, an installment plan with stores, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for over 7 years. They are looking to purchase a new car and have a credit history of critical account/other credits existing. They have less than 100 DM in savings and own real estate. With an installment rate of 4%, they are single, male, and 38 years old. They have two existing credits at the bank and no other installment plans. Living in their own home for 1 year, they work as an unskilled resident with two dependents. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and has a credit history of consistently repaying all credits at their bank. They are seeking credit for a business purpose, with a credit amount of 609. Their savings account contains less than 100 DM, and they have been employed for less than 1 year. They have no other debtors or guarantors. They have been residing in their current residence for 1 year and own real estate. At 26 years old, they have no other installment plans, are unmarried, and unemployed or working in an unskilled, non-resident job. They are responsible for providing maintenance for one person and do not have a telephone. Despite being a foreign worker, they are considered a good credit risk.###\nHence this label was No."
"The individual in this data set is a 20-year-old single male, who has been employed for at least 7 years as a skilled employee/official. He has a good credit history with a critical account/other credits existing. His existing checking account has a balance of at least 200 DM, and he has no savings account. The purpose of his credit is for furniture/equipment, with a credit amount of 3617. He pays a 4% installment rate of his disposable income and has no other installment plans. He has one co-applicant as a debtor/guarantor and no other people to provide maintenance for. He has been residing in the current property for 4 years, which is rented and of unknown property type. He has two existing credits at the bank, does not have a telephone, but is a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old divorced or separated or married female, with no existing checking account. They have been employed for 4 to 7 years as a skilled employee or official. The purpose of their credit is for a radio/television, with a credit amount of 1554. Their savings are less than 100 DM and they have no other installment plans or debtors/guarantors. They have been residing at their current residence for 2 years and have 2 existing credits at this bank. They have a 1% installment rate and live in a rented housing. They have one person liable for maintenance and a telephone registered under their name. Additionally, they are a foreign worker with a good credit history.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM and has had the account for at least 7 years. They have a good credit history with other existing credits, and are looking to purchase a used car. The credit amount requested is 6331 DM, and they have savings of less than 100 DM. They have been living in their current residence for 4 years, are a single male aged 46, with no other debtors or guarantors. They do not have any other installment plans, own no property, and live in a free housing situation. The individual has a stable job as a skilled employee/official, one person they are financially responsible for, and a registered telephone in their name. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a single male, aged 36, with no existing checking account. He has been employed for at least 7 years in a managerial or self-employed position. His credit history shows critical accounts and other existing credits. The purpose of the credit is for a used car, with a credit amount of 3275 DM. His savings are below 100 DM and he has no other installment plans. He resides in his own home for 4 years and has one existing credit at the bank. He has no other debtors or guarantors and no one else to provide maintenance for. He has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"This individual is a 35-year-old single male with no savings account and a checking account balance between 0 and 200 DM. They have been employed for less than 1 year and are currently unemployed or in an unskilled position. They have one existing credit at the bank and have been living in their own real estate property for 2 years. The purpose of their credit is for a new car, with a credit amount of 1549. They have no other installment plans, no other debtors/guarantors, and no phone. They are a foreign worker and responsible for providing maintenance for one person. Based on their credit history of paying existing credits back duly, they are classified as a good credit risk.###\nHence this label was Yes."
"The individual is a single male with a stable job as a skilled employee, having been employed for 4-7 years. He has been living in a rented house for 3 years and has one existing credit at the bank. He has no other debtors or guarantors and no other installment plans. He has a savings account with a balance of 100 to 500 DM and a checking account with a balance between 0 to 200 DM. The individual has a good credit history, despite a delay in paying off debts in the past. He is looking for a loan for education purposes, with a credit amount of 11760 DM. He has a manageable installment rate in percentage of his disposable income. At the age of 32, he is financially responsible and has a history of good credit.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a critical credit history with other existing credits, and a purpose to buy a new car. They have a credit amount of 2799 and savings of less than 100 DM. They have been employed for 1 to less than 4 years with a 2% installment rate. The individual is a 36-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. The person has 2 existing credits at the bank, works as a skilled employee/official, and is liable for 2 people's maintenance. They rent their housing, have no other installment plans, no telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual is a 21-year-old female, divorced/separated/married, who has been living in a rented accommodation for the past 4 years. She has a small credit amount of 1049 DM and has no other debtors or guarantors. She has a stable job as a skilled employee/official and has been employed for less than a year. She has only one existing credit at the bank, no other installment plans, and no telephone. She is responsible for providing maintenance for one person and is a foreign worker. Her credit history is considered critical, but she has a good record of managing her existing credits properly. She has a savings account with less than 100 DM and a property in building society savings agreement/life insurance.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are borrowing 1311 credits to purchase a radio/television. They have savings between 100 and 500 DM and have been employed for 4 to 7 years. Their disposable income installment rate is 4%, and they are a married/widowed male. They have no other debtors or guarantors and have been living at their current residence for 3 years. They have a building society savings agreement/life insurance and own their house. They are 26 years old, have no other installment plans, and have one existing credit at the bank. They are a skilled employee/official, have one dependent, own a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a critical credit history with other credits existing. They are taking a loan for education with a credit amount of 1864. They have savings between 100 and 500 DM, and have been employed for 1 to 4 years. Their installment rate is 4% of disposable income. The person is a female who is divorced, separated, or married. They have no other debtors or guarantors, and have been residing in their current residence for 2 years. They own real estate and are 30 years old with no other installment plans. The individual has two existing credits at the bank, is a skilled employee, and has one person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 27-year-old single male who is unemployed. He has a good credit history with existing credits elsewhere, and is looking to buy a used car. He has a moderate credit amount of 4576 DM and some savings. He currently owns a car or other property and has been residing at the same place for 4 years. With a stable job as a skilled employee, he has one existing credit at the bank and no other installment plans. He has no other debtors or guarantors, and no phone. He is responsible for providing maintenance for one person and is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and unknown savings. They have been repaying existing credits diligently and have a credit duration of 36 months for an education purpose. Their employment duration is between 1 to 4 years with a moderate installment rate. They are a 35-year-old single male with no other debtors or guarantors. They reside in a free housing with no specified property. The individual has one existing credit at the bank and is an unskilled resident. They have two dependents, a registered telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of delays in paying off debts. They took a loan for a business purpose, amounting to 5117 credits. Their savings are less than 100 DM, and they have been employed for 4 to 7 years. With an installment rate of 3%, the individual is a single male with no other debtors or guarantors. They have lived in their current residence for 4 years and own a car or other property. At 26 years old, they have no other installment plans and own their own home. They have two existing credits at the bank, work as a skilled employee or official, and have one person they are financially responsible for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a good credit history with existing credits paid back duly. They are looking to purchase furniture/equipment with a credit amount of 3422. They have savings of less than 100 DM and have been employed for over 7 years. Their personal status is male and single. They have no other debtors/guarantors and have been living at their current residence for 4 years. Their property includes a building society savings agreement/life insurance. At the age of 47, they have 3 existing credits at the bank and work as a skilled employee/official. They have 2 dependents and own their own home. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a 45-year-old divorced female with a steady job as a skilled employee. She has been living in her own real estate property for the past year. Her existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. She has one existing credit with a low installment rate, and no other installment plans. The purpose of her credit is for a radio/television, with a credit amount of 2329. She has a guarantor, no phone, and is a foreign worker. Overall, she has a good credit history with all existing credits paid back duly.###\nHence this label was Yes."
"This individual is a 55-year-old female who is divorced/separated/married. She has been in her current job as a skilled employee/official for over 7 years. She has no other debtors/guarantors and no other installment plans. She has been living in her current residence for 4 years, owns her own home, and has no telephone. She has a good credit history with existing credits paid back duly till now. She has a checking account balance of less than 0 DM and savings of less than 100 DM. She is borrowing a credit amount of 1603 for the purpose of purchasing a radio/television. She has a low installment rate in percentage of disposable income (4) and is the only person liable to provide maintenance for. She does not have any other existing credits at this bank. Additionally, she is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown/savings account. They have had their current employment for at least 7 years and have a good credit history with critical accounts/other existing credits. The purpose of their credit is for business. They are a 46-year-old divorced/separated male, living in their own home. They have two existing credits at this bank and two dependents. Their job is in management/self-employment/highly qualified employee/officer. They have no other debtors/guarantors, no telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 30, with a stable job working as a skilled employee/official. He has been living for free in his current residence for 4 years. He has a good credit history, with all credits at his bank paid back duly. His existing checking account balance is less than 0 DM, and he has between 500 and 1000 DM in his savings account. He is new to his current job, having worked there for less than a year. He has no other debtors or guarantors, and no other installment plans. He has one existing credit at the bank and two people he is liable to provide maintenance for. He has a telephone registered under his name and is a foreign worker. He is looking to purchase furniture/equipment, with a credit amount of 3349 and an installment rate of 4% of his disposable income. His property status is unknown/no property.###\nHence this label was No."
"This individual does not have a checking account and has a credit history of critical account/other credits existing. The purpose of the loan is for a new car. The credit amount is 2463 units. Savings range from 100 to less than 500 DM. The individual has been employed for 4 to less than 7 years. The installment rate is 4% of disposable income. They are a married/widowed male, with no other debtors/guarantors. They have been residing at their current residence for 3 years and their property includes a building society savings agreement/life insurance. The individual is 27 years old, with no other installment plans, and owns their housing. They have 2 existing credits at this bank and are a skilled employee/official. They have 1 person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has had existing credits paid back on time, and is looking to finance furniture/equipment. They have savings of less than 100 DM and have been employed for 1 to 4 years. With an installment rate of 2% of disposable income, the individual is a divorced/separated male. They have no other debtors or guarantors and have lived in their current residence for 1 year. The individual owns a car or other property, is 42 years old, and has no other installment plans. They live in their own home, have one existing credit at this bank, work as a skilled employee/official, and have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with a moderate amount in their existing checking account. They have a credit history with critical accounts or other existing credits. The purpose of their credit is for radio/television. They have a modest credit amount and some savings. They have been employed for 1 to 4 years and have a low installment rate in percentage of disposable income. The individual is a married/widowed male in their early thirties with no other debtors or guarantors. They have been residing at their current residence for 2 years and own their housing. They have a car or other property and no other installment plans. In terms of employment, they are a skilled employee/official with one existing credit at the bank. They are responsible for providing maintenance for one person and do not have a telephone. They are a foreign worker.###\nHence this label was No."
"The individual is a female who is divorced/separated/married, aged 22, with a stable job as a skilled employee/official. She has been living in her own real estate property for 2 years. She has one existing credit at the bank and no other debts or guarantors. She has no other installment plans and does not have a telephone. She does not have any dependents and is a foreign worker. She has a good credit history of paying back existing credits duly. Her existing checking account balance ranges from 0 to less than 200 DM, with savings of less than 100 DM. She is taking a credit of 5951 DM for the purpose of buying a radio/television, with an installment rate of 2% of disposable income.###\nHence this label was No."
"The individual in this example has a checking account with a balance of at least 200 DM. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a radio/television. The credit amount is 1258 DM. They have savings between 500 and less than 1000 DM, and have been employed for 1 to less than 4 years. The installment rate is 3% of disposable income. The individual is a female who is divorced, separated, or married. They have no other debtors or guarantors. They have been residing at their current residence for 3 years, own a car or other property, and are 57 years old. They have no other installment plans, own their housing, have one existing credit at the bank, work in an unskilled resident job, and have one person they are liable to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a young divorced or separated female, aged 19, with a short employment history, renting a home and living alone. She has a small amount of savings, no other debts, and a low installment rate. She has one existing credit, which was paid back on time, and is applying for a loan to purchase furniture/equipment. Despite her limited financial history, she is a foreign worker with the potential to be a good credit risk.###\nHence this label was Yes."
"The individual in this dataset has no checking account and an existing credit history of paying back credits on time. They are taking a business loan amounting to 7409 for a duration of 36 months. They do not have a savings account and have been employed for at least 7 years. Their disposable income installment rate is 3%, and they have no other debts or guarantors. The individual is a 37-year-old single male, living in their own property for the past 2 years. They have a building society savings agreement/life insurance for property. They have no other installment plans, own a telephone, and are a skilled employee/official with two existing credits at this bank. They have one dependent for maintenance and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a critical credit history with existing credits elsewhere. They are borrowing 2028 credits for furniture/equipment for a duration of 24 months. They have savings of less than 100 DM and have been employed for 4 to 7 years. With a low installment rate, they are a single, 30-year-old male with no other debtors or guarantors. They have been residing in their own home for 2 years and have a building society savings agreement/life insurance. With no other installment plans, they have two existing credits at the bank and work as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has had existing credits paid back duly up to now. They are looking to obtain a new car with a credit amount of 1101. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have a moderate installment rate of 3% of disposable income. The individual is a married or widowed male, 27 years old, with no other debtors or guarantors. They have been residing in their current home for 2 years and own real estate. They have no other installment plans or debtors, and their housing situation is categorized as \"own.\" The individual holds two existing credits at the bank and is a skilled employee or official. They are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has been with their current employer for 1 to 4 years. They have paid back all credits at the bank duly and are applying for a new car loan worth 1647 DM. They have no savings account and no other installment plans. The individual is a 40-year-old single male, working as an unskilled resident, with 2 people to provide maintenance for. They have been living in their own home for 2 years and have a building society savings agreement/life insurance. The individual has 2 existing credits at this bank, an installment rate of 4%, and no other debtors/guarantors. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual is a married/widowed male in their late twenties, working in a management role. They have been living in rented accommodation for four years and have a good credit history with one existing credit at the bank. The person has a small amount of savings, does not have any other debtors or guarantors, and has a phone registered in their name. They are a foreign worker and have no other installment plans. Their credit amount is relatively high, and they are looking to purchase a used car.###\nHence this label was No."
"The individual is a 25-year-old female, divorced/separated/married, with existing credits paid back duly till now. She has a good credit history and has a savings account with less than 100 DM. She has been employed for less than a year, and her monthly installment rate is 2% of disposable income. She lives in her own house with a 3-year residence tenure. She has one existing credit at the bank, no other installment plans, and no other debtors or guarantors. She works as an unskilled resident and is responsible for one person's maintenance. She does not have a telephone but is a foreign worker. The purpose of the credit amount of 2327 DM is for a radio/television.###\nHence this label was No."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They took a loan of 2210 credits for furniture/equipment for a duration of 10 months. Their savings account contains less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate on their disposable income. The individual is a 25-year-old single male, with no other debtors or guarantors. They have been living in real estate for 2 years and have one existing credit at the bank. Their job is unskilled-resident and they are responsible for one person. They have a telephone and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and unknown savings. They have held their current job for less than a year and have been living in their own home for the past 4 years. The purpose of their credit is for a new car. They are a divorced/separated 44-year-old male, employed as a skilled employee/official. They have 2 existing credits at the bank and no other installment plans. They have one dependent and their telephone is registered under their name. Overall, they appear to be a responsible individual with a stable financial situation.###\nHence this label was Yes."
"The individual has no checking account and has been employed for 4 to 7 years. They are looking to finance a used car with a credit amount of 7253. Their savings are less than 100 DM, and they have two existing credits at the bank. They are a single male, 35 years old, with no other debtors or guarantors. They have been living in their current residence for 2 years and own their own home. They work in a management or highly qualified position and are responsible for providing maintenance for one person. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a 32-year-old divorced/separated/married female, working as a skilled employee/official with 4-7 years of present employment history. She has a checking account balance of less than 0 DM, no savings account, and unknown property. She has been living in her current residence for 4 years and pays rent. She has one existing credit at the bank and no other installment plans. The credit history shows that she has paid back all existing credits duly. She is looking to borrow 1285 to buy a new car, with an installment rate of 4% of her disposable income. She has no other debtors/guarantors, no other people depending on her for maintenance, no telephone, and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has paid back existing credits on time. They are looking to borrow a relatively small amount of credit for a new car. They have savings between 100 and 500 DM and have been employed for less than a year. They have a moderate installment rate and are married or widowed. They have no other debtors or guarantors and have been living in their current residence for three years. They own real estate and are 33 years old with no other installment plans. They have one existing credit at their bank and work as a skilled employee/official. They are responsible for one person's maintenance and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 35, with no checking account. They have been employed for less than a year in a managerial or self-employed position. They have no other debtors or guarantors and own their own home. The purpose of the credit is for a new car, with a credit amount of 1393 and savings of less than 100 DM. They have been living in their current residence for 4 years and have 2 existing credits at the bank. They have no other installment plans, no telephone, and no foreign worker status. They have a 4% installment rate and are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of delaying payments in the past. They are seeking a loan for a business purpose, amounting to 1743 credits. Their savings fall within the range of 100 to 500 DM. They have been employed for 1 to 4 years and have a low installment rate as a percentage of their disposable income. The individual is a 34-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. They have no other installment plans or telephone. They have two existing credits at the bank and work as an unskilled resident. They are responsible for providing maintenance for one person and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown or no savings account. They have been employed for at least 7 years, are a single male, and own real estate. Their credit history shows critical accounts or other existing credits. The purpose of the credit is for business, with an amount of 6304 credits to be repaid over 36 months with an installment rate of 4%. They have no other debtors or guarantors, no other installment plans, and no telephone. The individual is a skilled employee or official, aged 36, with 4 years of residence in their current location. They have 2 existing credits at their bank and are responsible for providing maintenance for one person. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female, who has been working for less than 1 year at her current job as an unskilled resident. She has one existing credit at the bank and no other debtors/guarantors. She lives in her own home and has been at her current residence for 2 years. She has no telephone and is a foreign worker. She has a good credit history of paying back existing credits duly. The purpose of her loan is for a new car, with a credit amount of 836 DM. She has savings of 100-500 DM in her account and an installment rate of 4% of her disposable income. She has a building society savings agreement/life insurance as property and another installment plan with a bank. She is the sole provider for one person's maintenance.###\nHence this label was No."
"This individual has no checking account and has been making timely payments on existing credits. They took a 15-month loan of 5324 DM to buy a new car. They have savings between 500 and 1000 DM and have been employed for over 7 years. The monthly installment is 1% of their disposable income. The individual is a divorced/separated/married female, living in a free housing with no other debts. They have unknown/no property and are 35 years old. There are no other installment plans, and they have one existing credit at the bank. The individual is a skilled employee/official with one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated male, 55 years old, who has been in his current residence for 1 year. He has a checking account balance of less than 0 DM and has been employed for less than 1 year. His credit history shows that all credits at this bank have been paid back duly. The purpose of his credit is for furniture/equipment, with a credit amount of 6872. He has savings of less than 100 DM, and his installment rate is 2% of disposable income. He has no other debtors/guarantors and owns his own home. He has one existing credit at this bank and works as a skilled employee/official. He is responsible for providing maintenance for one person. He has a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"The individual is a 23-year-old divorced/separated/married female, working as a skilled employee/official. She has a checking account with less than 0 DM, a credit history of always paying back existing credits on time, and currently has a new car loan. She has savings of less than 100 DM, has been employed for less than a year, and pays 4% of her disposable income in installments. She lives in a rented house with one dependent and has one other credit at the bank. She has no other debtors or guarantors, no other installment plans, and owns a car or another type of property not specified. She has a registered telephone and is a foreign worker.###\nHence this label was No."
"This individual has no existing checking account and has a good credit history with existing credits paid back duly. They are taking a loan for a radio/television, with a credit amount of 1901 units. Their savings range from 100 to less than 500 DM and they have been employed for 1 to less than 4 years. They have no other debtors or guarantors. The individual is a single male, 29 years old, with no other installment plans. They reside in a rented house, have one existing credit at the bank, and work in a management/self-employed/highly qualified position. They have one dependent, a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee. He has been with the same employer for 4 to 7 years and has a good credit history, with existing credits paid back promptly. He is looking to borrow a relatively small amount of money (2002 DM) for a new car. His financial situation includes having some savings (less than 100 DM) and a modest monthly installment rate. He resides in a rented apartment and has been at his current address for 4 years. He has one other credit at this bank and is responsible for providing maintenance for two people. Additionally, he has a telephone registered in his name and is a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM and a credit history showing critical accounts or other existing credits. They took a 12-month loan for a new car, amounting to 1480 DM. Their savings account holds between 500 and 1000 DM, while they are currently unemployed but have been at their previous residence for 4 years. A 66-year-old single male, they have no other debtors or guarantors. They own no property and live in a house for free. Despite being unemployed and unskilled, they have taken 3 credits from this bank and are responsible for one dependent. They have a bank installment plan, no telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 33, who has been employed for 1 to less than 4 years as a skilled employee/official. She owns a house and has no other installment plans. She has one existing credit at the bank and has been living in the current residence for 2 years. She has no savings account, no other debtors/guarantors, and no telephone. She is a foreign worker. Based on her credit history of paying back existing credits duly until now, she has taken a credit amount of 1042 DM for a new car, with a duration of 18 months to repay.###\nHence this label was No."
"The individual has a checking account with a balance of less than 0 DM, a credit history of delayed payments, and is seeking credit for education purposes. They are borrowing 6887 DM for a duration of 36 months with a savings balance of less than 100 DM. The individual has been employed for 1 to 4 years, has no other debtors or guarantors, and resides in their own home. They are a 29-year-old single male, with 3 years at their current residence and 1 existing credit at the bank. They work as a skilled employee/official, have a telephone registered under their name, and are a foreign worker.###\nHence this label was No."
"This individual is a 68-year-old unemployed single male with a checking account balance between 0 and 200 DM. They have a critical credit history and currently have three existing credits at the bank. The purpose of their credit is for a new car, with a credit amount of 1175 DM. They have savings of less than 100 DM and no other debts or guarantors. They have been living in their current residence for 3 years and have no other installment plans. Their housing is free, and they have a telephone registered under their name. They are a foreign worker and have one person they are liable to provide maintenance for. Their job is categorized as unemployed/unskilled-non resident.###\nHence this label was Yes."
"The individual in this example has a moderate amount of money in their existing checking account (between 0 and 200 DM) and has a good credit history with all credits at the bank being paid back duly. They are looking for a business loan with a duration of 48 months and a credit amount of 3566. Their savings account/bonds contain an amount between 100 and 500 DM, and they have been employed at their current job for 4 to 7 years. They have no other debtors/guarantors and live in their own property. The individual is a 30-year-old single male, with no other installment plans and no telephone. They have one existing credit at the bank, a skilled job, and are responsible for providing maintenance for one person. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a critical credit history with other existing credits. They are looking to make a purchase related to radio/television. The amount of credit requested is 1516. They have substantial savings of at least 1000 DM. The individual has been employed for 1 to less than 4 years and has a moderate installment rate. Their personal status is a divorced/separated/married female with no other debtors or guarantors. They have been residing in their current residence for 1 year and own real estate. At the age of 43, they have no other installment plans, have 2 existing credits at this bank, and work in an unskilled resident job. They are responsible for the maintenance of one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM and a credit history of existing credits paid back duly. They are taking a loan for business purposes, with a credit amount of 7297. Their savings amount is less than 100 DM and they have been employed for at least 7 years. The individual has no other installment plans, one existing credit at this bank, and no telephone. They are a male who is single, a skilled employee/official, with one co-applicant as a debtor/guarantor. They live in a rented housing with a duration of 4 years at the present residence. The individual is 36 years old, with an installment rate of 4% of disposable income, and is a foreign worker. They are responsible for one dependent.###\nHence this label was No."
"This individual is a single male with a stable job as a skilled employee, having been employed for 4 to 7 years. He has a good credit history, with existing credits paid back on time. His current residence is owned, with real estate property. He has a small existing checking account balance, less than 100 DM in savings, and no other debts or guarantors. He is young, at 26 years old, with one existing credit at the bank. He is responsible for providing maintenance for one person and does not have a telephone. Despite being a foreign worker, he is considered a good credit risk, looking to purchase a new car with a credit amount of 759.###\nHence this label was No."
"The individual in this dataset does not have a checking account. They have a credit history of delay in paying off in the past and are taking a loan for a business purpose. The credit amount is 2375 and they have savings between 500 and 1000 DM. They have been employed for 1 to 4 years and have an installment rate of 4% of disposable income. The individual is a 44-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. The individual has no other installment plans, owns their own home, and has 2 existing credits at the bank. They are a skilled employee or official, with 2 people liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this data has a stable financial standing with less than 0 DM in their existing checking account and over 7 years in their current employment. They applied for credit to purchase a new car, with a relatively low credit amount of 860 DM. Their savings account holds less than 100 DM. They are a divorced/separated/married female, aged 39, owning their own house. They have no other outstanding debts or installment plans. Additionally, they have been residing at their current residence for 4 years, have 2 existing credits at the bank, and work as a skilled employee/official. They have one dependent, a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female, working as a skilled employee/official. She has no existing checking account but has a savings account with less than 100 DM. Currently, she has been employed for less than a year and has been living in her own residence for 4 years. She has one credit at the bank, with a credit history of critical account/other credits existing. The purpose of her credit is for furniture/equipment, amounting to 2288. She has no other debtors/guarantors or other installment plans. Her installment rate in percentage of disposable income is 4, and she has a building society savings agreement/life insurance as property. She is responsible for one person and has a telephone registered under her name. Additionally, she is a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has been employed for less than a year. They took a loan for furniture/equipment worth 2146 DM for a duration of 10 months. Their credit history is classified as critical, and they have savings of less than 100 DM. They are a divorced/separated/married female, 23 years old, and live in a rented house with a 3-year residence. They have no other debtors or installment plans, and own real estate. They work as a skilled employee/official and are liable for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, aged 24, who has no checking account. She has been in her current employment for 1 to less than 4 years and has been residing at her current residence for 4 years. She is looking to purchase a used car, with a credit amount of 11590 DM. Her savings range from 100 to less than 500 DM. She has no other debtors or guarantors, and no telephone. She has 2 existing credits at a bank, with an installment rate of 2% of disposable income. She has a job as an unskilled resident, with 1 person liable for maintenance and is a foreign worker. She has a bank installment plan, and her housing situation is renting.###\nHence this label was No."
"The individual in this dataset is a 44-year-old single male who has been working in their current employment for less than a year. They have a good credit history with critical accounts and existing credits at other banks. The purpose of their credit application is to finance a used car. They have a moderate credit amount of 1804 DM and some savings between 100 and 500 DM. They have no other debts or guarantors and live in their own house. Additionally, they have been residing at their current residence for four years and have one existing credit at this bank. Their job position is a skilled employee/official with no other installment plans. They have no telephone and are a foreign worker. They are responsible for providing maintenance for one person.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has been employed for at least 7 years. They took out a credit amount of 338 DM for the purpose of purchasing a radio/television. They have savings between 500 and 1000 DM and have been residing in their current residence for 4 years. The individual is a 52-year-old single male, with no other debtors or guarantors. They own a car or other property not specified and have no other installment plans. They have 2 existing credits at this bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old unemployed female who is divorced/separated/married. She has no savings account and a credit history of paying back existing credits duly. She is looking to borrow 7472 DM for a new car, with an installment rate of 1%. She has been living in a rented property for the past 2 years and has 1 existing credit at the bank. She is the sole provider for 1 person and has no other debtors/guarantors. Additionally, she has no other installment plans, a real estate property, and is a foreign worker. She does not have a telephone and is categorized as unemployed/unskilled - non-resident.###\nHence this label was Yes."
"This individual has a stable financial profile with no overdue payments on existing credits, a good amount of savings, long-term employment, and a low percentage of disposable income going towards installments. They are a married or widowed male, own real estate, and have one existing credit at the bank. They have a moderate credit amount for a radio/television purchase and have been living at their current residence for a year. Additionally, they have a skilled job, no other debtors or guarantors, no other installment plans, and no telephone. Overall, they seem to be a reliable and responsible credit risk.###\nHence this label was Yes."
"This individual has no checking account and an unknown savings account. They have been employed for 1 to less than 4 years and have a moderate installment rate. The purpose of their credit is for a used car. They are a single male, 46 years old, with no other debtors or guarantors. They own their own home and have two existing credits at their bank. They work in a management role and are responsible for providing maintenance for two people. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with a moderate credit history. They are taking a loan for furniture/equipment, with a substantial credit amount. They have some savings and have been employed for 4-7 years. Their living situation is secure, owning their own home. They are a single male skilled employee, with no other debtors or guarantors. They have been living at their current residence for 2 years and have one existing credit. At 49 years old, they have no other installment plans and no telephone. Overall, they seem financially responsible and reliable.###\nHence this label was No."
"The individual is a 70-year-old unemployed single male with no existing checking account. He has paid back all existing credits promptly and is looking to finance a new car for which he needs a credit amount of 7308 DM. He has savings of less than 100 DM and has been residing in his current residence for 4 years. He has no property, but he has a bank installment plan in place. He lives for free and has a telephone registered under his name. He is a highly qualified employee in a management position and has one existing credit at this bank. He has no other debtors or guarantors and is responsible for providing maintenance for one individual. He is a foreign worker.###\nHence this label was Yes."
"This individual is a 43-year-old divorced/separated male with a stable job as a skilled employee/official. They have been living in their own house for 3 years and have a good credit history, with existing credits paid back duly. The individual has no other debtors or guarantors and has a savings account with less than 100 DM. They have one existing credit at the bank and have been at their current employment for 4-7 years. The purpose of their credit application is for furniture/equipment, and they have a good credit standing with a credit amount of 4057. They have no other installment plans and no other people depending on them for maintenance. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"This individual is a 22-year-old divorced/married female with a stable job and a good credit history. She has a savings account with less than 100 DM. Currently, she has a small credit amount for a radio/television which she intends to pay back with a low installment rate. She owns her own home, has no other debts, and is the sole provider for herself. Additionally, she has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
