"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 96. The patient experiences exercise-induced angina and has a 2.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 69-year-old male patient with non-anginal chest pain, resting blood pressure of 140, serum cholesterol level of 254. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 146 without exercise-induced angina. ST depression of 2.0 was induced by exercise relative to rest, with a flat slope of the peak exercise ST segment. This data suggests a potential risk of heart disease in the patient.###\nHence this label was Yes."
"A 38-year-old male patient with non-anginal chest pain, normal resting blood pressure, no high serum cholesterol levels, normal fasting blood sugar, a normal resting electrocardiogram, a maximum heart rate of 128, experiencing exercise-induced angina. The patient showed no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 51-year-old male patient with no typical chest pain symptoms presents with normal resting blood pressure and cholesterol levels. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 100 bpm. The patient does not experience exercise-induced angina. There is no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 65-year-old male who is asymptomatic, with normal resting blood pressure and no fasting blood sugar above 120 mg/dl. His electrocardiogram results were normal, and he achieved a maximum heart rate of 154. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 1.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"This 57-year-old female patient has no typical chest pain symptoms but has high resting blood pressure and high serum cholesterol levels. The electrocardiogram results suggest probable or definite left ventricular hypertrophy. Despite achieving a high maximum heart rate during exercise, the patient did not experience angina. The exercise-induced ST depression was minimal and the peak exercise ST segment showed an upsloping pattern.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 130, serum cholesterol level of 222, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate of 112, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 56-year-old female patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol level of 219, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 164, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 71-year-old male patient with non-anginal chest pain had a resting blood pressure of 144 and a serum cholesterol level of 221. They had a normal resting electrocardiogram result and achieved a maximum heart rate of 108. The patient experienced exercise-induced angina, with an ST depression of 1.8 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat. Fasting blood sugar was not above 120 mg/dl.###\nHence this label was Yes."
"A 54-year-old female patient with atypical angina visited the clinic. She had normal resting blood pressure and slightly elevated serum cholesterol levels. Fasting blood sugar was below 120 mg/dl. Resting electrocardiogram showed normal results. Her maximum heart rate achieved was 138, with no exercise-induced angina. She experienced 1.0 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 47-year-old male patient has asymptomatic chest pain with a resting blood pressure of 140 and serum cholesterol of 276. Their fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results show normal activity, and the maximum heart rate achieved is 125. The patient experiences exercise-induced angina and has ST depression of 0.0 relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 49-year-old male patient with non-anginal chest pain, normal resting blood pressure, and low serum cholesterol of 142. They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, but they experience exercise-induced angina. Their maximum heart rate achieved is 127, with ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 63-year-old female patient with asymptomatic chest pain, normal resting blood pressure (124), and serum cholesterol level of 197. Fasting blood sugar level is below 120 mg/dl. Resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 136 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 140 during exercise, which induced angina. The patient experienced significant ST depression relative to rest (3.6) and displayed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The 70-year-old male patient presented with asymptomatic chest pain, a resting blood pressure of 140, normal resting electrocardiogram results, and experienced exercise-induced angina. With a maximum heart rate of 157, the patient had a serum cholesterol level of 0 and ST depression of 2.0 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat, and fasting blood sugar was above 120 mg/dl.###\nHence this label was Yes."
"A 54-year-old female patient presents with non-anginal chest pain. She has a resting blood pressure of 135 and a serum cholesterol level of 304. Her fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results show normal findings. She achieved a maximum heart rate of 170 and did not experience exercise-induced angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"This is a 49-year-old male patient with atypical angina chest pain. His resting blood pressure is 100, serum cholesterol is 253, and fasting blood sugar is not above 120 mg/dl. Resting electrocardiogram results are normal, and he achieved a maximum heart rate of 174. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130 and serum cholesterol level of 603. His fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 125 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 58-year-old male who is asymptomatic in terms of chest pain. His resting blood pressure is 110, and his serum cholesterol level is 198. Fasting blood sugar is not greater than 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 110. The patient does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 59-year-old male patient with non-anginal chest pain, normal resting blood pressure (130), high serum cholesterol level (318), normal fasting blood sugar, normal resting electrocardiogram results, moderate maximum heart rate achieved (120), experiencing exercise-induced angina, with a mild ST depression of 1.0 induced by exercise relative to rest, and showing a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 72-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, low serum cholesterol levels of 123, fasting blood sugar above 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. The patient achieved a maximum heart rate of 130 without exercise-induced angina. ST depression induced by exercise relative to rest is 1.5, with a flat slope of the peak exercise ST segment. These factors suggest a possibility of heart disease in the patient.###\nHence this label was Yes."
"A 36-year-old male patient with non-anginal chest pain, normal resting blood pressure (150 mmHg), and healthy serum cholesterol level (160 mg/dl). The patient has a high maximum heart rate of 172 bpm, did not experience exercise-induced angina, and showed no ST depression during exercise. The resting electrocardiogram results were normal, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 52-year-old male patient with asymptomatic chest pain has a resting blood pressure of 128 and serum cholesterol of 204. His fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 156. The patient experiences exercise-induced angina and has a ST depression of 1.0 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 42-year-old male patient without fasting blood sugar > 120 mg/dl, experiencing typical angina chest pain, with a resting blood pressure of 148 and serum cholesterol level of 244. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 178 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.8, with a peak exercise ST segment that slopes upwards.###\nHence this label was No."
"A 39-year-old male patient with no typical chest pain symptoms, normal resting blood pressure and cholesterol levels. Their fasting blood sugar is normal and resting electrocardiogram results are normal as well. The maximum heart rate achieved during exercise is 140, with no exercise-induced angina. There is no ST depression induced by exercise relative to rest and the slope of the peak exercise ST segment is upsloping. Overall, the individual shows no significant indicators of heart disease based on this data.###\nHence this label was No."
"A 50-year-old male patient with asymptomatic chest pain, resting blood pressure of 144, and serum cholesterol level of 349. The patient does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 120 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"The patient is a 70-year-old male with asymptomatic chest pain. His resting blood pressure is 115, serum cholesterol level is normal, and fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 92 during exercise, experienced exercise-induced angina, and had no ST depression. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 42-year-old male patient presented with non-anginal chest pain. His resting blood pressure was 160, while serum cholesterol level was 147. Fasting blood sugar was below 120 mg/dl. Resting electrocardiogram showed normal results. The maximum heart rate achieved was 146, and there was no exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain visited the clinic with a resting blood pressure of 114. His serum cholesterol level was high at 318, but fasting blood sugar was within the normal range. The resting electrocardiogram showed ST-T wave abnormality. Despite achieving a maximum heart rate of 140 during exercise, the patient did not experience angina. However, ST depression of 4.4 was induced by exercise relative to rest, and the slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"A 65-year-old male patient presented with typical angina chest pain. His resting blood pressure was 140, and serum cholesterol level was 252. He did not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram results showed normal activity. The maximum heart rate achieved during exercise was 135, and there was no exercise-induced angina. The ST depression induced by exercise relative to rest was 0.3, with an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 117. The patient experiences exercise-induced angina and has a ST depression of 1.3 induced by exercise relative to rest. The slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"This is a data record of a 72-year-old male patient with non-anginal chest pain. His resting blood pressure is 120 and serum cholesterol level is 214. The resting electrocardiogram shows normal results. He experienced exercise-induced angina and had a maximum heart rate of 102. His ST depression induced by exercise relative to rest is 1.0 and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
