"A 57-year-old male with asymptomatic chest pain has a normal resting blood pressure of 110 mmHg and a serum cholesterol level of 201 mg/dl. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal findings. He achieved a maximum heart rate of 126 bpm during exercise, but experienced angina. ST depression induced by exercise relative to rest is 1.5 mm, and the slope of the peak exercise ST segment is flat. This data suggests a possibility of heart disease.###\nHence this label was No."
"The 52-year-old male patient with typical angina chest pain has normal blood pressure and cholesterol levels. They do not have high fasting blood sugar and show signs of probable or definite left ventricular hypertrophy on resting electrocardiogram. Their maximum heart rate achieved is 190, and they did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure (130), and serum cholesterol levels of 242. They do not have fasting blood sugar > 120 mg/dl, have a normal resting electrocardiogram, and achieved a maximum heart rate of 91. The patient experienced exercise-induced angina and had ST depression of 1.0 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 59-year-old male patient with no typical chest pain symptoms, normal resting blood pressure and low serum cholesterol levels. The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 125 during exercise without experiencing angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 57-year-old male with asymptomatic chest pain. He has high resting blood pressure (160) and fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. He experiences exercise-induced angina and has an ST depression of 2.0. The slope of the peak exercise ST segment is flat. His maximum heart rate achieved is 98.###\nHence this label was Yes."
"A 60-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no fasting blood sugar elevation, normal resting electrocardiogram results, low maximum heart rate of 63, experiencing exercise-induced angina, slight ST depression of 0.5 induced by exercise relative to rest, and a peak exercise ST segment with an upsloping slope.###\nHence this label was Yes."
"Patient is a 49-year-old male who is asymptomatic and has normal resting blood pressure. They have relatively high serum cholesterol but normal fasting blood sugar levels. Resting electrocardiogram results are normal and they achieved a maximum heart rate of 132 without experiencing exercise-induced angina. The patient shows a slight ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"The patient is a 31-year-old male with asymptomatic chest pain. His resting blood pressure is 120, and serum cholesterol is 270. He does not have fasting blood sugar over 120 mg/dl. His resting electrocardiogram results are normal. He achieved a maximum heart rate of 153 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 65-year-old male who is asymptomatic but has probable or definite left ventricular hypertrophy based on resting electrocardiogram results. His resting blood pressure is 110, serum cholesterol level is 248, and fasting blood sugar is not above 120 mg/dl. He achieved a maximum heart rate of 158 during the exercise test and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.6, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 63-year-old male patient with no history of chest pain presented with a resting blood pressure of 140 and serum cholesterol level of 187. The resting electrocardiogram revealed probable or definite left ventricular hypertrophy. Despite reaching a maximum heart rate of 144 during exercise, the patient experienced angina. ST depression of 4.0 was induced by exercise relative to rest, with the slope of the peak exercise ST segment being upsloping.###\nHence this label was Yes."
"A 74-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, a normal resting electrocardiogram, a moderate maximum heart rate achieved, experiencing exercise-induced angina, slight ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old male patient, asymptomatic chest pain, with resting blood pressure of 110 and serum cholesterol of 206. Fasting blood sugar is not above 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 108. The patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 56-year-old male patient with non-anginal chest pain, normal resting blood pressure, slightly elevated serum cholesterol, normal fasting blood sugar level, normal resting electrocardiogram results, achieved a maximum heart rate of 128 during exercise, experienced exercise-induced angina, showed a slight ST depression of 1.0 induced by exercise relative to rest, and had an upsloping peak exercise ST segment. These factors may be indicative of a possible heart disease.###\nHence this label was No."
"A 64-year-old female patient with non-anginal chest pain, normal resting blood pressure (140), and slightly elevated serum cholesterol (313). The patient has a normal resting electrocardiogram, a maximum heart rate of 133, and does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is minimal at 0.2, with the slope of the peak exercise ST segment being upsloping.###\nHence this label was No."
"A 55-year-old female patient with atypical angina chest pain, resting blood pressure of 130, serum cholesterol level of 394, no fasting blood sugar > 120 mg/dl, showing probable or definite left ventricular hypertrophy in resting electrocardiogram results. The patient achieved a maximum heart rate of 150, did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 59-year-old male patient with typical angina chest pain, resting blood pressure of 160, serum cholesterol of 273, no fasting blood sugar over 120 mg/dl, showing probable or definite left ventricular hypertrophy in resting electrocardiogram results. The patient achieved a maximum heart rate of 125, did not experience exercise-induced angina, had no ST depression induced by exercise compared to rest, and displayed an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 40-year-old female patient with no history of chest pain or angina visited the clinic for a routine check-up. Her resting blood pressure was high at 150 mmHg, and serum cholesterol levels were elevated at 392 mg/dl. The electrocardiogram results showed a normal sinus rhythm. Despite reaching a maximum heart rate of 130 beats per minute during exercise, the patient did not experience angina. There was ST depression of 2.0 mm induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat. Overall, the patient's heart health appears to be at risk due to high blood pressure and elevated cholesterol levels.###\nHence this label was Yes."
"A 36-year-old male patient with non-anginal chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, and a high maximum heart rate of 184. The patient did not experience exercise-induced angina, but exhibited a 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 46-year-old male patient with atypical angina chest pain, normal resting blood pressure (140), high serum cholesterol (275), normal fasting blood sugar levels, normal resting electrocardiogram results, achieved a maximum heart rate of 165 during exercise, experienced exercise-induced angina, showed no ST depression induced by exercise relative to rest, and had an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain has a resting blood pressure of 140 and serum cholesterol level of 177. Fasting blood sugar is normal, resting electrocardiogram shows normal results, and the maximum heart rate achieved is 162. The patient experiences exercise-induced angina, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 64-year-old male patient with asymptomatic chest pain, resting blood pressure of 150, serum cholesterol level of 193, normal fasting blood sugar, ST-T wave abnormality shown on resting electrocardiogram, maximum heart rate achieved at 135, experiencing exercise-induced angina, with 0.5 ST depression caused by exercise relative to rest, and a flat slope of the peak exercise ST segment. This data suggests a potential risk of heart disease in the patient.###\nHence this label was Yes."
"The patient is a 67-year-old male who is asymptomatic with regards to chest pain. His resting blood pressure is 140 and serum cholesterol levels are 219. He does not have fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 122 and experienced exercise-induced angina. His ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no high serum cholesterol. He has a normal resting electrocardiogram, achieved a maximum heart rate of 105, and experienced exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"A 59-year-old male patient with non-anginal chest pain has normal resting blood pressure and high serum cholesterol levels. They do not have fasting blood sugar over 120 mg/dl. The patient has a normal resting electrocardiogram and achieved a maximum heart rate of 120. They experienced exercise-induced angina and had 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"The patient is a 77-year-old male who is asymptomatic but shows ST-T wave abnormality on resting electrocardiogram. He has a resting blood pressure of 124 and serum cholesterol level of 171. Although he does not have fasting blood sugar above 120 mg/dl, he experiences exercise-induced angina. His maximum heart rate achieved is 110, and he has a ST depression of 2.0 induced by exercise relative to rest with an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. She has a normal resting electrocardiogram and achieved a maximum heart rate of 131 during exercise, without experiencing angina. There was a slight ST depression of 0.6 induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat. Fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 55-year-old male with atypical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. He has normal fasting blood sugar levels and a normal resting electrocardiogram. His maximum heart rate achieved is 155, and he did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 49-year-old male patient with non-anginal chest pain has normal resting blood pressure and slightly elevated serum cholesterol. They have a high maximum heart rate of 175 and did not experience exercise-induced angina. The ST segment depression induced by exercise relative to rest is 0.0, indicating a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with non-anginal chest pain, normal resting blood pressure (150), and serum cholesterol (168). Fasting blood sugar is below 120 mg/dl, and resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 174 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.6, with a peak exercise ST segment slope that is upsloping.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 130, serum cholesterol level of 203, fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 98, no exercise-induced angina, ST depression of 1.5 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. The data suggests a moderate risk for heart disease.###\nHence this label was Yes."
"A 51-year-old female patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar levels, a normal resting electrocardiogram, a maximum heart rate of 142, experiencing exercise-induced angina, with ST depression of 1.2, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 50-year-old male patient with asymptomatic chest pain, resting blood pressure of 145, normal fasting blood sugar (>120 mg/dl), normal resting electrocardiogram results, maximum heart rate achieved at 139, experiencing exercise-induced angina, ST depression of 0.7 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 132, high serum cholesterol of 353, normal fasting blood sugar levels, normal resting electrocardiogram results, maximum heart rate achieved at 132, experiencing exercise-induced angina, with ST depression of 1.2 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 59-year-old male patient with no history of chest pain, normal resting blood pressure, and cholesterol levels, normal fasting blood sugar levels, and a normal electrocardiogram. The patient experienced exercise-induced angina and had a moderate ST depression of 1.3 during exercise. The slope of the peak exercise ST segment was downsloping. The patient achieved a maximum heart rate of 117.###\nHence this label was Yes."
"A 36-year-old male patient with non-anginal chest pain, normal resting blood pressure of 130, serum cholesterol level of 209, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 178, no exercise-induced angina, no ST depression post-exercise, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. Fasting blood sugar is normal. Resting electrocardiogram shows normal results. The patient experiences exercise-induced angina but achieves a maximum heart rate of 110. ST depression induced by exercise relative to rest is 0.5, with a flat slope of the peak exercise ST segment. These factors suggest a possible presence of heart disease.###\nHence this label was No."
"A 47-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, serum cholesterol level of 276, fasting blood sugar higher than 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 125, experiencing exercise-induced angina, with no ST depression induced by exercise relative to rest, and a peak exercise ST segment that is upsloping.###\nHence this label was No."
"A 34-year-old male patient with typical angina chest pain has a resting blood pressure of 118 and serum cholesterol level of 182. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 174 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 74-year-old male patient with atypical angina chest pain, resting blood pressure of 145, normal serum cholesterol level, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 123, no exercise-induced angina, 1.3 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old female patient with atypical angina chest pain, resting blood pressure of 136, high serum cholesterol of 319, fasting blood sugar above 120 mg/dl, showing probable or definite left ventricular hypertrophy in resting electrocardiogram results. She achieved a maximum heart rate of 152 without exercise-induced angina. Her ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"The patient is a 69-year-old male with non-anginal chest pain. His resting blood pressure is 140, and he has a fasting blood sugar level over 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 118 and did not experience exercise-induced angina. His ST depression induced by exercise relative to rest is 2.5, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"The patient is a 62-year-old male with non-anginal chest pain. His resting blood pressure is 138, and serum cholesterol is 204. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 122 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 52-year-old male with atypical angina chest pain. His resting blood pressure is 120, and serum cholesterol is 284. He does not have fasting blood sugar above 120 mg/dl. His resting electrocardiogram is normal. He achieved a maximum heart rate of 118 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 45-year-old female patient with no symptoms of chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, a high maximum heart rate achieved, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 41-year-old male patient with no chest pain, normal resting blood pressure and cholesterol levels. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 142 during exercise. There was no exercise-induced angina, and no ST depression was observed post-exercise. The slope of the peak exercise ST segment was upsloping. These factors indicate a relatively low risk of heart disease in this individual.###\nHence this label was No."
"This is a profile of a 53-year-old male with atypical angina chest pain. His resting blood pressure is 140, serum cholesterol is 320, and fasting blood sugar is normal. Resting electrocardiogram results are normal, with a maximum heart rate of 162. He does not experience exercise-induced angina, and the ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 60-year-old female patient with non-anginal chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, high maximum heart rate achieved, no exercise-induced angina, no ST depression induced by exercise, and an upsloping slope of the peak exercise ST segment. This patient may have possible heart disease based on these factors.###\nHence this label was No."
"The patient is a 61-year-old male who is currently experiencing no chest pain but has high resting blood pressure and moderately high cholesterol levels. The electrocardiogram results are normal, but the patient experiences exercise-induced angina. Despite this, the patient achieved a relatively high maximum heart rate during peak exercise. The ST depression induced by exercise relative to rest is significant at 3.0, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 51-year-old male patient with asymptomatic chest pain has a resting blood pressure of 132 and serum cholesterol level of 218. Fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 139 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.1, with a peak exercise ST segment slope that is upsloping.###\nHence this label was No."
"A 52-year-old female patient with atypical angina presents with normal resting blood pressure (140) and serum cholesterol levels (225). The fasting blood sugar level is below 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 140. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 57-year-old female patient with atypical angina chest pain, normal blood pressure, and slightly elevated serum cholesterol level. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 174 during exercise without experiencing angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat. No fasting blood sugar level above 120 mg/dl was recorded.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar issue. Resting electrocardiogram shows ST-T wave abnormality. The patient experiences exercise-induced angina and has a maximum heart rate of 100. ST depression induced by exercise relative to rest is -1.0, with a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 58-year-old male with asymptomatic chest pain. His resting blood pressure is 160 and serum cholesterol level is 256. He has fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 113. He experiences exercise-induced angina. ST depression induced by exercise relative to rest is 1.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"The patient is a 58-year-old male with non-anginal chest pain. His resting blood pressure is 130, with a serum cholesterol level of 213. Fasting blood sugar is normal. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 140, and the patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. He does not have high fasting blood sugar. The resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 140, experienced exercise-induced angina, and had ST depression of 3.0 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 74-year-old male patient with non-anginal chest pain, resting blood pressure of 140, serum cholesterol level of 237, fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 94, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain had a normal resting blood pressure of 100 and serum cholesterol level of 213. They had no fasting blood sugar above 120 mg/dl and showed ST-T wave abnormality on resting electrocardiogram. With a maximum heart rate of 110, the patient did not experience exercise-induced angina. They showed no ST depression induced by exercise and had an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 41-year-old female patient with non-anginal chest pain, resting blood pressure of 112, serum cholesterol level of 268. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 172. Patient experiences exercise-induced angina, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The 56-year-old female patient has atypical angina chest pain. Her resting blood pressure is 140, with a serum cholesterol level of 294. She does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. Her maximum heart rate achieved is 153, and she does not experience exercise-induced angina. She has ST depression of 1.3 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 64-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and no serum cholesterol. She has a fasting blood sugar level above 120 mg/dl. Resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 145 without experiencing exercise-induced angina. She had a ST depression of 1.1 induced by exercise relative to rest, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"The patient is a 63-year-old female. She experiences non-anginal chest pain. Her resting blood pressure is 135, and her serum cholesterol level is 252. She does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. Her maximum heart rate achieved is 172, and she does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar elevation. Resting electrocardiogram results are normal, with a maximum heart rate of 115. The patient experiences exercise-induced angina and has a ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 47-year-old male who experiences non-anginal chest pain. \nHis resting blood pressure is 110, with a serum cholesterol level of 0. \nHe has high fasting blood sugar (>120 mg/dl) and normal resting electrocardiogram results. \nHis maximum heart rate achieved is 120 and he experiences exercise-induced angina. \nThere is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 52-year-old male patient with asymptomatic chest pain, normal resting blood pressure (160), high serum cholesterol level (331), normal fasting blood sugar level, normal resting electrocardiogram results, a maximum heart rate of 94, experiencing exercise-induced angina, with ST depression of 2.5 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 28-year-old male patient with atypical angina chest pain and resting blood pressure of 130. His serum cholesterol level is 132. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 185 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 61-year-old male patient with typical angina chest pain, elevated resting blood pressure of 142, normal serum cholesterol of 200, fasting blood sugar > 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. He achieved a maximum heart rate of 100 without exercise-induced angina. The patient exhibited ST depression of 1.5 induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment. These factors may indicate a potential heart disease risk.###\nHence this label was Yes."
"A 43-year-old female patient with atypical angina chest pain has a resting blood pressure of 120 and serum cholesterol level of 215. They have a normal fasting blood sugar level, but their resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 175 and did not experience exercise-induced angina. Their ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment slopes upwards.###\nHence this label was No."
"A 33-year-old male patient with non-anginal chest pain, normal resting blood pressure of 120, high serum cholesterol of 298, normal fasting blood sugar levels, normal resting electrocardiogram results, high maximum heart rate achieved at 185, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 38-year-old male patient with asymptomatic chest pain has normal resting blood pressure and low serum cholesterol levels. They have a normal resting electrocardiogram with a maximum heart rate of 134. The patient experiences exercise-induced angina and has a ST depression of 2.5. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure (110), slightly high serum cholesterol (239), normal fasting blood sugar levels, normal resting electrocardiogram results, a maximum heart rate of 126, experiencing exercise-induced angina, with ST depression of 2.8 relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 46-year-old female patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 90. The patient did not experience exercise-induced angina and showed no ST depression during exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, and serum cholesterol level of 311. The patient has fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, and experienced exercise-induced angina. The maximum heart rate achieved was 148, with ST depression of 2.0 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat. This information suggests a potential risk of heart disease for the patient.###\nHence this label was Yes."
"A 44-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120, and serum cholesterol level of 184. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 142. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 50-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar elevation. Resting electrocardiogram results are normal, with a maximum heart rate of 120. The patient experiences exercise-induced angina and has a ST depression of 0.5. The slope of the peak exercise ST segment is flat. These factors suggest a potential risk of heart disease.###\nHence this label was Yes."
"A 62-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol levels. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 99. The patient experiences exercise-induced angina and has ST depression of 1.8 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 44-year-old female patient with no chest pain, normal blood pressure, slightly elevated cholesterol levels, normal fasting blood sugar, showing ST-T wave abnormality on resting electrocardiogram. She achieved a maximum heart rate of 115 with no exercise-induced angina. ST depression relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 41-year-old asymptomatic male patient with normal resting blood pressure and serum cholesterol levels. Resting electrocardiogram results were also normal. The maximum heart rate achieved was 128, and the patient experienced exercise-induced angina. There was a 1.5 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment. Fasting blood sugar was not above 120 mg/dl.###\nHence this label was No."
"This data belongs to a 64-year-old male with typical angina chest pain. His resting blood pressure is 110, serum cholesterol level is 211, and fasting blood sugar is below 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 144 during exercise, experienced exercise-induced angina, and had ST depression of 1.8 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was No."
"The patient is a 64-year-old male with typical angina chest pain. His resting blood pressure is high at 170, while his serum cholesterol level is slightly elevated at 227. He does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram indicates probable or definite left ventricular hypertrophy. Despite achieving a maximum heart rate of 155 during exercise, he did not experience exercise-induced angina. He displayed a minor ST depression of 0.6 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"This is a 52-year-old female patient with atypical angina chest pain. Her resting blood pressure is 120, serum cholesterol is 210, and fasting blood sugar is normal. Resting electrocardiogram results show normal activity. She achieved a maximum heart rate of 148 without exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old female patient with atypical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. She does not have fasting blood sugar over 120 mg/dl and shows a normal resting electrocardiogram. Her maximum heart rate achieved during exercise is 138, and she does not experience exercise-induced angina. There is a 1.0 ST depression induced by exercise relative to rest, with the peak exercise ST segment showing an upsloping pattern.###\nHence this label was No."
"A 29-year-old male patient with atypical angina experiences normal resting blood pressure and cholesterol levels. Their fasting blood sugar is less than 120 mg/dl. Resting electrocardiogram results are normal, and they achieved a maximum heart rate of 170 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 59-year-old male patient with typical angina chest pain, resting blood pressure of 178, serum cholesterol level of 270, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 145, no exercise-induced angina, ST depression of 4.2 induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment. These factors suggest a potential risk of heart disease in this individual.###\nHence this label was No."
"A 39-year-old female patient with non-anginal chest pain, normal resting blood pressure of 138, serum cholesterol level of 220. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved at 152. The patient does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 62-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 135, serum cholesterol level of 297, and a maximum heart rate of 130. The patient experiences exercise-induced angina, with 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat, and fasting blood sugar is below 120 mg/dl.###\nHence this label was Yes."
"A 52-year-old male patient with non-anginal chest pain, resting blood pressure of 172, serum cholesterol of 199, fasting blood sugar over 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 162, no exercise-induced angina, ST depression of 0.5 induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment. These factors suggest a comprehensive profile for predicting heart disease risk in the patient.###\nHence this label was No."
"The patient is a 68-year-old male who experiences typical angina chest pain. His resting blood pressure is 139 and serum cholesterol is 181. He has fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 135, and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 84. The patient experiences exercise-induced angina and has a ST depression of 2.5 relative to rest. The slope of the peak exercise ST segment is downsloping. These factors indicate a potential risk for heart disease.###\nHence this label was Yes."
"A 54-year-old male patient with atypical angina presented with normal resting blood pressure and slightly elevated serum cholesterol of 246. Fasting blood sugar was normal. Resting electrocardiogram results were normal, and the maximum heart rate achieved was 110. The patient did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 63-year-old male with asymptomatic chest pain. He has a resting blood pressure of 150 and fasting blood sugar level higher than 120 mg/dl. His resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 154 and did not experience exercise-induced angina. He had ST depression of 3.7 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 41-year-old male patient with atypical angina chest pain has normal resting blood pressure and serum cholesterol levels. They have a fasting blood sugar level lower than 120 mg/dl and a normal resting electrocardiogram. The patient achieved a maximum heart rate of 182 without experiencing exercise-induced angina. Their ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 60-year-old male patient with non-anginal chest pain had a resting blood pressure of 120 and normal electrocardiogram results. His fasting blood sugar was above 120 mg/dl. He experienced exercise-induced angina and had an ST depression of 2.0 during exercise relative to rest. The peak exercise ST segment showed an upsloping slope, and his maximum heart rate achieved was 141.###\nHence this label was Yes."
"A 72-year-old male patient with asymptomatic chest pain, normal resting blood pressure (143), and serum cholesterol levels (211). His fasting blood sugar is normal, but he experiences exercise-induced angina. Despite a slightly elevated ST depression (1.4), the slope of the peak exercise ST segment remains flat. The patient achieved a maximum heart rate of 109 during the test.###\nHence this label was Yes."
"The patient is a 66-year-old male with atypical angina chest pain. His resting blood pressure is 160 and serum cholesterol is 246. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal. He achieved a maximum heart rate of 120 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 38-year-old male who is asymptomatic but experiences exercise-induced angina. His resting blood pressure is 110, serum cholesterol level is 190, and fasting blood sugar is not high. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 150 during exercise. ST depression induced by exercise relative to rest is 1.0 and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 61-year-old male patient with atypical angina, normal resting blood pressure, and slightly elevated serum cholesterol levels. Fasting blood sugar is normal. Resting electrocardiogram shows a normal pattern. The patient achieved a maximum heart rate of 135 with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.3, and the slope of the peak exercise ST segment is upsloping. These factors suggest a moderately increased risk of heart disease.###\nHence this label was No."
"A 46-year-old female patient with non-anginal chest pain, resting blood pressure of 142, and serum cholesterol of 177. The patient does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. The maximum heart rate achieved is 160, and the patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 1.4, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was No."
"A 40-year-old male patient with non-anginal chest pain, normal resting blood pressure and high cholesterol levels. Their fasting blood sugar is normal, and the resting electrocardiogram results are normal as well. The patient achieved a maximum heart rate of 80 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 61-year-old male patient with non-anginal chest pain, high resting blood pressure of 200, normal serum cholesterol level, fasting blood sugar above 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, a relatively low maximum heart rate of 70, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 46-year-old female patient with atypical angina, normal resting blood pressure, serum cholesterol of 204, normal fasting blood sugar levels, normal resting electrocardiogram results, achieved a maximum heart rate of 172 without exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 62-year-old male patient with atypical angina chest pain, normal resting blood pressure, and no fasting blood sugar above 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 130. The patient did not experience exercise-induced angina and had a slight ST depression of 0.1 relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old female patient with atypical angina chest pain, normal resting blood pressure of 150, serum cholesterol level of 230, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram, maximum heart rate of 130, no exercise-induced angina, ST depression of 0.0 during exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 30-year-old female patient with typical angina chest pain, resting blood pressure of 170, serum cholesterol of 237, normal fasting blood sugar levels, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved of 170, no exercise-induced angina, no ST depression induced by exercise, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 40-year-old male patient with asymptomatic chest pain has a resting blood pressure of 120 and a serum cholesterol level of 466. The patient has fasting blood sugar greater than 120 mg/dl and a normal resting electrocardiogram. They achieved a maximum heart rate of 152 and experienced exercise-induced angina. The patient had ST depression of 1.0 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 63-year-old female patient with asymptomatic chest pain, normal resting blood pressure (124), and serum cholesterol levels at 197. She does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram results are normal, and her maximum heart rate achieved is 136. She experiences exercise-induced angina, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 49-year-old male patient with non-anginal chest pain, normal resting blood pressure and low serum cholesterol level. The patient does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 127 bpm. The patient experiences exercise-induced angina and has an ST depression of 1.5 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 46-year-old male patient with no history of chest pain visited the clinic. His resting blood pressure was 110, and serum cholesterol level was 202. The resting electrocardiogram results showed normal activity. The patient achieved a maximum heart rate of 150 during exercise, but experienced angina symptoms. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 54-year-old male patient with non-anginal chest pain had a resting blood pressure of 133 and serum cholesterol level of 203. Results from resting electrocardiogram showed ST-T wave abnormality. The patient achieved a maximum heart rate of 137 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.2, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 70-year-old asymptomatic male patient with resting blood pressure of 170 and serum cholesterol of 192. The patient has no fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 129 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 3.0, with a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain had a resting blood pressure of 155 and a serum cholesterol level of 342. His fasting blood sugar was above 120 mg/dl. Resting electrocardiogram results were normal, and he achieved a maximum heart rate of 150 during exercise. The patient experienced exercise-induced angina and had ST depression of 3.0 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 48-year-old male patient with asymptomatic chest pain, resting blood pressure of 124, serum cholesterol level of 274, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 166, no exercise-induced angina, 0.5 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The 48-year-old male patient has no chest pain symptoms but has probable or definite left ventricular hypertrophy. His blood pressure is 130 and serum cholesterol is 256. He has a fasting blood sugar level above 120 mg/dl. Despite experiencing exercise-induced angina, his maximum heart rate achieved is 150. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 48-year-old female patient with atypical angina chest pain, resting blood pressure of 120, serum cholesterol of 177, fasting blood sugar above 120 mg/dl, ST-T wave abnormality on rest electrocardiogram, maximum heart rate achieved at 148, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 69-year-old male patient with asymptomatic chest pain, normal serum cholesterol levels, and resting blood pressure of 137. The patient does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. Maximum heart rate achieved is 104. The patient experiences exercise-induced angina and has ST depression of 1.6 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"This is a 56-year-old male patient with asymptomatic chest pain. His resting blood pressure is 132 and serum cholesterol level is 184. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 105 during exercise, experienced exercise-induced angina, and had ST depression of 2.1 relative to rest. The slope of his peak exercise ST segment is flat.###\nHence this label was Yes."
"A 50-year-old male patient with atypical angina chest pain, resting blood pressure of 170, serum cholesterol level of 209, normal fasting blood sugar, ST-T wave abnormality in electrocardiogram results, achieved maximum heart rate of 116, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 43-year-old male patient with no chest pain, normal resting blood pressure, and cholesterol levels. The resting electrocardiogram results are normal. He achieved a maximum heart rate of 120 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.5, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"The patient is a 34-year-old male with asymptomatic chest pain. His resting blood pressure is 115 and serum cholesterol level is 0. He has fasting blood sugar > 120 mg/dl. Resting electrocardiogram results show normal findings. The maximum heart rate achieved is 154, and he does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 56-year-old male patient with atypical angina chest pain has a resting blood pressure of 124 and serum cholesterol level of 224. Their fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results show to be normal, with a maximum heart rate achieved at 161. The patient does not experience exercise-induced angina. They have ST depression of 2.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 69-year-old male with asymptomatic chest pain has normal resting blood pressure and low serum cholesterol levels. He has high fasting blood sugar, a normal resting electrocardiogram, and achieved a maximum heart rate of 109. He experienced exercise-induced angina and had 1.5 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 48-year-old female patient with non-anginal chest pain, normal resting blood pressure (120), and serum cholesterol level (195). Fasting blood sugar is normal, and resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 125 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 45-year-old male patient with typical angina chest pain has normal resting blood pressure (110) and elevated serum cholesterol (264). They have fasting blood sugar below 120 mg/dl and normal resting electrocardiogram results. The patient achieved a maximum heart rate of 132 without experiencing exercise-induced angina. They had a ST depression of 1.2 induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The 59-year-old male patient has asymptomatic chest pain, with a resting blood pressure of 164 and serum cholesterol level of 176. They have high fasting blood sugar (>120 mg/dl) and probable or definite left ventricular hypertrophy shown in resting electrocardiogram results. The patient achieved a maximum heart rate of 90, did not experience exercise-induced angina, and showed 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol, no fasting blood sugar above 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, achieved a maximum heart rate of 131 during exercise, experienced exercise-induced angina, ST depression of 2.2 relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 48-year-old female patient with non-anginal chest pain, normal resting blood pressure of 130, serum cholesterol level of 275, fasting blood sugar below 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 139. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.2, and the peak exercise ST segment shows an upsloping pattern.###\nHence this label was No."
"The patient is a 32-year-old male with an asymptomatic chest pain type. His resting blood pressure is 118, and serum cholesterol is high at 529. Fasting blood sugar is normal. Resting electrocardiogram results show normal activity. The maximum heart rate achieved is 130, and there is no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 40-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. They have a fasting blood sugar level below 120 mg/dl and a normal resting electrocardiogram. The patient achieved a maximum heart rate of 188 without exercise-induced angina. Additionally, they had no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 63-year-old male presenting with asymptomatic chest pain. His resting blood pressure is 140, and he has fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 149, and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 53-year-old male with non-anginal chest pain has normal resting blood pressure and cholesterol levels. He does not have fasting blood sugar levels above 120 mg/dl. His resting electrocardiogram results are normal, and he achieved a maximum heart rate of 140 during exercise without experiencing angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 115. The patient experiences exercise-induced angina but has no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat. These factors suggest a possible risk of heart disease in this individual.###\nHence this label was Yes."
"A 56-year-old male patient with no history of chest pain or fasting blood sugar > 120 mg/dl was found to have an asymptomatic heart condition. His resting blood pressure was 120, with a serum cholesterol level of 0. The resting electrocardiogram revealed an ST-T wave abnormality. The patient achieved a maximum heart rate of 148, did not experience exercise-induced angina, and showed no ST depression induced by exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 56-year-old female patient with asymptomatic chest pain, high resting blood pressure (200), elevated serum cholesterol (288), fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram. She achieved a maximum heart rate of 133, experienced exercise-induced angina, with 4.0 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment. These factors may indicate a risk of heart disease that should be further evaluated and monitored.###\nHence this label was Yes."
"A 38-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. He has a normal resting electrocardiogram and achieved a maximum heart rate of 170 during exercise without experiencing angina. There was no ST depression observed post-exercise, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 61-year-old female patient with atypical angina chest pain, resting blood pressure of 140, high serum cholesterol level of 298, fasting blood sugar over 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 120, experienced exercise-induced angina, no ST depression induced by exercise relative to rest, and a peak exercise ST segment showing upsloping. This data suggests a potential risk for heart disease.###\nHence this label was No."
"The patient is a 57-year-old male with asymptomatic chest pain. His resting blood pressure is 110 and serum cholesterol is 335. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. He achieved a maximum heart rate of 143 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 3.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 56-year-old male presenting with asymptomatic chest pain. Resting blood pressure is high at 150, with normal serum cholesterol levels. Fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results appear normal. Maximum heart rate achieved is 125, with exercise-induced angina present. ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 40-year-old male patient, experiencing typical angina chest pain, with normal resting blood pressure and cholesterol levels. Resting electrocardiogram results were normal with a maximum heart rate of 178. The patient experienced exercise-induced angina and had a 1.4 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping. Fasting blood sugar was not above 120 mg/dl.###\nHence this label was No."
"A 56-year-old female patient with asymptomatic chest pain, resting blood pressure of 134, serum cholesterol of 409, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, maximum heart rate achieved at 150, exercise-induced angina present, ST depression of 1.9 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. These factors suggest a possibility of heart disease and may require further evaluation and monitoring.###\nHence this label was Yes."
"A 44-year-old male patient with atypical angina chest pain, resting blood pressure of 130, serum cholesterol level of 219, no fasting blood sugar over 120 mg/dl, and probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 188, did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The peak exercise ST segment showed an upsloping pattern.###\nHence this label was No."
"A 66-year-old male patient with asymptomatic chest pain, normal fasting blood sugar levels, and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. Resting blood pressure is 160 and serum cholesterol is 228. The patient achieved a maximum heart rate of 138, did not experience exercise-induced angina, and showed ST depression of 2.3 induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 51-year-old male who is asymptomatic. His resting blood pressure is high at 140 mmHg, while his serum cholesterol level is normal. He does not have fasting blood sugar greater than 120 mg/dl. The resting electrocardiogram results show a normal reading. The patient's maximum heart rate achieved is low at 60 bpm, and he does not experience exercise-induced angina. There is no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old female with atypical angina visited the clinic. Her resting blood pressure was high at 180, and she had elevated serum cholesterol levels of 393. She did not have fasting blood sugar over 120 mg/dl. Her resting electrocardiogram showed normal results, but she experienced exercise-induced angina. Her maximum heart rate achieved was 110, and she had ST depression of 1.0 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat. These factors suggest a potential risk of heart disease.###\nHence this label was Yes."
"A 62-year-old female patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol of 164, no fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. She achieved a maximum heart rate of 145 without exercise-induced angina. The patient had an ST depression of 6.2 induced by exercise relative to rest, and the slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"A 44-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 263, normal fasting blood sugar level, normal resting electrocardiogram results, maximum heart rate achieved at 173, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 48-year-old male patient with non-anginal chest pain, resting blood pressure of 132, serum cholesterol level of 220, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved of 162, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 43-year-old female patient with asymptomatic chest pain has a resting blood pressure of 132 and high serum cholesterol of 341. Their fasting blood sugar level is above 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. Despite reaching a maximum heart rate of 136 during exercise, the patient experienced angina. They also exhibited significant ST depression of 3.0 induced by exercise compared to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 41-year-old female patient with atypical angina chest pain, normal resting blood pressure of 130, serum cholesterol level of 245, no fasting blood sugar over 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 150, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 38-year-old male patient with non-anginal chest pain, normal resting blood pressure, no fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, a maximum heart rate of 128, experiencing exercise-induced angina. The patient has no serum cholesterol, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 59-year-old male patient with typical angina chest pain, a resting blood pressure of 170, and a serum cholesterol level of 288. The patient does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 159 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.2, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 66-year-old female patient presented with typical angina chest pain, normal resting blood pressure at 150, and slightly elevated serum cholesterol at 226. They had a normal resting electrocardiogram, achieved a maximum heart rate of 114, and did not experience exercise-induced angina. Their ST depression induced by exercise relative to rest was 2.6, and the slope of the peak exercise ST segment was downsloping.###\nHence this label was No."
"A 61-year-old male patient with typical angina chest pain has normal resting blood pressure and cholesterol levels. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and their maximum heart rate achieved is 145. The patient did not experience exercise-induced angina. They showed ST depression of 2.6 mm induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 64-year-old female patient with asymptomatic chest pain has a normal resting blood pressure of 130 and serum cholesterol level of 303. She does not have fasting blood sugar over 120 mg/dl and her resting electrocardiogram results are normal. Her maximum heart rate achieved is 122 and she did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 2.0 and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol level of 207, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 96, experienced exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 57-year-old female patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol levels. She does not have fasting blood sugar over 120 mg/dl and has a normal resting electrocardiogram. Her maximum heart rate achieved is 163, and she experiences exercise-induced angina. She has a slight ST depression induced by exercise relative to rest and a peak exercise ST segment that is upsloping.###\nHence this label was No."
"A 67-year-old male patient with asymptomatic chest pain, resting blood pressure of 120, serum cholesterol of 229, no fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved was 129. The patient experienced exercise-induced angina, with ST depression of 2.6 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 65-year-old male who is asymptomatic but has probable or definite left ventricular hypertrophy. His resting blood pressure is 144 and serum cholesterol level is 312. He experiences exercise-induced angina, with a maximum heart rate of 113. During exercise, he had ST depression of 1.7 relative to rest, and the slope of his peak exercise ST segment is flat. He does not have fasting blood sugar levels above 120 mg/dl.###\nHence this label was Yes."
"A 37-year-old male patient with non-anginal chest pain, normal fasting blood sugar levels, and probable or definite left ventricular hypertrophy on resting electrocardiogram. Resting blood pressure is 118, serum cholesterol is 240, maximum heart rate achieved is 165. The patient does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.0, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 37-year-old male with atypical angina chest pain. His resting blood pressure is 130 and serum cholesterol level is 283. He does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 98 and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 65-year-old female patient with non-anginal chest pain, normal resting blood pressure and cholesterol levels. She has fasting blood sugar below 120 mg/dl and a normal resting electrocardiogram. Her maximum heart rate achieved is 148, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.8, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 65-year-old male with asymptomatic chest pain. He has a resting blood pressure of 140 and a serum cholesterol level of 306. His fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 87 and experienced exercise-induced angina. He has an ST depression of 1.5 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 57-year-old male patient with no history of chest pain, normal blood pressure, low cholesterol levels, normal fasting blood sugar, and a healthy resting electrocardiogram. He achieved a maximum heart rate of 115 during exercise, experienced angina, and had a slight ST depression after exercise. The peak exercise ST segment showed a flat slope.###\nHence this label was Yes."
"A 43-year-old male patient with typical angina chest pain, has a resting blood pressure of 120 and serum cholesterol of 291. They have no fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 155 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 49-year-old male patient with asymptomatic chest pain, normal resting blood pressure (130), high serum cholesterol (341), normal fasting blood sugar levels, normal resting electrocardiogram results, achieved a maximum heart rate of 120 during exercise. The patient experienced exercise-induced angina, with 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. Resting electrocardiogram results are normal, with a maximum heart rate of 130 achieved during exercise. The patient experiences exercise-induced angina and has ST depression of 3.0 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 38-year-old female patient with asymptomatic chest pain, normal resting blood pressure of 105, fasting blood sugar greater than 120 mg/dl, normal electrocardiogram results, and a high maximum heart rate of 166. The patient does not experience exercise-induced angina and has a 2.8 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 42-year-old male patient with non-anginal chest pain has normal resting blood pressure (120) and slightly elevated serum cholesterol (240). The patient has fasting blood sugar > 120 mg/dl, a high maximum heart rate (194), and does not experience exercise-induced angina. There is a slight ST depression (0.8) induced by exercise relative to rest, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was No."
"A 50-year-old female patient with asymptomatic chest pain, high blood pressure (160), normal resting electrocardiogram, and fasting blood sugar above 120 mg/dl. She achieved a maximum heart rate of 110, did not experience exercise-induced angina, and had no ST depression induced by exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 62-year-old male patient with asymptomatic chest pain, high resting blood pressure (160), elevated serum cholesterol levels (254), abnormal resting electrocardiogram (ST-T wave abnormality), moderate maximum heart rate achieved (108), experienced exercise-induced angina, significant ST depression of 3.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. The patient also has high fasting blood sugar (>120 mg/dl).###\nHence this label was Yes."
"A 67-year-old male patient with typical angina chest pain has a resting blood pressure of 142 and a serum cholesterol level of 270. Their fasting blood sugar is high (>120 mg/dl), but their resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 125 and did not experience exercise-induced angina. They exhibited ST depression of 2.5 induced by exercise relative to rest, with a peak exercise ST segment showing upsloping. This data suggests a potential risk for heart disease and warrants further investigation.###\nHence this label was Yes."
"The patient is a 52-year-old male with asymptomatic chest pain. He has normal resting blood pressure and cholesterol levels. His fasting blood sugar is above 120 mg/dl. The resting electrocardiogram results are normal. He achieved a maximum heart rate of 128 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 53-year-old male patient, presenting with asymptomatic chest pain, normal resting blood pressure, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, maximum heart rate achieved is 120. The patient denies experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old female patient with normal resting blood pressure and serum cholesterol levels. She experiences non-anginal chest pain and has a normal resting electrocardiogram result. Her maximum heart rate achieved is 156, and she does not have fasting blood sugar higher than 120 mg/dl. She does not have exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0 and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 29-year-old male patient with atypical angina reported a resting blood pressure of 120 and serum cholesterol of 243. They had normal resting electrocardiogram results and achieved a maximum heart rate of 160 during exercise. The patient did not experience fasting blood sugar > 120 mg/dl or exercise-induced angina. Additionally, their ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A male patient aged 53 presented with asymptomatic chest pain. His resting blood pressure is 140, serum cholesterol is 243, and fasting blood sugar is normal. Resting electrocardiogram results show normal activity. He achieved a maximum heart rate of 155 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain has a resting blood pressure of 139 and a serum cholesterol level of 277. His fasting blood sugar is above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 118 and experienced exercise-induced angina. The patient had ST depression of 1.9 induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 42-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal electrocardiogram results, a maximum heart rate of 128, experiencing exercise-induced angina, with ST depression induced by exercise relative to rest at -1.5, and a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, high blood pressure, normal resting electrocardiogram, fasting blood sugar above 120 mg/dl, and a maximum heart rate of 150. The patient did not experience exercise-induced angina, but showed ST depression of 1.5 post-exercise, with a flat slope on the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. No fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. Maximum heart rate achieved is 122, with no exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 48-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol of 193, normal resting electrocardiogram results, reaching a maximum heart rate of 102. The patient experiences exercise-induced angina, with ST depression of 3.0 relative to rest, and a flat slope of the peak exercise ST segment. Fasting blood sugar is below 120 mg/dl.###\nHence this label was Yes."
"A 51-year-old female patient with asymptomatic chest pain, resting blood pressure of 114, high serum cholesterol levels of 258, and fasting blood sugar above 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 96 without experiencing exercise-induced angina. There was ST depression of 1.0 induced by exercise relative to rest, and the peak exercise ST segment slope was upsloping.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, normal resting electrocardiogram results, maximum heart rate achieved at 149, no exercise-induced angina, ST depression of 0.4, flat slope of the peak exercise ST segment, and fasting blood sugar > 120 mg/dl.###\nHence this label was Yes."
"A 48-year-old female patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. They have no fasting blood sugar issues and show ST-T wave abnormality on resting electrocardiogram. Their maximum heart rate achieved is 110, and they do not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, with a upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 67-year-old male with non-anginal chest pain. His resting blood pressure is 152 and serum cholesterol is 212. He does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 150 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.8, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"This is a 39-year-old male patient with asymptomatic chest pain. His resting blood pressure is 110, serum cholesterol is 273. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 132 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 48-year-old asymptomatic female patient with normal resting blood pressure and serum cholesterol levels. She does not have fasting blood sugar over 120 mg/dl. Her resting electrocardiogram results are normal, and she achieved a maximum heart rate of 108 during exercise. She experienced exercise-induced angina and had an ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat. These factors indicate a potential risk of heart disease in this patient.###\nHence this label was Yes."
"A 53-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, and a maximum heart rate of 120. The patient did not experience exercise-induced angina and had a ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure (140), and slightly elevated serum cholesterol (217). The patient does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results were normal, and the maximum heart rate achieved during exercise was 111. The patient experienced exercise-induced angina and had a significant ST depression of 5.6 induced by exercise relative to rest. The slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"The patient is a 50-year-old male with asymptomatic chest pain. His resting blood pressure is 150, and serum cholesterol level is 215. He does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 140 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 52-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a maximum heart rate of 169 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is upsloping. The fasting blood sugar level is under 120 mg/dl.###\nHence this label was No."
"A 48-year-old female patient with asymptomatic chest pain, normal resting blood pressure (108), and normal serum cholesterol level (163). The patient has a maximum heart rate of 175 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 2.0, and the slope of the peak exercise ST segment was upsloping. Fasting blood sugar was not above 120 mg/dl.###\nHence this label was No."
"A 38-year-old male patient with atypical angina chest pain, normal resting blood pressure of 140, high serum cholesterol level of 297, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 150, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 54-year-old male patient with atypical angina chest pain, resting blood pressure of 160, serum cholesterol level of 195, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 130, no exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment slope.###\nHence this label was No."
"A 29-year-old male patient with atypical angina chest pain has normal blood pressure and slightly elevated cholesterol levels. There is no fasting blood sugar > 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a high maximum heart rate of 202 without exercise-induced angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"This 59-year-old male patient experiences non-anginal chest pain and has a resting blood pressure of 125. Their fasting blood sugar level is above 120 mg/dl. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 175 without exercise-induced angina. They have a ST depression of 2.6 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 62-year-old male who experiences non-anginal chest pain. \nHis resting blood pressure is at 160, with normal resting electrocardiogram results. \nHe does not have fasting blood sugar > 120 mg/dl. \nHis maximum heart rate achieved is 72, and he experiences exercise-induced angina. \nThe patient has no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 57-year-old female patient with typical angina chest pain, normal resting blood pressure (130), high serum cholesterol (308), normal fasting blood sugar level, normal resting electrocardiogram results, low maximum heart rate achieved (98), no exercise-induced angina, slight ST depression (1.0) induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 75-year-old male patient with asymptomatic chest pain, high resting blood pressure (160 mmHg), elevated serum cholesterol (310 mg/dl), fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, achieving a maximum heart rate of 112 bpm. The patient experiences exercise-induced angina, with ST depression of 2.0 mm relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 57-year-old male with asymptomatic chest pain. His resting blood pressure is high at 165, and serum cholesterol level is elevated at 289. He has fasting blood sugar > 120 mg/dl. The ECG results indicate probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 124 without experiencing exercise-induced angina. There is 1.0 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 65-year-old male who is showing no symptoms of chest pain. He has high resting blood pressure (160) and his serum cholesterol level is normal. The fasting blood sugar level is above 120 mg/dl. The resting electrocardiogram shows an abnormality in the ST-T wave. The maximum heart rate achieved during exercise is 122. The patient did not experience exercise-induced angina. There is a ST depression of 1.2 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 60-year-old asymptomatic male patient with resting blood pressure of 160, normal serum cholesterol levels, and no fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 99 and experienced exercise-induced angina. ST depression induced by exercise relative to rest was 0.5, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain, resting blood pressure of 141, serum cholesterol level of 292, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 115, experiencing exercise-induced angina, 1.7 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 32-year-old male patient with atypical angina chest pain had normal resting blood pressure of 110, serum cholesterol level of 225, and fasting blood sugar below 120 mg/dl. The resting electrocardiogram showed normal results. Despite reaching a maximum heart rate of 184 during exercise, the patient did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. They have a normal resting electrocardiogram with a maximum heart rate of 125. The patient experiences exercise-induced angina and has ST depression of 2.0 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 51-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, and a maximum heart rate of 104. The patient did not experience exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 50-year-old female patient with non-anginal chest pain presented with normal resting blood pressure, high serum cholesterol levels, and no fasting blood sugar over 120 mg/dl. Resting electrocardiogram results were normal. The patient achieved a maximum heart rate of 140, experienced exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 54-year-old male patient, asymptomatic for chest pain, with a resting blood pressure of 150 and serum cholesterol level of 365. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 134 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 44-year-old female patient with non-anginal chest pain, normal resting blood pressure of 108, serum cholesterol level of 141, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, and a high maximum heart rate of 175. The patient does not experience exercise-induced angina and has a slight ST depression of 0.6 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 58-year-old male patient with atypical angina chest pain, resting blood pressure of 126, fasting blood sugar over 120 mg/dl, normal resting electrocardiogram results, maximum heart rate of 110, experience exercise-induced angina, 2.0 ST depression induced by exercise relative to rest, and flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 62-year-old male who presented with asymptomatic chest pain. His resting blood pressure is 115, and he has normal resting electrocardiogram results. He has fasting blood sugar > 120 mg/dl and experienced exercise-induced angina. His serum cholesterol level is 0, and he achieved a maximum heart rate of 128. The ST depression induced by exercise relative to rest is 2.5, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130. There is probable or definite left ventricular hypertrophy seen on the resting electrocardiogram. The patient achieved a maximum heart rate of 122 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, with a flat slope of the peak exercise ST segment. Fasting blood sugar is not above 120 mg/dl, indicating a lower risk for heart disease.###\nHence this label was Yes."
"A 66-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient experienced exercise-induced angina but reached a maximum heart rate of 132. ST depression during exercise relative to rest was minimal at 0.1, with a peak exercise ST segment showing upsloping.###\nHence this label was Yes."
"A 57-year-old male patient with no history of chest pain presented with asymptomatic chest pain. His resting blood pressure was 140, and serum cholesterol level was 214. He had a resting electrocardiogram showing ST-T wave abnormality. Despite reaching a maximum heart rate of 144 during exercise, he experienced angina. The ST segment depression induced by exercise relative to rest was 2.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 57-year-old male patient with atypical angina chest pain, normal resting blood pressure, and high serum cholesterol level. The patient has fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, and reached a maximum heart rate of 140 during exercise. There was no exercise-induced angina, and the ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 75-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results were normal, with a maximum heart rate of 112 bpm. The patient experienced exercise-induced angina and had a 3.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 63-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol level of 254, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 147, no exercise-induced angina, ST depression of 1.4 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no high serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, a maximum heart rate of 105, experienced exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 65-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly high serum cholesterol. They have a normal resting electrocardiogram and achieve a maximum heart rate of 140 during exercise. The patient experiences exercise-induced angina and shows significant ST depression relative to rest (4.0). The slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 38-year-old female patient with atypical angina chest pain, normal resting blood pressure (120 mmHg), elevated serum cholesterol levels (275 mg/dl), normal fasting blood sugar levels, a normal resting electrocardiogram, maximum heart rate achieved at 129 bpm, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 41-year-old female patient with atypical angina chest pain, resting blood pressure of 130, serum cholesterol of 204, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 172, no exercise-induced angina, 1.4 ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 56-year-old male patient with atypical angina chest pain, normal resting blood pressure, serum cholesterol of 184, normal fasting blood sugar levels, normal resting electrocardiogram results, maximum heart rate achieved was 100, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"This data belongs to a 50-year-old male patient with asymptomatic chest pain. His resting blood pressure is 133, serum cholesterol level is 218, and fasting blood sugar is normal. The resting electrocardiogram results are normal, and he achieved a maximum heart rate of 128. The patient experienced exercise-induced angina and had a ST depression of 1.1 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar levels, ST-T wave abnormality on resting electrocardiogram, achieved a maximum heart rate of 115, experienced exercise-induced angina, no ST depression induced by exercise, and had an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 58-year-old male who is asymptomatic for chest pain. His resting blood pressure is 130 and serum cholesterol level is 263. He does not have fasting blood sugar above 120 mg/dl and his resting electrocardiogram results are normal. The maximum heart rate achieved is 140. He experiences exercise-induced angina, with ST depression of 2.0 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 62-year-old female patient without fasting blood sugar > 120mg/dl presented with typical angina chest pain. Her resting blood pressure was 160, serum cholesterol was 193, and resting electrocardiogram showed normal results. She achieved a maximum heart rate of 116, did not experience exercise-induced angina, and had an ST depression of 0.0 induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 39-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. He has a normal resting electrocardiogram, achieved a maximum heart rate of 140 during exercise with no exercise-induced angina. There was 1.2 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 150, serum cholesterol of 276, no fasting blood sugar over 120 mg/dl, and probable or definite left ventricular hypertrophy as per resting electrocardiogram results. The patient achieved a maximum heart rate of 112, experienced exercise-induced angina, with ST depression of 0.6 relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 47-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. The patient does not have high fasting blood sugar levels. Resting electrocardiogram results are normal, but the maximum heart rate achieved is lower than average. The patient experiences exercise-induced angina and has a slight ST depression induced by exercise. The slope of the peak exercise ST segment is flat. Overall, the data suggests a potential risk of heart disease due to the combination of factors present.###\nHence this label was Yes."
"The patient is a 56-year-old male who is asymptomatic but has a resting blood pressure of 150 and a serum cholesterol level of 230. They do not have fasting blood sugar greater than 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The patient reached a maximum heart rate of 124 and experienced exercise-induced angina. They also had ST depression of 1.5 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 41-year-old male patient with atypical angina chest pain, normal resting blood pressure of 135, and serum cholesterol level of 203. The patient's fasting blood sugar is below 120 mg/dl, resting electrocardiogram results are normal, and the maximum heart rate achieved is 132. The patient does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 47-year-old female patient with no anginal chest pain, normal resting blood pressure of 130, serum cholesterol of 235, normal fasting blood sugar, normal resting electrocardiogram, maximum heart rate achieved at 145, no exercise-induced angina, ST depression of 2.0 induced by exercise, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 58-year-old male who is asymptomatic for chest pain. His resting blood pressure is 110 and serum cholesterol level is 198. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, and he achieved a maximum heart rate of 110. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 55-year-old male patient with non-anginal chest pain visited the clinic. His resting blood pressure was 110, and his serum cholesterol level was 277. The fasting blood sugar level was normal. The resting electrocardiogram showed normal results. He achieved a maximum heart rate of 160 during exercise and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. Overall, the patient's heart health indicators appear favorable based on the given data.###\nHence this label was No."
"The patient is a 65-year-old male who is asymptomatic and has normal resting blood pressure. They have a serum cholesterol level of 0, fasting blood sugar below 120 mg/dl, and a maximum heart rate of 93. The patient experiences exercise-induced angina but has no ST depression induced by exercise. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 37-year-old male patient with no typical chest pain symptoms but with normal resting blood pressure and slightly elevated serum cholesterol levels. The patient has a normal fasting blood sugar level and resting electrocardiogram results. Despite reaching a high maximum heart rate during exercise, the patient did not experience exercise-induced angina. There were no significant changes in ST segment depression post-exercise. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 67-year-old male who experiences typical angina chest pain. His resting blood pressure is 145, and he has no fasting blood sugar over 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 125 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 39-year-old male patient with atypical angina presented with normal resting blood pressure and slightly elevated serum cholesterol levels. The patient had a normal fasting blood sugar level, a normal electrocardiogram, and achieved a maximum heart rate of 106 during exercise without experiencing angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 55-year-old male with asymptomatic chest pain. His resting blood pressure is 140, and his serum cholesterol level is 268. He does not have fasting blood sugar > 120 mg/dl and has a normal resting electrocardiogram. His maximum heart rate achieved is 128, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 38-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 110, high serum cholesterol of 289. Fasting blood sugar is normal. Resting electrocardiogram shows a normal result. The patient achieved a maximum heart rate of 105 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"The patient is a 64-year-old male who is experiencing asymptomatic chest pain. His resting blood pressure is 120 and serum cholesterol is 246. He does not have fasting blood sugar greater than 120 mg/dl. Based on the resting electrocardiogram results, he has probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 96, and he experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 2.2, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 50-year-old male patient presented with asymptomatic chest pain, resting blood pressure of 144, and serum cholesterol level of 349. The patient had probable or definite left ventricular hypertrophy based on resting electrocardiogram results. He achieved a maximum heart rate of 120 during exercise, experienced exercise-induced angina, and had an ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 45-year-old female patient with atypical angina chest pain, normal resting blood pressure of 112, and serum cholesterol level of 160. Fasting blood sugar is below 120 mg/dl, resting electrocardiogram results are normal. She achieved a maximum heart rate of 138 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 51-year-old female patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol levels. She had a normal resting electrocardiogram and achieved a maximum heart rate of 170 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 39-year-old male who is asymptomatic for chest pain. His resting blood pressure is 130 and serum cholesterol level is 307. He has normal results for resting electrocardiogram. The maximum heart rate achieved is 140 and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 46-year-old female patient with no history of chest pain, but with probable or definite left ventricular hypertrophy as shown on resting electrocardiogram. Resting blood pressure is 138, serum cholesterol is 243. Patient experiences exercise-induced angina but shows no ST depression relative to rest. Maximum heart rate achieved is 152 with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 51-year-old male patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol levels. They do not have fasting blood sugar over 120 mg/dl. Their resting electrocardiogram results are normal, and they achieved a maximum heart rate of 173. The patient experienced exercise-induced angina and had ST depression of 1.6 relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 54-year-old male patient, asymptomatic, with resting blood pressure of 122 and serum cholesterol levels at 286. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 116. The patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is at 3.2. The slope of the peak exercise ST segment is flat. Fasting blood sugar is below 120 mg/dl.###\nHence this label was Yes."
"A 52-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. Their fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results are normal and they achieved a maximum heart rate of 147. The patient did not experience exercise-induced angina. They had a slight ST depression of 0.1 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 37-year-old female patient with no history of chest pain or fasting blood sugar issues. She has a resting blood pressure of 130 and serum cholesterol level of 173. The electrocardiogram shows ST-T wave abnormality. Her maximum heart rate achieved is 184, and she does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar over 120 mg/dl and exhibit a normal resting electrocardiogram. The patient achieved a maximum heart rate of 124 without experiencing exercise-induced angina. They show 1.0 ST depression induced by exercise relative to rest, with an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 34-year-old female patient with atypical angina chest pain has normal resting blood pressure and serum cholesterol levels. Their fasting blood sugar is below 120 mg/dl, and resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 190 without exercise-induced angina. They did not show any ST depression induced by exercise relative to rest, and their peak exercise ST segment slope is upsloping.###\nHence this label was No."
"A 46-year-old male patient, asymptomatic for chest pain, with normal resting blood pressure and elevated serum cholesterol level. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. Patient achieved a maximum heart rate of 125 during exercise, experiencing angina. ST depression induced by exercise relative to rest is 1.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 67-year-old male who is asymptomatic. His resting blood pressure is 120, with a serum cholesterol level of 237. He does not have fasting blood sugar above 120 mg/dl. The resting electrocardiogram shows normal results, with a maximum heart rate achieved of 71. The patient did not experience exercise-induced angina. He has a ST depression of 1.0 induced by exercise relative to rest, and the peak exercise ST segment slope is flat.###\nHence this label was Yes."
"A 55-year-old male patient with non-anginal chest pain, normal resting blood pressure and cholesterol levels. The resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 134 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 42-year-old male patient with non-anginal chest pain, normal resting blood pressure and serum cholesterol levels. The patient has a normal fasting blood sugar level and resting electrocardiogram results. He achieved a maximum heart rate of 146 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 51-year-old male patient with asymptomatic chest pain, resting blood pressure of 128, normal serum cholesterol levels, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 125, experiencing exercise-induced angina, 1.2 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"This data represents a 57-year-old male patient with atypical angina chest pain. His resting blood pressure is 124, serum cholesterol level is 261, and fasting blood sugar is normal. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 141 and did not experience exercise-induced angina. There was a slight ST depression of 0.3 relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
