"The 61-year-old male patient experienced asymptomatic chest pain and had a resting blood pressure of 138. His serum cholesterol level was 166, and he did not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram showed probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 125 and experienced exercise-induced angina. His ST depression induced by exercise relative to rest was 3.6, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 63-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. His fasting blood sugar is under 120 mg/dl, with a normal resting electrocardiogram. He achieved a maximum heart rate of 84, experienced exercise-induced angina, and had a ST depression of 2.5 induced by exercise relative to rest. The slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 55-year-old male patient with no typical chest pain symptoms was found to have elevated resting blood pressure. His serum cholesterol level was within normal range. The resting electrocardiogram showed ST-T wave abnormalities. Despite achieving a high maximum heart rate during exercise, the patient did not experience exercise-induced angina. The ST segment depression induced by exercise relative to rest was minimal. The peak exercise ST segment showed an upsloping pattern. Overall, the data suggests a possible risk of heart disease that should be investigated further.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 125, normal electrocardiogram results, and a maximum heart rate of 110. The patient has fasting blood sugar over 120 mg/dl, no exercise-induced angina, and a slight ST depression of 0.1. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 50-year-old female patient with non-anginal chest pain, normal resting blood pressure and high cholesterol levels. The patient has a normal resting electrocardiogram and achieved a maximum heart rate of 140. She experienced exercise-induced angina and had no ST depression relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 41-year-old male patient with asymptomatic chest pain has a resting blood pressure of 125 and normal electrocardiogram results. His fasting blood sugar is above 120 mg/dl. He achieved a maximum heart rate of 176 during exercise, did not experience exercise-induced angina, and has a slight ST depression of 1.6 relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"The patient is a 57-year-old male who experiences atypical angina chest pain. His resting blood pressure is 140, and serum cholesterol level is 265. He does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 145 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 64-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels of 0. This patient has fasting blood sugar levels above 120 mg/dl and a normal resting electrocardiogram. They achieved a maximum heart rate of 114 during exercise, experienced exercise-induced angina, and had ST depression of 1.3 induced by exercise relative to rest. The slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 58-year-old female patient with non-anginal chest pain visited the hospital. Her resting blood pressure was 120, and serum cholesterol level was high at 340. She had normal results on resting electrocardiogram. Her maximum heart rate achieved was 172, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 32-year-old male patient with atypical angina chest pain. Resting blood pressure is 110, serum cholesterol is 225. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 184 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol. He does not have fasting blood sugar over 120 mg/dl. His resting electrocardiogram results are normal, and he achieved a maximum heart rate of 132. The patient experiences exercise-induced angina and has a ST depression of 1.2 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 64-year-old male, who is asymptomatic, with a resting blood pressure of 150 and a serum cholesterol level of 193. His fasting blood sugar is below 120 mg/dl, but he has ST-T wave abnormality in resting electrocardiogram results. He achieved a maximum heart rate of 135 during exercise, experienced exercise-induced angina, and had a ST depression of 0.5 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"This is a 41-year-old male with asymptomatic chest pain. His resting blood pressure is 130, serum cholesterol is 172, and fasting blood sugar is below 120 mg/dl. His resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 130 without exercise-induced angina. There is a 2.0 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 75-year-old male patient with asymptomatic chest pain has a resting blood pressure of 170 and a serum cholesterol level of 203. Their fasting blood sugar is above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 108 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat. This data suggests a possible risk of heart disease in the patient.###\nHence this label was Yes."
"A 43-year-old female patient with atypical angina presented with a resting blood pressure of 120 and serum cholesterol level of 249. Fasting blood sugar level was below 120 mg/dl. Resting electrocardiogram showed ST-T wave abnormality. The patient achieved a maximum heart rate of 176 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. These factors suggest a comprehensive profile for predicting heart disease.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, resting blood pressure of 120, serum cholesterol level of 226, no fasting blood sugar > 120 mg/dl, resting electrocardiogram showing probable or definite left ventricular hypertrophy. His maximum heart rate achieved was 127, experienced exercise-induced angina, had ST depression of 1.7 induced by exercise relative to rest, and displayed a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 72-year-old male with asymptomatic chest pain. \nHis resting blood pressure is 160 and serum cholesterol is 123. \nHe has fasting blood sugar > 120 mg/dl. \nResting electrocardiogram shows probable or definite left ventricular hypertrophy. \nHis maximum heart rate achieved is 130 and he does not experience exercise-induced angina. \nHe has ST depression of 1.5 induced by exercise relative to rest. \nThe slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 41-year-old male patient with no history of chest pain, normal resting blood pressure, and serum cholesterol levels. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 158 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. This data suggests a relatively healthy cardiovascular profile for the patient.###\nHence this label was Yes."
"A 55-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a maximum heart rate of 155 and did not experience exercise-induced angina. There is a 1.5 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat. The fasting blood sugar level is below 120 mg/dl.###\nHence this label was Yes."
"A 56-year-old female patient with asymptomatic chest pain, resting blood pressure of 200, serum cholesterol level of 288, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 133 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 4.0, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 35-year-old male patient with asymptomatic chest pain, normal blood pressure, high serum cholesterol level. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He experienced exercise-induced angina but showed no ST depression during exercise. The peak exercise ST segment showed an upsloping pattern, with a maximum heart rate of 156 bpm.###\nHence this label was Yes."
"A 41-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120, and serum cholesterol level of 157. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 182 during exercise. The patient did not experience exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 45-year-old male patient with typical angina chest pain and normal resting electrocardiogram results. His resting blood pressure is 110, serum cholesterol is 264, and fasting blood sugar is below 120 mg/dl. He achieved a maximum heart rate of 132, did not experience exercise-induced angina, and had ST depression of 1.2 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 58-year-old male patient with non-anginal chest pain, resting blood pressure of 140, serum cholesterol level of 211, fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram, maximum heart rate achieved at 165, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and upsloping peak exercise ST segment.###\nHence this label was No."
"This is a 54-year-old female with non-anginal chest pain. Her resting blood pressure is 110, serum cholesterol is 214. She has normal fasting blood sugar, electrocardiogram, and does not experience exercise-induced angina. Her maximum heart rate achieved is 158. She has a slight ST depression of 1.6 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 65-year-old female patient with non-anginal chest pain, resting blood pressure of 160, high serum cholesterol of 360, and no fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 151 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 0.8, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 52-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal electrocardiogram results, and a maximum heart rate of 120. The patient did not experience exercise-induced angina and showed no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 43-year-old female patient with typical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol. She has a healthy fasting blood sugar level and a normal resting electrocardiogram. Despite achieving a high maximum heart rate during exercise, she does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is minimal at 0.0. The slope of the peak exercise ST segment is upsloping. Overall, the data suggests a relatively low risk of heart disease for this patient.###\nHence this label was No."
"A 49-year-old male patient with typical angina chest pain, resting blood pressure of 130, no fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved of 145, no exercise-induced angina, 3.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 39-year-old female patient with non-anginal chest pain, normal resting blood pressure, and normal serum cholesterol levels. The patient has a maximum heart rate of 179 beats per minute and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. The fasting blood sugar level is below 120 mg/dl.###\nHence this label was No."
"A 74-year-old male patient with typical angina chest pain has a resting blood pressure of 145 and serum cholesterol level of 216. The patient has high fasting blood sugar (>120 mg/dl) and normal resting electrocardiogram results. His maximum heart rate achieved is 116, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.8, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 60-year-old male experiencing asymptomatic chest pain. His resting blood pressure is 130, serum cholesterol level is 206, and fasting blood sugar is normal. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 132 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 2.4, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 62-year-old female patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol level of 164, and no fasting blood sugar over 120 mg/dl. The resting electrocardiogram indicates probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 145 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 6.2, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"The patient is a 55-year-old male who is asymptomatic but experiences exercise-induced angina. Their resting blood pressure is 140, serum cholesterol level is 268, and they have a normal resting electrocardiogram. They achieved a maximum heart rate of 128 and have a slight ST depression of 1.5 induced by exercise. The slope of the peak exercise ST segment is flat. Overall, this patient shows some signs of heart disease risk based on the provided data.###\nHence this label was Yes."
"A 62-year-old male patient with asymptomatic chest pain, high blood pressure (160), elevated serum cholesterol levels (254), and ST-T wave abnormality on resting electrocardiogram. The patient experiences exercise-induced angina, with a maximum heart rate of 108. ST depression induced by exercise relative to rest is 3.0, and the slope of the peak exercise ST segment is flat. The patient also has high fasting blood sugar (>120 mg/dl).###\nHence this label was Yes."
"A 35-year-old female patient with no history of chest pain or fasting blood sugar issues. She has a normal resting electrocardiogram and did not experience exercise-induced angina. Her blood pressure is at 138, cholesterol levels at 183, and achieved a maximum heart rate of 182 during exercise. The ST depression induced by exercise relative to rest is 1.4, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 67-year-old male patient with typical angina chest pain has a resting blood pressure of 142 and serum cholesterol level of 270. Their fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results show normal findings. The patient achieved a maximum heart rate of 125 and did not experience exercise-induced angina. They had ST depression of 2.5 relative to rest during exercise, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain has a resting blood pressure of 122 and serum cholesterol level of 223. Their fasting blood sugar is higher than 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 100, and there is no exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 39-year-old male patient with no symptoms of chest pain visited the clinic. His resting blood pressure was 110, and serum cholesterol level was 273. Fasting blood sugar was normal. Resting electrocardiogram results showed normal readings. The maximum heart rate achieved during the test was 132, and the patient did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 60-year-old female patient with non-anginal chest pain, normal resting blood pressure (102), high serum cholesterol (318), normal fasting blood sugar levels, normal resting electrocardiogram results, achieved a maximum heart rate of 160, did not experience exercise-induced angina, had no ST depression after exercise compared to rest, and showed an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 69-year-old male patient with asymptomatic chest pain, resting blood pressure of 137, no fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate of 104, exercise-induced angina present, ST depression of 1.6 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 42-year-old male with non-anginal chest pain. His resting blood pressure is 160 and serum cholesterol is 147. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows normal results. His maximum heart rate achieved is 146 and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping. These factors suggest a relatively healthy cardiovascular profile for this individual.###\nHence this label was No."
"A 49-year-old male patient with asymptomatic chest pain has normal resting blood pressure (140 mmHg) and serum cholesterol levels (185 mg/dl). They have a normal resting electrocardiogram and achieved a maximum heart rate of 130 bpm during exercise. The patient did not experience exercise-induced angina and showed no ST depression relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 50-year-old male who is asymptomatic and has normal resting blood pressure. Their cholesterol level is 218, fasting blood sugar is below 120 mg/dl. The resting electrocardiogram shows normal results, and the maximum heart rate achieved is 128. The patient experiences exercise-induced angina and has ST depression of 1.1 relative to rest. The slope of the peak exercise ST segment is flat. These factors suggest a risk of heart disease that should be further evaluated by a healthcare professional.###\nHence this label was Yes."
"The patient is a 67-year-old male with asymptomatic chest pain. His resting blood pressure is 146, and serum cholesterol is 369. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal. He achieved a maximum heart rate of 110 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.9, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 47-year-old male patient with asymptomatic chest pain, elevated resting blood pressure of 140, high serum cholesterol of 276, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 125 during exercise. The patient experienced exercise-induced angina, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 69-year-old female patient with typical angina chest pain, normal resting blood pressure and serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 151. The patient does not experience exercise-induced angina. There is ST depression of 1.8 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping. These factors indicate a detailed profile that can help predict the possibility of heart disease.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure (200), and serum cholesterol level of 198. Resting electrocardiogram results were normal, with a maximum heart rate of 142. The patient experienced exercise-induced angina, with ST depression of 2.0. The slope of the peak exercise ST segment was flat. Fasting blood sugar was below 120 mg/dl.###\nHence this label was Yes."
"This male patient, aged 55, experienced atypical angina chest pain and had a resting blood pressure of 110. His serum cholesterol level was 214, and fasting blood sugar was above 120 mg/dl. The resting electrocardiogram showed ST-T wave abnormality. He achieved a maximum heart rate of 180 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.4, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 66-year-old male patient with non-anginal chest pain, resting blood pressure of 110, serum cholesterol level of 213, fasting blood sugar over 120 mg/dl, showing probable or definite left ventricular hypertrophy on electrocardiogram. He achieved a maximum heart rate of 99, experienced exercise-induced angina, had 1.3 ST depression induced by exercise, and showed a flat slope on the peak exercise ST segment.###\nHence this label was No."
"A 66-year-old male patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol levels, showing no fasting blood sugar elevation. The resting electrocardiogram results were normal, reaching a maximum heart rate of 120 during exercise. The patient experienced exercise-induced angina but had no ST depression relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"This data belongs to a 67-year-old male patient with asymptomatic chest pain. His resting blood pressure is 140, and serum cholesterol level is 219. The patient does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 122 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 47-year-old male patient with asymptomatic chest pain has a resting blood pressure of 150 and serum cholesterol level of 226. His resting electrocardiogram shows normal results, with a maximum heart rate achieved at 98. He experiences exercise-induced angina and has a ST depression of 1.5 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 41-year-old female patient with atypical angina presented normal resting blood pressure (105 mmHg) and serum cholesterol levels (198 mg/dl). She had a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 168 during exercise. The patient did not experience exercise-induced angina, and showed no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 44-year-old male patient with non-anginal chest pain, normal resting blood pressure, slightly elevated serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, high maximum heart rate achieved, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The 58-year-old male patient experienced atypical angina chest pain. His resting blood pressure is 126 and serum cholesterol level is 0. He has fasting blood sugar higher than 120 mg/dl and normal resting electrocardiogram results. His maximum heart rate achieved was 110, and he experienced exercise-induced angina. The ST depression induced by exercise relative to rest was 2.0, and the slope of the peak exercise ST segment was flat. This combination of factors could indicate a possible heart disease.###\nHence this label was Yes."
"A 52-year-old male patient with atypical angina chest pain presented with normal resting blood pressure, slightly elevated serum cholesterol levels, and a normal fasting blood sugar level. The resting electrocardiogram showed normal results, and the patient achieved a maximum heart rate of 118 bpm during exercise without experiencing angina. There was no ST depression induced by exercise relative to rest, and the peak exercise ST segment showed an upsloping pattern.###\nHence this label was No."
"This 54-year-old male patient with asymptomatic chest pain has normal resting blood pressure and cholesterol levels. They have a fasting blood sugar level above 120 mg/dl and normal resting electrocardiogram results. The patient experiences exercise-induced angina and has a significant ST depression of 3.0 induced by exercise compared to rest. The slope of the peak exercise ST segment is flat, and the maximum heart rate achieved is 110.###\nHence this label was Yes."
"A 58-year-old female patient with typical angina chest pain, resting blood pressure of 150, serum cholesterol level of 283, fasting blood sugar > 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. Her maximum heart rate achieved was 162 with no exercise-induced angina. She had ST depression of 1.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping. These factors could be indicators of a possible heart disease.###\nHence this label was No."
"A 49-year-old male patient with asymptomatic chest pain has a resting blood pressure of 140 and a serum cholesterol level of 234. The patient's fasting blood sugar is normal, resting electrocardiogram results are normal, and the maximum heart rate achieved is 140. The patient experiences exercise-induced angina and has a 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 54-year-old female patient with atypical angina chest pain, normal resting blood pressure of 120, and serum cholesterol level of 273. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 150. The patient does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat. This data suggests a relatively healthy cardiovascular status, with minor abnormalities in heart function during exercise.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 137, serum cholesterol levels at 282. Fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows normal results, maximum heart rate achieved is 126. Patient experiences exercise-induced angina, with ST depression of 1.2 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 61-year-old male with non-anginal chest pain. His resting blood pressure is 150 and serum cholesterol is 243. He has high fasting blood sugar (>120 mg/dl) and a normal resting electrocardiogram. His maximum heart rate achieved is 137, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 55-year-old male patient with non-anginal chest pain, resting blood pressure of 133, serum cholesterol level of 185, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 136, no exercise-induced angina, 0.2 ST depression post-exercise, and an upsloping ST segment during peak exercise.###\nHence this label was No."
