"A 64-year-old female patient with asymptomatic chest pain, normal resting blood pressure of 130, serum cholesterol level of 303. Fasting blood sugar is below 120 mg/dl, resting electrocardiogram is normal. She achieved a maximum heart rate of 122 without exercise-induced angina. However, she experienced ST depression of 2.0 during exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 59-year-old male patient with atypical angina chest pain, normal resting blood pressure of 140, and serum cholesterol of 287. The patient's fasting blood sugar is below 120 mg/dl, resting electrocardiogram shows normal results. He achieved a maximum heart rate of 150 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 66-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 108. The patient experiences exercise-induced angina and has ST depression of 2.0 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 48-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, and a maximum heart rate of 128. The patient did not experience exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"This 59-year-old male patient has asymptomatic chest pain and normal resting blood pressure. His serum cholesterol level is 222. He does not have fasting blood sugar > 120 mg/dl. His resting electrocardiogram results are normal. He achieved a maximum heart rate of 135 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 2.5, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 67-year-old male patient with typical angina experienced high blood pressure and elevated cholesterol levels. Resting electrocardiogram results were normal, and the maximum heart rate achieved was 125. The patient did not experience exercise-induced angina, but ST depression relative to rest was observed at 2.5. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"This is a 67-year-old male patient with asymptomatic chest pain. His resting blood pressure is 160 and serum cholesterol is 286. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 108. He experiences exercise-induced angina and has ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 54-year-old female with atypical angina chest pain. She has a resting blood pressure of 132 and high serum cholesterol levels of 288. Her fasting blood sugar is above 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 159 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 62-year-old female patient with typical angina chest pain, normal resting blood pressure (160), serum cholesterol level of 193, fasting blood sugar under 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 116, no exercise-induced angina, no ST depression induced by exercise relative to rest (0.0), and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 56-year-old male patient with no chest pain symptoms, normal resting blood pressure and low cholesterol levels. Fasting blood sugar is normal, resting electrocardiogram results are normal. Achieved a maximum heart rate of 140 without exercise-induced angina. Has no ST depression induced by exercise and shows an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 52-year-old male patient with atypical angina presents with normal resting blood pressure and slightly elevated serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 118 during exercise, with no exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 66-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol of 228, no fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy on resting electrocardiogram. The patient achieved a maximum heart rate of 138, did not experience exercise-induced angina, and showed a ST depression of 2.3 induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping. This data suggests a possible heart disease but further evaluation is needed.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain has a resting blood pressure of 150 and serum cholesterol level of 230. Their resting electrocardiogram shows ST-T wave abnormality. Despite having a maximum heart rate of 124, they experience exercise-induced angina. They have a ST depression of 1.5 relative to rest and their peak exercise ST segment slope is flat. The fasting blood sugar level is not higher than 120 mg/dl.###\nHence this label was Yes."
"A 60-year-old male patient with non-anginal chest pain has a resting blood pressure of 141 and serum cholesterol level of 316. They have fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 122 and experienced exercise-induced angina. They also had ST depression of 1.7 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment. These features suggest a possibility of heart disease in this patient.###\nHence this label was Yes."
"A 37-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. Fasting blood sugar is normal, resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 187 without exercise-induced angina. The ST depression induced by exercise relative to rest is 3.5, and the peak exercise ST segment slope is downsloping.###\nHence this label was No."
"A 47-year-old male patient with atypical angina chest pain, normal resting blood pressure of 160, and serum cholesterol levels of 263. The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 174, and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, serum cholesterol level of 281, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 118, experiencing exercise-induced angina, 1.5 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"This data represents a 40-year-old male patient with asymptomatic chest pain. His resting blood pressure is 110, and serum cholesterol level is 167. He does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 114. He experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 45-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130 and serum cholesterol level of 219. Their fasting blood sugar is normal, but they have an ST-T wave abnormality in the resting electrocardiogram. The patient achieved a maximum heart rate of 130, experienced exercise-induced angina, and had 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 42-year-old male patient with atypical angina presented normal resting blood pressure and serum cholesterol levels. Fasting blood sugar was below 120 mg/dl. Resting electrocardiogram results were normal, and the maximum heart rate achieved during exercise was 155. The patient did not experience exercise-induced angina, and there was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 54-year-old female patient with atypical angina visited the clinic. Her resting blood pressure was 120, and serum cholesterol level was 221. She had normal resting electrocardiogram results and achieved a maximum heart rate of 138. She did not experience exercise-induced angina and had a ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 49-year-old male patient with non-anginal chest pain has normal resting blood pressure and low serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 127 during exercise. The patient experienced exercise-induced angina and had a 1.5 ST depression relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 62-year-old male patient with no typical chest pain, normal blood pressure, slightly elevated cholesterol levels, normal fasting blood sugar, showing ST-T wave abnormality on resting electrocardiogram. The patient achieved a maximum heart rate of 86 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 42-year-old male patient, experiencing non-anginal chest pain, with normal resting blood pressure and high serum cholesterol levels. The patient has fasting blood sugar levels greater than 120 mg/dl. Resting electrocardiogram results were normal, and the patient achieved a maximum heart rate of 194. There was no exercise-induced angina present. The patient experienced ST depression of 0.8 induced by exercise relative to rest, with a downsloping peak exercise ST segment.###\nHence this label was No."
"A 51-year-old female patient with non-anginal chest pain has normal resting blood pressure and serum cholesterol levels. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and the patient achieved a maximum heart rate of 120. They did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 50-year-old female patient with non-anginal chest pain presented with normal resting blood pressure (140 mmHg), elevated serum cholesterol levels (288 mg/dl), and a maximum heart rate of 140 bpm. The patient experienced exercise-induced angina, had no fasting blood sugar > 120 mg/dl, and demonstrated a flat slope of the peak exercise ST segment with no ST depression induced by exercise relative to rest.###\nHence this label was Yes."
"The patient is a 58-year-old male who experiences non-anginal chest pain. His resting blood pressure is 140 and serum cholesterol is 211. He has fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 165 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 36-year-old male patient with non-anginal chest pain, normal resting blood pressure of 112, high serum cholesterol level of 340, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, and a maximum heart rate of 184. The patient did not experience exercise-induced angina, had 1.0 ST depression induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 70-year-old male patient with asymptomatic chest pain, high resting blood pressure, fasting blood sugar > 120 mg/dl, normal electrocardiogram results, and experiencing exercise-induced angina. The patient has a maximum heart rate of 157 and shows ST depression of 2.0 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain had high resting blood pressure (144) and high serum cholesterol (270). Their fasting blood sugar was above 120 mg/dl. Resting electrocardiogram showed ST-T wave abnormality. Despite reaching a maximum heart rate of 160 during exercise, they experienced angina. ST depression induced by exercise relative to rest was 2.0, and the slope of the peak exercise ST segment was flat. These factors indicate a potential risk of heart disease in the patient.###\nHence this label was Yes."
"A 49-year-old male patient with no typical chest pain, normal resting blood pressure and cholesterol levels. The patient has a normal resting electrocardiogram, a high maximum heart rate of 170, and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 43-year-old male patient, asymptomatic chest pain, with normal resting blood pressure of 140 and serum cholesterol of 288. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. Maximum heart rate achieved is 135. The patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 2.0. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 42-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 295, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate of 162, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 75-year-old male patient with asymptomatic chest pain and resting blood pressure of 170. His serum cholesterol is 203, with fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 108 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat. Overall, the patient's cardiovascular health profile indicates some potential risk factors for heart disease.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, high resting blood pressure of 150, elevated serum cholesterol level of 365, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram results, achieved a maximum heart rate of 134, did not experience exercise-induced angina, showed 1.0 ST depression induced by exercise relative to rest, and had an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 58-year-old male patient with non-anginal chest pain had normal resting blood pressure (140) and serum cholesterol levels (179). They did not have fasting blood sugar over 120 mg/dl and showed a normal resting electrocardiogram. Despite a maximum heart rate of 160, the patient did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"This is a profile of a 68-year-old male patient with non-anginal chest pain. His resting blood pressure is 118, serum cholesterol level is 277. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. He achieved a maximum heart rate of 151 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 155 bpm. The patient did not experience exercise-induced angina and showed no ST depression post-exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 40-year-old male patient with non-anginal chest pain has normal resting blood pressure (140) and serum cholesterol levels (235). Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 188. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 35-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal electrocardiogram results, a maximum heart rate of 130, experiencing exercise-induced angina. The patient has ST depression of 1.2 induced by exercise relative to rest and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 66-year-old female patient with typical angina chest pain, resting blood pressure of 150, serum cholesterol level of 226, normal resting electrocardiogram results, maximum heart rate achieved at 114, no fasting blood sugar > 120 mg/dl, no exercise-induced angina, ST depression of 2.6 induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain, resting blood pressure of 110, serum cholesterol level of 238, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 140, experiencing exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. These factors suggest a potential risk for heart disease that should be further evaluated.###\nHence this label was No."
"The patient is a 60-year-old male who is asymptomatic. His resting blood pressure is high at 160, with normal electrocardiogram results. He has fasting blood sugar levels above 120 mg/dl. The patient achieved a maximum heart rate of 149 and did not experience exercise-induced angina. He has a slight ST depression of 0.4 relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 35-year-old female patient with no history of chest pain or angina visited the clinic. Her resting blood pressure was 140 mmHg and serum cholesterol level was 167 mg/dl, both within normal ranges. The electrocardiogram showed normal results. Despite achieving a maximum heart rate of 150 bpm during exercise, she did not experience angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 38-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, a moderate maximum heart rate of 105, experiencing exercise-induced angina, with a slight ST depression of 1.5 induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 36-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 267, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 160, absence of exercise-induced angina, 3.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"This is a 69-year-old male patient with asymptomatic chest pain. He has a resting blood pressure of 142 and a serum cholesterol level of 210. His fasting blood sugar is above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 112. He experiences exercise-induced angina and has a ST depression of 1.5 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 53-year-old female patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol levels. They do not have fasting blood sugar over 120 mg/dl and show normal results in resting electrocardiogram. The patient achieved a maximum heart rate of 142 and experienced exercise-induced angina. They displayed a 2.0 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 41-year-old male with atypical angina presents normal resting blood pressure of 135 and serum cholesterol of 203. The individual has fasting blood sugar levels below 120 mg/dl, normal resting electrocardiogram results, and achieves a maximum heart rate of 132. There is no exercise-induced angina, ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 50-year-old male patient with asymptomatic chest pain visited the clinic. His resting blood pressure was 130, and serum cholesterol level was 233. He had a normal resting electrocardiogram and achieved a maximum heart rate of 121. The patient experienced exercise-induced angina and had a 2.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 53-year-old male patient with no chest pain symptoms, normal resting blood pressure, and cholesterol levels. The patient has a normal resting electrocardiogram and did not experience exercise-induced angina. The maximum heart rate achieved was 106, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat. Overall, the patient's heart health indicators suggest a relatively low risk of heart disease.###\nHence this label was Yes."
"The patient is a 52-year-old male with atypical angina chest pain. His resting blood pressure is 134, serum cholesterol level is 201, and fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal activity. He achieved a maximum heart rate of 158 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 0.8, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 49-year-old male patient with asymptomatic chest pain, normal resting blood pressure (140), and serum cholesterol (234). They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram result is normal, with a maximum heart rate of 140. The patient experiences exercise-induced angina and has 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 48-year-old female patient with atypical angina chest pain, normal resting blood pressure (120 mmHg), elevated serum cholesterol (284 mg/dl), normal fasting blood sugar levels, normal resting electrocardiogram results, maximum heart rate achieved at 120 bpm, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"The patient is a 67-year-old female with non-anginal chest pain. She has a resting blood pressure of 115 and a high serum cholesterol level of 564. There is no fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Her maximum heart rate achieved is 160 and she does not experience exercise-induced angina. She has ST depression of 1.6 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 49-year-old female patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 160 without exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the peak exercise ST segment shows upsloping.###\nHence this label was No."
"The patient is a 58-year-old male with asymptomatic chest pain. His resting blood pressure is 120, with normal serum cholesterol levels. He does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 106 during exercise, experiencing exercise-induced angina. He also had ST depression of 1.5 mm induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old male patient with typical angina chest pain, resting blood pressure of 130, normal serum cholesterol levels, no fasting blood sugar above 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved of 145, no exercise-induced angina, 3.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 65-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 93. The patient experienced exercise-induced angina, with no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with atypical angina chest pain, normal resting blood pressure of 145, high serum cholesterol of 326, fasting blood sugar under 120 mg/dl, normal resting electrocardiogram results, a maximum heart rate of 155, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 64-year-old male patient with asymptomatic chest pain, normal resting blood pressure and slightly elevated serum cholesterol. The patient experienced exercise-induced angina, significant ST depression during exercise, and achieved a maximum heart rate of 102. The peak exercise ST segment showed a downsloping pattern.###\nHence this label was Yes."
"A 41-year-old female patient presenting with atypical angina chest pain, normal resting blood pressure of 126, and high serum cholesterol level of 306. Fasting blood sugar is below 120 mg/dl, resting electrocardiogram results are normal. She achieved a maximum heart rate of 163 without experiencing exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"This is a 54-year-old female with non-anginal chest pain and normal resting blood pressure. She has high serum cholesterol and fasting blood sugar. Her electrocardiogram results are normal, and she achieved a maximum heart rate of 170 without exercise-induced angina. There is no ST depression post-exercise, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 30-year-old female patient with typical angina chest pain, a resting blood pressure of 170, serum cholesterol of 237, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved of 170, no exercise-induced angina, no ST depression induced by exercise, and an upsloping ST segment during peak exercise.###\nHence this label was No."
"A 40-year-old female patient with no history of chest pain or angina, presented with normal resting blood pressure and elevated serum cholesterol. Resting electrocardiogram showed normal results. The patient achieved a maximum heart rate of 130 during exercise without experiencing angina. There was a 2.0 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 48-year-old male patient with atypical angina chest pain has resting blood pressure of 130 and serum cholesterol of 245. Fasting blood sugar is not greater than 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 180 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.2, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain, resting blood pressure of 110, serum cholesterol level of 206, no fasting blood sugar over 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 108, experienced exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat. These factors suggest a potential heart disease risk in the patient.###\nHence this label was Yes."
"A 58-year-old male patient with atypical angina, resting blood pressure of 120, serum cholesterol of 284, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram, maximum heart rate achieved at 160, no exercise-induced angina, ST depression of 1.8 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 46-year-old male patient with no history of chest pain presented with high resting blood pressure of 180 and elevated serum cholesterol levels of 280. The patient's electrocardiogram revealed ST-T wave abnormality. Despite achieving a moderate maximum heart rate of 120 during exercise, the patient did not experience angina. Additionally, there was no significant ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping, indicating a potential risk for heart disease.###\nHence this label was No."
"The patient is a 50-year-old male with no chest pain, normal resting blood pressure, and normal serum cholesterol levels. The fasting blood sugar level is below 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 156 during exercise and experienced exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 48-year-old female patient with atypical angina chest pain, resting blood pressure of 120, serum cholesterol level of 177, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 148, did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 125, fasting blood sugar greater than 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 119, experienced exercise-induced angina, ST depression of 0.9 induced by exercise relative to rest, and a peak exercise ST segment showing upsloping.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, normal blood pressure, slightly elevated serum cholesterol levels, no fasting blood sugar over 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 100 with no exercise-induced angina. He had no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain, resting blood pressure of 125, serum cholesterol of 292, normal fasting blood sugar levels, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 115, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and a peak exercise ST segment showing upsloping pattern.###\nHence this label was No."
"The patient is a 51-year-old male who is experiencing asymptomatic chest pain. His resting blood pressure is 131, and serum cholesterol level is 152. He has fasting blood sugar > 120 mg/dl, and possible left ventricular hypertrophy as per resting electrocardiogram results. The patient achieved a maximum heart rate of 130, and experienced exercise-induced angina. He has 1.0 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. His fasting blood sugar is below 120 mg/dl. The resting electrocardiogram shows normal results. He achieved a maximum heart rate of 168 and experienced exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"This is a 38-year-old male patient who is asymptomatic but experiences exercise-induced angina. His resting blood pressure is 92, serum cholesterol is 117, and fasting blood sugar level is below 120 mg/dl. Resting electrocardiogram results show normal findings. He achieved a maximum heart rate of 134 during exercise. The ST depression induced by exercise relative to rest is 2.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 57-year-old male patient with atypical angina presented with resting blood pressure of 140 and serum cholesterol level of 260. Their fasting blood sugar level was above 120 mg/dl. Resting electrocardiogram showed normal results, and the maximum heart rate achieved was 140. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 47-year-old female patient with atypical angina is observed. She has a resting blood pressure of 140 and serum cholesterol level of 257. Her fasting blood sugar is not above 120 mg/dl. Resting electrocardiogram results are normal, and her maximum heart rate achieved is 135. She does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 61-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 108 during exercise, experienced exercise-induced angina, had a ST depression of 2.0 induced by exercise relative to rest, and displayed a downsloping peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 53-year-old male who is asymptomatic but has probable or definite left ventricular hypertrophy. \nHe has a resting blood pressure of 130 and experiences exercise-induced angina. \nHis maximum heart rate achieved is 135, and he has a flat slope of the peak exercise ST segment.\nThere is no fasting blood sugar > 120 mg/dl, and his serum cholesterol level is not provided. \nDuring exercise, he experiences ST depression relative to rest with a value of 1.0.###\nHence this label was Yes."
"A 51-year-old female patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. She has a normal fasting blood sugar level, resting electrocardiogram results, and a maximum heart rate of 120. She does not experience exercise-induced angina and has a slight ST depression relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 40-year-old male patient with typical angina chest pain, normal resting blood pressure, serum cholesterol level of 199, normal fasting blood sugar, normal resting electrocardiogram results, achieved a maximum heart rate of 178, experienced exercise-induced angina, with 1.4 ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment. This data suggests a possibility of heart disease.###\nHence this label was No."
"A 55-year-old male patient with atypical angina chest pain, resting blood pressure of 110, serum cholesterol level of 214, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 180, no exercise-induced angina, 0.4 ST depression induced by exercise relative to rest, and upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 62-year-old male with atypical angina chest pain. His resting blood pressure is 131 mmHg and serum cholesterol levels are normal. He does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram results are normal. The maximum heart rate achieved during exercise is 130 bpm, and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.1. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old male patient with non-anginal chest pain has normal resting blood pressure and slightly elevated serum cholesterol. They do not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 152 without experiencing exercise-induced angina. They exhibited 0.5 ST depression induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 58-year-old female patient with atypical angina chest pain has a resting blood pressure of 136 and high serum cholesterol of 319. Fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 152 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 48-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 140, and serum cholesterol levels of 208. The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 159 during exercise, and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is upsloping. Fasting blood sugar level is not above 120 mg/dl.###\nHence this label was Yes."
"A 42-year-old male patient with non-anginal chest pain, normal resting blood pressure of 134, serum cholesterol of 240, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved of 160, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment. These factors suggest a moderate risk for heart disease in this individual.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure and relatively low serum cholesterol levels. Their fasting blood sugar is under 120 mg/dl. Resting electrocardiogram results show a normal reading. The patient achieved a maximum heart rate of 140 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, and a maximum heart rate of 124. The patient did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 59-year-old male patient, asymptomatic but with probable or definite left ventricular hypertrophy, has resting blood pressure of 110 and serum cholesterol of 239. He experienced exercise-induced angina, with a maximum heart rate of 142. His ST depression induced by exercise relative to rest was 1.2, and the slope of the peak exercise ST segment was flat. The fasting blood sugar level was not above 120 mg/dl.###\nHence this label was Yes."
"A 75-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol level of 310, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, achieving a maximum heart rate of 112, experiencing exercise-induced angina, with 2.0 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 65-year-old male with asymptomatic chest pain. His resting blood pressure is 140 and serum cholesterol level is 306. He has high fasting blood sugar (>120 mg/dl) and a normal resting electrocardiogram. His maximum heart rate achieved is 87 and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 54-year-old male with asymptomatic chest pain. His resting blood pressure is 125, and his serum cholesterol level is 216. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, and he achieved a maximum heart rate of 140. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 45-year-old female patient with atypical angina presents with a resting blood pressure of 180 and serum cholesterol level of 295. She has normal resting electrocardiogram results and achieved a maximum heart rate of 180. She did not experience exercise-induced angina, and her ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 62-year-old male patient, without any chest pain symptoms, has a resting blood pressure of 135 and serum cholesterol level of 297. His fasting blood sugar is below 120 mg/dl, with normal resting electrocardiogram results. He achieved a maximum heart rate of 130 during exercise, experienced angina, and had 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 43-year-old male patient, experiencing non-anginal chest pain, with normal resting blood pressure and high serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 162 and no exercise-induced angina. The ST segment depression induced by exercise relative to rest is 1.9, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 62-year-old female patient presented with typical angina chest pain. She had a resting blood pressure of 140 mmHg and normal electrocardiogram results. Her maximum heart rate achieved was 143 bpm. She had fasting blood sugar over 120 mg/dl. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and cholesterol levels. The resting electrocardiogram showed ST-T wave abnormality. He achieved a maximum heart rate of 148 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The 48-year-old male patient experienced non-anginal chest pain and had a resting blood pressure of 102. The resting electrocardiogram showed ST-T wave abnormality. Despite a fasting blood sugar level above 120 mg/dl, the patient achieved a maximum heart rate of 110 during exercise, which induced angina. The ST segment depression relative to rest was 1.0 and the slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"A 59-year-old female patient with atypical angina chest pain has a normal resting blood pressure of 130 and serum cholesterol level of 188. She does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, and her maximum heart rate achieved is 124. She does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 52-year-old male patient with no symptoms of chest pain visited the doctor. His resting blood pressure was 112, and serum cholesterol levels were at 230. He had normal resting electrocardiogram results and achieved a maximum heart rate of 160 during exercise. The patient did not experience exercise-induced angina, with no ST depression relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure (135 mmHg) and slightly elevated serum cholesterol (234 mg/dl). No fasting blood sugar level above 120 mg/dl was detected. Resting electrocardiogram results were normal, and the patient achieved a maximum heart rate of 161 beats per minute. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 0.5. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 57-year-old female patient with typical angina chest pain has normal resting blood pressure and elevated serum cholesterol. They have a normal resting electrocardiogram and achieved a relatively low maximum heart rate of 98. The patient did not experience exercise-induced angina and showed a slight ST depression of 1.0 after exercise. The peak exercise ST segment is flat in this case.###\nHence this label was No."
"A 77-year-old male patient with asymptomatic chest pain, resting blood pressure of 125, serum cholesterol of 304, no fasting blood sugar > 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 162, experienced exercise-induced angina, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"The patient is a 68-year-old male who experiences typical angina chest pain. \nHis resting blood pressure is 139 and serum cholesterol level is 181. \nHe has fasting blood sugar levels above 120 mg/dl. \nThe resting electrocardiogram shows ST-T wave abnormality. \nHis maximum heart rate achieved is 135 and he does not experience exercise-induced angina. \nST depression induced by exercise relative to rest is 0.2. \nThe slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 52-year-old male patient with typical angina chest pain, high resting blood pressure (152), elevated serum cholesterol (298), fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, high maximum heart rate achieved (178), no exercise-induced angina, mild ST depression induced by exercise relative to rest (1.2), and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 57-year-old male patient, asymptomatic chest pain, with resting blood pressure of 150 and serum cholesterol of 276. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 112. Patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 0.6. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 55-year-old male patient with atypical angina chest pain, resting blood pressure of 160, serum cholesterol level of 292, fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 143, experienced exercise-induced angina, 2.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. These factors indicate a potential risk for heart disease in this patient.###\nHence this label was Yes."
"A 51-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dL, normal resting electrocardiogram results, and a maximum heart rate of 126. The patient did not experience exercise-induced angina and had a ST depression of 2.2 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, achieving a maximum heart rate of 110 during exercise, experiencing exercise-induced angina, having a ST depression of 2.5 induced by exercise relative to rest, and showing a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, high resting blood pressure of 180, normal electrocardiogram results, and a maximum heart rate of 150. The patient has fasting blood sugar greater than 120 mg/dl and no exercise-induced angina. There is a 1.5 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with non-anginal chest pain, normal resting blood pressure and cholesterol levels. Fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results are normal. Maximum heart rate achieved is 148, with no exercise-induced angina. The ST depression induced by exercise relative to rest is 0.3, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 63-year-old male patient with no history of chest pain, normal blood sugar levels, and a resting blood pressure of 110. The patient has a high serum cholesterol level of 252 and an abnormal resting electrocardiogram showing ST-T wave abnormalities. Despite reaching a maximum heart rate of 140 during exercise, the patient experienced angina. The ST depression induced by exercise relative to rest was 2.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 51-year-old male patient with non-anginal chest pain, normal resting blood pressure of 110, serum cholesterol level of 175, fasting blood sugar below 120 mg/dl, normal rest electrocardiogram results, maximum heart rate of 123, no exercise-induced angina, slight ST depression of 0.6 induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 35-year-old male patient with atypical angina chest pain, normal resting blood pressure of 150, and serum cholesterol level of 264. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 168 during exercise. There was no exercise-induced angina present, and the ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol level of 256, high fasting blood sugar (>120 mg/dl), probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 113, experienced exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"This 71-year-old male patient experiences non-anginal chest pain. His resting blood pressure is 144, and serum cholesterol is 221. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. His maximum heart rate achieved is 108, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.8, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain, resting blood pressure of 170, serum cholesterol level of 326, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 140, experiencing exercise-induced angina, ST depression of 3.4 induced by exercise relative to rest, and a downsloping peak exercise ST segment.###\nHence this label was Yes."
"This data describes a 56-year-old female patient with non-anginal chest pain. Her resting blood pressure is 130, and serum cholesterol is 219. She does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. Her maximum heart rate achieved is 164, and she does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. These factors can be used to predict the likelihood of heart disease in the patient.###\nHence this label was No."
"A 44-year-old male patient with atypical angina chest pain has normal resting blood pressure and serum cholesterol levels. They have a maximum heart rate of 142 and did not experience exercise-induced angina. The patient's electrocardiogram results were normal, with a slight ST depression of 1.0 induced by exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 55-year-old male patient with atypical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol. Their fasting blood sugar level is within the normal range. The resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 155 during exercise without experiencing angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 62-year-old male with typical angina chest pain. His resting blood pressure is 135, and serum cholesterol is 139. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 137, and he does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 48-year-old male patient with non-anginal chest pain has a resting blood pressure of 132 and serum cholesterol level of 220. The patient has fasting blood sugar higher than 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 162 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat. These factors can be considered to predict the presence of a heart disease in this patient.###\nHence this label was Yes."
"A 62-year-old male patient with atypical angina chest pain, resting blood pressure of 128, serum cholesterol level of 208, fasting blood sugar greater than 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram, achieving a maximum heart rate of 140, without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment shows upsloping. These factors suggest a profile for assessing the risk of heart disease in the patient.###\nHence this label was No."
"A 47-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and they achieved a maximum heart rate of 143 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.1, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 57-year-old male with atypical angina chest pain. His resting blood pressure is 140, serum cholesterol level is 265. Fasting blood sugar is normal. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 145 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
