"This 37-year-old White female, who is divorced and not living with family, is employed in the private sector as an office and administrative support worker in the United States. She is a high school graduate and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 61-year-old married White male from the United States. He works in the craft and repair sector as the owner of a non-incorporated business, professional practice, or farm. With a high school education, he works 35 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 41-year-old Black male from the United States. He is divorced and does not live with family. He works in a professional specialty occupation in the private sector, with a bachelor's degree education. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 37-year-old married white male from the United States. He works in the private sector as a craft and repair worker, putting in 40 hours per week. Last year, he had no capital gains or losses. His education level is college for one or more years without a degree.###\nHence this label was Yes."
"The individual in the dataset is a 39-year-old married white male from the United States. He works in the private sector in the transportation, communication, and other public utilities sector. He has a bachelor's degree and works unusually long hours per week (99). His capital gain last year was significant ($15,024), while he had no reported capital loss. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This dataset represents a 22-year-old married White male from England. He works in a professional specialty occupation for the state government, with a bachelor's degree education. Despite working only 20 hours per week, he had no capital gains or losses last year. The prediction is whether his annual income exceeds $50,000.###\nHence this label was No."
"This individual is a 41-year-old married White male from the United States. He is the husband in his household and works as an executive manager in an incorporated business, professional practice, or farm. Despite finishing 11th grade, he works 40 hours per week with no significant capital gains or losses last year.###\nHence this label was No."
"This individual is a 22-year-old White female from the United States who has never been married. She is classified as an own-child in the household. She works in the service sector as a private sector employee, with a college education of less than one year. Despite working 20 hours per week, she had no capital gains or losses last year.###\nHence this label was No."
"This individual is a 36-year-old divorced White female in the United States. She is unmarried and works in the private sector as an executive and manager. She has a high school education, works 40 hours per week, had no capital gains or losses last year, and it is predicted that her annual income is over $50,000.###\nHence this label was No."
"This is a 54-year-old White male who is married and works in the craft and repair sector as a private sector employee in the United States. He is the husband in the household and is a high school graduate. Despite working 40 hours per week, he did not have any capital gains or losses last year.###\nHence this label was No."
"This is a 50-year-old separated White female from the United States. She is unmarried and works in the service sector as a private sector employee. She has a high school education and works 35 hours per week. She had no capital gain or loss last year. The dataset predicts whether her annual income is over $50,000.###\nHence this label was No."
"The individual is a 63-year-old White male from the United States, who is married and works as an executive in management. He owns an incorporated business, professional practice, or farm. He has a high school education and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"This individual is a 47-year-old married White female from the United States. She works in a professional specialty occupation in the local government sector. With a master's degree education, she works 60 hours per week and had no capital gain or loss last year.###\nHence this label was Yes."
"This data represents a 35-year-old White male from the United States who has never been married. He is not living with family and works in the craft and repair sector as a private sector employee. Despite having a master's degree, he had no capital gains or losses last year. He dedicates 50 hours per week to his job.###\nHence this label was Yes."
"This individual is a 57-year-old unmarried white male from the United States. He works in the private sector as an employee in the protective services sector, putting in 40 hours per week. He has not received any capital gains or losses in the last year and has completed less than a year of college education.###\nHence this label was No."
"The individual is a 35-year-old Black female from the United States who has never been married. She is unmarried and her occupation and work class are unspecified. She has a high school education and works 40 hours per week. Last year, she had no capital gain or loss.###\nHence this label was No."
"The individual is a 19-year-old White male from the United States who has never been married. He is categorized as an own-child in relation to the head of the household. His occupation is in the craft and repair sector, and he is the owner of a non-incorporated business, professional practice, or farm. Despite having some college education, he has worked 20 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 63-year-old White male from the United States. He is married and works in the private sector as an executive manager. He has a bachelor's degree and works 50 hours per week. His capital gain and capital loss from last year are both $0. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"The individual is a 57-year-old married white male from the United States. He works in the private sector as a professional specialty employee with a master's degree. Despite working long hours per week (60), he did not report any capital gain or loss last year.###\nHence this label was Yes."
"This person is a 33-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a standard 40-hour work week. He finished 10th grade for his education. Last year, he had no capital gains or losses.###\nHence this label was No."
"This individual is an 18-year-old White female from the United States. She has never been married and is considered an own-child in the household. She works in the service sector as a private sector employee, with a capital gain and loss of 0 last year. She has completed 11th class education and works 20 hours per week.###\nHence this label was No."
"The individual is a 51-year-old Black male from the United States. He is divorced and unmarried. He works in the transportation, communication, and other public utilities sector for the local government. He is a high school graduate and works 40 hours per week. He had no capital gain or loss last year.###\nHence this label was No."
"This is a 29-year-old White female from the United States, who is married and works in the private sector as a professional specialty. She holds a bachelor's degree and works 35 hours per week. Last year, she had no capital gain or loss.###\nHence this label was Yes."
"The individual is a 49-year-old White male from the United States. He is married and works in a professional specialty occupation in the local government sector. With a bachelor's degree, he works 50 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 47-year-old married White male from the United States. He works in the sales sector as a private sector employee with a bachelor's degree education. Despite working 60 hours per week, he had no capital gains or losses last year.###\nHence this label was Yes."
"The individual is a 46-year-old married White female from the United States. She works in the private sector as an executive and manager, with a college education for less than one year. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was Yes."
"The individual is a 28-year-old white male from the United States who works in the service sector as a private sector employee. He is separated and not living with any family member. He completed 11th grade education and works 40 hours per week. Additionally, he had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 41-year-old married White female from the United States. She works in the technology and support sector as a private sector employee with a bachelor's degree. She has no capital gain or loss from the previous year and works 25 hours per week.###\nHence this label was Yes."
"This individual is a 19-year-old White female from the United States who has never been married. She is categorized as an own-child in relation to the head of the household. She works in the service sector as a private sector employee, with an educational background of less than one year in college. Last year, she had no capital gains or losses. She works 15 hours per week.###\nHence this label was No."
"This individual is a 48-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a high school graduate education. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 21-year-old White male living in the United States. He has never been married and is categorized as an Own-child in the household. He works as a machine operator and inspector in the private sector, with a high school education. He worked 40 hours per week last year with no capital gain or loss.###\nHence this label was No."
"This individual is a 31-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, holding a bachelor's degree. With no capital gains or losses last year, he typically works 40 hours per week.###\nHence this label was Yes."
