"The person is a 40-year-old married White female from the United States. She works in the private sector as an executive and manager, with a bachelor's degree. She has no capital gain or loss from the previous year and works 45 hours per week.###\nHence this label was Yes."
"The individual is a 58-year-old married White male from the United States. He works in the private sector as a craft and repair employee, with a typical workweek of 40 hours. He has no capital gain or loss from the previous year and has received less than one year of college education.###\nHence this label was Yes."
"This person is a 53-year-old married White male from the United States. He has a doctoral degree and works in a professional specialty occupation for the state government. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was Yes."
"The individual is a 55-year-old married white male from the United States. He works in the craft and repair sector as a private sector employee. He is a high school graduate and works 40 hours per week. There were no capital gains or losses last year.###\nHence this label was Yes."
"This person is a 49-year-old married White male from the United States. He works in the private sector as an office and administrative support employee, with a college education for less than one year. He worked 40 hours per week last year and had no capital gains or losses.###\nHence this label was No."
"This person is a 28-year-old Black male from the United States. He has never been married and is categorized as an other-relative in terms of relation to the head of the household. He works in the cleaning and maintenance sector for the local government, with a high school education. Despite working 40 hours per week, he did not have any capital gain or loss last year.###\nHence this label was No."
"The individual is a 33-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He is a high school graduate and works 43 hours per week. His capital gain and loss last year were both 0.###\nHence this label was No."
"This individual is a 27-year-old White male from Mexico. He has never been married and is not living with family. He works in the service sector as a private sector employee, with a high work commitment of 60 hours per week. Despite completing 10th class education, he did not have any capital gains or losses last year.###\nHence this label was No."
"This individual is a 31-year-old White female from the United States who has never been married. She works in the service sector as a private sector employee, having graduated from high school. She is not living with family and worked 56 hours per week last year with no capital gain or loss.###\nHence this label was No."
"This individual is a 39-year-old married white male from the United States. He works in the sales sector as the owner of a non-incorporated business, professional practice, or farm. He is a high school graduate and works 40 hours per week. He had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 41-year-old married White male from the United States. He works in the private sector as an office and administrative support employee, putting in 40 hours per week. His education level is college for less than one year, and he had no capital gains or losses last year.###\nHence this label was No."
"This individual is a 62-year-old Black male from the United States who is widowed and not living with any family members. He has completed 8th grade education and works an average of 40 hours per week. His occupation and work class are not specified, and he did not have any capital gain or loss last year.###\nHence this label was No."
"The individual is a 48-year-old married white male from the United States. He is the husband in the household. He is a business owner in the agriculture, forestry, and fisheries sector, working 40 hours per week. He is a high school graduate with no capital gains or losses last year.###\nHence this label was Yes."
"A 33-year-old unmarried white male from El-Salvador works in the craft and repair sector as a private sector employee. He is classified as an Own-child in relation to the head of the household. He is a high school graduate and works 40 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"The individual in this data is a 64-year-old White female from the United States. She is divorced and not living with any family member. She works in office and administrative support in the local government sector. She is a high school graduate and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 28-year-old White male from Columbia. He has never been married and does not live with family. He works in the craft and repair sector as a private sector employee, with no capital gain or loss last year. He finished 6th class for education and works 40 hours per week.###\nHence this label was No."
"The individual is a 40-year-old White female from the United States who is separated. She is not living with any family member and works in the private sector as an office and administrative support employee. She did not have any capital gain or loss last year. Her education level is college for less than one year, and she works 40 hours per week.###\nHence this label was No."
"The person is a 22-year-old White male from the United States who has never been married. He is classified as an Own-child in relation to the head of the household. He works in the sales sector as a private sector employee, with a college education for less than one year. Despite working 20 hours per week, he did not have any capital gain or loss the previous year.###\nHence this label was No."
"This person is a 20-year-old Black male who is married and identified as an own-child in the household. He is a private sector employee working in the sales sector, with a high school education. Last year, he had no capital gains or losses. He works 32 hours per week in the United States. Based on this information, it is predicted that his annual income is not over $50,000.###\nHence this label was No."
"The person is a 39-year-old White male from the United States. He is married and works in the agriculture, forestry, and fisheries sector as the owner of an incorporated business, professional practice, or farm. Despite working long hours (60 per week), he did not have any capital gain or loss last year. His education level is college for one or more years without a degree.###\nHence this label was Yes."
"The person is a 34-year-old White male from the United States, currently married and working in the private sector as a craft and repair employee. He is a high school graduate, works 40 hours per week, and had no capital gain or loss last year. Based on this information, it is predicted that his annual income is not over $50,000.###\nHence this label was No."
"This 24-year-old married White male, working as a private sector employee in the sales sector with a bachelor's degree, resides in the United States. He is the husband in the household, working 35 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 60-year-old married White male from the United States. He is the husband in the household and owns an incorporated business, professional practice, or farm. His occupation is in execution and management. He had a capital gain of $7688 and no capital loss last year. He received education for less than one year in college and works 50 hours per week.###\nHence this label was Yes."
"This individual is a 22-year-old White male from the United States. He is never married and not living with family. He works in the private sector as an employee in the cleaning and maintenance sector, putting in 40 hours per week. He finished 12th class without receiving a diploma. Last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 55-year-old married white male from the United States. He works in the craft and repair sector as a private sector employee, with a high school graduate education. Last year, he had no capital gain but incurred a capital loss of $1672. He works 45 hours per week as a husband in the household.###\nHence this label was No."
"The person is a 34-year-old White male, married and considered the husband in their household. They are from the United States and work in the craft and repair sector as the owner of a non-incorporated business, professional practice, or farm. Last year, they had no capital gains or losses. Their education level is some college without a degree. They work 45 hours per week.###\nHence this label was No."
"This person is a 21-year-old White female from the United States who has never been married and is not living with family. She is a high school graduate with no specified occupation or work class. Last year, she had a capital gain of 1055 and no capital loss, and she works 40 hours per week.###\nHence this label was No."
"This 28-year-old never-married Asian female works in the private sector as an office and administrative support employee in the United States. She is not living with family and has no capital gain or loss from the previous year. She has attended college for one or more years but does not have a degree, and she works 45 hours per week. Based on this information, it is predicted that her annual income is below $50,000.###\nHence this label was No."
"A 47-year-old White female, divorced, not living with family in the United States. She works in the private sector as an executive manager, with no capital gain or loss last year. She has had some college education for less than a year and works 48 hours per week.###\nHence this label was No."
"This individual is a 50-year-old Asian-Pac-Islander male from the United States. He is divorced and not living with family. He works in an office and administrative support role in the private sector, with an associate's degree education. He had no capital gains or losses last year and typically works 40 hours per week.###\nHence this label was No."
"This is a 17-year-old White female from the United States who has never been married. She is categorized as an own-child in the household. She works in the service sector as a private sector employee, with a capital gain and loss of 0 last year. She has completed up to 11th class education and works 16 hours per week.###\nHence this label was No."
"The person is a 42-year-old White male who is divorced and not living with family. He works as a machine operator and inspector in the private sector in the United States. His education level is college for less than one year. Last year, he had no capital gain but incurred a capital loss of $1590. He works 40 hours per week.###\nHence this label was No."
"This is a 75-year-old male, White, married individual from the United States. He works in the agriculture, forestry, and fisheries sector as the owner of a non-incorporated business, professional practice, or farm. With a high school education, he works 20 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This dataset includes information about a 58-year-old White female from the United States who is married and works as a sales sector employee in the private sector. She is the wife in her household and is a high school graduate. She had no capital gain or loss last year and works 38 hours per week. The data aims to predict whether her annual income exceeds $50,000.###\nHence this label was No."
"The person is a 28-year-old White male from the United States, married, and working in the private sector as an employee in the agriculture, forestry, and fisheries sector. He is the husband in the household and has a high school education. Despite working 50 hours per week, he did not have any capital gain or loss last year.###\nHence this label was No."
"The individual is a 47-year-old Black female from the United States. She is divorced and not living with any family member. She works in the private sector in the transportation, communication, and other public utilities sector. She had no capital gain or loss last year. She has completed up to 11th class in education and works 40 hours per week.###\nHence this label was No."
"The person is a 50-year-old White male from the United States. He is divorced and not living with any family member. He is a highly educated professional with a master's degree and works in the field of execution and management. He is the owner of an incorporated business, professional practice, or farm, working an intense 80 hours per week. Last year, he did not experience any capital gain or loss.###\nHence this label was Yes."
"This is a 42-year-old Black female in the United States. She is divorced and not living with any family members. She works as a machine operator and inspector in the private sector, with a 9th-grade education. Last year, she had no capital gains or losses. She works 46 hours per week.###\nHence this label was No."
"This individual is a 29-year-old White female from the United States. She is divorced and currently classified as an own-child in the household. Her occupation, work class, and education level are unspecified. Last year, she had no capital gain or loss. She works 15 hours per week.###\nHence this label was No."
"The person is a 22-year-old White male living in the United States. He has never been married and is not living with family. He works in the private sector as an employee in the cleaning and maintenance sector. He has no capital gain or loss from last year. His education level is college for less than one year. He works 40 hours per week.###\nHence this label was No."
"This person is a 44-year-old white male from the United States. He is married and works in the private sector as a craft and repair worker. Despite working 56 hours per week, he did not have any capital gain or loss last year. He has received some college education but for less than a year.###\nHence this label was Yes."
"This individual is an 18-year-old White male from the United States who has never been married. He is not living with family and works in the sales sector as a private sector employee. He has completed 10th grade education and works 20 hours per week. Last year, he did not have any capital gains or losses.###\nHence this label was No."
"This dataset entry describes a 19-year-old White female from Mexico who is never married. She is classified as an Other-relative in terms of her relation to the head of the household. She works in the sales sector as a private sector employee, with a high school education. She had no capital gains or losses last year and works 28 hours per week.###\nHence this label was No."
"This individual is a 51-year-old married white male from the United States. He works in the craft and repair sector for the state government, has a high school education, and works 45 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"The person is a 39-year-old unmarried White female from the United States. She is divorced and works in the craft and repair sector for the local government. She is a high school graduate and works 40 hours per week with no significant capital gain or loss last year.###\nHence this label was No."
"The individual is a 27-year-old married White male from Mexico. He works in the service sector as a private sector employee, with a 52-hour work week. He has no capital gain or loss from the previous year and has completed 6th grade education.###\nHence this label was No."
"The person is a 66-year-old married White male from the United States. He works as an owner of an incorporated business, professional practice, or farm in an executive and management role. He finished 8th class for education and works 50 hours per week. He did not have any capital gains or losses last year. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"This 18-year-old White female is never married and lives with her parent(s) in the United States. She works in the service sector as a private sector employee, having finished 11th class for her education. With no capital gains or losses last year, she works 15 hours per week.###\nHence this label was No."
"The individual is a 28-year-old married White male from the United States working in the private sector as a sales employee. He has not attended college for more than a year and works 40 hours per week. Last year, he did not have any capital gains or losses. Based on the given information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"This individual is a 17-year-old White female from the United States who has never been married. She is classified as an own-child in relation to the head of the household. She works in the sales sector as a private sector employee, with a capital gain and loss of 0 last year. She has completed 11th class education and works 30 hours per week.###\nHence this label was No."
"This individual is a 28-year-old married Asian-Pac-Islander male from the Philippines working as an execution and management professional in the private sector. He has no capital gains or losses from last year, with an educational background of college for less than one year. He works 40 hours per week.###\nHence this label was No."
"This individual is a 31-year-old married White male from the United States. He works in the private sector as a sales sector employee, with a high school education. Last year, he had no capital gain or loss. He works 40 hours per week.###\nHence this label was No."
"The individual is a 36-year-old married White male living in the United States. He is employed in the private sector as a professional specialty worker, holding a bachelor's degree. Last year, he had no capital gains or losses. He works 40 hours per week and is identified as the husband in the household.###\nHence this label was Yes."
"The individual is a 56-year-old married White male from the United States. He works in the private sector as a professional specialty employee with a bachelor's degree. Despite having no capital gain or loss last year, he dedicates 50 hours per week to his job.###\nHence this label was No."
"This is a 32-year-old White female, married to the head of the household, residing in the United States. She works in the service sector as a private sector employee, with no capital gain or loss last year. She completed 12th grade without a diploma and works 40 hours per week.###\nHence this label was No."
"This individual is a 33-year-old Black female from the United States. She has never been married and is not living with any family members. She works in execution and management for the federal government, putting in 40 hours per week. She completed less than a year of college education. Last year, she did not have any capital gains or losses.###\nHence this label was No."
"The person is a 29-year-old White female from the United States. She has never been married and is not living with any family member. She works in the private sector as an office and administrative support employee, putting in 40 hours per week. With no capital gain or loss last year, she has received college education for less than a year.###\nHence this label was No."
"This individual is a 20-year-old White female from the United States who has never been married. She is the own-child of the head of the household and works as a machine operator and inspector in her own incorporated business, professional practice, or farm. She graduated from high school and works 30 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 45-year-old White male from the United States. He is married and works as a professional specialty in the private sector. Despite not completing a full year of college, he works 50 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The individual is a 63-year-old married White male from the United States. He works in the private sector as a sales employee, with a work week of 45 hours. He has not reported any capital gains or losses in the last year, and he has completed 8th grade education.###\nHence this label was No."
"This data represents a 27-year-old married White male from the United States. He is the husband in the household and works as an owner of a non-incorporated business, professional practice, or farm in the field of execution and management. He holds a bachelor's degree and works 60 hours per week. Last year, he did not experience any capital gains or losses.###\nHence this label was Yes."
"The person is a 22-year-old White male from the United States who has never been married and is not living with family. He works in the service sector as a private sector employee, with a high school degree as his highest level of education. Last year, he had a high capital gain of $14,084 and no capital loss. He works long hours, putting in 60 hours per week.###\nHence this label was Yes."
"This individual is a 45-year-old unmarried Asian-Pacific-Islander male, living in the United States. He is the owner of an incorporated business, professional practice, or farm, working in the sales sector. Despite being a high school graduate, he does not have any capital gain or loss from the previous year. He works 40 hours per week.###\nHence this label was No."
"The individual is a 43-year-old White male from the United States, married and working in the service sector for the local government. He has no capital gain or loss from the previous year and has received education for less than a year in college. He works 40 hours per week.###\nHence this label was No."
