"The client is a 32-year-old single individual working in a management position with tertiary education. They do not have any credit in default, but they have housing and personal loans. The average yearly balance in euros is 611. The client was contacted via cellular communication on the 9th of July, with a call duration of 353 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client for marketing purposes. The outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 60-year-old divorced admin with secondary education and no credit defaults. They have a low average yearly balance of 162 euros and do not have housing or personal loans. The communication type used is unknown, and the last contact was on the 27th of May, lasting for 74 seconds. This is the first contact made during this campaign, and there is no record of previous contacts or outcomes from past campaigns.###\nHence this label was No."
"The client is a 36-year-old married entrepreneur with a secondary level of education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is negative at -280 euros. The last contact was made on the 17th of August for only 6 seconds. This was the first call made to the client during this campaign. The outcome of the previous marketing campaign is unknown, and the communication type for this contact was through an unknown method.###\nHence this label was No."
"A 27-year-old single individual, working in a managerial position with a tertiary education, was contacted via cell phone for a banking campaign. They do not have any credit in default, housing, or personal loans. Their average yearly balance is 1277 euros. The call lasted 267 seconds, and this was the fourth time they were contacted during this campaign. There is no record of previous contact, and the outcome of the previous campaign is unknown. The call took place on the last day of January.###\nHence this label was No."
"The client is a 54-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, but have a housing loan. Their average yearly balance is 2110 euros and they do not have a personal loan. The communication with the client was through a cellular phone. The last contact was on the 22nd of August and lasted for 120 seconds. This was the 8th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old single technician with secondary education. They do not have credit in default, a housing loan, but have a personal loan. The average yearly balance is 469 euros. The contact was made via cellular communication, on the 9th of July, and lasted 313 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 58-year-old married individual working in a blue-collar job with unknown education status. They do not have any credit in default and do not have a housing loan, but they do have a personal loan. The average yearly balance in euros is 64. The communication type used for contact was cellular, and the last contact was on the 21st of July, with a duration of 78 seconds. This was the second contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old married individual working in a management position with a tertiary level of education. They do not have credit in default, have a housing loan, but no personal loan. The bank contacted them via cellular communication on the 21st of November with a call duration of 197 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 432 euros.###\nHence this label was No."
"The client is a 28-year-old single blue-collar worker with a secondary education. They do not have credit in default and have a housing loan. They were contacted through an unknown communication type and the last call duration was 115 seconds. This is the first time they have been contacted during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old single individual working in administration with tertiary education. They do not have credit in default but have a housing loan. They have an average yearly balance of 373 euros and do not have a personal loan. The client was contacted via cellular communication, with the last call lasting 78 seconds on the 14th day of August. This was the 1st contact during the current campaign, following 4 previous contacts. The outcome of the previous marketing campaign was 'other', and 79 days had passed since the client was last contacted.###\nHence this label was No."
"The client is a 60-year-old retired individual who is married and has primary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 6th of October for a duration of 205 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown. The client has an average yearly balance of 71188 euros.###\nHence this label was No."
"The client is a 59-year-old married individual working in administration with unknown education status. They do not have any credit in default and do not have any housing or personal loans. Communication was made via cellular phone, with the last call lasting 45 seconds on the 6th day of August. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, and the client's average yearly balance is 64343 euros.###\nHence this label was No."
"The client is a 40-year-old single individual working in administration with a secondary education. They do not have any credit in default and have an average yearly balance of 877 euros. They have a housing loan but no personal loan. They were contacted via an unknown communication type on the 28th of May, with the call lasting 318 seconds. This was the 6th contact made to this client during the current campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old married individual working in the services sector with a secondary level of education. They do not have any credit in default but have a housing loan. They have an average yearly balance of 2083 euros and do not have a personal loan. The last contact was made via cellular communication, lasting 190 seconds. This is the third contact made during this campaign, with the previous contact made 355 days ago. Prior to this campaign, there were 2 contacts made. The outcome of the previous marketing campaign was categorized as \"other\".###\nHence this label was No."
"The client is a 34-year-old married technician with secondary education. They do not have credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 12th of August. The call lasted 201 seconds and it was the second contact made during this campaign. The client was last contacted 267 days ago from a previous campaign, where there was one previous contact made resulting in a failure outcome.###\nHence this label was No."
"The client is a 42-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication. The client was last contacted on the 9th of April and the call lasted for 311 seconds. This was the second time they were contacted during this campaign, with the previous contact being 336 days ago and ending in failure. The client's average yearly balance is 1773 euros.###\nHence this label was No."
"The client is a 30-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan. They have a relatively high average yearly balance of 913 euros and do not have a personal loan. The client was last contacted in August via a cellular communication type and the call duration was 341 seconds. This is the fourth contact made during this campaign to this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. They were last contacted via cellular communication on the 11th of August and the call lasted 90 seconds. This was the third contact made with the client during this campaign. The client has not been previously contacted. The outcome of the previous marketing campaign is unknown. The average yearly balance in euros for this client is 1166.###\nHence this label was No."
"The client is a 46-year-old single individual working in a management position with a tertiary level of education. They do not have any credit in default and possess a housing loan but no personal loan. The client was contacted via cellular communication, with the last call lasting 190 seconds on the 29th of January. This was the third time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 593 euros.###\nHence this label was No."
"The client is a 30-year-old self-employed individual who is married with a primary education. They do not have credit in default and have an average yearly balance of 674 euros. They have a housing loan but do not have a personal loan. The bank contacted them via cellular communication on the 21st of November, and the call lasted for 72 seconds. This was the second time they were contacted during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old single individual working as a blue-collar worker with primary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 20th of November and the call duration was 758 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with this client is unknown. The client's average yearly balance is 121 euros.###\nHence this label was Yes."
"A 48-year-old married individual working in a blue-collar job with primary education was contacted for a marketing campaign. They do not have credit in default but have a housing loan. They were previously contacted 18 times during this campaign, with the last contact lasting 18 seconds on the 19th of June. There is no record of any previous contact or outcome from a previous campaign. Their average yearly balance is 237 euros and they do not have a personal loan. The communication type for this contact is listed as unknown.###\nHence this label was No."
"The client is a 42-year-old married individual working in the services sector with secondary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The average yearly balance in euros is 9277. The contact was made via cellular communication, and the call duration was 395 seconds. This was the first contact during this campaign, and there were 3 previous contacts. The client was last contacted 361 days before this campaign. The outcome of the previous marketing campaign was 'other'.###\nHence this label was No."
"The client is a 42-year-old divorced individual working in management with tertiary education. They do not have credit in default and have a personal loan but no housing loan. They were contacted via cellular communication on the 28th of January for 228 seconds. This is the first contact made during this campaign. There is no information on previous campaign outcomes or prior contacts with the client. The client's average yearly balance is 266 euros.###\nHence this label was No."
"The client is a 33-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. The average yearly balance is 2284 euros. The client was contacted via cellular communication on the 7th of July for 210 seconds, as part of the 2nd contact in the current campaign. There was no previous campaign contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 35-year-old single individual working in the services sector with secondary education was contacted via cellular communication. They do not have a housing loan but do have a personal loan. Their average yearly balance is 2110 euros. During the current campaign, they were contacted once, which lasted 39 seconds. This client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 49-year-old single individual working as a blue-collar worker with primary education. They do not have any credit in default and have an average yearly balance of 87 euros. The client has a housing loan but no personal loan. The bank contacted them via telephone on the 14th of May for a duration of 162 seconds. This was the second time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 70-year-old retired married individual with secondary education. They do not have credit in default and do not have a housing or personal loan. The bank contacted them via cellular communication and the last call lasted 149 seconds. This is the second call during this campaign, with a gap of 182 days since the previous contact. The client was contacted once before this campaign, with the previous marketing campaign resulting in failure. The client's average yearly balance is 616 euros.###\nHence this label was No."
"The client is a 36-year-old married individual working in an administrative role with a secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The client was contacted by phone, but the communication type is unknown. The last contact was on the 18th of June, lasting 604 seconds. This was the 6th contact made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 542 euros.###\nHence this label was No."
"The client is a 30-year-old single individual working in the services sector with primary education. They do not have any credit in default, but they have a housing loan. They were contacted via cellular communication on the 6th of May and the call lasted 457 seconds. This was the second time they were contacted during this campaign, with the previous contact being 358 days ago. The outcome of the previous campaign was categorized as 'other'. The client has an average yearly balance of 411 euros and does not have a personal loan.###\nHence this label was No."
"The client is a 36-year-old blue-collar worker who is divorced and has a secondary level of education. They do not have any credit in default and have an average yearly balance of 107 euros. They have a housing loan but no personal loan. The communication type used for contacting the client is cellular. The last contact was made on the 31st of July and lasted for 134 seconds. This is the second time they have been contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old single individual working in the services sector with a secondary level of education. They do not have any credit default and do not have any housing or personal loans. Communication was conducted via a cellular phone, with the last call lasting 271 seconds on the 29th of September. This was the first contact made with the client during this campaign. The outcome of any previous marketing campaigns with this client is unknown. The client's average yearly balance is 1934 euros.###\nHence this label was Yes."
"The client is a 52-year-old unemployed married individual with primary education. They do not have credit in default, do not have a housing loan but have a personal loan. The communication with the client was done via cellular phone. The last contact was on the 29th of January and lasted 141 seconds. This was the first contact made during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown. The average yearly balance is negative at -110 euros.###\nHence this label was No."
"The client is a 34-year-old married technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 390 euros. The contact was made via cellular communication, with the last call lasting 95 seconds on the 27th of March. This was the second contact in the current campaign, following up after 231 days from the previous campaign where there were also 2 contacts. The outcome of the previous marketing campaign was a failure.###\nHence this label was Yes."
"The client is a 33-year-old married individual working as a blue-collar worker with secondary education. They have credit in default, a housing loan, and a personal loan. The average yearly balance is negative at -406 euros. The communication type used for the contact was cellular, with the last call made on the 14th of July and lasting for 332 seconds. This was the second contact made during this campaign, with no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old married individual working as a blue-collar worker with a secondary education. They do not have any credit default history and have a housing loan. The client does not have a personal loan. They were contacted through an unknown communication type on the 29th of May. The call duration was 514 seconds, and it was the third contact made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1017 euros.###\nHence this label was No."
"The client is a 39-year-old single individual working as a blue-collar worker with primary education. They do not have any credit in default and have an average yearly balance of 446 euros. They have a housing loan but no personal loan. The last contact made was on the 12th of May with a duration of 183 seconds. This was the first contact made during the current campaign. The outcome of the previous marketing campaign is unknown. The communication type used for contact is also unknown.###\nHence this label was No."
"The client is a 39-year-old married individual working in administration with a secondary education. They do not have credit in default but have a housing loan. They have an average yearly balance of 3047 euros and do not have a personal loan. The communication type for the marketing campaign was cellular, and the last contact was on the 11th of May. The call duration was 279 seconds, this was the first contact made during this campaign, and there were 2 contacts made with the client in previous campaigns. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 59-year-old married individual working in a management position with tertiary education. They do not have any credit in default and do not have any housing or personal loans. The average yearly balance in their account is 7049 euros. The communication type for contacting the client is unknown. The client was last contacted on the 11th of June and the call duration was 647 seconds. This is the second time they have been contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"This is a profile of a 37-year-old single person working in management with tertiary education. They do not have credit in default and have an average yearly balance of 331 euros. They have a housing loan but no personal loan. The communication with them was done via cellular phone. The last contact was on the 8th of May and lasted for 94 seconds. This was the third contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old self-employed individual who is single and has a tertiary level education. They do not have any credit in default and maintain an average yearly balance of 120 euros. They have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 8th of May, with the call lasting 239 seconds. This is the second contact made during the current campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 54-year-old married individual working in the services sector with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 29th of July and had a 481-second conversation. This was the third contact made during this campaign, with no previous contact history available. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2681 euros.###\nHence this label was No."
"The client is a 44-year-old married technician with secondary education. They do not have credit in default but have a housing loan. They have no personal loan. The communication type during the marketing campaign was unknown. The client was last contacted on the 30th of May for 243 seconds, and this was the third contact made during this campaign. There were no previous contacts with this client before this campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 29-year-old unemployed single individual with a secondary education. They do not have any credit in default, but have a housing loan. They do not have a personal loan. The communication type used for contacting the client is unknown. The client was last contacted on the 26th of September for a very short duration of 6 seconds. This is the first contact made to the client during this campaign. There is no information available about any previous marketing campaign outcome. The client's average yearly balance is 670 euros.###\nHence this label was No."
"The client is a 53-year-old married individual working in the services sector with secondary education. They do not have any credit in default and do not have a housing loan, but they do have a personal loan. The average yearly balance in their account is 2774 euros. The client was contacted via an unknown communication type on the 19th of June and the call lasted 193 seconds. This was the first contact during this campaign, and there were no previous campaign contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 60-year-old married technician with a secondary education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via telephone on the 23rd of July, with a call duration of 248 seconds, as part of their second campaign for this client. The outcome of the previous campaign is unknown. The client's average yearly balance is 591 euros.###\nHence this label was No."
"The client is a 57-year-old divorced individual working in the services sector with a primary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 1920. The contact communication type is unknown, and the last contact was made on the 19th of May, with a duration of 77 seconds. This was the second contact made during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 2nd of April, with the call lasting 1164 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1612 euros.###\nHence this label was Yes."
"The client is a 45-year-old single individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is 999 euros. The client was contacted via cellular communication on the 29th of January and the call lasted for 182 seconds. This was the second time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old divorced individual working in an administrative role, with secondary education. They do not have any credit in default but have housing and personal loans. Their average yearly balance is negative. The last contact was made on the 28th of May, with a duration of 270 seconds. This was the 4th contact during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The communication type for this contact was unknown.###\nHence this label was No."
"A 33-year-old single entrepreneur with a tertiary education, who does not have credit in default, holds a housing loan but no personal loan. The client was contacted via cellular communication and had a relatively high average yearly balance of 484 euros. The last contact was on the 29th of January for a duration of 537 seconds. This was the first contact made during the current campaign, and there was no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 56-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan as well as a personal loan. The average yearly balance is 173 euros. The communication for the marketing campaign was done via telephone, with the last contact being on the 23rd of July for 31 seconds. This was the 2nd time the client was contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old married individual working in an administrative role with primary education. They do not have any credit in default, but have a housing loan. They have an average yearly balance of 1351 euros and do not have a personal loan. The last contact made with the client was on the 20th of May, with a duration of 325 seconds. This was the third contact made during this campaign, with no previous contacts before this. The outcome of the previous marketing campaign is unknown, as well as the type of communication used during the contact.###\nHence this label was No."
"The client is a 38-year-old married technician with a secondary education. They do not have credit in default, have a housing loan, but no personal loan. The bank contacted them via cellular communication on the 7th of May. The call lasted 198 seconds, and this was the 2nd contact made to the client during this campaign. It was the first time they were contacted by the bank. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 2000 euros.###\nHence this label was No."
"The client is a 41-year-old unemployed married individual with secondary education. They do not have credit in default and have an average yearly balance of 356 euros. They have a housing loan but no personal loan. The communication type for the last contact is unknown, which occurred on the 16th of May and lasted 80 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old married individual working in the services sector with secondary education. They do not have credit in default but have a housing loan. They were contacted via cellular communication on the 11th of July, and the call lasted for 210 seconds. This was the second contact made during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and has an average yearly balance of -601 euros.###\nHence this label was No."
"The client is a 47-year-old divorced technician with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in September. The client was last contacted on the 15th of the month for 170 seconds. This was the first contact during this campaign, but they were contacted 3 times in a previous campaign where the outcome was a failure. The client's average yearly balance is 1013 euros.###\nHence this label was Yes."
"This individual is a 28-year-old single blue-collar worker with a secondary education. They do not have any credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 13th of March and had a 61-second conversation. This was the 11th time they were contacted during this campaign, with 282 days passing since they were last contacted from a previous campaign. They had one previous contact, resulting in an \"other\" outcome. Their average yearly balance is 387 euros.###\nHence this label was No."
"The client is a 46-year-old married technician with tertiary education. They do not have credit in default, but have a housing loan. They were contacted via telephone on the 30th of January and the call lasted 162 seconds. This was the 3rd contact during this campaign and there were 7 previous contacts. The client was last contacted 2 days ago from a previous campaign where the outcome was other. They do not have a personal loan and have an average yearly balance of 43 euros.###\nHence this label was No."
"The client is a 47-year-old married blue-collar worker with primary education. They do not have credit in default but have a housing loan and a personal loan. The bank contacted them via cellular communication, lasting 172 seconds. This is the second time they have been contacted during this campaign, after 310 days from the previous one, which resulted in failure. Their average yearly balance is negative at -169 euros.###\nHence this label was No."
"The client is a 46-year-old married technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the last day of July for 37 seconds. This was the 10th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 499 euros.###\nHence this label was No."
"The client is a 20-year-old blue-collar worker who is single and has secondary education. They do not have credit in default and have a yearly balance of 76 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 18th of May and the call lasted 639 seconds. This was the second contact made during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 23-year-old single individual working in an administrative role with a tertiary education. They do not have any credit in default and have an average yearly balance of 897 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 190 seconds on the 8th day of February. This was the 2nd contact during the current campaign, following up after 280 days from the previous campaign where they were contacted 8 times and the outcome was a failure.###\nHence this label was Yes."
"The client is a 51-year-old married individual working in a management role with a tertiary education. They do not have any credit in default and have a housing loan. They were contacted via an unknown communication type in May. The client has an average yearly balance of 307 euros and does not have a personal loan. During the current campaign, they were contacted twice, with the last call lasting 206 seconds on the 30th day of the month. There is no record of previous contacts or outcomes from past marketing campaigns.###\nHence this label was No."
