"The client is a 41-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is negative. They were last contacted in May, on the 27th day, through an unknown communication type for 269 seconds. This is their 11th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old blue-collar worker who is single and has secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via an unknown communication type on the 14th of May. The call lasted for 229 seconds, and it was the first contact made during this campaign. There is no record of previous contact with the client, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 24 euros.###\nHence this label was No."
"The client is a 59-year-old married individual working in management with a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 22nd of May and the call lasted for 431 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 2239 euros.###\nHence this label was Yes."
"A 25-year-old single individual, working as an admin and with secondary education, was contacted via cellular communication for a marketing campaign. They have no credit in default, do not have a housing loan but have a personal loan. The average yearly balance in euros is 0. The client was contacted on the 25th of July for 49 seconds, this being the first contact during this campaign. There is no record of any previous marketing campaign outcome or contact history with the client.###\nHence this label was No."
"The client is a 24-year-old blue-collar worker who is single and has secondary education. They do not have any credit in default but have a housing loan. They were contacted via cellular communication on the 18th of May and the call duration was 424 seconds. This is the second time they have been contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 5482 euros and does not have a personal loan.###\nHence this label was No."
"A 59-year-old retired single individual with a secondary education was contacted for a marketing campaign. They do not have credit in default, have a housing loan, but no personal loan. The communication type was unknown. The call was made on the 27th of May and lasted for 1063 seconds. This was the 5th contact made during this campaign. There were no previous contacts made with this client. The outcome of the previous marketing campaign is unknown. The average yearly balance for this individual is 351 euros.###\nHence this label was Yes."
"The client is a 45-year-old married individual working in management with tertiary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 210 euros. The communication type used for contact is cellular. The last contact was made on the 21st of July and lasted for 623 seconds. This was the first contact made to the client during this campaign. There is no information on previous marketing campaign outcomes or prior contacts with the client.###\nHence this label was No."
"The client is a 23-year-old single individual working in administration with a secondary education. They do not have credit in default and have an average yearly balance of 589 euros. They have a housing loan but no personal loan. The communication type for contact is cellular. The last contact was on the 6th of May, lasting 62 seconds. This is the first contact made with the client during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"This data represents a 29-year-old single technician with secondary education. They do not have any credit in default, housing loan, or personal loan. The client was contacted via cellular communication and the last call duration was 64 seconds. This client was previously contacted 3 times during this campaign and 3 times before. The last contact was made on the 27th of August and the previous marketing campaign's outcome was categorized as 'other'. The average yearly balance in euros for this client is 382.###\nHence this label was No."
"The client is a 39-year-old divorced individual working in the services sector with secondary education. They do not have any credit in default but have a housing loan. They were contacted via cellular communication on the 9th of July and the call lasted 869 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. They have an average yearly balance of 687 euros and do not have a personal loan.###\nHence this label was Yes."
"The client is a 35-year-old blue-collar worker who is single and has primary education. They do not have credit in default but have a housing loan. Their average yearly balance is negative. They do not have a personal loan. The bank contacted them via cellular communication on the 14th of July, with a call duration of 183 seconds. This is their third contact during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default, have a housing loan, and do not have a personal loan. The average yearly balance in euros is 19. The client was contacted through an unknown communication type on the 29th of May, with a call duration of 33 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old single technician with a secondary education. They do not have any credit in default but have a housing loan. They have no personal loan. The communication type used for contacting the client was cellular. The client was contacted on the 10th of February and the call lasted for 515 seconds. This was the first contact made during this campaign. There is no information on previous campaign outcomes or previous contacts with the client. The client's average yearly balance is 1693 euros.###\nHence this label was Yes."
"The client is a 60-year-old retired married individual with primary education and no credit in default. They have an average yearly balance of 1216 euros and do not have a housing or personal loan. The client was contacted via cellular communication on the 28th of January for 156 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old married individual working in the services sector with tertiary education. They do not have any credit in default, but they do have a housing loan. They were contacted via cellular communication on the 8th of May and the call lasted for 52 seconds. This was the first contact made during this campaign. Their average yearly balance is 0 euros and they do not have a personal loan. The outcome of any previous marketing campaign is unknown, as this client was not contacted previously.###\nHence this label was No."
"The client is a 52-year-old married technician with tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication. The last contact was on the 9th of August, lasting 145 seconds. This was the 3rd contact during this campaign and the 4th overall. The previous marketing campaign was successful.###\nHence this label was No."
"The client is a 35-year-old single individual working in a management position with tertiary education. They do not have any credit in default and have an average yearly balance of 870 euros. They have a housing loan but do not have a personal loan. The client was contacted through an unknown communication type on the 29th of May and the call lasted 188 seconds. This was the 6th contact made during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"This data represents a 34-year-old married entrepreneur with tertiary education. They do not have any credit in default but have a housing loan. They were contacted via cellular communication and the last call lasted 141 seconds. This was the second time they were contacted during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 60-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 15th of May, with a call duration of 109 seconds. This was the 11th contact made during this campaign, following up after 373 days from the previous campaign contact. There was 1 contact made in the previous campaign, which resulted in an outcome categorized as 'other'.###\nHence this label was No."
"The client is a 30-year-old married individual working in the services sector with a secondary level of education. They do not have credit in default, have a housing loan but no personal loan. The average yearly balance is 80 euros. The client was contacted via an unknown communication type on the 8th day of the month of May, with a call duration of 185 seconds. This was the second time they were contacted during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default, but have a housing loan. They were not previously contacted for a marketing campaign. They do not have a personal loan. The contact was made via cellular communication on the 20th of April. The client's average yearly balance is -337 euros. The last contact duration was 326 seconds, and a total of 3 contacts were made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old single individual working in an administrative role with secondary education. They do not have any credit in default and do not have any housing or personal loans. The bank communicated with them via cell phone and contacted them once during the campaign in April. The call lasted 571 seconds. The client had not been previously contacted for a marketing campaign, and the outcome of any previous campaigns is unknown. The client's average yearly balance is 377 euros.###\nHence this label was Yes."
"The client is a 49-year-old single administrative worker with a secondary education. They do not have credit in default and have a housing loan. They were contacted via cellular communication on the 18th of May. The client's average yearly balance is 1150 euros, and they do not have a personal loan. The last contact duration was 126 seconds, and this was the second contact made during this campaign. The client was last contacted 355 days ago from a previous campaign, where the outcome was a failure.###\nHence this label was No."
"The client is a 58-year-old retired married individual with primary education. They do not have credit in default but have a housing loan. They have an average yearly balance of 269 euros and do not have a personal loan. The communication type for contacting the client is unknown. The client was last contacted on the 16th of May for 38 seconds, as part of the 2nd contact during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 53-year-old married individual working in an administrative role with a secondary education. They do not have any credit in default and have both a housing and personal loan. They were contacted via cellular communication and the last call lasted for 116 seconds. This was the second contact made during this campaign and a total of three contacts have been made so far. The client was last contacted 188 days ago from a previous campaign, which resulted in a successful outcome.###\nHence this label was No."
"The client is a 35-year-old single technician with secondary education. They do not have credit in default, but have a housing loan. They were last contacted in November via cellular communication, with a call duration of 57 seconds. This was the 6th contact during this campaign, following 4 previous contacts. The average yearly balance is -476 euros, and they do not have a personal loan. The outcome of the previous marketing campaign was a failure, and the last contact was made 177 days after the client was last contacted.###\nHence this label was No."
"The client is a 30-year-old single individual working in a management role with a tertiary level of education. They do not have any credit in default, but they do have a housing loan. They have an average yearly balance of 78 euros and do not have a personal loan. The communication type used for contacting the client is unknown. The client was last contacted on the 15th of May and the call duration was 73 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working in management with unknown educational background. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication. The last contact was on the 5th of February and lasted 58 seconds. This was the first contact during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 169 euros.###\nHence this label was No."
"The client is a 52-year-old unemployed married individual with a secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 13th day of August. The call lasted for 684 seconds, and this was the second time they were contacted during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 9139 euros.###\nHence this label was No."
"The client is a young, 21-year-old single individual working in a blue-collar job with secondary education. They do not have any credit in default but have a housing loan. They have an average yearly balance of 1385 euros and do not have a personal loan. The client was contacted via cellular communication and the last call duration was short, only 12 seconds. This is the fifth contact made to the client during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 54-year-old married technician with tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 26th of May, with a call duration of 145 seconds. This is the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 6507 euros.###\nHence this label was No."
"The client is a 32-year-old single individual working in administration with a secondary education. They do not have credit in default and have a yearly average balance of 739 euros. The client has a housing loan but no personal loan. They were contacted via cellular communication, with the last call lasting 91 seconds on the 20th of November. This was the third contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 56-year-old married technician with secondary education and no credit in default. They have a low average yearly balance of 2065 euros and do not have any housing or personal loans. The bank contacted the client via cellular communication on the 14th day of August and the call lasted for 71 seconds. This was the second time the client was contacted during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old married housemaid with primary education. They do not have credit in default and do not have a housing loan but have a personal loan. They were contacted via cellular communication on the 11th of July and the call lasted for 83 seconds. This was the second time they were contacted during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old married individual working in management with a tertiary education. They do not have any credit in default, but have a housing loan. They have a yearly average balance of 303 euros and do not have a personal loan. The communication type for the last contact is unknown, which lasted for 143 seconds on the 14th day of May. This is the first contact made during this campaign, and there was no previous contact. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 43-year-old divorced individual working in a management position with a tertiary level of education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication, and the last call was made on the 22nd of July, with a duration of 211 seconds. This was the third contact made during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3163 euros.###\nHence this label was No."
"The client is a 27-year-old single individual working as an admin, with tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is 73 euros. The client was contacted via cellular communication on the 29th of January, with a call duration of 242 seconds. This is the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in euros is 582. The communication type used for contact was cellular, and the last contact was made on the 21st of July, with a duration of 83 seconds. This is the second contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old self-employed individual who is married and has a tertiary level of education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via an unknown communication type on the 5th of May, and the call lasted 286 seconds. This was the first contact made to the client during this campaign. There is no information available about any previous marketing campaigns involving this client.###\nHence this label was No."
"The client is a 51-year-old married technician with secondary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication, and the last call lasted 132 seconds. This was the third call made to the client during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous campaign is unknown. The client's average yearly balance is 223 euros.###\nHence this label was No."
"The client is a 34-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default and have housing and personal loans. They were contacted via an unknown communication type on the 16th of May. The client's average yearly balance is 695 euros. During this campaign, they were contacted 4 times, with the last contact lasting 1064 seconds. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 48-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default and have an average yearly balance of 1778 euros. They have a housing loan but no personal loan. The bank contacted them via telephone on the 8th of May, with a call duration of 267 seconds. This was the third time they were contacted during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 30-year-old single individual working in the services sector with a secondary level education was contacted for a marketing campaign. They do not have a credit in default, housing loan, or personal loan. The average yearly balance in euros is 63. The contact was made through an unknown communication type in August, and the call lasted for 75 seconds. This was the first contact made during this campaign, and there is no record of previous marketing outcomes for this client.###\nHence this label was No."
"The client is a 41-year-old married individual working in management with tertiary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The average yearly balance is negative at -370 euros. The last contact was made via cellular communication in May on the 8th day, with a duration of 233 seconds. This was the second contact made during this campaign. The client was not contacted in any previous campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication, reaching out on the 11th of May for a duration of 577 seconds. This was the second time they were contacted during this campaign, with 368 days passing since their last contact from a previous campaign. The outcome of the previous marketing campaign for this client was classified as \"other.\" Their average yearly balance is 2548 euros.###\nHence this label was No."
"The client is a 52-year-old married individual working in a management role with a tertiary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 1339 euros and do not have a personal loan. The client was last contacted in August via cellular communication, with the call lasting 343 seconds. This was the 5th contact made during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old unemployed individual who is married with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 822. The communication type during the contact is unknown. The last contact was on the 1st of August and lasted for 11 seconds. This is the first contact made during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married technician with tertiary education. They do not have credit in default, but have a housing loan. They have an average yearly balance of 1524 euros and do not have a personal loan. The bank contacted them via cellular communication on the 16th of April, with a call duration of 399 seconds. This is the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old married technician with a tertiary education. They do not have credit in default but have housing and personal loans. They were contacted via an unknown communication type on the 26th of May. The client's average yearly balance is negative. They were contacted for 523 seconds during this campaign, which is the second contact made. There was no previous contact with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default, but have a housing loan. Their average yearly balance is 2305 euros and they do not have a personal loan. The bank contacted them via cellular communication on the 18th of November for 301 seconds. This is the first contact during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 43-year-old married housemaid with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 12th of August. The call lasted 121 seconds, and this was the second time they were contacted during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 25 euros.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with a secondary level of education. They do not have any credit in default and do not have a housing loan, but they do have a personal loan. The average yearly balance in euros is 752. The client was contacted via cellular communication on the 21st of November, with the call lasting 456 seconds. This was the second time they were contacted during this campaign, with the previous contact resulting in failure. Additionally, 157 days had passed since they were last contacted from a previous campaign.###\nHence this label was No."
"A 30-year-old single technician with secondary education, who has no credit in default, no housing loan, and no personal loan, was contacted via cellular communication on the 14th of August. They had an average yearly balance of 2782 euros. During this campaign, they were contacted twice, with the last call lasting 205 seconds. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old individual working in a management position and is divorced. They have a secondary level of education and no credit in default. Their average yearly balance is 0 euros and they do not have any housing or personal loans. The communication type used for contact is cellular. The last contact with the client was on the 17th of July, with a duration of 395 seconds. This is the third contact made during this campaign. The client has not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication in July. The client's average yearly balance is negative. The last contact with the client during this campaign lasted only 14 seconds. This is the 32nd contact made to the client during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 43-year-old married individual with a job in administration and secondary education was contacted via phone call for a marketing campaign by a Portuguese banking institution. They do not have any credit in default, housing loan, or personal loan. Their average yearly balance is 584 euros. The contact was made through an unknown communication type on the 20th of June, and lasted for 27 seconds. This was the first time they were contacted in this campaign, and there is no information available about any previous marketing campaigns.###\nHence this label was No."
"The client is a 53-year-old married individual working in the services sector with secondary education. They do not have credit in default and have a yearly average balance of 139 euros. They have a housing loan but no personal loan. The communication with the client was via cellular phone, with the last contact being on the 19th of August for 28 seconds. This was the 17th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old single individual working in an administrative role with unknown education status. They do not have any credit in default, housing loan, or personal loan. Their average yearly balance is 175 euros. The client was contacted via an unknown communication type on the 28th of May. The call duration was 597 seconds, and this was the third contact made to the client during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 54-year-old divorced individual working in management with tertiary education was contacted via telephone for a marketing campaign. They do not have credit in default, do not have a housing loan but have a personal loan. They had an average yearly balance of 92 euros. The call lasted 86 seconds and it was the 4th contact made during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old single individual working in a management position with a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 20th of November for a duration of 25 seconds as part of the current campaign, which is the 8th contact attempt. The client has not been previously contacted for any campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 819 euros.###\nHence this label was No."
"The client is a 55-year-old married housemaid with primary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 2152 euros. The contact communication type is unknown. The client was last contacted on the 19th of June and the call duration was 922 seconds. This is the second time they have been contacted during this campaign. There is no record of previous contact or outcome from previous marketing campaigns.###\nHence this label was Yes."
"The client is a 56-year-old individual with an unknown job and education level, who is married and has no credit in default. They do not have a housing or personal loan. The communication type used for contacting the client is unknown. The client was last contacted on the 20th of June, and the call lasted for 471 seconds. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married blue-collar worker with a secondary education. They do not have credit in default, do not have a housing loan, but have a personal loan. They were contacted via an unknown communication type on the 6th of June. The call lasted 189 seconds, and this was the 3rd contact made during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 926 euros.###\nHence this label was No."
"The client is a 47-year-old married technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 12th of August, with a call duration of 1613 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 568 euros.###\nHence this label was Yes."
"The client is a 30-year-old married individual working in management with a tertiary education. They do not have any credit in default and do not have housing or personal loans. The average yearly balance in their account is 4948 euros. The client was last contacted on the 21st of August via a cellular communication type and the call lasted for 376 seconds. This was the second contact made during this campaign, with no previous contacts made before. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 32-year-old married individual working in a blue-collar job with a secondary level of education. They do not have credit in default and have a housing loan. They do not have a personal loan. The communication type for contact is unknown. The client was last contacted on the 20th of May for 132 seconds. This was their first contact during this campaign. There is no information about previous campaign outcomes. The client's average yearly balance is 328 euros.###\nHence this label was No."
"The client is a 42-year-old married individual working as a blue-collar worker with a secondary level of education. They do not have credit in default and have an average yearly balance of 333 euros. They have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 9th of May and the call lasted for 190 seconds. This was the 3rd contact made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old divorced individual working in management with a tertiary level of education. They do not have credit in default and have an average yearly balance of 507 euros. They have a housing loan but no personal loan. The last contact was made via cellular communication on the 9th of April, with a duration of 528 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married individual working in the services sector with secondary education. They do not have any credit in default and have a housing loan. They were contacted via cellular communication for a marketing campaign. The last contact was made on the 4th of February and lasted for 215 seconds. This was the third contact during this campaign and the fourth overall. The previous marketing campaign resulted in failure. The client's average yearly balance is 357 euros, and they do not have a personal loan. They were last contacted 253 days ago from a previous campaign.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and do not have a housing loan, but they do have a personal loan. They were contacted via cellular communication and the last call duration was 125 seconds on the 21st of November. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3451 euros.###\nHence this label was No."
"The client is a 34-year-old divorced individual working in an administrative role with secondary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is at -220 euros. The contact communication type is unknown, and they were last contacted on the 12th of May for 115 seconds as part of the current campaign. This is the fourth contact made to the client during this campaign. There is no record of previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default, have a housing loan, but do not have a personal loan. The bank made a cellular phone call to contact them on the last day of July. The call lasted 207 seconds, and it was the second time they were contacted during this campaign. There was no previous contact with the client for marketing purposes. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 750 euros.###\nHence this label was No."
"The client is a 38-year-old married technician with tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is unknown. The communication type used for contacting the client was cellular. The last contact was made on the 8th of August and lasted 188 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working in management with tertiary education. They do not have credit in default and do not have housing or personal loans. The average yearly balance is 4654 euros. The client was contacted via cellular communication on the 17th of November, with a call duration of 251 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working in a management position with tertiary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication in August. The client's average yearly balance is 728 euros. The last contact duration was 275 seconds, and this was the 5th contact made during this campaign with the client. There were no previous contacts with the client before this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married housemaid with primary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 14th of July. The call duration was 340 seconds, and this was the third call made to the client during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 39-year-old married housemaid with a secondary education. They do not have credit in default and do not have any existing housing or personal loans. The average yearly balance in their account is 633 euros. The last contact was made on the 9th of June, lasting 233 seconds. This was the first contact made during this campaign. There is no information on previous campaign outcomes or prior contacts with the client. The communication type used for this contact is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual working in management with tertiary education. They have a credit in default, housing loan, and a personal loan. The average yearly balance is 327 euros. The bank contacted the client by phone, specifically on a cellular device, on the 9th of July, lasting for 556 seconds. This was the 5th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 54-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 26th of May. The call lasted for 135 seconds, and this was the second time they were contacted during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is negative, specifically -69 euros.###\nHence this label was No."
"A 32-year-old single male technician with a tertiary education and no credit in default, housing loan, or personal loan was contacted via cellular communication. \nDuring the current marketing campaign, he was contacted 3 times, with the last call lasting 159 seconds on the 21st of August. \nThere was no previous contact with him for marketing purposes, and the outcome of any previous campaign is unknown. \nHe maintains an average yearly balance of 178 euros.###\nHence this label was No."
"The client is a 56-year-old married individual working in an administrative role with secondary education. They do not have any credit in default, but have a housing loan. They were contacted via cellular communication on the 17th of November and the call lasted for 80 seconds. This was the second time they were contacted during this campaign, with a gap of 165 days since the last contact from a previous campaign. The client did not have a personal loan. The outcome of the previous marketing campaign was classified as \"other\". Their average yearly balance is 1270 euros.###\nHence this label was No."
"The client is a 60-year-old married individual working in management with tertiary education. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is 79 euros. They were contacted via an unknown communication type on the 11th of June and the call lasted for 48 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old single individual working in a management position with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 3343 euros. They were contacted via cellular communication on the 18th of November and the call lasted for 307 seconds. This was the first contact made during this marketing campaign. The outcome of any previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 47-year-old divorced individual working in an administrative role with a secondary level of education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via an unknown communication type on the 9th of May. The call lasted 203 seconds, which was the 4th contact made during this campaign. This client was not previously contacted. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 162 euros.###\nHence this label was No."
"A 30-year-old single blue-collar worker with secondary education was contacted for a marketing campaign. They do not have credit in default, have a housing loan but no personal loan. The bank had previously contacted them twice during this campaign. The last contact was on the 3rd of June, with a call duration of 235 seconds. The client's average yearly balance is 855 euros. The outcome of the previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 26-year-old student who is single and has a tertiary education. They do not have any credit in default, housing loan, or personal loan. The marketing campaign contacted them via cellular communication. The client was last contacted on the 5th of March for 87 seconds. This was the first contact during this campaign, with 2 previous contacts. The outcome of the previous marketing campaign was successful. The client's average yearly balance is 294 euros.###\nHence this label was Yes."
"The client is a 56-year-old married individual working in an administrative role with a secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in their bank account is 1671 euros. They were contacted via cellular communication on the 28th of May and the call lasted 158 seconds. This was the second call made to them during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 39-year-old married individual working in the services sector with secondary education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via cellular communication and the last call duration was 96 seconds on the 18th of November. This was the second call during this campaign, with the previous one being 182 days ago, resulting in a failed outcome. The average yearly balance is 173 euros.###\nHence this label was No."
"The client is a 33-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default, housing loan, or personal loan. The communication type used for contact was cellular. The last contact was made on the 20th of November, with a duration of 113 seconds. This was the first contact made during this campaign for this client, with no previous contacts. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 53 euros.###\nHence this label was No."
"A 22-year-old housemaid who is single and has secondary education was contacted via cellular communication. They do not have any credit in default, housing loan, or personal loan. With an average yearly balance of 1796 euros, they were previously not contacted for any marketing campaign. During the current campaign, they were contacted 3 times, with the last contact lasting 369 seconds on the 28th day of June. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 31-year-old married technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 344 euros. The last contact was made on the 7th of May using an unknown communication type, with a duration of 123 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old single individual working in management with a tertiary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 48 euros and do not have a personal loan. The client was contacted via cellular communication on the 19th of November and the call duration was 308 seconds. This was the 5th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old single individual working in a management position with tertiary education. They do not have any credit in default but have a housing loan. The client does not have a personal loan. The bank has tried to contact them 7 times during this campaign, with the last contact lasting 112 seconds. The client was not contacted in any previous marketing campaigns. The outcome of the previous campaign is unknown. The average yearly balance in euros for the client is 0. The communication type used for contacting the client is unknown, and the last contact was made on the 28th of May.###\nHence this label was No."
"The client is a 42-year-old blue-collar worker who is divorced. They have a secondary level of education and do not have any credit in default. Their average yearly balance is 1118 euros. They have a housing loan but no personal loan. The communication with the client was done via cellular phone. The last contact was on the 17th of April and lasted for 620 seconds. This was the first contact during the current campaign. There is no information on previous contacts or the outcome of any previous marketing campaigns.###\nHence this label was No."
"The client is a 30-year-old student who is single and has a tertiary education. They do not have any credit in default and do not have any housing or personal loans. They were contacted via cellular communication on the 6th of February for a duration of 38 seconds. This is the first time they have been contacted for this campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 300 euros.###\nHence this label was No."
"The client is a 30-year-old self-employed individual who is married with tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 20th of November for 80 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1930 euros.###\nHence this label was No."
"The client is a 60-year-old retired individual who is married and has secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 21st of August. The client's average yearly balance is 404 euros. During the current campaign, the client has been contacted twice and the last call lasted for 335 seconds. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working in the services sector with secondary education. They do not have credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 17th of April, with a call duration of 358 seconds. This was the second time they were contacted during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. They have an average yearly balance of 732 euros.###\nHence this label was No."
"The client is a 53-year-old married individual working in the services sector with a secondary level of education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular phone on the 18th of July and the call lasted for 91 seconds. This was the second call made to the client during this campaign. There were no previous contacts with the client regarding marketing campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1378 euros.###\nHence this label was No."
"The client is a 63-year-old retired individual who is married and has a secondary level education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via a cellular phone call on the 11th of September. The call lasted for 113 seconds. This was the second time they were contacted during this marketing campaign, with the previous contact occurring 80 days ago and resulting in a failed outcome. The client's average yearly balance is 2747 euros.###\nHence this label was No."
"A 46-year-old married individual working in a blue-collar job with secondary education, having no credit defaults, a housing loan but no personal loan. They were contacted via cellular communication and had a previous unsuccessful marketing campaign contact 397 days ago. They were last contacted in the month of August, with a call duration of 1529 seconds. They have an average yearly balance of 4855 euros. This client was contacted once during the current campaign and once in a previous campaign, resulting in a failure outcome.###\nHence this label was No."
"The client is a 45-year-old married individual working in management with tertiary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 22nd of August and the call lasted 112 seconds. This was the 3rd time they were contacted during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old student who is single and has a secondary level of education. They do not have any credit in default and have an average yearly balance of 4716 euros. They have a housing loan but do not have a personal loan. The client was contacted via an unknown communication type on the 26th of May, with a call duration of 329 seconds. This is the second contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married entrepreneur with a tertiary education and no credit in default. They do not have a housing loan or personal loan. The bank contacted them via cellular communication on the 1st of June and the call lasted for 761 seconds. This was the second time they were contacted during this campaign. There is no record of any previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 98 euros.###\nHence this label was No."
"The client is a 30-year-old unemployed individual who is married and has a tertiary education. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 14th of April, with a call duration of 111 seconds. This was the first call made to the client during this campaign. The outcome of the previous marketing campaign with the client is unknown. The client's average yearly balance is 330 euros.###\nHence this label was Yes."
"The client is a 46-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The average yearly balance is negative. The last contact was made on the 9th of May, with a call duration of 92 seconds. This is the second contact in the current campaign. There was no previous campaign contact. The outcome of the previous marketing campaign is unknown, as well as the communication type used for contact.###\nHence this label was No."
"The client is a 52-year-old married individual working in the services industry with an unknown education level. They do not have any credit in default and have a yearly balance of 482 euros. They have housing and personal loans. The communication with the client was done via cellular phone, and the last contact was on the 28th of July for 83 seconds. This was the 7th contact made during this campaign. There were no previous contacts with the client for this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old married individual working in administration with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication, with the last call lasting 180 seconds on the 14th day of August. This was the first contact during this campaign, but they were contacted twice before in a previous campaign that resulted in failure. The client has an average yearly balance of 169 euros.###\nHence this label was No."
"The client is a 55-year-old married housemaid with secondary education. They do not have credit in default and have a housing loan. They have been contacted via cellular communication, with the last call lasting 178 seconds. This is the 3rd contact during the current campaign, following 7 previous contacts. The last contact was made 357 days ago, where the outcome of the previous marketing campaign was a failure. The client does not have a personal loan and has an average yearly balance of 167 euros.###\nHence this label was No."
"The client is a 53-year-old divorced individual working in the services sector with a secondary level of education. They do not have any credit in default and have a housing loan. The client does not have a personal loan. The bank contacted them via an unknown communication type on the 3rd day of June. The call lasted for 70 seconds. This was the 6th contact made to the client during this campaign. The client has not been contacted before for any previous campaigns, and the outcome of the previous marketing campaign is unknown. Their average yearly balance is 43 euros.###\nHence this label was No."
"The client is a 60-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default but have a personal loan. Their average yearly balance is in the negative. They do not have a housing loan. The client was last contacted in July via a cellular communication for 282 seconds. This is the second time they have been contacted during the current campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default but have housing and personal loans. The average yearly balance in euros is 2085. The last contact was made on the 19th of May with a duration of 488 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, as well as the communication type used for contact.###\nHence this label was No."
"A 31-year-old married technician with tertiary education who does not have credit in default, housing loan, or personal loan. They were contacted through an unknown communication type on the 29th of May. The call lasted 71 seconds and it was the 5th contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 8 euros.###\nHence this label was No."
"The client is a 27-year-old married technician with secondary education. They do not have any credit in default but have a housing loan. Their average yearly balance is 374 euros, and they do not have a personal loan. The communication type for the marketing campaign is unknown. The client was last contacted on the 19th of May and the call duration was 188 seconds. This is the second time they have been contacted during this campaign. There is no record of previous contacts or outcome from a previous marketing campaign.###\nHence this label was No."
"The client is a 27-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 818 euros. The client was contacted through an unknown communication type in June, with the last contact lasting 188 seconds. This is the 5th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 52-year-old married technician with secondary education. They do not have any credit in default but have a housing loan. They were contacted via an unknown communication type on the 19th of May. The client's average yearly balance is 1781 euros, and they do not have a personal loan. The last contact duration was 144 seconds, with a total of 2 contacts performed during this campaign. They have not been previously contacted in a past campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old single individual working in the services sector with secondary education. They do not have credit in default and have a yearly average balance of 1482 euros. They have a housing loan but no personal loan. The communication with the client was done via cellular contact. The last contact was on the 18th of November, lasting for 177 seconds. This is the second time they have been contacted during this campaign, with 174 days passing since they were last contacted from a previous campaign. They had one previous contact before this campaign, resulting in a different outcome.###\nHence this label was No."
"The client is a 56-year-old retired married individual with primary education. They do not have any credit in default, but they do have a personal loan. They do not have a housing loan. The bank contacted them via cellular communication on the 22nd of July, and the call lasted for 121 seconds. This was the second contact made to the client during this campaign. There were no previous contacts with the client, and the outcome of any previous marketing campaign is unknown. The client's average yearly balance is 161 euros.###\nHence this label was No."
"The client is a 28-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. The contact was made via an unknown communication type on the 16th of May. The call lasted for 136 seconds and it was the 2nd contact made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 58 euros.###\nHence this label was No."
"The client is a 35-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default but have housing and personal loans. They were contacted via cellular communication and the last call lasted 114 seconds. This client was contacted 1 time during this campaign, 5 times in previous campaigns, with the last contact made 352 days ago which resulted in a failure outcome. Their average yearly balance is 247 euros.###\nHence this label was No."
"The client is a 33-year-old married individual working in the services sector with secondary level education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 478 euros. The communication with the client was done via cellular phone. The last contact was on the 30th of April and lasted for 475 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign with this client is unknown.###\nHence this label was Yes."
"The client is a 42-year-old married individual working in an administrative role with a secondary level of education. They do not have credit in default and have an average yearly balance of 1279 euros. They have a housing loan but no personal loan. The communication with the client was done via cellular phone, with the last call lasting for 50 seconds on the 17th of July. This was the first and only contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 47-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default, housing loan, but have a personal loan. The average yearly balance is 1092 euros. The communication type during the marketing campaign was unknown, and the last contact was made on the 30th of May, with a duration of 41 seconds. This was the 8th contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 46-year-old unemployed individual who is married and has secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 29th of August and the call lasted for 74 seconds. This was the second time they were contacted during this campaign. There was no previous contact with the client from previous campaigns and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old married individual working in management, with tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 10th of November, and the call lasted for 248 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign with this client is unknown.###\nHence this label was Yes."
"The client is a 32-year-old married technician with a secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The average yearly balance is 381 euros. The last contact was made on the 2nd day of June, with a duration of 347 seconds. This was the 2nd contact made during this campaign to the client, with no previous contacts. The outcome of the previous marketing campaign is unknown. The communication type used for contact is also unknown.###\nHence this label was No."
"The client is a 59-year-old retired married individual with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 20th of August. The call lasted 63 seconds, and this was the 5th contact made to the client during this campaign. They were not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2568 euros.###\nHence this label was No."
"The client is a 35-year-old single individual working in the services sector with a secondary level education. They do not have any credit in default and have a housing loan. The client does not have a personal loan. The bank communicated with the client via a cellular phone. The last contact made was on the 31st of July, with a call duration of 39 seconds. This was the second contact made during this marketing campaign. The client has not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1742 euros.###\nHence this label was No."
"The client is a 50-year-old married individual working in administration with a secondary level education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via telephone on the 30th of July and had a conversation lasting 1011 seconds. This was the 6th contact made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2678 euros.###\nHence this label was Yes."
"The client is a 55-year-old married blue-collar worker with primary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 309 euros. The client was contacted via an unknown communication type on the 12th of May and the call lasted for 115 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 60-year-old retired individual who is divorced and holds a tertiary education. They do not have credit in default and have a yearly average balance of 979 euros. They have a housing loan but no personal loan. The communication with the client was via cellular phone, with the last call lasting 295 seconds on the 15th of January. This client has been contacted 3 times during this campaign, with the previous contact occurring 347 days ago, resulting in a failure outcome.###\nHence this label was Yes."
"The client is a 33-year-old married individual working in the administrative sector with secondary education. They do not have credit in default but have housing and personal loans. The average yearly balance is 0 euros. The bank contacted them via cellular communication in July, and the call lasted for 160 seconds. This was the first contact made during this campaign. Past marketing campaign outcome is unknown, and there were no previous contacts with the client.###\nHence this label was No."
"The client is a 56-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 5th of February and the call lasted for 151 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 121 euros.###\nHence this label was No."
"A married 42-year-old admin worker with unknown education and no credit in default was contacted via cellular communication in May. They have a yearly average balance of 756 euros and do not have any housing or personal loans. The client was last contacted on the 7th of the month and the call lasted 116 seconds. This was the third contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 52-year-old divorced individual working in management with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, with the last call lasting 365 seconds on the 6th day of February. This was the second time they were contacted during this campaign, with 9 days passed since the previous contact. The outcome of the previous marketing campaign was categorized as \"other.\"###\nHence this label was No."
"The client is a 49-year-old married blue-collar worker with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication and the last call lasted 134 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 364.###\nHence this label was No."
"The client is a 44-year-old divorced individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via an unknown communication type on the 6th of June. The call lasted for 373 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old single technician with a tertiary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 25th of August, with a call duration of 476 seconds. This was the third contact made during this campaign. The client had not been contacted previously. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan as well as a personal loan. They were contacted via cellular communication in July. The client's average yearly balance is 126 euros. The last contact duration was 75 seconds, and they have been contacted 10 times during this campaign with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 21st of November, with a call duration of 328 seconds. This is the 6th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old married individual working in management with primary education. They do not have credit in default and do not have any existing housing or personal loans. They were contacted via cellular communication and the last call duration was 326 seconds. This client has an average yearly balance of 1506 euros. The last contact was made on the 14th of August, as part of the third call in the current campaign. There was no previous contact with the client for a marketing campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 36-year-old student who is single and has a secondary level education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 22nd of April and the call duration was 621 seconds. This was the first contact made during the current campaign. The outcome of any previous marketing campaign with this client is unknown. The client's average yearly balance is 17 euros.###\nHence this label was Yes."
"The client is a 52-year-old married individual working in the services sector with a primary education. They do not have any credit in default, do not have a housing loan but have a personal loan. The average yearly balance is 14 euros. The communication type is cellular, and the last contact was on the 28th of July for 55 seconds. This is the 5th contact during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old married technician with secondary education. They do not have credit in default and have a housing loan. They have an average yearly balance of 3240 euros and do not have a personal loan. The client was last contacted on the 14th of May for 129 seconds, which was the second time during this campaign. There were no previous contacts with this client for marketing purposes. The outcome of the previous marketing campaign is unknown, as well as the communication type used for contact.###\nHence this label was No."
"A 26-year-old student who is single and has secondary education was contacted for a marketing campaign by phone. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is negative. The contact was made through an unknown communication type in June, and the call lasted 95 seconds. This was the second contact made during this campaign to this client. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"A 29-year-old single individual working as an admin with secondary education, having credit in default and a housing loan. They do not have a personal loan and their average yearly balance is negative. They were contacted via an unknown communication type in June, with a call duration of 269 seconds. This is their third contact in the current campaign, with no previous contacts. The outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 52-year-old married individual working in the administrative field with secondary education. They do not have any credit in default, but they do have a housing loan. The client does not have a personal loan. The average yearly balance in euros is 1933. The contact was made using an unknown communication type on the 21st of May. The call duration was 153 seconds, and this was the 4th contact made to the client during this campaign. There were no previous contacts with the client before this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old single individual working as a blue-collar worker with primary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 1055. The contact communication type is unknown. The last contact was made on the 6th day of June, with a duration of 32 seconds. This is the second time the client has been contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 52-year-old single individual working in an administrative role with secondary education. They do not have any credit in default but have a housing loan and a personal loan. The average yearly balance is in the negative (-528 euros). The communication type for contact was cellular, with the last contact being on the 1st of June and lasting 1144 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 55-year-old married individual working in the services sector with a secondary level education. They do not have any credit in default and do not have any housing or personal loans. Their average yearly balance is 477 euros. The communication type for the last contact is unknown, which took place on the 19th day of June, lasting for 170 seconds. This was the first contact made during this campaign. There is no information on previous marketing campaign outcomes or prior contacts with the client.###\nHence this label was No."
"The client is a 45-year-old married entrepreneur with primary education. They do not have credit in default and have both housing and personal loans. They were contacted via cellular communication on the 14th of May. The last phone call lasted 586 seconds and it was the first contact made during this campaign. The client was last contacted 364 days ago during a previous campaign, where the outcome was a failure.###\nHence this label was No."
"The client is a 51-year-old married individual working in a management role with a tertiary education. They do not have credit in default and do not have any existing housing or personal loans. The client was contacted via cellular communication on the 18th of November and the call lasted for 54 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 5343 euros.###\nHence this label was No."
"The client is a 52-year-old individual with an unknown job and education status, who is married. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is 1571 euros. The communication type for the contact was cellular, with the last contact made on the 4th of August and lasted for 164 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"A 40-year-old married individual, working as a blue-collar worker with a primary education, was contacted via cellular communication. They do not have credit in default, a housing loan, but have a personal loan. The average yearly balance in euros is 137. The last contact was made on the 10th of July, lasting for 214 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 54-year-old blue-collar worker who is divorced and has primary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance is negative at 182 euros. The communication type for the marketing campaign was cellular. The last contact was made on the 9th of July and lasted 98 seconds. This was the first contact made during this campaign for this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 27-year-old married individual working in an administrative role with a secondary education. They do not have credit in default, have a housing loan, but do not have a personal loan. The client was contacted via an unknown communication type on the 9th of May. The call duration was 1713 seconds, and this was the first contact made during this campaign. There is no information available about previous marketing campaign outcomes or prior contacts with the client. The average yearly balance in euros for this client is 1033.###\nHence this label was No."
"The client is a 50-year-old married individual working in the services sector with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via cellular communication on the 23rd of July, with the call lasting 59 seconds. This was the 4th contact made to the client during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2362 euros.###\nHence this label was No."
"The client is a 59-year-old retired married individual with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via an unknown communication type on the 18th of June. The call lasted 205 seconds, and this was the second contact during this campaign. The client had not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1245 euros.###\nHence this label was No."
"The client is a 59-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The communication with the client was done via telephone. The client was last contacted on the 30th of July and the call duration was 215 seconds. This was the third contact during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is -209 euros, indicating a negative balance.###\nHence this label was No."
"The client is a 32-year-old single individual working in management with tertiary education. They do not have credit in default and have an average yearly balance of 2983 euros. They have a housing loan but no personal loan. The last contact was made via cellular communication, lasting 268 seconds on the 12th of October. This was the second time they were contacted during this campaign, with 102 days passing since the previous contact. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 32-year-old married technician with a secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 21st of November, with a call duration of 82 seconds. This was the third call made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 950 euros.###\nHence this label was No."
"The client is a 59-year-old retired individual who is divorced and has primary education. They do not have credit in default and have an average yearly balance of 217 euros. They have a housing loan but no personal loan. The communication type for the last contact is unknown, which occurred on the 26th of May and lasted for 574 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old unemployed married individual with primary education. They do not have credit in default but have housing and personal loans. They were contacted via an unknown communication type, with the last call lasting 62 seconds on the 27th day of May. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 180 euros.###\nHence this label was No."
"The client is a 59-year-old divorced technician with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 0 euros. The communication with the client was done via cellular phone call, with the call lasting 126 seconds. This was the second time they were contacted during this campaign. The client was not previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old married individual working in a management position with a tertiary level of education. They do not have any credit in default but have both a housing loan and a personal loan. They were contacted via cellular communication and were last called on the 17th of November for a duration of 160 seconds. This was the second contact made to them during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 441 euros.###\nHence this label was No."
"The client is a 59-year-old retired individual who is married with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in August. The client had an average yearly balance of 0 euros. During the current campaign, this client was contacted twice, with the last contact lasting 142 seconds. There were no previous contacts with this client from earlier campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 43-year-old divorced individual working in the services sector with secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 5571. The current marketing campaign contacted the client via an unknown communication type on the 9th of June for 149 seconds. This is the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"This data describes a 26-year-old single individual, working as a blue-collar worker with primary education. They do not have any credit in default, but they have a housing loan. They were contacted via cellular communication, and the last call was made on the 15th of May, lasting 86 seconds. This was the 2nd call during this campaign, with 2 previous contacts made before. The individual has a yearly average balance of 17 euros, does not have a personal loan, and the outcome of the previous marketing campaign was a failure. Additionally, 367 days had passed since they were last contacted from a previous campaign.###\nHence this label was No."
"The client is a 42-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have an average yearly balance of 1017 euros. They have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 3rd day of June, with a call duration of 11 seconds. This is the 18th contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old single individual working as a blue-collar worker with a secondary education. They do not have any credit in default, but they have a housing loan. They have an average yearly balance of 1446 euros and do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting 88 seconds on the 17th of April. This was the third time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default but have housing and personal loans. Their average yearly balance is 1138 euros. The bank contacted them through an unknown communication type in June, and the call lasted 164 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 55-year-old single individual working in a management position with a tertiary education. They do not have any credit in default but have housing and personal loans. The client was contacted through an unknown communication type on the 17th of June and the call lasted for 98 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 854 euros.###\nHence this label was No."
"The client is a 29-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 19th of November, and the call lasted for 401 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 659 euros.###\nHence this label was No."
"The client is a 50-year-old married individual working in a blue-collar job with secondary education. They have credit in default and a housing loan. They do not have a personal loan. The bank contacted them by cellular communication on the 26th of August and the call lasted for 240 seconds. This was the 5th contact made during this campaign. The client was not contacted previously. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working in administration with a secondary education. They do not have credit in default, housing, or personal loans. They were contacted via cellular communication, with the last call lasting 89 seconds on the 9th of July. This was the 3rd contact made during this campaign, and there were no previous contacts. The outcome of the previous campaign is unknown. The client's average yearly balance is 335 euros.###\nHence this label was No."
"The client is a 27-year-old married housemaid with primary education. They have credit in default and a negative average yearly balance. They do not have a housing or personal loan. The bank contacted them via cellular communication, with the last call lasting 132 seconds on the 14th of July. This was the 4th time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 23-year-old single individual working in the services sector with a secondary education was contacted via cellular communication. They have no credit in default, housing loan, or personal loan. With an average yearly balance of 488 euros, they were previously contacted 91 days ago and had a successful outcome from the previous campaign. The latest call lasted 205 seconds, which was the fourth contact made to the client during this campaign.###\nHence this label was Yes."
"The client is a 39-year-old married individual working in the services sector with a secondary level education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The communication with the client was done via telephone. The last contact was on the 10th of July and lasted for 123 seconds. This was the 4th contact made during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 972 euros.###\nHence this label was No."
"The client is a 50-year-old married individual working in management with a tertiary education. They do not have credit in default, do not have a housing loan but have a personal loan. The average yearly balance is 3463 euros. The client was contacted via cellular communication and the call lasted for 96 seconds on the 28th of October. This was the first contact during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was Yes."
"The client is a 45-year-old divorced technician with secondary education. They do not have credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting 76 seconds on the 30th of July. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 245 euros.###\nHence this label was No."
"The client is a 41-year-old single individual working in the administration sector with unknown education status. They do not have any credit in default, have a housing loan, but do not have a personal loan. The contact was made via cellular communication, and the call duration was 442 seconds. This was the 1st contact during this campaign, following 3 previous contacts. The last contact was 370 days ago, and the outcome of the previous marketing campaign was a failure. The client's average yearly balance is 419 euros.###\nHence this label was No."
"The client is a 57-year-old married entrepreneur with secondary education and no credit in default. They have an average yearly balance of 905 euros and do not have a housing or personal loan. The bank contacted them via cellular phone on the 7th of August, with a call duration of 121 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 36-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 6th of May. The call lasted for 467 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 152 euros.###\nHence this label was No."
"The client is a 56-year-old divorced housemaid with primary education. They have credit in default and do not have a housing or personal loan. The bank contacted them via an unknown communication type on the 5th of June with a call duration of 1558 seconds. This was the first contact made during this campaign. There is no information available about any previous marketing campaign outcomes or contacts. The client's average yearly balance is 1238 euros.###\nHence this label was Yes."
"The client is a 55-year-old single individual working in an administrative role. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 2359 euros, they have a housing loan but no personal loan. The bank reached out to them via telephone on the 20th of April, with the call lasting 43 seconds. This was the third contact made to the client during this campaign. There were no previous contacts with the client from previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old self-employed individual who is single and holds a tertiary education degree. They do not have any credit in default and do not have any housing or personal loans. They were contacted via cellular communication on the 5th of February, with a call duration of 393 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 580 euros.###\nHence this label was No."
"The client is a 44-year-old divorced technician with unknown education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 1823 euros. The contact communication type is unknown. The last contact was on the 20th of June and lasted for 43 seconds. This is the second time they have been contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working in an administrative role with secondary education. They do not have any credit in default and do not have any housing or personal loans. Their average yearly balance is 0 euros. They were contacted via an unknown communication type on the 7th day of May, and the call lasted for 326 seconds. This was the first contact made with the client during this campaign. The outcome of any previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual with a primary education level and no credit default. They do not have a housing or personal loan. The client's average yearly balance is 1502 euros. The contact was made through an unknown communication type in June, with a call duration of 34 seconds. This is the second time they have been contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working as a blue-collar worker with a secondary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is negative. They were contacted via cellular communication during the month of August and the call lasted only 8 seconds. This was the 13th contact made to the client during this campaign. The client had not been previously contacted in any previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default and have a housing loan. The average yearly balance in euros is 1464 and they do not have a personal loan. The contact communication type is unknown, and the last contact was on the 23rd of May, with a duration of 588 seconds. This is the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 55-year-old married technician with secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 8th of July for 138 seconds. This is their first contact during this campaign, and there is no record of previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 477 euros.###\nHence this label was No."
"A 58-year-old individual, working in a managerial position and divorced, with a secondary level of education, is being targeted for a banking campaign. They do not have any credit default history and have a personal loan. They were contacted via cellular communication on the 17th of November, with the call lasting 254 seconds. This is the second time they have been contacted during this campaign, with no previous contact history available. The outcome of the previous marketing campaign for this individual is unknown. Their average yearly balance is 321 euros and they do not have a housing loan.###\nHence this label was No."
"The client is a 36-year-old entrepreneur who is single and has a secondary level of education. They do not have any credit in default and have an average yearly balance of 866 euros. They have a housing loan but do not have a personal loan. The communication type for the marketing campaign was cellular, and they were last contacted on the 11th day of May. The duration of the last contact was 629 seconds. This was the first contact performed during this campaign for this client, but in a previous campaign, they were contacted 173 days ago. The outcome of the previous marketing campaign was a failure.###\nHence this label was Yes."
"The client is a 46-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 218 euros. The communication type used was cellular, and the last contact was on the 10th of July, lasting 41 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old technician who is divorced. They have a secondary level of education and do not have any credit in default. Their average yearly balance is 630 euros. They have a housing loan but no personal loan. The communication with the client was done via cellular phone call. The last contact was on the 20th of April and lasted 28 seconds. This was the second contact made during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 47-year-old married technician with a secondary education and no credit in default was contacted via cellular communication. They have a housing loan but no personal loan. Their average yearly balance is 734 euros. During the current campaign, this client was contacted 3 times, with the last call lasting 92 seconds on the 17th of November. There were no previous contacts with the client, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in management with a tertiary education. They do not have credit in default and have a relatively low average yearly balance of 47 euros. They do not have a housing loan or personal loan. The bank contacted them via cellular communication on the 26th of May, and the call lasted for 244 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaigns with this client is unknown.###\nHence this label was No."
"The client is a 54-year-old married technician with tertiary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is 2883 euros. The last contact was made on the 15th of May, with a duration of 12 seconds. This is the third time they have been contacted during this campaign. There was no previous contact with this client. The outcome of the previous marketing campaign is unknown. The communication type for the contact is also unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in the services sector with secondary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication, and the last call lasted 208 seconds. This was the first contact during this campaign, but they were contacted 2 times in the past. The previous marketing campaign outcome was a failure. They have an average yearly balance of 4963 euros. The last contact was made on the 17th of April, and 332 days had passed since they were last contacted from a previous campaign.###\nHence this label was No."
"The client is a 31-year-old self-employed individual who is married and has a tertiary level of education. They do not have any credit in default or any housing or personal loans. The average yearly balance in euros is 94. The client was contacted via cellular communication on the 22nd of August, with a call duration of 579 seconds. This was the second contact made to the client during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 29-year-old single individual working in management with a tertiary education. They do not have any credit in default and have an average yearly balance of 11968 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 20th of April for 241 seconds, as part of a campaign where they were contacted 2 times. This is the first time they have been contacted for this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old married individual working in the management field with tertiary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The communication type during the campaign is unknown. The client was last contacted on the 6th of June and the call duration was 300 seconds. During this campaign, they were contacted 5 times. There was no previous contact with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old married individual who works in a blue-collar job with a secondary education level. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is negative at -95 euros. The client was contacted via an unknown communication type on the 13th day of May, and the call lasted 200 seconds. This was the first contact made during this campaign, and the outcome of any previous marketing campaigns is unknown.###\nHence this label was No."
"The client is a 70-year-old retired individual who is divorced. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 4572 euros, they do not have a housing or personal loan. The bank contacted them via cellular communication on the 8th of July, and the call duration was 173 seconds. This client has been contacted 11 times during this campaign and was last contacted 162 days ago from a previous campaign, where the outcome was a failure.###\nHence this label was No."
"The client is a 58-year-old married technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via cellular communication and the last call duration was 511 seconds. This client was contacted 3 times during this campaign and 6 times in previous campaigns. The previous marketing campaign was successful, and the last contact was made on the 10th of February, with 183 days passing since the previous campaign contact. The client's average yearly balance is 589 euros.###\nHence this label was Yes."
"The client is a 38-year-old married technician with a secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance is 1828 euros. The contact was made through an unknown communication type on the 16th of June, with a duration of 35 seconds. This is the first contact during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 35-year-old single individual working in management with secondary education and a negative yearly balance has credit in default and a housing loan. They do not have a personal loan. They were contacted through an unknown communication type in May, with the last call lasting 268 seconds on the 20th day of the month. This was the third contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 39-year-old married individual working in management with a tertiary education was contacted via phone call in May. They have no credit in default, housing loan, or personal loan. The client's average yearly balance is 0 euros. The contact communication type is unknown and the call lasted for 205 seconds. This was the 8th contact made during this campaign, with no previous campaign history. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 37-year-old married technician with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 122. The client was contacted via cellular communication on the 25th of June for a duration of 266 seconds. This was the second contact made during this campaign, with a previous contact made 318 days ago during a different campaign. There were a total of 3 contacts made before this campaign. The outcome of the previous marketing campaign was categorized as \"other\".###\nHence this label was Yes."
"The client is a 26-year-old single individual working as an admin, with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 255 euros. The client was contacted via cellular communication, with the last call lasting 457 seconds in April on the 30th day. This was the second time they were contacted during this campaign, after 80 days from the previous campaign, which ended successfully.###\nHence this label was Yes."
"The client is a 42-year-old self-employed individual who is married with tertiary education. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 22nd of April for 102 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 10072 euros.###\nHence this label was No."
"A 41-year-old married individual with a management job and tertiary education was contacted via phone call for a marketing campaign. They do not have credit in default, housing loan, or personal loan. The contact was made through an unknown communication type in June, and the call lasted 68 seconds. This was the first contact made to this client during this campaign. The outcome of any previous marketing campaigns targeting this client is unknown. The individual's average yearly balance is 1234 euros.###\nHence this label was No."
"The client is a 27-year-old single technician with tertiary education. They do not have any credit in default, a housing loan, but have a personal loan. The bank contacted them via cellular communication, with the last call lasting 389 seconds on the 28th of January. This is the first time they have been contacted during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3064 euros.###\nHence this label was No."
"The client is a 32-year-old single individual working in the services sector with secondary education. They do not have credit in default but have a housing loan. They were contacted via cellular communication and the call lasted for 369 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous campaign is unknown. The client's average yearly balance is 101 euros and they do not have a personal loan. The call took place on the 11th of May.###\nHence this label was No."
"The client is a 29-year-old unemployed individual who is single with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in February. The last contact lasted 93 seconds, and it was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2424 euros.###\nHence this label was No."
"The client is a 30-year-old married individual working in management with a tertiary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication in July, and the call lasted for 127 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 0 euros.###\nHence this label was No."
"The client is a 31-year-old single person working as an admin. They have a secondary education and do not have any credit in default. Despite having a housing loan, they do not have a personal loan. The bank reached out to them via cellular communication on the 15th of May, with a call duration of 99 seconds. This was the second time they were contacted during this campaign, with 352 days passing since they were last contacted in a previous campaign. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 56-year-old retired married individual with tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 25th of May. The call duration was 185 seconds, and this was the first contact during this campaign. They were last contacted 83 days ago, with 2 contacts made in the previous campaign, which was successful. The client's average yearly balance is 281 euros.###\nHence this label was No."
"The client is a 41-year-old technician who is married with a secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance is 1344 euros. The communication type used was cellular. The client was last contacted on the 22nd of August and the call lasted 169 seconds. This was the 6th contact made during this campaign. There were no previous contacts with the client from earlier campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married technician with a tertiary education and no credit in default. They have an average yearly balance of 14355 euros and do not have a housing or personal loan. The bank contacted them via cellular communication on the 7th of August and the call lasted for 244 seconds. This was the second contact made during this campaign and no previous contacts were made with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married technician with secondary education. They do not have credit in default and have a personal loan. Their average yearly balance is 587 euros and they do not have a housing loan. The client was last contacted via cellular communication on the 21st of November for 23 seconds. This is the 8th contact during this campaign and 5 contacts were made before. The previous marketing campaign outcome was labeled as \"other\".###\nHence this label was No."
"The client is a 39-year-old blue-collar worker who is married and has a secondary level education. They do not have any credit in default and have a housing loan. The client does not have a personal loan. The bank contacted them via cellular communication and the call lasted for 551 seconds. This was the 5th contact made during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 366 euros.###\nHence this label was No."
"The client is a 46-year-old married technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank communicated with them via cellphone and the last call was made on the 7th of April, lasting 226 seconds. This was the second call during this campaign, with no previous contacts made. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is €138.###\nHence this label was No."
"A 26-year-old single individual working in admin with secondary education, having a personal loan but no housing loan, and no credit in default. They were last contacted in July via cellular communication, with the call lasting 658 seconds. This was their second contact in the current campaign, with no previous campaign history available. The outcome of the previous marketing campaign is unknown. They have an average yearly balance of 102 euros.###\nHence this label was Yes."
"The client is a 53-year-old retired individual who is married and has a tertiary level of education. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 17th of November, with a call duration of 1091 seconds. This was the second time they were contacted during this marketing campaign, with a gap of 150 days since they were last contacted from a previous campaign. In the previous campaign, the outcome was successful, indicating the client may be receptive to the current marketing offer.###\nHence this label was Yes."
"The client is a 47-year-old married technician with a tertiary education and no credit in default. They have an average yearly balance of 1127 euros and do not have a housing or personal loan. The bank contacted them via cellular communication on the 11th of August for 133 seconds, as part of the 6th contact in the current campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 56-year-old married individual working in administration with a secondary education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via cellular communication on the 19th of August and the call lasted for 97 seconds. This was the second time they were contacted during this campaign. There is no record of them being contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 33 euros.###\nHence this label was No."
"A 36-year-old married technician with tertiary education, who does not have credit in default, does not have a housing loan or personal loan. They were contacted via cellular communication on the 19th of August. The last call lasted 587 seconds, and this was the second contact made during the current campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is 33 years old, unemployed, married, with secondary education, and does not have any credit in default. Their average yearly balance is -144 euros. They do not have a housing or personal loan. The communication type used for contact is cellular. The client was last contacted on the 30th of July and the call lasted for 481 seconds. This was the 3rd contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 40-year-old married individual working in the services sector with a secondary level of education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The communication type used for contacting the client was cellular. The last contact was made on the 13th of April, and it lasted for 128 seconds. This was the third contact made during this campaign, with no previous contacts before this. The outcome of the previous marketing campaign for this client is unknown. The average yearly balance in euros for this client is 1293.###\nHence this label was No."
"The client is a 47-year-old married individual working in management with a tertiary education. They do not have credit in default but have a housing loan. They were contacted via cellular communication, and the last call duration was 194 seconds. This was the client's 2nd contact during this campaign, with 3 previous contacts. The last contact from a previous campaign was 181 days ago, with the outcome being a failure. The client does not have a personal loan and their average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 57-year-old married individual working in the services sector with a primary level of education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via telephone on the 16th of July, and the call lasted for 164 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign with this client is unknown. The client's average yearly balance is 1728 euros.###\nHence this label was No."
"The client is a 48-year-old divorced individual working in a management role with a tertiary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank made 5 previous phone calls to the client during this campaign, with the last call lasting 87 seconds. The client was last contacted 167 days ago from a previous campaign where 6 contacts were made. The outcome of the previous marketing campaign was a failure. The communication with the client was done via a cellular phone. The average yearly balance of the client is negative, standing at -478 euros. The last contact with the client was on the 17th of November.###\nHence this label was No."
"The client is a married 40-year-old individual working in the services sector with primary education. They do not have any credit in default and have housing and personal loans. The average yearly balance is 170 euros. They were contacted via cellular communication on the 8th of May and the call duration was 361 seconds. This is the third contact made during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old single technician with a tertiary education. They do not have credit in default and have an average yearly balance of 218 euros. They have a housing loan and a personal loan. The client was contacted via an unknown communication type on the 28th of May, with a call duration of 74 seconds. This is the second time they have been contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 52-year-old self-employed individual who is married with a tertiary education. They do not have credit in default and have an average yearly balance of 583 euros. They have a housing loan but no personal loan. The communication type used for contact is cellular. The last contact was made on the 22nd of August and lasted for 132 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown since the client was not previously contacted.###\nHence this label was No."
"The client is a 35-year-old single technician with secondary education. They do not have credit in default and do not have a housing or personal loan. The client was contacted via an unknown communication type on the 2nd of July. The call lasted 134 seconds, and this was the 2nd contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is negative, indicating they may be in debt.###\nHence this label was No."
"The client is a 39-year-old married individual working in a management position with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 346. The communication with the client was done via a cellular phone. The last contact was made on the 30th of July and lasted for 230 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married individual working in management with a secondary level of education. They do not have any credit in default but have a housing loan. The client does not have a personal loan and their average yearly balance is negative at -1746 euros. They were contacted via an unknown communication type on the 20th of June and the call duration was 218 seconds. This was the first contact made to the client during this campaign. The outcome of any previous marketing campaigns to this client is unknown.###\nHence this label was No."
"The client is a 30-year-old technician who is single and has tertiary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 13th of May. The call lasted 375 seconds. This was the first contact during this campaign, and there was no previous campaign contact. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is -522 euros.###\nHence this label was No."
"The client is a 33-year-old divorced individual working in the admin sector with a secondary level education. They do not have credit in default, but they have a housing loan. They do not have a personal loan. The average yearly balance in their account is 212 euros. They were contacted via an unknown communication type on the 7th of January, and the call lasted for 23 seconds. This was the first contact made to the client during this campaign. There is no record of any previous marketing campaign outcome with this client.###\nHence this label was No."
"The client is a 60-year-old retired married individual with primary education. They do not have any credit in default, housing loan, or personal loan. The bank communicated with them via cellular phone, contacting them on the 6th day of August. The call duration was 224 seconds, and this was the second contact made during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 957 euros.###\nHence this label was No."
"The client is a 49-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have both a housing loan and a personal loan. The client was contacted via telephone on the 10th of July and the call lasted for 834 seconds. This was the 10th contact made to the client during this campaign. The client has not been previously contacted for a marketing campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 305 euros.###\nHence this label was No."
"The client is a 57-year-old self-employed married individual with unknown education status. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance is 964 euros. The contact communication type is unknown. The last contact was on the 11th of June and lasted for 70 seconds. This was the 5th contact during this campaign. The client was not previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old single individual working in a management position with tertiary education. They do not have any credit in default and do not have a housing loan, but they do have a personal loan. They were contacted via cellular communication on the 6th of May, with the call lasting for 60 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client had an average yearly balance of 1517 euros.###\nHence this label was No."
"The client is a 28-year-old student who is single and has tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication. The last contact was made on the 31st of May and lasted for 85 seconds. This was the 2nd contact during the current campaign, with 5 contacts made in previous campaigns. The outcome of the previous marketing campaign was \"other\". The client's average yearly balance is 118 euros.###\nHence this label was No."
"The client is a 51-year-old married housemaid with primary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 1382 euros. The client was contacted via an unknown communication type on the 17th of June and the call lasted 226 seconds. This was the first contact made during this campaign. There is no information on previous marketing campaign outcomes or prior contacts with the client.###\nHence this label was No."
"A 32-year-old self-employed single individual with a tertiary education was contacted via cellular communication. They have no credit in default, housing loan, or personal loan. Their average yearly balance is 2559 euros. The last contact was made on the 7th of July and lasted 889 seconds. This client was contacted once during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 32-year-old single technician with a secondary education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 5th of August, with a call duration of 159 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with the client is unknown.###\nHence this label was No."
"The client is a 31-year-old single technician with a secondary education. They do not have credit in default, but have a housing loan. They were contacted via cellular communication on the 5th of May for 269 seconds in a previous marketing campaign. This was their first contact in this campaign. Their average yearly balance is 271 euros and they do not have a personal loan. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 58-year-old self-employed individual who is married with primary education. They do not have credit in default and have an average yearly balance of 671 euros. They have a housing loan but no personal loan. The communication type for contact is unknown, and the last contact was made on the 17th of June for only 16 seconds. This is the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 30-year-old married housemaid with a tertiary education. They do not have credit in default but have housing and personal loans. The average yearly balance in their account is 113 euros. The bank contacted them via cellular communication on the 3rd day of February, with a call duration of 230 seconds. This was the third contact made during this campaign, with no previous contact history. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is 35 years old, working as a blue-collar worker, single, with unknown education status. They do not have credit in default, have a housing loan, and do not have a personal loan. They were contacted via cellular communication on the 30th of July and the call lasted 107 seconds. This is the 11th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 217 euros.###\nHence this label was No."
"The client is a 61-year-old married individual working in a management role with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their bank account is 267 euros. \nThe bank contacted them via a cellular phone call on the 20th of April, with a call duration of 190 seconds. This was the first contact made during this campaign for this client. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was Yes."
"The client is a 50-year-old married housemaid with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 28th of August. The call lasted for 39 seconds. This was the 4th time they were contacted during this campaign. They had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
