"The client is a 26-year-old single technician with a secondary education. They do not have credit in default but have a housing loan. They have an average yearly balance of 124 euros and do not have a personal loan. The client was contacted 8 times during this campaign, with the last contact lasting 57 seconds. They were not previously contacted in a previous campaign, and the outcome of the previous marketing campaign is unknown. The communication type used for contact is unknown, and the last contact was made on the 12th of May.###\nHence this label was No."
"The client is a 55-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, housing loan, or personal loan. The contact was made via cellular communication, and the call lasted for 81 seconds. This was the first contact made during this campaign. The outcome of the previous campaign is unknown. The client's average yearly balance is 196 euros. The call took place on the 21st of August.###\nHence this label was Yes."
"A 28-year-old student who is single and has a secondary education was contacted for a banking campaign. They do not have any credit in default but have a housing loan. Their average yearly balance is 4716 euros and they do not have a personal loan. The client was contacted via an unknown communication type in May, with the last call lasting 329 seconds on the 26th day of the month. This was the second contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 41-year-old single individual working in management with a tertiary education was contacted via cellular communication. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is 7595 euros. The client was previously contacted twice during this campaign, with the last call lasting 1121 seconds on the 17th of November. There is no record of them being contacted before. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old unemployed individual who is divorced. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 3 euros, they do not have a housing loan or personal loan. The client was contacted via cellular communication and the last call lasted 77 seconds. This was the third contact made to the client during this campaign. They were not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old single individual working in a blue-collar job with secondary education. They do not have any credit in default and have an average yearly balance of 387 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 61 seconds on the 13th of March. This was the 11th contact made during this campaign, with the previous contact made 282 days ago. There was 1 contact made with the client before this campaign, resulting in an outcome of \"other\".###\nHence this label was No."
"The client is a 37-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default and have an average yearly balance of 660 euros. They have a housing loan and a personal loan. The contact communication type is unknown, and the last contact was on the 20th of May, with a duration of 170 seconds. This is the second contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 49-year-old single individual working in the services sector with a secondary education was contacted via cellular communication. They have no credit in default, but have a housing loan. Their average yearly balance is 1884 euros and they do not have a personal loan. The client was previously not contacted for any marketing campaign. The last contact was on the 8th of May, lasting 43 seconds. This client subscribed to a term deposit after one contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit in default and have a housing loan but no personal loan. Their average yearly balance is 70 euros. The communication type for the last contact is unknown, which lasted for 100 seconds on the 6th day of June. This was the 2nd contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 36-year-old single person working in the services sector with secondary education. They do not have credit in default but have a housing loan. Their average yearly balance is negative. They were contacted via an unknown communication type on the 27th of May for 256 seconds, as part of a campaign where they were contacted twice. There is no record of previous contact or outcome from a previous campaign. The client does not have a personal loan.###\nHence this label was No."
"A 28-year-old married entrepreneur with secondary education, who does not have any credit in default, holds a housing loan but no personal loan. They were contacted via cellular communication on the 17th of April and the call lasted for 728 seconds. This was the first contact made during this campaign, but they had been contacted 3 times in previous campaigns, with the last contact being 316 days ago. The outcome of the previous campaign was classified as \"other.\" Their average yearly balance is 490 euros.###\nHence this label was No."
"The client is a 53-year-old retired individual who is married with tertiary education. They do not have any credit in default and have a yearly average balance of 183 euros. They have a housing loan but no personal loan. The communication type used during the campaign is unknown. The client was last contacted on the 15th of May and the call lasted for 73 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaigns with this client is unknown.###\nHence this label was No."
"The client is a 40-year-old married technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 26 euros. The communication type for contact is unknown. The client was last contacted on the 16th of May and the call lasted 230 seconds. This is the third contact made during this campaign, with no previous contacts for this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 39-year-old married individual working in the services sector with secondary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 2040 euros and do not have a personal loan. The client was contacted via cellular communication, with the last call lasting 312 seconds on the 12th of May. This was the 6th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 43-year-old divorced individual working as an admin, with tertiary education. They do not have any credit in default and have an average yearly balance of 1440 euros. They have a housing loan and a personal loan. The last contact was made on the 30th of May via an unknown communication type, with a call duration of 254 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old divorced individual working as a blue-collar worker with a primary education. They have credit in default and a housing loan, but no personal loan. The bank contacted them via cellular communication on the 7th of May, with a call duration of 227 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, and the client's average yearly balance is 78 euros.###\nHence this label was No."
"The client is a 33-year-old single technician with secondary education and no credit in default. They have an average yearly balance of 608 euros and do not have a housing or personal loan. The communication with the client was done through a cellular phone. The last contact was on the 31st of July and lasted for 58 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old single individual working in the services sector with a secondary level education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellphone on the 4th of May, and the call lasted for 643 seconds. This was the first contact made during this campaign, and the outcome of any previous marketing campaign is unknown. The client's average yearly balance is 365 euros.###\nHence this label was Yes."
"The client is a 36-year-old blue-collar worker who is divorced with a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 853. The client was contacted via an unknown communication type on the 20th day of June, with a call duration of 15 seconds. This is the 12th contact made during this campaign, with no previous contacts before this. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 34-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 23rd of July. The client was previously contacted 3 times during this campaign. The last contact with the client lasted 158 seconds. There is no record of any previous marketing campaign outcome for this client. Their average yearly balance is 672 euros.###\nHence this label was No."
"The client is a 49-year-old single individual working in administration with a secondary education. They do not have credit in default and have a housing loan but no personal loan. Their average yearly balance is in the negative. The communication type used for contact was cellular, with the last contact made on the 21st of July for 31 seconds. This was the first contact during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 59-year-old single technician with secondary education. They do not have credit in default, have a personal loan but no housing loan. They were contacted via an unknown communication type on the 2nd day of August. The call lasted for 25 seconds. This was the first contact made to the client during this campaign. The outcome of any previous marketing campaign with this client is unknown. The client's average yearly balance is 571 euros.###\nHence this label was No."
"The client is a 37-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 22nd of March and the call lasted for 344 seconds. This was the second time the client was contacted during this campaign, with 326 days passing since the last contact from a previous campaign. The outcome of the previous marketing campaign was successful, resulting in the client subscribing to a term deposit.###\nHence this label was No."
"A 43-year-old unemployed married individual with secondary education, having no credit default, housing loan, or personal loan. They were contacted via cellular communication and had a last contact duration of 169 seconds on the 5th of February. This client was contacted 2 times during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old divorced technician with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 21st of July, with a call lasting 101 seconds. This is the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old single individual working in the services sector with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, with the last call lasting 225 seconds on the 3rd of February. This was the second time they were contacted during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 528 euros.###\nHence this label was No."
"The client is a 48-year-old married individual working in administration with a secondary education. They do not have any credit in default, do not have a housing loan but have a personal loan. They were contacted via cellular communication in August. Their average yearly balance is 811 euros. The last contact duration was 149 seconds, with a total of 2 contacts made during this campaign. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working in the services sector with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 803 euros. They were contacted via cellular communication on the 30th of April and the call lasted for 243 seconds. This was the first contact made during this campaign and there were no previous contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 38-year-old individual working in the services sector, who is divorced and has a secondary level of education. They do not have any credit in default, a housing loan, or a personal loan. The average yearly balance in their account is 439 euros. The last contact made was on the 16th of June, with a duration of 50 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The communication type for this contact was unknown.###\nHence this label was No."
"The client is a 25-year-old self-employed individual who is single and holds a tertiary education degree. They do not have any credit in default and have an average yearly balance of 931 euros. The client has a housing loan but no personal loan. The communication with the client was through a cellular phone. The last contact was on the 11th of May, with a call duration of 263 seconds. This is the second time they have been contacted during this campaign, after 348 days from the previous contact in a different campaign where they were contacted 4 times and the outcome was a failure.###\nHence this label was No."
"A 39-year-old single technician with secondary education, having no credit in default, and a personal loan, was contacted via an unknown communication type for a direct marketing campaign. They have an average yearly balance of 2321 euros and do not have a housing loan. The client was contacted on the 16th of June for 203 seconds, as part of the second contact in the current campaign. There was no previous contact history with the client, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married entrepreneur with tertiary education and no credit in default. They have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 92 seconds on the 14th day of May. This was the third contact in the current campaign, with no previous contacts. The outcome of the previous campaign is unknown. The client's average yearly balance is 1145 euros.###\nHence this label was No."
"The client is a 33-year-old single individual working in a management position with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 11th of August and had a conversation lasting 699 seconds. This was the 7th time the bank reached out to them during this campaign. The client had not been previously contacted by the bank. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 57-year-old retired married individual with secondary education. They do not have any credit in default, do not have a housing loan but have a personal loan. The average yearly balance is -418 euros. The communication type for the last contact is unknown, which lasted 95 seconds on the 27th day of June. This is the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 33-year-old single individual working in the services sector with secondary education. They do not have any credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 15th of May, and the call lasted 101 seconds. This was the second time they were contacted during this campaign. The outcome of the previous marketing campaign with this client is unknown. The client had an average yearly balance of 239 euros.###\nHence this label was No."
"The client is a 41-year-old married individual working as a blue-collar worker with a secondary education. They do not have any credit in default and have a housing loan. Their average yearly balance is 2152 euros and they do not have a personal loan. The communication with the client was done via cellular phone. The last contact was made on the 17th of November and lasted for 369 seconds. This was the first contact made during the current campaign. The outcome of the previous marketing campaign with the client is unknown.###\nHence this label was No."
"The client is a 44-year-old married technician with secondary education. They do not have credit in default, have a housing loan, but no personal loan. They were contacted via cellular communication, and the last call duration was 122 seconds. This was the second call made to the client during this campaign, after 357 days since the previous contact, which resulted in a failure outcome. The client's average yearly balance is 78 euros.###\nHence this label was No."
"The client is a 32-year-old single individual working as a blue-collar worker with primary education. They do not have any credit in default but have a housing loan. They have an average yearly balance of 1918 euros and do not have a personal loan. The client was contacted via cellular communication on the 17th of November and the call duration was 321 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 8th of July, with a call duration of 1720 seconds. This was the 4th time they were contacted during this campaign. The client had not been contacted in any previous campaigns, and the outcome of the previous campaign is unknown. Their average yearly balance is 2840 euros.###\nHence this label was No."
"The client is a 51-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 13th of August and the call lasted 186 seconds. This was the second time they were contacted during this campaign. There is no record of previous contact with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1694 euros.###\nHence this label was No."
"The client is a 52-year-old married individual working in management with tertiary education. They do not have credit in default but have a housing loan. They were contacted via cellular communication in July, and the call lasted 94 seconds. This was the first contact made during this campaign. The client's average yearly balance is -1112 euros, and they do not have a personal loan. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 51-year-old self-employed individual, married, with tertiary education and no credit in default. They have an average yearly balance of 146 euros and do not have any housing or personal loans. The bank contacted them via cellular communication on the 15th of July, with a call duration of 132 seconds. This is the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 49-year-old divorced technician with secondary education. They do not have credit in default but have a housing loan. They were last contacted in June for 34 seconds as part of a campaign where they were contacted 3 times. The client had not been previously contacted for any campaign. The outcome of the previous marketing campaign is unknown. They do not have a personal loan and their average yearly balance is 1669 euros. The communication type for contact is unknown.###\nHence this label was No."
"The client is a 44-year-old divorced technician with a secondary education. They do not have credit in default but have a housing loan. Their average yearly balance is 1262 euros and do not have a personal loan. The last contact was made on the 26th of May, with a duration of 788 seconds. This was the 11th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The communication type during the contact was unknown.###\nHence this label was Yes."
"The client is a 32-year-old single individual working in the services sector with secondary education. They do not have credit in default and have a housing loan but no personal loan. Their average yearly balance is 85 euros. The client was contacted via an unknown communication type on the 9th of May. The call lasted 834 seconds, and this was the 9th contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 24-year-old married individual working in the administrative field with a secondary level of education. They do not have any credit in default but have a housing loan. They were not contacted in any previous marketing campaigns. The client does not have a personal loan. The contact for this campaign was made via cellular communication on the 15th of May. The client's average yearly balance is negative at -94 euros. The duration of the last contact was 217 seconds. This client was contacted only once during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working in management with a tertiary level of education. They do not have any credit in default, but have a housing loan. They have a yearly average balance of 620 euros and do not have a personal loan. The communication with the client was done via a cellular phone, and the last contact was on the 30th of April, lasting for 513 seconds. This was the first contact made during this campaign, and there was no previous history of contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 39-year-old married individual working in management with secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication and the last call duration was 224 seconds. This was the second contact made during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 53-year-old retired married individual with a secondary education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 6th of May and had a conversation that lasted 109 seconds. This was the first contact made during this campaign, but they had been contacted twice before in previous campaigns, with the last contact being 87 days ago which resulted in a failure outcome. The client's average yearly balance is 4968 euros.###\nHence this label was No."
"The client is a 41-year-old single individual working in the services sector with secondary education. They do not have any credit in default, but they have a housing loan. They were not previously contacted for a personal loan. The bank reached out to them via cellular communication, contacting them 5 times during this campaign, with the last contact lasting 17 seconds. The previous marketing campaign outcome was a failure, and the client was last contacted 360 days ago. Their average yearly balance is -278 euros.###\nHence this label was No."
"The client is a 37-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 3420 euros and do not have a personal loan. The client was contacted via cellular communication and the last call duration was 77 seconds on the 12th of May. This was the first contact made during this campaign, but they were contacted twice in the past, with the previous outcome being a failure, and 301 days have passed since then.###\nHence this label was No."
"The client is a 45-year-old married individual working in administration with secondary education. They do not have credit in default, but have a housing loan. They do not have a personal loan. The average yearly balance is 171 euros. The client was contacted via an unknown communication type on the 12th of May and the call lasted for 539 seconds. This was the first contact made during this campaign. There is no information on previous campaign contacts or outcomes.###\nHence this label was No."
"A 52-year-old married individual, working as a blue-collar worker with primary education, was contacted via cellular communication. They do not have a housing loan but have a personal loan. Their average yearly balance is 382 euros. During the current campaign, they were contacted 7 times, with the last contact lasting 98 seconds on the 26th of August. There were no previous contacts before this campaign, and the outcome of the previous campaign is unknown. The client does not have credit in default.###\nHence this label was No."
"The client is a 31-year-old married individual working in management with a tertiary education. They do not have any credit in default and do not have housing or personal loans. They were contacted via cellular communication on the 11th of August. The client's average yearly balance is 4945 euros. The last call duration was 445 seconds, and this was the first contact during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old divorced individual working in the services sector with a secondary level of education. They do not have credit in default and have an average yearly balance of 8554 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 21st of November, with a call duration of 29 seconds. This is the second time they have been contacted during this campaign, with 176 days passing since they were last contacted from a previous campaign. Prior to this campaign, they were contacted 4 times. The outcome of the previous marketing campaign was categorized as 'other'.###\nHence this label was No."
"A 38-year-old unemployed married individual with tertiary education was contacted via cellular communication for a marketing campaign. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is 380 euros. The last contact was made on the 10th of February and lasted 100 seconds. This was the first contact in the current campaign, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married individual working in a blue-collar job with a secondary level of education. They do not have any credit in default and have a housing loan. They were contacted via cellular communication and the last call duration was 46 seconds. This client has been contacted 4 times during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. They do not have a personal loan and their average yearly balance is 1521 euros. The last contact was made on the 8th of April.###\nHence this label was No."
"This individual is a 31-year-old student who is single and has a secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 15th of June, and the call lasted 220 seconds. This was the second time they were contacted during this campaign, with 1 previous contact. The outcome of the previous marketing campaign was categorized as \"other.\" Additionally, they have an average yearly balance of 1776 euros.###\nHence this label was Yes."
"A 50-year-old married entrepreneur with tertiary education, who does not have credit in default, has a housing loan but no personal loan. They were contacted via an unknown communication type on the 23rd of May for a duration of 22 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1605 euros.###\nHence this label was No."
"The client is a 37-year-old married individual working as a blue-collar worker with a secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is 1053 euros. The communication type for the last contact is unknown, which lasted for 405 seconds on the 16th day of June. This is the third contact made during this campaign, with no previous contacts for this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working in a management position with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 8th of August and the call lasted for 129 seconds. This was the 2nd time they were contacted during this campaign. There is no record of previous contact with this client. The outcome of the previous marketing campaign is unknown. Their average yearly balance is negative 4 euros.###\nHence this label was No."
"The client is a 36-year-old single individual working as a blue-collar worker with a secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 5th of February, with a call duration of 569 seconds. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 33-year-old single technician with a tertiary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 25th of August, and the call lasted for 88 seconds. This was the 4th time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 137 euros.###\nHence this label was No."
"The client is a 33-year-old married individual working in the services sector with a secondary level education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 12th of May and the call lasted for 317 seconds. This was the 1st contact made during this campaign and the client was contacted 181 days after the previous campaign, where there were 5 previous contacts. The outcome of the previous marketing campaign was successful. The client's average yearly balance is 386 euros.###\nHence this label was Yes."
"The client is a 43-year-old divorced individual working in the services sector with a secondary level of education. They do not have any credit in default and have a personal loan but no housing loan. The average yearly balance is 957 euros. The client was last contacted in July via a cellular communication type, with the call lasting 145 seconds. This is the fourth contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in a management position with a tertiary education. They do not have any credit in default, housing loan, or personal loan. Their average yearly balance is 82 euros. The last contact was made on the 14th of May, with a duration of 94 seconds. This was the 6th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, as well as the contact communication type.###\nHence this label was No."
"The client is a 52-year-old married individual working in the services sector with secondary education. They do not have credit in default and have a housing loan. The client does not have a personal loan. They were contacted via an unknown communication type on the 14th of May. The call duration was 203 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with this client is unknown. The average yearly balance in euros is 2257.###\nHence this label was No."
"The client is a 43-year-old self-employed individual, married, with tertiary education. They do not have any credit in default and do not have a housing or personal loan. They were contacted via cellular communication and the last call lasted 153 seconds. This client was contacted 4 times during this campaign, with no previous contacts before. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 2501 euros. The last contact was made on the 29th of January.###\nHence this label was No."
"A 39-year-old married individual, working as a blue-collar employee with primary education, was contacted via cellular communication. They do not have credit in default, but have housing and personal loans. Their average yearly balance is 176 euros. During the current marketing campaign, they were contacted twice, with the last call lasting 189 seconds in April on the 3rd day of the month. There is no record of previous campaign contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"This client is a 43-year-old single individual working in an administrative role, with secondary education. They do not have any credit in default and have an average yearly balance of 309 euros. They have a housing loan but no personal loan. The bank contacted them via telephone on the 6th of February for a duration of 24 seconds, as part of the 5th contact during this campaign. They were contacted 276 days after the last campaign, where there was 1 previous contact. The outcome of the previous marketing campaign was categorized as 'other'.###\nHence this label was No."
"The client is a 32-year-old single individual working in administration with secondary education. They do not have credit in default and have an average yearly balance of 642 euros. They have a housing loan but no personal loan. The communication type for the marketing campaign was cellular, and the last contact was on the 5th of February for 52 seconds. This was the first contact during this campaign, but they were contacted twice before in a previous campaign, resulting in a failure outcome.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and have a housing loan. Their average yearly balance is 7985 euros, and they do not have a personal loan. The client was contacted via an unknown communication type on the 29th of May. The call duration was 347 seconds, and it was the first contact made to the client during this campaign. There is no record of previous contacts with this client or the outcome of any previous marketing campaigns.###\nHence this label was No."
"The client is a 45-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via a cellular phone call on the 28th of January, with a call duration of 64 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 103 euros.###\nHence this label was No."
"The client is a 55-year-old divorced individual working in management with a tertiary education. They do not have credit in default, a housing loan, or a personal loan. They were contacted via cellular communication on the 20th of November for a duration of 151 seconds, as part of a campaign where they were contacted twice. There is no record of previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 29484 euros.###\nHence this label was No."
"The client is a 38-year-old married technician with secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication. The last contact was on the 3rd of April and lasted 277 seconds. This was the second contact during this campaign, with 1 previous contact before. The outcome of the previous marketing campaign was a failure. The client's average yearly balance is 275 euros. A total of 333 days had passed since the client was last contacted from a previous campaign.###\nHence this label was No."
"A 28-year-old single individual working in the services sector with secondary education was contacted by phone regarding a term deposit subscription. They do not have credit in default but have a housing loan. Their average yearly balance is -260 euros, and they do not have a personal loan. The contact communication type is unknown, and the call lasted 170 seconds. This was the second contact made to the client during this campaign. The previous marketing campaign's outcome is unknown, and the client had not been contacted before. The call took place on the 12th of May.###\nHence this label was No."
"The client is a 62-year-old retired married individual with tertiary education. They do not have credit in default, have a housing loan, but no personal loan. They were contacted via cellular communication, with the last call lasting 211 seconds on the 14th day of September. This was the 1st contact during this campaign, following 7 previous contacts. The outcome of the previous marketing campaign was successful.###\nHence this label was Yes."
"The client is a 47-year-old married individual working in administration, with secondary education. They do not have credit in default, do not have a housing loan but have a personal loan. They were contacted via cellular communication on the 22nd of August and the call lasted for 150 seconds. This was the 8th contact made to them during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 29.###\nHence this label was No."
"The client is a 45-year-old married individual working in the services sector with a primary level of education. They do not have credit in default but have housing and personal loans. The average yearly balance in euros is 2406. The communication type for contact is cellular, with the last contact made on the 20th of April, lasting 108 seconds. This is the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working in administration with secondary education. They do not have credit in default and have an average yearly balance of 514 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 25th of May for 56 seconds. This was the first contact during this campaign, but they were contacted 185 days after the previous campaign. The outcome of the previous campaign was classified as 'other'.###\nHence this label was No."
"The client is a 40-year-old married individual working in a management position with a tertiary education. They do not have any credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via an unknown communication type on the 5th of May. The call duration was 2033 seconds. This was the first contact made during the current campaign. There is no information on previous contacts or outcomes of past marketing campaigns. The client's average yearly balance is negative.###\nHence this label was No."
"A 33-year-old self-employed married individual with a tertiary education and no credit defaults was contacted via cellular communication. They do not have a housing or personal loan. Their average yearly balance is 263 euros. The last contact was made on the 4th of May for 119 seconds, as part of the 2nd contact of the current campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old single individual working in the administrative field with secondary education. They do not have any credit in default, but they have a housing loan. They were contacted via cellular communication and during the last campaign, they were contacted 7 times, with the last contact lasting 185 seconds. The client was previously contacted 280 days ago, and there was 1 contact before this campaign. The outcome of the previous marketing campaign was 'other'.###\nHence this label was No."
"The client is a 59-year-old married entrepreneur with a tertiary education. They do not have credit in default, have a housing loan, but do not have a personal loan. The bank contacted them via cellular communication and the last call lasted 97 seconds. This is the third time they have been contacted during this campaign, with 3 total contacts. They were last contacted 365 days ago as part of a previous campaign, where they were contacted 6 times. The outcome of the previous campaign was a failure. The client's average yearly balance is 146 euros.###\nHence this label was No."
"The client is a 29-year-old self-employed individual who is married and has secondary level education. They do not have any credit in default but have a housing loan. The client does not have a personal loan. The communication type for contacting the client is unknown. The last contact was made on the 27th of May and lasted for 305 seconds. This is the second time they have been contacted during this campaign, and they were not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The average yearly balance is -76 euros.###\nHence this label was No."
"The client is a 52-year-old divorced individual who works as an admin. They have a secondary level education and do not have any credit in default. Their average yearly balance is 944 euros. They have a housing loan but no personal loan. The last contact was made on the 12th of May, with a call duration of 198 seconds. This was the third contact made during the current campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The communication type used for contact is also unknown.###\nHence this label was No."
"A 35-year-old married individual working in administration with secondary education was contacted via cellphone in September. They do not have a credit default, housing loan, or personal loan. They had an average yearly balance of 1204 euros. The last call lasted 789 seconds, and they have been contacted twice during this campaign. There was no previous contact with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 20th of May. The call duration was 446 seconds, and this was the 12th contact made to the client during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2390 euros.###\nHence this label was No."
"The client is a 53-year-old married individual working in management with tertiary education. They do not have any credit in default and have a housing loan. They have been contacted via cellular communication and during the current campaign, they were contacted twice for a duration of 121 seconds. There was a gap of 344 days since they were last contacted from a previous campaign, where they were also contacted twice before. The outcome of the previous marketing campaign for this client was a failure. Additionally, they do not have a personal loan and maintain an average yearly balance of 2124 euros.###\nHence this label was No."
"The client is a 43-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default and have a yearly balance of 1579 euros. They have a housing loan but no personal loan. The bank contacted them via telephone on the 11th of May, with a call duration of 176 seconds. This was the 1st contact during this campaign, and they were last contacted 284 days ago from a previous campaign where there were 4 contacts made. The outcome of the previous marketing campaign was categorized as \"other.\"###\nHence this label was No."
"The client is a 31-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default but have a housing loan and no personal loan. The bank contacted them via telephone on the 15th of July, with a call duration of 237 seconds. This was the 7th call made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old unemployed married individual with secondary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication and the last call lasted for 517 seconds. This was the 1st contact during the current campaign, with 4 previous contacts made. The previous marketing campaign was successful, and the client was last contacted 282 days ago. Their average yearly balance is 817 euros.###\nHence this label was Yes."
"The client is a 53-year-old entrepreneur who is divorced and has tertiary education. They do not have credit in default and have an average yearly balance of 81 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 6th day of May, with a call duration of 178 seconds. This is the 5th contact made during this campaign, with 3 previous contacts made before. The client was last contacted 352 days ago from a previous campaign, which ended in failure.###\nHence this label was No."
"The client is a 41-year-old married individual working in an administrative role with a secondary education. They do not have any credit in default, but they do have a housing loan. They do not have a personal loan. The bank contacted them via telephone on the 11th of May, and the call lasted for 64 seconds. This was the 2nd contact made during this campaign, with 1 previous contact made before. The client was last contacted 347 days ago from a previous campaign, where the outcome was 'other'. Their average yearly balance is 542 euros.###\nHence this label was No."
"A 37-year-old married individual working in administration, with secondary education, and no credit in default, was contacted via cellular communication. They do not have a housing or personal loan. They were previously contacted twice during this campaign, with the last call lasting 396 seconds on the 12th of May. There is no record of previous contact or outcome from a previous campaign. Their average yearly balance is 1193 euros.###\nHence this label was No."
"The client is a 36-year-old married individual working in management with a tertiary education. They do not have credit in default and do not have any housing or personal loans. The bank contacted the client via cellular communication on the 11th of August. The call lasted 386 seconds, and this was the 4th contact made during this campaign. There were no previous contacts with the client for marketing purposes. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 9 euros.###\nHence this label was Yes."
"The client is a 56-year-old divorced individual working in an administrative role, with secondary education. They do not have credit in default but have a housing loan. They were contacted by telephone on the 17th of November, with the call lasting 99 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 3337 euros and does not have a personal loan.###\nHence this label was No."
"The client is a 47-year-old retired individual who is married and has primary education. They do not have any credit in default, but they do have a personal loan. They do not have a housing loan. The client was contacted via an unknown communication type on the 25th of June with a call duration of 268 seconds. This was the first contact made during the current campaign. No previous campaign contact information is available. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is -468 euros.###\nHence this label was No."
"The client is a 33-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 1323. The client was contacted via cellular communication, with the last call lasting 109 seconds on the 15th day of September. This was the second contact during this campaign, following one previous contact. The outcome of the previous marketing campaign was successful, resulting in the client subscribing to a term deposit.###\nHence this label was No."
"The client is a 79-year-old married housemaid with primary education and no credit in default. They have a yearly balance of 0 euros and do not have a housing or personal loan. The bank contacted them via cellular communication on the 18th of August for 90 seconds. This is their first contact during this campaign, and there is no record of previous interactions. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working in a managerial position with a tertiary education. They do not have any credit in default and have a housing loan. They were contacted via an unknown communication type on the 21st of May. The client has an average yearly balance of 11149 euros and does not have a personal loan. The last contact duration was 418 seconds, and this was the second contact made during the current campaign. There is no information on previous contacts or campaign outcomes.###\nHence this label was No."
"The client is a 38-year-old single technician with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 2442 euros. The communication type was cellular, and the last contact was made on the 27th of May, lasting 161 seconds. This was the client's first contact during this campaign, but they were contacted 3 times in previous campaigns with the last contact being 100 days ago, resulting in a successful outcome.###\nHence this label was No."
"The client is a 53-year-old married individual working in the services sector with secondary education. They do not have any credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 17th of July, with a call duration of 187 seconds. This was the first time they were contacted during this campaign. The outcome of the previous marketing campaign is unknown, as the client was not previously contacted. They have an average yearly balance of 0 euros.###\nHence this label was No."
"The client is a 49-year-old married individual working in a blue-collar job with a secondary level of education. They do not have any credit in default and have a housing loan. The client does not have a personal loan. The communication type during the marketing campaign is unknown. The client was last contacted on the 6th of May for a duration of 276 seconds. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 26.###\nHence this label was No."
"The client is a 51-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 1123 euros. The last contact was made on the 18th of June, lasting 54 seconds. This is the 4th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client was contacted through an unknown communication type.###\nHence this label was No."
"The client is a 38-year-old married individual working in administration with a secondary education. They do not have any credit in default and do not have any housing or personal loans. The average yearly balance in their account is 4874 euros. They were contacted via an unknown communication type on the 6th day of June, and the call lasted for 1291 seconds. This was the third contact made during the current campaign, and they were not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old divorced individual working in administration with tertiary education. They do not have any credit in default and have an average yearly balance of €66. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 17th of November, and the call lasted 77 seconds. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, do not have a housing loan or personal loan. They were contacted via cellular communication on the 21st of July for a duration of 83 seconds. This was their second contact during this campaign, and they had not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 582 euros.###\nHence this label was No."
"The client is a 36-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 387. The communication type used for contact was cellular. The last contact was made on the 2nd day of June and lasted for 327 seconds. This was the first time they were contacted during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 31-year-old single individual working in a blue-collar job with secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is negative. The bank contacted the client via cellular communication on the 21st of July, with a call duration of 37 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 36-year-old single individual working in management with a tertiary education. They do not have any credit in default and have an average yearly balance of 7606 euros. They have a housing loan but no personal loan. The last contact was made on the 30th of May for 917 seconds. This was the first contact made during this campaign. Previous marketing campaign outcome is unknown.###\nHence this label was Yes."
"The client is a 32-year-old self-employed individual who is married with a tertiary education. They do not have any credit in default and have a personal loan. They do not have a housing loan. The bank contacted them via cellular communication on the 20th of November for 228 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 266 euros.###\nHence this label was No."
"A 24-year-old student, who is single and holds a tertiary education degree, with no credit in default, an average yearly balance of 834 euros, no housing or personal loan. The client was contacted via cellular communication on the 9th of September and the call lasted for 679 seconds. This was the first contact made during the current campaign, with no previous interactions recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"This client is a 50-year-old married technician with secondary education. They do not have credit in default, but they have a housing loan. They were contacted via cellular communication and the last call, which lasted 327 seconds, took place on the 6th day of May. This was the second time they were contacted during this campaign, with 356 days passed since they were last contacted from a previous campaign. The outcome of the previous marketing campaign was 'other'. Additionally, they have no personal loan and their average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 41-year-old married entrepreneur with unknown education. They do not have credit in default but have a housing loan. They do not have a personal loan. The average yearly balance in euros is 89. The communication type for contact is unknown. The last contact was made on the 6th of May and lasted for 333 seconds. This is the second time they have been contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and have a housing loan. Their average yearly balance is 762 euros and they do not have a personal loan. The client was contacted via an unknown communication type on the 29th of May, with the call lasting 56 seconds. This is their third contact during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 54-year-old married individual, working in a blue-collar job with secondary education, was contacted via telephone as part of a marketing campaign by a Portuguese banking institution. They do not have any credit in default, but have a housing loan. The client does not have a personal loan. The average yearly balance in euros is 5372. The call lasted 221 seconds, and this was the second time they were contacted during this campaign. The previous marketing campaign's outcome is unknown. The call was made on the 3rd of February.###\nHence this label was No."
"The client is a 34-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. The bank communicated with them via a cellular phone call on the 12th of November. The client's average yearly balance is 1026 euros. The last call duration was 319 seconds, and this was the 1st call made during this campaign to the client. The client was last contacted 100 days ago from a previous campaign and had 6 contacts before this current campaign. The outcome of the previous marketing campaign for this client was a failure.###\nHence this label was No."
"A 30-year-old single student with a secondary education, having no credit in default and no housing or personal loans. The client was contacted via cellular communication, with the last call lasting 165 seconds on the 27th of April. This was the second call made during this campaign, with no previous contact history available. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 5836 euros.###\nHence this label was No."
"The client is a 50-year-old married individual working in management with a tertiary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 14th of July, and the call duration was 68 seconds. This was the third time the bank contacted the client during this campaign. There was no previous contact with the client from a previous campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 6739 euros.###\nHence this label was No."
"The client is a 37-year-old married individual working in management with a tertiary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in their account is 1113 euros. They were contacted via cellular communication on the 1st of September and the call duration was 265 seconds. This is their second contact during this campaign, with 183 days passing since they were last contacted from a previous campaign. The outcome of the previous marketing campaign for this client was successful.###\nHence this label was Yes."
"The client is a 32-year-old single individual working in the services sector with a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 133. The bank contacted the client via cellular communication on the 15th of April, with a call duration of 171 seconds. This was the first contact made during this campaign, and there were no previous campaign contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was Yes."
"The client is a 33-year-old married technician with a tertiary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 20th of November, and the call lasted 103 seconds. This was the first contact made to the client during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 15,169 euros.###\nHence this label was No."
"The client is a 34-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication. The client has an average yearly balance of 800 euros. The last contact was on the 5th of April, with a call duration of 144 seconds. This was the first contact made during this campaign. No previous contact information is available. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"A 35-year-old single individual working in a management position with tertiary education was contacted for a marketing campaign. They do not have credit in default, have a housing loan, but do not have a personal loan. The average yearly balance is 565 euros. The contact was made through an unknown communication type on the last day of May, with a duration of 763 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 22-year-old single technician with a secondary education. They do not have credit in default and have a personal loan. Their average yearly balance is 333 euros, and they do not have a housing loan. The client was contacted by telephone on the 12th of November and the call lasted 129 seconds. This was the first contact during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default and have a housing loan. They were contacted through an unknown communication type on the 3rd day of June. The call lasted 328 seconds, and this was the 9th contact made during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and has an average yearly balance of 228 euros.###\nHence this label was No."
"A 29-year-old single individual working in the services sector, with primary education, and no credit in default, was contacted for a marketing campaign. They have a relatively low average yearly balance of 339 euros and do not have any housing or personal loans. The contact was made through an unknown communication type on the 4th day of July, with a call duration of 1576 seconds. This was the third time they were contacted in the current campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
