"The client is a 45-year-old married individual working in administration with secondary education. They do not have credit in default and have a yearly average balance of 72 euros. They have a housing and personal loan. The communication with the client was via cellular phone. The last contact was made on the 15th of May and lasted 262 seconds. This was the second contact made during this campaign, with a gap of 352 days since the client was last contacted from a previous campaign. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 31-year-old single individual working in an administrative role with a secondary education. They do not have credit in default, but they have a housing loan. Their average yearly balance is not specified (recorded as -1) and they do not have a personal loan. The client was contacted via cellular communication on the 15th of May and the call lasted 99 seconds. This was the second time they were contacted during this campaign, with the previous contact being 352 days ago, resulting in a failed outcome.###\nHence this label was No."
"A 39-year-old married individual working in a blue-collar job with a secondary education was contacted via telephone for a marketing campaign. They do not have a housing loan but have a personal loan. They do not have credit in default. Their average yearly balance is 1309 euros. The call lasted for 37 seconds and it was the first time they were contacted for this campaign. The outcome of the previous marketing campaign is unknown. The call took place on the 10th of July.###\nHence this label was No."
"A 34-year-old married individual working in a blue-collar job with secondary education was contacted by phone for a marketing campaign. They do not have credit in default and have a housing loan. Their average yearly balance is 2495 euros and they do not have a personal loan. The contact was made through an unknown communication type in May, with a call duration of 924 seconds on the 23rd day of the month. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 51-year-old married individual working in the services sector with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 25th of August and the call lasted 105 seconds. This was the 4th contact made to the client during this campaign. There were no previous contacts with the client regarding marketing campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 135 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The average yearly balance in euros is 550. The last contact was made on the 7th day of May, with a duration of 113 seconds. This was the first contact made during the current campaign. There is no information on previous campaign outcomes or contacts. The communication type is unknown.###\nHence this label was No."
"The client is a 44-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default but have a housing loan. They were not previously contacted for any marketing campaign. The average yearly balance is negative, amounting to -315 euros. They do not have a personal loan. The last contact was made on the 23rd of May, via an unknown communication type, and lasted for 90 seconds. This was the third contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old married individual working in a blue-collar job with primary education. They do not have credit in default nor any housing or personal loans. They were contacted via cellular communication on the 23rd of July, with the call lasting 135 seconds. This was the first contact made during this campaign. The client's average yearly balance is negative, specifically -460 euros. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 39-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 558 euros and do not have a personal loan. The client was contacted via an unknown communication type on the 22nd of July for 23 seconds. This is the first contact during this campaign, but they were contacted 3 times in previous campaigns, with the last contact being 531 days ago resulting in a failed outcome.###\nHence this label was No."
"The client is a 33-year-old married housemaid with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted the client via cellular communication on the 8th of August, with a call duration of 138 seconds. This was the second contact made during this campaign, and there were no previous contacts. The outcome of the previous campaign is unknown. The average yearly balance in euros is 0.###\nHence this label was No."
"The client is a 54-year-old single technician with tertiary education. They do not have credit in default and have housing and personal loans. The client was contacted via an unknown communication type on the 18th of June for 18 seconds. This is the 20th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1433 euros.###\nHence this label was No."
"The client is a 36-year-old married individual working as an admin with a tertiary education. They do not have any credit in default, have a housing loan, but do not have a personal loan. The average yearly balance in their account is 157 euros. The bank contacted them via cellular communication on the 17th of April and the call lasted for 277 seconds. This was the second time they were contacted during this campaign. There is no record of any previous contact with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 53-year-old married technician with secondary education, no credit in default, and a housing loan was contacted via cellular communication in July. They have an average yearly balance of 2818 euros and do not have a personal loan. During the current campaign, they were contacted 7 times, with the last call lasting 350 seconds. This is the first time they have been contacted for this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working in an administrative role with a tertiary education. They do not have any credit in default and have an average yearly balance of 33 euros. They have a housing loan but do not have a personal loan. The communication with the client was done via a cellular phone, and the last contact was made on the 25th of July, with a duration of 396 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not contacted before.###\nHence this label was No."
"The client is a 25-year-old single individual working in an administrative role with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their bank account is 1734 euros. They were contacted via cellular communication on the 19th of October and the call lasted for 366 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 37-year-old divorced individual working in administration with tertiary education. They do not have credit in default and have an average yearly balance of 43 euros. They have a housing loan but no personal loan. The communication type for the marketing campaign was cellular. The client was last contacted on the 20th of April and the call lasted 328 seconds. This was the second contact made during this campaign and the total number of contacts with the client is 4. The previous marketing campaign resulted in failure.###\nHence this label was No."
"A 35-year-old single individual working in the services sector with secondary education was contacted for a marketing campaign. They do not have any credit in default and have a housing loan but no personal loan. The average yearly balance is negative. The communication type used for contact was unknown, and the call duration was 43 seconds. This client has been contacted 5 times during this campaign but has not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old single blue-collar worker with secondary education. They do not have credit in default, but they have a housing loan. They were contacted via cellular communication and during the last campaign, the client was contacted 3 times, with the last contact lasting 84 seconds. This is the first time they have been contacted before this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 67-year-old retired individual who is divorced and has a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, and the call duration was 411 seconds. This was the second contact made during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 361 euros.###\nHence this label was Yes."
"The client is a 35-year-old single entrepreneur with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is negative 49 euros. The contact was made through an unknown communication type in June, with a call duration of 668 seconds. This is the 8th contact made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 72-year-old retired individual who is married and has primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication and the last call was made on the 5th of February, lasting 229 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted. The client has an average yearly balance of 9160 euros.###\nHence this label was No."
"The client is a 49-year-old divorced individual working in management with tertiary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 18th of July, with a call duration of 141 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 169 euros.###\nHence this label was No."
"The client is a 26-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is negative. The client was contacted via telephone on the 16th of July, with the call lasting 198 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, indicating that the client may not have been contacted before for a similar offer.###\nHence this label was No."
"The client is a 41-year-old self-employed individual who is married and has a secondary level of education. They do not have any credit in default and have an average yearly balance of 305 euros. They have a housing loan but do not have a personal loan. The communication with the client was done via cellular phone. The last contact was made on the 13th of May, with a duration of 174 seconds. This was the second contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old single technician with tertiary education. They do not have credit in default and currently have a housing loan but no personal loan. The average yearly balance is 0 euros. The client was contacted via an unknown communication type on the 7th of May. The call lasted for 104 seconds, and this was the second time they were contacted during this campaign. There is no record of them being contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 21-year-old student who is single and has tertiary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 7th of July for a duration of 404 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 1258 euros.###\nHence this label was No."
"The client is a 45-year-old married individual working in a management position with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in July. The client was last contacted on the 31st day of the month for 83 seconds, as part of the 4th contact in the current campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1533 euros.###\nHence this label was No."
"The client is a 40-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 30th of September and had a 117-second long conversation. This was the second time they were contacted during this campaign, after 121 days from the previous campaign where the outcome was successful. Their average yearly balance is 1451 euros.###\nHence this label was Yes."
"The client is a 29-year-old single technician with secondary education and no credit in default. They have an average yearly balance of 825 euros and do not have any housing or personal loans. The client was contacted via cellular communication on the 25th of June, with a call duration of 472 seconds. This is the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 49-year-old divorced technician with tertiary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 11th of August and the call lasted for 165 seconds. This was the 6th contact made during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 917 euros.###\nHence this label was No."
"The client is a 69-year-old married housemaid with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 22nd of April, and the call lasted for 164 seconds. This was the second time they were contacted during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1080 euros.###\nHence this label was No."
"The client is a 46-year-old married individual working in admin, with a secondary level education. They do not have any credit in default, but have housing and personal loans. The average yearly balance is 171 euros. The communication type used for contact was cellular. The last contact was on the 11th of October and lasted for 251 seconds. This was the first contact in the current campaign, but they were previously contacted 430 days ago with an outcome of failure.###\nHence this label was No."
