"This individual is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 31, and a plasma glucose concentration of 109 after a glucose tolerance test. Her 2-hour serum insulin level is 0. She has a body mass index of 35.9 and a diabetes pedigree function of 1.127. Overall, this data suggests a potential risk for developing diabetes.###\nHence this label was consent."
"A 44-year-old woman who has never been pregnant shows normal values for diastolic blood pressure, triceps skin fold thickness, and serum insulin. Her plasma glucose concentration after a glucose tolerance test is 117, indicating normal blood sugar levels. She has a moderate body mass index of 33.8 and a relatively high diabetes pedigree function score of 0.932, suggesting a genetic predisposition to diabetes.###\nHence this label was avoid."
"This patient is a 23-year-old who has never been pregnant. She has a normal diastolic blood pressure of 76 and a healthy body mass index of 33.3. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0, indicating low risk for diabetes. Her plasma glucose concentration after a glucose tolerance test is 113, and her diabetes pedigree function is 0.278, further suggesting low risk for developing diabetes.###\nHence this label was consent."
"The patient is a 39-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 41 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 137 mg/dL. She has no detectable insulin levels after a 2-hour serum test. Her body mass index is 32.0, and her diabetes pedigree function is 0.391.###\nHence this label was avoid."
"This individual is 39 years old and has been pregnant 8 times. Their diastolic blood pressure is 74, and they have a triceps skin fold thickness of 0. In a glucose tolerance test, their plasma glucose concentration at 2 hours is 197, and their 2-hour serum insulin is 0. They have a body mass index of 25.9 and a diabetes pedigree function of 1.191.###\nHence this label was consent."
"The patient is a 29-year-old female who has been pregnant 6 times. She has a normal diastolic blood pressure of 66 and a healthy body mass index of 24.3. However, she has no triceps skin fold thickness measurement and 2-hour serum insulin. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 103, and her diabetes pedigree function score is 0.249.###\nHence this label was avoid."
"The patient is a 36-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 42. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 179 and her 2-hour serum insulin level is 130. She has a body mass index of 32.7 and a diabetes pedigree function of 0.719.###\nHence this label was consent."
"A 30-year-old woman, who is pregnant for the first time, has a normal diastolic blood pressure, slightly above average triceps skin fold thickness, and a healthy plasma glucose concentration after a 2-hour oral glucose tolerance test. She has relatively high 2-hour serum insulin levels, indicating good metabolic function. Her body mass index is in the obese range, and she has a moderate genetic predisposition towards diabetes.###\nHence this label was consent."
"A 29-year-old woman who is pregnant for the ninth time with normal diastolic blood pressure and a healthy body mass index. She has average triceps skin fold thickness but surprisingly low insulin levels. Her glucose concentration after a glucose tolerance test is within normal range, and her diabetes pedigree function suggests a low risk of developing diabetes.###\nHence this label was consent."
"This individual is a 36-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 22 mm. Her plasma glucose concentration is high at 187 mg/dL, and her 2-hour serum insulin level is elevated at 200 μU/mL. She has a body mass index of 36.4, indicating obesity. Additionally, her diabetes pedigree function score is 0.408, suggesting a genetic predisposition to diabetes.###\nHence this label was consent."
"A 29-year-old female, who has been pregnant 7 times, with low diastolic blood pressure, average triceps skin fold thickness, normal plasma glucose concentration, very low 2-hour serum insulin levels, a slightly above-average body mass index, and a low diabetes pedigree function score.###\nHence this label was consent."
"This 32-year-old individual has been pregnant 5 times and shows normal diastolic blood pressure at 74. Their triceps skin fold thickness is 22, while their glucose level after a glucose tolerance test is 85. With no serum insulin detected, their body mass index is 29.0, indicating they might be overweight. Additionally, their diabetes pedigree function value is 1.224, suggesting a higher risk of developing diabetes.###\nHence this label was consent."
"This 24-year-old patient has been pregnant twice and shows normal diastolic blood pressure. They have a moderately high triceps skin fold thickness and a slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. Their insulin levels are low despite a high body mass index. Additionally, they have a family history of diabetes based on their diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 25-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 62 and a triceps skin fold thickness of 41. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 109, with a 2-hour serum insulin level of 129. She has a body mass index of 35.8 and a diabetes pedigree function of 0.514.###\nHence this label was consent."
"This data belongs to a 22-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 60 mmHg, triceps skin fold thickness of 18 mm, plasma glucose concentration of 122 mg/dL after a glucose tolerance test, and a 2-hour serum insulin level of 106 μU/ml. Their body mass index is 29.8, and their diabetes pedigree function is 0.717.###\nHence this label was avoid."
"A 21-year-old individual who has never been pregnant has a relatively low diastolic blood pressure of 58. They have a moderate triceps skin fold thickness of 20 and a slightly elevated plasma glucose concentration of 134 after a 2-hour oral glucose tolerance test. The individual also has high insulin levels at 291, a body mass index of 26.4, and a relatively low diabetes pedigree function of 0.352.###\nHence this label was avoid."
"The patient is a 31-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 66 mmHg and a triceps skin fold thickness of 29 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85 mg/dL. She has no detectable insulin levels. Her body mass index is 26.6, and her diabetes pedigree function score is 0.351.###\nHence this label was avoid."
"This is a case of a 22-year-old individual who has never been pregnant. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 37, and a plasma glucose concentration of 106 after a two-hour oral glucose tolerance test. Her 2-hour serum insulin level is 148, and she has a body mass index of 39.4. Her diabetes pedigree function is 0.605.###\nHence this label was avoid."
"This 22-year-old individual has been pregnant once. Their diastolic blood pressure is 58, and triceps skin fold thickness is 18. During an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 109. They have a 2-hour serum insulin level of 116 and a body mass index of 28.5. The diabetes pedigree function score is 0.219. Overall, this person's diabetes-related measurements fall within normal ranges.###\nHence this label was avoid."
"This patient is a 46-year-old woman who has been pregnant 14 times. She has a normal diastolic blood pressure of 78 and a slightly above average triceps skin fold thickness of 25. Her plasma glucose concentration after a glucose tolerance test is 100, and her 2-hour serum insulin level is elevated at 184. She has a body mass index of 36.6, indicating obesity. The diabetes pedigree function score is low at 0.412, suggesting a lower genetic predisposition to diabetes.###\nHence this label was consent."
"This is a 30-year-old individual who has been pregnant 5 times. They have a low diastolic blood pressure of 68 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a GTT is 110, with a 2-hour serum insulin level of 0. The individual has a body mass index of 26.0 and a diabetes pedigree function of 0.292.###\nHence this label was avoid."
"The patient, a 40-year-old female, has been pregnant 4 times. She has normal diastolic blood pressure and a low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 141, while her 2-hour serum insulin level is low. She has a healthy body mass index of 27.6 and a low diabetes pedigree function of 0.244. Overall, the patient shows some characteristics that may suggest a low risk of developing diabetes.###\nHence this label was avoid."
"A 46-year-old individual, who has been pregnant three times, with a diastolic blood pressure of 82. Their triceps skin fold thickness is 28, plasma glucose concentration after a glucose tolerance test is 61, and no insulin was detected after a 2-hour serum test. They have a body mass index of 34.4 and a low diabetes pedigree function of 0.243.###\nHence this label was avoid."
"The patient is a 41-year-old individual who has been pregnant 6 times. They have a low diastolic blood pressure of 68 and a high triceps skin fold thickness of 41. The patient's plasma glucose concentration after a 2-hour oral glucose tolerance test is 0, indicating normal levels. They also have normal 2-hour serum insulin levels of 0. The patient has a high body mass index of 39.0 and a diabetes pedigree function of 0.727, suggesting a potential genetic predisposition to diabetes.###\nHence this label was consent."
"This 21-year-old patient has never been pregnant and has normal diastolic blood pressure. The triceps skin fold thickness is within a healthy range. Their glucose levels are slightly elevated after a GTT, and their serum insulin levels are high. The patient has a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was avoid."
"This 27-year-old female has been pregnant twice and has a diastolic blood pressure of 74. She has a triceps skin fold thickness of 29, a plasma glucose concentration of 110 after a GTT, and a 2-hour serum insulin level of 125. Her body mass index is 32.4 and her diabetes pedigree function is 0.698.###\nHence this label was avoid."
"The individual in the dataset is a 27-year-old woman who has never been pregnant. She has normal diastolic blood pressure of 80 and slightly elevated Triceps skin fold thickness of 34. Her plasma glucose concentration after a glucose tolerance test is within normal range at 114. However, her 2-hour serum insulin level is high at 285. Despite having a high body mass index of 44.2, her diabetes pedigree function, which indicates the likelihood of developing diabetes based on family history, is low at 0.167.###\nHence this label was avoid."
"The patient is a 36-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 90 and a triceps skin fold thickness of 38. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 151. She has no serum insulin after 2 hours and has a body mass index of 29.7. Her diabetes pedigree function is 0.294, indicating a potential risk for developing diabetes in the future.###\nHence this label was avoid."
"This individual, aged 32, has been pregnant 6 times and has a diastolic blood pressure of 60. Their triceps skin fold thickness is 19, plasma glucose concentration is 99 after a glucose tolerance test, and 2-hour serum insulin level is 54. With a body mass index of 26.9 and a diabetes pedigree function of 0.497, this person's health profile suggests a moderate risk for developing diabetes.###\nHence this label was avoid."
"This patient is a 41-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 66, a triceps skin fold thickness of 30, and a plasma glucose concentration of 80 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, indicating low insulin production. She has a body mass index of 26.2 and a low diabetes pedigree function score of 0.313. Overall, this patient shows some signs of potential risk for developing diabetes, such as elevated glucose levels and lower insulin production.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 64 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 95, with a 2-hour serum insulin level of 0. She has a body mass index of 32.0 and a low diabetes pedigree function of 0.161.###\nHence this label was consent."
"The patient is a 40-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 44 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 123 mg/dL, and her 2-hour serum insulin level is 94 μU/ml. With a body mass index of 33.1, she has a relatively high risk of developing diabetes, as indicated by her diabetes pedigree function of 0.374.###\nHence this label was avoid."
"This patient is 55 years old and has been pregnant 6 times. She has a diastolic blood pressure of 72, a triceps skin fold thickness of 32, and a body mass index of 37.7. Her plasma glucose concentration after a glucose tolerance test is 103, and her 2-hour serum insulin level is 190. The diabetes pedigree function for this patient is 0.324.###\nHence this label was avoid."
"A 24-year-old individual who has been pregnant 3 times has a diastolic blood pressure of 64 and a triceps skin fold thickness of 13. Their plasma glucose concentration after a 2-hour glucose tolerance test is 158, with a 2-hour serum insulin level of 387. They have a body mass index of 31.2 and a diabetes pedigree function of 0.295.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant 3 times. She has low diastolic blood pressure, a moderate triceps skin fold thickness, and normal plasma glucose concentration at 2 hours. Her 2-hour serum insulin level is low. She has a healthy body mass index and a low diabetes pedigree function score. Overall, her risk of developing diabetes appears to be low based on these diagnostic measurements.###\nHence this label was avoid."
"This is a 26-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 80, triceps skin fold thickness of 33, plasma glucose concentration of 124 after a glucose tolerance test, and a 2-hour serum insulin level of 130. Their body mass index is 33.2 and their diabetes pedigree function is 0.305.###\nHence this label was avoid."
"This individual is a 21-year-old who has never been pregnant. They have a healthy diastolic blood pressure of 64 and a low triceps skin fold thickness of 17. Their glucose levels are normal at 101 mg/dL after a glucose tolerance test, and they have no insulin present after 2 hours. With a body mass index of 21.0 and a low diabetes pedigree function of 0.252, this person appears to be at low risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 45-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 100, triceps skin fold thickness of 36, and a plasma glucose concentration of 105 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 43.3. The diabetes pedigree function is 0.239.###\nHence this label was consent."
"The patient is a young adult woman who has never been pregnant. She has normal diastolic blood pressure and a healthy body mass index. Her glucose levels are within the normal range after a glucose tolerance test. She has a low triceps skinfold thickness and her insulin levels are normal. Overall, her risk of developing diabetes appears to be low based on these measurements.###\nHence this label was avoid."
"A 32-year-old individual who has been pregnant 6 times and has normal diastolic blood pressure, no triceps skin fold thickness, low plasma glucose concentration, zero serum insulin levels, low body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"This data belongs to a young adult female who is 24 years old and has been pregnant once. She has a healthy diastolic blood pressure of 72 mmHg and a relatively low triceps skin fold thickness of 18 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 81 mg/dL, and she has a moderate insulin level of 40 mu U/ml. With a body mass index of 26.6, she is considered overweight but not obese. Additionally, her diabetes pedigree function value is 0.283, indicating a modest genetic predisposition to diabetes. Overall, this individual appears to have relatively normal health markers with a low risk for developing diabetes.###\nHence this label was avoid."
"This individual is a 52-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 27, and a plasma glucose concentration of 97 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 35.6. Her diabetes pedigree function is 0.378.###\nHence this label was consent."
"This is a data entry for a 29-year-old individual who has been pregnant 5 times. She has normal diastolic blood pressure, a slightly above-average triceps skin fold thickness, and high plasma glucose concentration after a glucose tolerance test. Her 2-hour serum insulin level is elevated, indicating possible insulin resistance. Additionally, she has a high body mass index and a moderately low diabetes pedigree function score. Overall, these measurements suggest a potential risk for developing diabetes.###\nHence this label was consent."
"The patient is a 28-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 40 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 123 mg/dL, and her 2-hour serum insulin level is 77 μU/mL. She has a body mass index of 34.1 kg/m² and a diabetes pedigree function of 0.269.###\nHence this label was avoid."
"This patient, a 44-year-old female, has had 3 pregnancies and shows signs of potential health risks. She has normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a glucose tolerance test. Her insulin levels are low, and she has a high body mass index, indicating possible risk for diabetes. The diabetes pedigree function score suggests a moderate genetic risk for diabetes.###\nHence this label was consent."
"This individual is a 25-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 72, triceps skin fold thickness of 30, and a plasma glucose concentration of 112 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 176, and her body mass index is 34.4. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 38-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 82, a triceps skin fold thickness of 0, and a plasma glucose concentration of 75 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 33.3. The diabetes pedigree function score for this patient is 0.263.###\nHence this label was avoid."
"A 23-year-old individual who has been pregnant 4 times shows slightly elevated diastolic blood pressure, normal triceps skin fold thickness, slightly elevated plasma glucose concentration after a glucose tolerance test, high serum insulin levels, high body mass index, and a low diabetes pedigree function score. This combination of factors may indicate a moderate risk of developing diabetes.###\nHence this label was avoid."
"This 29-year-old individual, who is pregnant for the first time, has a diastolic blood pressure of 76 mmHg. They have a triceps skin fold thickness of 36 mm and a high plasma glucose concentration of 196 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 249 μU/mL. With a body mass index of 36.5, they have a relatively high risk of developing diabetes, as indicated by a diabetes pedigree function score of 0.875.###\nHence this label was consent."
"The patient is a 51-year-old woman who has been pregnant 11 times. She has elevated diastolic blood pressure, normal triceps skin fold thickness, and slightly high plasma glucose concentration after a glucose tolerance test. Her insulin levels are normal, and she has a high body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The individual in the data is 37 years old and has been pregnant 8 times. Their diastolic blood pressure is 90, triceps skin fold thickness is 35, and their plasma glucose concentration after a glucose tolerance test is 186. The 2-hour serum insulin level is 225, and their body mass index is 34.5. The diabetes pedigree function score is 0.423.###\nHence this label was consent."
"The patient is a 50-year-old woman who has been pregnant 7 times. She has normal diastolic blood pressure at 90 mmHg and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 136 mg/dL. She has low insulin levels at 0 μU/mL. With a body mass index of 29.9, she is considered overweight. Her diabetes pedigree function score is 0.21, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"A 31-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 76. They have a triceps skin fold thickness of 17, plasma glucose concentration of 114 after a GTT, and 2-hour serum insulin level of 110. Their body mass index is 23.8 and their diabetes pedigree function is 0.466.###\nHence this label was avoid."
"This individual is a 33-year-old who has been pregnant once. Despite a low diastolic blood pressure and a slightly low triceps skin fold thickness, they have a high plasma glucose concentration at 103 and a relatively high body mass index of 43.3, indicating a risk for diabetes. Their 2-hour serum insulin level is also elevated, while their diabetes pedigree function score is relatively low.###\nHence this label was avoid."
"A 38-year-old individual who has been pregnant nine times with a diastolic blood pressure of 78, triceps skin fold thickness of 25, and a plasma glucose concentration of 72 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 31.6. The diabetes pedigree function for this individual is 0.28.###\nHence this label was avoid."
"A 27-year-old woman who has been pregnant twice has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 17mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 155 mg/dL, and her 2-hour serum insulin level is 96 μU/mL. With a body mass index of 26.6 and a diabetes pedigree function of 0.433, she may be at risk for developing diabetes.###\nHence this label was consent."
"This data represents a 24-year-old individual who is pregnant for the first time. She has normal diastolic blood pressure, low triceps skin fold thickness, and normal plasma glucose concentration. Her 2-hour serum insulin level is very low. She has a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is 35 years old with a history of 6 pregnancies. They have low diastolic blood pressure of 44 and a moderate triceps skin fold thickness of 20. The plasma glucose concentration after a glucose tolerance test is normal at 108, but the 2-hour serum insulin is high at 130. The patient has a healthy body mass index of 24.0 and a slightly elevated diabetes pedigree function of 0.813.###\nHence this label was avoid."
"This is a case of a 32-year-old woman who has never been pregnant and shows a normal diastolic blood pressure of 68. She has a low triceps skin fold thickness of 20 and a healthy plasma glucose concentration of 108 after a glucose tolerance test. Her 2-hour serum insulin level is 0, indicating normal insulin levels. With a body mass index of 27.3, she falls within the overweight category. Her diabetes pedigree function is 0.787, suggesting a moderate genetic predisposition to diabetes. Overall, the woman presents with mostly normal health indicators, but may benefit from monitoring her weight and genetic risk for diabetes.###\nHence this label was avoid."
"The individual is a 31-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 78, triceps skin fold thickness of 39, and a plasma glucose concentration of 184 after a glucose tolerance test. Her 2-hour serum insulin level is 277, and her body mass index is 37.0. The diabetes pedigree function indicates a low genetic risk of developing diabetes.###\nHence this label was consent."
"The patient is a 45-year-old individual who has been pregnant 10 times. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 31. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 122, with a 2-hour serum insulin level of 0. The patient has a body mass index of 27.6 and a diabetes pedigree function of 0.512.###\nHence this label was avoid."
"This patient is a 50-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 84 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 99. She has no insulin present at the 2-hour mark. Her body mass index is 35.4 and her diabetes pedigree function is 0.388.###\nHence this label was avoid."
"A 44-year-old woman, who has been pregnant 12 times, shows normal diastolic blood pressure and low triceps skin fold thickness. Her glucose levels are within the normal range after a 2-hour oral glucose tolerance test, with no detectable insulin levels. She has a healthy body mass index of 23.6 and a low diabetes pedigree function.###\nHence this label was avoid."
"A 27-year-old woman who has been pregnant twice, with a diastolic blood pressure of 84, no triceps skin fold thickness, a plasma glucose concentration of 129 after a 2-hour oral glucose tolerance test, no serum insulin after 2 hours, a body mass index of 28.0, and a diabetes pedigree function of 0.284.###\nHence this label was avoid."
"This individual is 22 years old and has been pregnant 2 times. They have a low diastolic blood pressure of 62 and zero triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 91, with no detectable 2-hour serum insulin. They have a body mass index of 27.3 and a diabetes pedigree function of 0.525.###\nHence this label was avoid."
"The patient is a 45-year-old woman who has been pregnant 13 times. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 54 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106 mg/dL. She has no detectable insulin levels after a 2-hour serum test. The patient has a body mass index of 36.6 and a low diabetes pedigree function of 0.178, indicating a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"This patient is a young adult woman in her mid-twenties who is pregnant for the first time. She has low diastolic blood pressure and a below average triceps skin fold thickness. Her glucose levels after a 2-hour oral glucose tolerance test are within the normal range. She has a moderate insulin level and a relatively low body mass index. The diabetes pedigree function score indicates a low genetic predisposition to diabetes.###\nHence this label was avoid."
"A 24-year-old individual who has never been pregnant shows normal diastolic blood pressure and low triceps skin fold thickness. Their glucose levels are within normal range after a glucose tolerance test and they have normal insulin levels. However, their body mass index is considered high, and they have a moderate familial history of diabetes.###\nHence this label was avoid."
"A 41-year-old individual, who has been pregnant 7 times, with a diastolic blood pressure of 68, 39 triceps skin fold thickness, and a plasma glucose concentration of 187 mg/dL after a 2-hour oral glucose tolerance test. They have a 2-hour serum insulin level of 304 µU/ml, a body mass index of 37.7, and a diabetes pedigree function value of 0.254.###\nHence this label was consent."
"This 29-year-old individual has a low pregnancy history with 1 pregnancy. Their diastolic blood pressure is 86, and their triceps skin fold thickness is 39. The plasma glucose concentration at 2 hours is 119, while the 2-hour serum insulin level is high at 220. They have a high body mass index of 45.6 and a moderate diabetes pedigree function of 0.808.###\nHence this label was consent."
"The patient is a 62-year-old who has never been pregnant. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 105 mg/dL, and her 2-hour serum insulin level is 0 µU/mL. She has a body mass index of 27.9 and a diabetes pedigree function of 0.741.###\nHence this label was consent."
"A 37-year-old woman, who has been pregnant 4 times, has relatively low diastolic blood pressure of 58. Her triceps skin fold thickness is 28, indicating a moderate amount of subcutaneous fat. She has a plasma glucose concentration of 144 after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 140. With a body mass index of 29.5, she is classified as overweight. Her diabetes pedigree function is 0.287, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"A 26-year-old woman who has been pregnant twice has normal diastolic blood pressure and a slightly below average triceps skin fold thickness. Her blood glucose levels after a glucose tolerance test are within the normal range. However, she has high insulin levels and a high body mass index, indicating a potential risk for developing diabetes. Her diabetes pedigree function score is relatively low, suggesting a moderate genetic predisposition to the disease.###\nHence this label was avoid."
"This individual is a 38-year-old woman who is pregnant for the first time. She has normal diastolic blood pressure, moderate triceps skin fold thickness, and high plasma glucose concentration after a glucose tolerance test. Her insulin levels are elevated, and she has a high body mass index. The diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was consent."
"This individual is a 21-year-old who has never been pregnant. Their diastolic blood pressure is 80, triceps skin fold thickness is 16, and plasma glucose concentration after a glucose tolerance test is 113. They have no insulin in their bloodstream after 2 hours, and their body mass index is 31.0. Their diabetes pedigree function score is 0.874.###\nHence this label was avoid."
"This patient is a 69-year-old female who has been pregnant 5 times. She has a normal diastolic blood pressure of 80 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 132, and her 2-hour serum insulin level is 0. She has a body mass index of 26.8 and a low diabetes pedigree function of 0.186.###\nHence this label was avoid."
"This individual is a 46-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 62 and a triceps skin fold thickness of 32. Her plasma glucose concentration after a glucose tolerance test is 92, and her 2-hour serum insulin level is 126. With a body mass index of 32.0, she has a low diabetes pedigree function score of 0.085.###\nHence this label was avoid."
"A 47-year-old individual, who has been pregnant once, with a low diastolic blood pressure of 60. They have no triceps skin fold thickness, a normal plasma glucose concentration of 126, and no insulin level after a 2-hour oral glucose tolerance test. With a body mass index of 30.1 and a low diabetes pedigree function of 0.349, this individual shows some signs of potential diabetes risk, but overall appears to have relatively stable health markers.###\nHence this label was consent."
"This is a data entry for a 26-year-old individual with 1 pregnancy. They have normal diastolic blood pressure, no triceps skin fold thickness, and normal glucose levels after a 2-hour oral glucose tolerance test. Their insulin level is normal, but they have a high body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 94, triceps skin fold thickness of 33, and a plasma glucose concentration of 143 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 146, and she has a body mass index of 36.6. The diabetes pedigree function score is 0.254.###\nHence this label was consent."
"The patient is a 21-year-old female who has never been pregnant. Her diastolic blood pressure is normal at 75. She has a triceps skin fold thickness of 23mm. The patient's glucose levels after a 2-hour oral glucose tolerance test are within normal range at 102. She has no insulin present in her serum. Her body mass index is very low at 0.0. The patient has a moderate risk of developing diabetes, indicated by a diabetes pedigree function of 0.572.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 54 mmHg and a relatively low triceps skin fold thickness of 14 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 95 mg/dL, and her 2-hour serum insulin level is 88 μU/mL. With a body mass index of 26.1, she is considered to be overweight. Her diabetes pedigree function value is 0.748, indicating a moderate genetic risk for developing diabetes.###\nHence this label was avoid."
"This individual is 37 years old and has been pregnant 3 times. They have a normal diastolic blood pressure of 76 and a low triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 150, with a low 2-hour serum insulin level of 0. They have a healthy body mass index of 21.0 and a low diabetes pedigree function of 0.207.###\nHence this label was avoid."
"A 21-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 64, a triceps skin fold thickness of 23, a plasma glucose concentration of 100 after a glucose tolerance test, no insulin after 2 hours, a body mass index of 29.7, and a diabetes pedigree function of 0.368.###\nHence this label was avoid."
"A 40-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 78. Their triceps skin fold thickness is 27mm, plasma glucose concentration after a 2-hour oral glucose tolerance test is 126mg/dL, and 2-hour serum insulin level is 22mu U/mL. They have a body mass index of 29.6 and a diabetes pedigree function score of 0.439.###\nHence this label was avoid."
"The patient is a 46-year-old female who has been pregnant 6 times. She has a diastolic blood pressure reading of 80 and a triceps skinfold thickness of 37. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 134, with a 2-hour serum insulin level of 370. Additionally, she has a body mass index of 46.2 and a diabetes pedigree function value of 0.238.###\nHence this label was consent."
"The patient is a 41-year-old female who is currently pregnant for the first time. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 48 mm. Her plasma glucose concentration after a glucose tolerance test is 120 mg/dL and her 2-hour serum insulin level is 200 uU/mL. She has a body mass index of 38.9 and a diabetes pedigree function of 1.162.###\nHence this label was avoid."
"A 66-year-old individual who has been pregnant twice, with a diastolic blood pressure of 90. They have no triceps skin fold thickness or serum insulin, but a high plasma glucose concentration of 158 after a glucose tolerance test. Their body mass index is 31.6 and they have a diabetes pedigree function value of 0.805.###\nHence this label was consent."
"This individual is a 36-year-old who is in their first pregnancy and has a healthy diastolic blood pressure of 74. They have a moderately low triceps skin fold thickness of 21, and their plasma glucose level after a 2-hour GTT is within normal range at 95. Their 2-hour serum insulin level is also in the healthy range at 73. With a body mass index of 25.9, they are considered to have a normal weight. The diabetes pedigree function score of 0.673 indicates a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 24-year-old who has been pregnant twice. Their diastolic blood pressure is 88, triceps skin fold thickness is 37, and body mass index is 44.5, indicating they may be overweight. They have a plasma glucose concentration of 174 after a glucose tolerance test and a 2-hour serum insulin level of 120. The diabetes pedigree function is 0.646, suggesting a moderate genetic influence on diabetes risk.###\nHence this label was consent."
"The individual is 30 years old and has been pregnant 3 times. They have a diastolic blood pressure of 80, triceps skin fold thickness of 11, and a plasma glucose concentration of 99 after a glucose tolerance test. Their 2-hour serum insulin level is 64, with a body mass index of 19.3. The diabetes pedigree function value is 0.284.###\nHence this label was avoid."
"A 27-year-old woman, who is pregnant for the first time, has normal diastolic blood pressure and low triceps skin fold thickness. Her glucose level after a 2-hour oral test is within the normal range. She has no insulin present in her serum and has a low body mass index. The diabetes pedigree function indicates a moderate genetic risk for diabetes development.###\nHence this label was avoid."
"This is a data record of a 21-year-old individual who has been pregnant once. \nShe has a diastolic blood pressure of 60 and a triceps skin fold thickness of 23. \nHer plasma glucose concentration after a 2-hour oral glucose tolerance test is 130, and her 2-hour serum insulin level is 170. \nWith a body mass index of 28.6, she has a diabetes pedigree function of 0.692.###\nHence this label was avoid."
"The individual is a 38-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 86 and a triceps skin fold thickness of 37. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 101, and she has a 2-hour serum insulin level of 0. With a body mass index of 45.6 and a diabetes pedigree function value of 1.136, the data suggests a risk for developing diabetes.###\nHence this label was consent."
"A 26-year-old woman who has been pregnant 4 times is showing signs of low risk for developing diabetes. Her blood pressure and triceps skin fold thickness are within healthy ranges. Her glucose and insulin levels are normal after a glucose tolerance test. She has a low body mass index and a relatively low diabetes pedigree function score, indicating a low likelihood of developing diabetes.###\nHence this label was avoid."
"The individual is 35 years old and has been pregnant 3 times. They have a low diastolic blood pressure of 70 and a moderate triceps skin fold thickness of 30. Their plasma glucose concentration after a GTT is high at 158, and their 2-hour serum insulin level is very high at 328. They have a high body mass index of 35.5 and a relatively low diabetes pedigree function score of 0.344.###\nHence this label was consent."
"A 22-year-old woman, who has been pregnant twice, with low diastolic blood pressure and a moderate triceps skin fold thickness. Her glucose levels after a glucose tolerance test are within normal range, but she has high insulin levels. Despite having a slightly elevated body mass index, her risk of developing diabetes is low based on her family history.###\nHence this label was avoid."
"The patient is a 27-year-old individual who has been pregnant 5 times. They have a healthy diastolic blood pressure of 72 and a relatively low triceps skin fold thickness of 28. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 111. The patient has no insulin present in their serum after 2 hours. They have a low body mass index of 23.9 and a relatively low diabetes pedigree function score of 0.407.###\nHence this label was avoid."
"This data describes a 24-year-old individual who has been pregnant twice and has a diastolic blood pressure of 58. They have a triceps skin fold thickness of 34, a plasma glucose concentration of 141 after a 2-hour glucose tolerance test, and a 2-hour serum insulin level of 128. The individual has a body mass index of 25.4 and a diabetes pedigree function of 0.699.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 3 times. She has a healthy diastolic blood pressure of 78 and moderate triceps skin fold thickness of 39. Her plasma glucose concentration after a glucose tolerance test is high at 173, and she has elevated 2-hour serum insulin levels at 185. Despite these, her body mass index is in the overweight range at 33.8. Her diabetes pedigree function, a measure of diabetes risk, is relatively high at 0.97. Overall, the data suggests a potential risk for developing diabetes due to the elevated glucose and insulin levels, as well as the high diabetes pedigree function score.###\nHence this label was consent."
"This individual is a 33-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 17 mm. Her plasma glucose concentration after a glucose tolerance test is 167 mg/dL, and her 2-hour serum insulin level is 144 μU/ml. She has a body mass index of 23.4 and a diabetes pedigree function value of 0.447.###\nHence this label was consent."
"This data belongs to a 31-year-old individual who has never been pregnant. Their diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin levels are all at 0. They have a plasma glucose concentration of 145, a high body mass index of 44.2, and a moderately low diabetes pedigree function of 0.63.###\nHence this label was consent."
"The patient is a 58-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 76, no triceps skin fold thickness, and a healthy plasma glucose concentration of 110 after a glucose tolerance test. Her 2-hour serum insulin level is 0, indicating proper insulin function. With a body mass index of 27.8 and a low diabetes pedigree function of 0.237, she appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 24-year-old who has never been pregnant. They have a diastolic blood pressure of 85 and a triceps skin fold thickness of 54. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 147. They have a 2-hour serum insulin level of 0. With a body mass index of 42.8 and a diabetes pedigree function of 0.375, this individual's risk for developing diabetes may be of concern.###\nHence this label was avoid."
"The individual is a 39-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 32, and a plasma glucose concentration of 154 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 193, and her body mass index is 29.3. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes of 0.839.###\nHence this label was avoid."
"The patient is a 56-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 85, triceps skin fold thickness of 32, and a plasma glucose concentration of 90 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 34.9. The diabetes pedigree function for this patient is 0.825.###\nHence this label was consent."
"This patient is a 29-year-old female who has been pregnant twice. She has a diastolic blood pressure of 80, triceps skin fold thickness of 45, and a plasma glucose concentration of 105 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 191, and she has a body mass index of 33.7. The diabetes pedigree function for this patient is 0.711.###\nHence this label was consent."
"This individual is a 24-year-old woman who has been pregnant 3 times. She has a healthy diastolic blood pressure of 74 and a moderate triceps skin fold thickness of 15. Her glucose levels after a 2-hour oral glucose tolerance test are normal at 116, and her insulin levels are slightly elevated at 105. Her body mass index is within the normal range at 26.3, and her diabetes pedigree function score is low at 0.107, indicating a low risk of developing diabetes.###\nHence this label was avoid."
"A 21-year-old individual who has been pregnant 4 times, with a healthy diastolic blood pressure of 76 mmHg. They have a moderate triceps skin fold thickness of 15mm and a normal glucose level of 99 mg/dL after a GTT. Their insulin level is slightly elevated at 51 μU/mL, but their body mass index is within the normal range at 23.2. The individual has a low diabetes pedigree function score of 0.223, indicating a low genetic risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 22-year-old woman who has been pregnant three times. Her diastolic blood pressure is normal at 66, and she has a low triceps skin fold thickness of 25. Her plasma glucose concentration after a glucose tolerance test is elevated at 148, but she has very low insulin levels at 0. She has a high body mass index of 32.5 and a relatively low diabetes pedigree function score of 0.256. Overall, this data suggests a potential risk for developing diabetes due to the high glucose concentration and BMI.###\nHence this label was avoid."
"The individual is a 40-year-old woman who has been pregnant once. She has a diastolic blood pressure of 88, triceps skin fold thickness of 24, and a plasma glucose concentration of 117 after a glucose tolerance test. Her 2-hour serum insulin level is 145, and she has a body mass index of 34.5. The diabetes pedigree function value is 0.403.###\nHence this label was consent."
"The patient, a 34-year-old female, has been pregnant 6 times and has a diastolic blood pressure of 72. Her triceps skin fold thickness is 45mm and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 123mg/dL. Additionally, her 2-hour serum insulin level is 230mu U/ml. She has a body mass index of 33.6 and a diabetes pedigree function of 0.733. These measurements provide insight into her current health status and risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 42-year-old woman who is in her 9th pregnancy. She has a very low diastolic blood pressure of 52 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106. The 2-hour serum insulin level is 0, indicating potential risk for diabetes. Her body mass index is 31.2, and she has a relatively low diabetes pedigree function score of 0.38.###\nHence this label was avoid."
"This individual is a 22-year-old who is 1 time pregnant. She has a low diastolic blood pressure of 48 and a relatively low body mass index at 24.7. Her triceps skin fold thickness is 20, indicating a healthy amount of subcutaneous fat. The levels of plasma glucose and serum insulin at 2 hours are both at 0, suggesting she may have normal glucose tolerance. Additionally, her diabetes pedigree function is 0.14, indicating a relatively low genetic risk of developing diabetes.###\nHence this label was avoid."
"This data represents a 53-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 88, a triceps skin fold thickness of 34, and a plasma glucose concentration of 145 after a glucose tolerance test. Their 2-hour serum insulin level is 165, and their body mass index is 30.3. The diabetes pedigree function for this individual is 0.771.###\nHence this label was consent."
"This 28-year-old female has been pregnant once. She has a healthy diastolic blood pressure of 72 and a normal triceps skin fold thickness of 12. Her plasma glucose concentration after a glucose tolerance test is 100, and her 2-hour serum insulin level is 70. With a body mass index of 25.3 and a diabetes pedigree function of 0.658, she appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 42-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 86 mmHg and a triceps skin fold thickness of 30 mm. Her plasma glucose concentration after a glucose tolerance test is 117 mg/dL and she has a 2-hour serum insulin level of 105 mu U/ml. With a body mass index of 39.1, she has a relatively high risk of developing diabetes, as indicated by her diabetes pedigree function of 0.251.###\nHence this label was avoid."
"The patient is a 27-year-old female who has been pregnant 4 times. She has a normal diastolic blood pressure of 80 and a normal body mass index of 32.3. However, she has an unusually low triceps skin fold thickness of 0, which could indicate low muscle mass. Her plasma glucose concentration after a glucose tolerance test is 125, which is within the normal range. The patient has no insulin in her system after 2 hours and a relatively low diabetes pedigree function score of 0.536, suggesting a lower genetic predisposition to diabetes.###\nHence this label was consent."
"The individual is a 26-year-old female who has never been pregnant. She has slightly elevated diastolic blood pressure and a high triceps skin fold thickness. Her glucose level after a 2-hour oral glucose tolerance test is within normal range. She has higher than average insulin levels and a high body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This data belongs to a 24-year-old individual who has never been pregnant and has a diastolic blood pressure of 85. They have a triceps skin fold thickness of 25mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 95mg/dL, and their 2-hour serum insulin level is 36uU/mL. With a body mass index of 37.4 and a diabetes pedigree function of 0.247, this individual's risk for developing diabetes can be assessed.###\nHence this label was consent."
"A 24-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 65 and a triceps skin fold thickness of 28. Their plasma glucose concentration after a GTT is 83, with a 2-hour serum insulin level of 66. They have a body mass index of 36.8 and a diabetes pedigree function score of 0.629.###\nHence this label was avoid."
"A 47-year-old individual who has been pregnant 10 times with a diastolic blood pressure of 68. They have a triceps skin fold thickness of 23mm and a plasma glucose concentration of 161mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 132mu U/ml and they have a body mass index of 25.5. The diabetes pedigree function, a measure of the diabetes genetic influence, is calculated as 0.326. Overall, this individual's data suggests they may be at risk for developing diabetes.###\nHence this label was consent."
"This 34-year-old individual has been pregnant four times. Despite having a normal diastolic blood pressure of 86, their triceps skin fold thickness is below average at 19. They have a healthy plasma glucose concentration of 83 and minimal insulin level. Their body mass index is within the healthy range at 29.3, and their diabetes pedigree function indicates a low genetic risk of diabetes.###\nHence this label was avoid."
"A 25-year-old woman, who has been pregnant twice, shows low diastolic blood pressure of 52. She has a moderately high triceps skin fold thickness of 27 and high plasma glucose concentration of 155 after a GTT. Her insulin levels are very high at 540, and she has a high body mass index of 38.7 along with a relatively low diabetes pedigree function of 0.24.###\nHence this label was consent."
"This 22-year-old individual is not pregnant and has normal diastolic blood pressure. They have a low triceps skin fold thickness and a low plasma glucose concentration after a glucose tolerance test. Their insulin levels are within normal range. Despite having a slightly elevated body mass index, their diabetes pedigree function is low, indicating a low risk of developing diabetes.###\nHence this label was avoid."
"This is a data entry of a 21-year-old individual who has been pregnant twice. They have normal diastolic blood pressure, zero triceps skin fold thickness, and zero serum insulin level. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 118 mg/dL. Despite having a high body mass index of 42.9 and a moderate diabetes pedigree function score of 0.693, the individual shows no indication of insulin resistance based on the provided data.###\nHence this label was consent."
"A 38-year-old individual, who has been pregnant 13 times, with normal diastolic blood pressure and no triceps skin fold thickness. They have a slightly elevated plasma glucose concentration after a glucose tolerance test, but no insulin present. Their body mass index is in the overweight range, and they have a relatively low diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 27-year-old female who has never been pregnant. She has normal diastolic blood pressure, slightly below average triceps skin fold thickness, and normal plasma glucose concentration after a glucose tolerance test. Her 2-hour serum insulin level is slightly elevated, and she has a healthy body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes. Overall, the patient appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"The patient is a 35-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 84, triceps skin fold thickness of 41, plasma glucose concentration of 136, 2-hour serum insulin level of 88, and a body mass index of 35.0. Her diabetes pedigree function is 0.286.###\nHence this label was consent."
"This data belongs to a 51-year-old individual who has been pregnant 7 times. They have a diastolic blood pressure of 84, triceps skin fold thickness of 21, and a plasma glucose concentration of 181 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 192, and they have a body mass index of 35.9. The diabetes pedigree function for this individual is 0.586.###\nHence this label was consent."
"A 25-year-old woman who has been pregnant once has low diastolic blood pressure, average triceps skin fold thickness, normal glucose levels after a glucose tolerance test, slightly elevated serum insulin levels, high body mass index, and a low risk of developing diabetes based on her family history.###\nHence this label was avoid."
"The patient is a young adult, 22 years old, who is pregnant for the first time. She has low diastolic blood pressure (56) and a low triceps skin fold thickness (11). Her glucose concentration after a 2-hour oral glucose tolerance test is normal (93), and her insulin level is very low (0). She has a healthy body mass index of 22.5 and a low diabetes pedigree function score of 0.417. Overall, the patient appears to have a low risk of developing diabetes based on these factors.###\nHence this label was avoid."
"This 22-year-old patient has been pregnant 4 times and shows normal diastolic blood pressure. She has no triceps skin fold thickness and zero insulin levels. Her plasma glucose concentration after a glucose tolerance test is 142, and she has a high body mass index of 44.0. With a relatively low diabetes pedigree function of 0.645, this patient may have a low risk of developing diabetes.###\nHence this label was consent."
"This data describes a 23-year-old individual who has been pregnant twice. The individual has a diastolic blood pressure of 64, a triceps skin fold thickness of 32, and a plasma glucose concentration of 93 after a glucose tolerance test. Their 2-hour serum insulin level is 160, and their body mass index is 38.0. The diabetes pedigree function for this individual is 0.674.###\nHence this label was consent."
"This patient is a 33-year-old female who has never been pregnant. She has a slightly low diastolic blood pressure of 66 mmHg. Her triceps skin fold thickness is within a healthy range at 30 mm. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 121 mg/dL. She has a higher than normal 2-hour serum insulin level of 165 μU/mL. Her body mass index is elevated at 34.3, indicating obesity. The diabetes pedigree function score is relatively low at 0.203, suggesting a lower genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 24-year-old woman who is pregnant for the first time. She has low diastolic blood pressure and a relatively low triceps skin fold thickness. However, her plasma glucose concentration after a glucose tolerance test is high, indicating a risk for diabetes. Her insulin levels are also elevated. Despite having a normal body mass index, her diabetes pedigree function score suggests a moderate genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 27-year-old who has been pregnant three times. They have normal diastolic blood pressure, no triceps skin fold thickness, and zero insulin levels. Their plasma glucose concentration after a glucose tolerance test is 141, and they have a body mass index of 30.0. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 24-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 48 and a relatively high triceps skin fold thickness of 45. Her plasma glucose concentration after a glucose tolerance test is 128, and her 2-hour serum insulin level is 194. With a body mass index of 40.5, she is considered obese. The diabetes pedigree function indicates a moderate genetic risk of diabetes at 0.613.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant 4 times. She has a normal diastolic blood pressure of 70 and a slightly above-average triceps skin fold thickness of 32. Her plasma glucose concentration after a glucose tolerance test is 91, and her 2-hour serum insulin level is 88. With a body mass index of 33.1, she is considered overweight. Her diabetes pedigree function is 0.446, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual, a 22-year-old woman, has been pregnant twice. She has normal diastolic blood pressure and a slightly below average triceps skin fold thickness. Her plasma glucose concentration after a GTT is low, and she has very low serum insulin levels. Despite this, her body mass index is within the normal range. Her diabetes pedigree function score indicates a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This 26-year-old individual, who has been pregnant twice, shows healthy readings in most measurements: their diastolic blood pressure is low at 68, triceps skin fold thickness is at a moderate level of 13, and their body mass index is within the normal range at 21.1. With a plasma glucose concentration of 96 and 2-hour serum insulin of 49, both indicating typical values, the person's risk for developing diabetes appears low.###\nHence this label was avoid."
"The patient is a 54-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 84 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 162, and her 2-hour serum insulin level is 0. Her body mass index is 27.7 and her diabetes pedigree function is 0.182.###\nHence this label was avoid."
"This individual is a 26-year-old who is pregnant for the first time. They have a low diastolic blood pressure of 62 and no triceps skin fold thickness. Their glucose levels after a 2-hour oral glucose tolerance test are 71, with no serum insulin present. Despite their low body mass index of 21.8, they have a slight diabetes pedigree function value of 0.416.###\nHence this label was avoid."
"This is a dataset of a 45-year-old individual who has been pregnant 9 times. Their diastolic blood pressure is 78, with a triceps skin fold thickness of 0. The plasma glucose concentration in an oral glucose tolerance test is 164, and their 2-hour serum insulin is 0. The individual has a body mass index of 32.8 and a diabetes pedigree function of 0.148.###\nHence this label was consent."
"A 21-year-old individual who has been pregnant 3 times shows no triceps skin fold thickness and no serum insulin measured at 2 hours. They have a diastolic blood pressure of 62 and a plasma glucose concentration of 111 after an oral glucose tolerance test. With a body mass index of 22.6 and a low diabetes pedigree function of 0.142, this individual may have a low risk of developing diabetes.###\nHence this label was avoid."
"This individual is 38 years old and has been pregnant 14 times. They have a healthy diastolic blood pressure of 62 and a triceps skin fold thickness of 30. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 175, while their 2-hour serum insulin level is 0. With a body mass index of 33.6 and a low diabetes pedigree function of 0.212, this individual appears to have a moderate risk of developing diabetes.###\nHence this label was consent."
"This 28-year-old individual has been pregnant three times and has a normal diastolic blood pressure of 72. Their triceps skin fold thickness is within normal range at 32. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 84, indicating normal blood sugar levels. They have a low 2-hour serum insulin level of 0. Despite having a high body mass index of 37.2, their diabetes pedigree function is low at 0.267, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant twice and has a diastolic blood pressure of 76. Their triceps skin fold thickness is 18, plasma glucose concentration at 2 hours is 94, and 2-hour serum insulin level is 66. With a body mass index of 31.6 and a diabetes pedigree function of 0.649, this person's risk for developing diabetes may be worth monitoring.###\nHence this label was avoid."
"The patient is a 23-year-old female who has never been pregnant. She has a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 23 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 104 mg/dL, and her 2-hour serum insulin level is 116 μU/mL. She has a body mass index of 27.8 and a diabetes pedigree function value of 0.454.###\nHence this label was avoid."
"This patient is 27 years old and has been pregnant 4 times. They have a slightly elevated diastolic blood pressure of 85 and a moderate triceps skin fold thickness of 27. Their blood glucose level after a 2-hour oral glucose tolerance test is 146, with a 2-hour serum insulin level of 100. They have a body mass index of 28.9, indicating they are slightly overweight. Their diabetes pedigree function is low at 0.189, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 32-year-old female, who has been pregnant 8 times, shows low diastolic blood pressure of 64. She has no triceps skin fold thickness and minimal 2-hour serum insulin. However, she exhibits a high plasma glucose concentration of 183, with a healthy body mass index of 23.3 and a moderate diabetes pedigree function of 0.672.###\nHence this label was consent."
"The patient is a 25-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 52 and a slightly below average triceps skin fold thickness of 22. Her plasma glucose concentration after a glucose tolerance test is normal at 82, but her 2-hour serum insulin levels are elevated at 115. She has a healthy body mass index of 28.5 and a relatively high diabetes pedigree function of 1.699, indicating a potential genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 23-year-old who is pregnant for the first time. She has a diastolic blood pressure of 62, triceps skin fold thickness of 13, and a plasma glucose concentration of 111 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 182, and she has a body mass index of 24.0. Her diabetes pedigree function is 0.138.###\nHence this label was avoid."
"This individual is a 42-year-old woman who has been pregnant 6 times. She has a normal diastolic blood pressure of 78 and a low triceps skin fold thickness of 0. Her glucose levels are within normal range at 85, with no insulin present in her system after a 2-hour oral glucose tolerance test. Despite a slightly elevated body mass index of 31.2, her diabetes pedigree function indicates a relatively low genetic risk for developing diabetes, at 0.382.###\nHence this label was avoid."
"This patient is a 51-year-old female who has been pregnant 7 times. She has a relatively low diastolic blood pressure of 74 mmHg. Even though her triceps skin fold thickness is 26 mm, indicating a moderate amount of body fat, her plasma glucose concentration during an oral glucose tolerance test is 136 mg/dL which is within the normal range. She also has a 2-hour serum insulin level of 135 μU/mL, suggesting good insulin sensitivity. With a body mass index of 26.0 kg/m², she is considered overweight but not obese. The diabetes pedigree function score of 0.647 indicates a moderate genetic predisposition to diabetes. Overall, this patient appears to be at low risk for developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"A 30-year-old individual who has been pregnant 5 times shows a diastolic blood pressure of 72 and a triceps skin fold thickness of 23. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 121, with 2-hour serum insulin level at 112. They have a body mass index of 26.2 and a diabetes pedigree function of 0.245.###\nHence this label was avoid."
"The patient is a young adult female, 22 years old, who is in the early stages of pregnancy. She has normal diastolic blood pressure, moderate triceps skin fold thickness, and a healthy plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are within a reasonable range, and her body mass index indicates that she is at a healthy weight. Overall, she has a low diabetes pedigree function score, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"A 27-year-old individual who has been pregnant twice, with a considerably low diastolic blood pressure of 54. They have no triceps skin fold thickness and a normal plasma glucose concentration of 120 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 26.8. The diabetes pedigree function score is 0.455, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"This 25-year-old individual, who has been pregnant twice, has a relatively normal diastolic blood pressure of 68. Their triceps skin fold thickness is moderate at 22, and they have a healthy plasma glucose concentration of 114 after a GTT. The individual has no insulin present in their system after a 2-hour serum test. With a body mass index of 28.7 and a low diabetes pedigree function of 0.092, this person appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"A 24-year-old patient with 1 pregnancy, low diastolic blood pressure of 54, slightly below average triceps skin fold thickness of 13, normal plasma glucose concentration after a glucose tolerance test at 119, moderate 2-hour serum insulin level of 50, healthy body mass index of 22.3, and a low diabetes pedigree function score of 0.205.###\nHence this label was avoid."
"The patient is a 51-year-old woman who has been pregnant 11 times. Her diastolic blood pressure is 76, triceps skin fold thickness is 28, and plasma glucose concentration after a 2-hour oral glucose tolerance test is 155. She has a 2-hour serum insulin level of 150 and a body mass index of 33.3. Her diabetes pedigree function is 1.353.###\nHence this label was consent."
"This is a data entry for a 21-year-old individual with 1 pregnancy. The person has normal diastolic blood pressure and a moderate triceps skin fold thickness. Their glucose levels after a GTT are within the normal range. There is no insulin present in their blood after a 2-hour period. The individual has a slightly elevated body mass index and a relatively low diabetes pedigree function score.###\nHence this label was consent."
"This 21-year-old individual has been pregnant twice and shows normal diastolic blood pressure. They have a moderately high triceps skin fold thickness of 32, with a slightly elevated BMI of 35.7. Their plasma glucose level after a GTT is within the normal range. However, their insulin level is low at 0, and their diabetes pedigree function is relatively low at 0.148, indicating a potentially lower risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 23-year-old female who has been pregnant twice. She has a relatively low diastolic blood pressure of 62 and a low triceps skin fold thickness of 13. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 68, and her 2-hour serum insulin level is 15. With a body mass index of 20.1 and a diabetes pedigree function of 0.257, she appears to have a low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"The patient is a 22-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 80, triceps skin fold thickness of 11, plasma glucose concentration of 103, 2-hour serum insulin level of 82, and a body mass index of 19.4. The diabetes pedigree function is calculated to be 0.491.###\nHence this label was avoid."
"The patient is a young adult female, aged 26, who is pregnant for the first time. She has slightly elevated diastolic blood pressure and a high triceps skinfold thickness. Her glucose levels are within normal range, but her insulin levels are elevated. She has a high body mass index, indicating obesity. The diabetes pedigree function suggests a moderate genetic predisposition to diabetes. Overall, the patient may be at risk for developing gestational diabetes due to her high insulin levels and obesity.###\nHence this label was avoid."
"The patient is a 36-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 82, triceps skin fold thickness of 32, plasma glucose concentration of 112 after a glucose tolerance test, and 2-hour serum insulin of 175. Her body mass index is 34.2 and she has a diabetes pedigree function of 0.26.###\nHence this label was consent."
"This individual is a 30-year-old female who has never been pregnant. She has normal diastolic blood pressure, with a low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is high at 167, but her insulin levels are normal. She has a slightly elevated body mass index of 32.3 and a moderate diabetes pedigree function score of 0.839.###\nHence this label was consent."
"A 28-year-old woman, who has been pregnant four times, with a diastolic blood pressure of 72 and a triceps skin fold thickness of 17. Her plasma glucose concentration after a glucose tolerance test is 99, with no insulin detected after 2 hours. She has a body mass index of 25.6 and a low diabetes pedigree function score of 0.294.###\nHence this label was avoid."
"This 26-year-old individual, who has been pregnant once, has a low diastolic blood pressure of 38. They have a relatively low triceps skin fold thickness of 18 and a normal plasma glucose concentration of 109 after a glucose tolerance test. Their 2-hour serum insulin level is elevated at 120, and they have a healthy body mass index of 23.1. With a diabetes pedigree function of 0.407, this person may have a lower risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"The patient is a 23-year-old who has been pregnant 3 times. She has a healthy diastolic blood pressure of 62 and a slightly below average triceps skin fold thickness of 13. Her glucose levels are normal at 107 after a GTT, with a moderate insulin level of 48. She has a low body mass index of 22.9 and a relatively low diabetes pedigree function score of 0.678. Overall, the data suggests that the patient has a low risk of developing diabetes.###\nHence this label was consent."
"A 64-year-old individual who has been pregnant 8 times and has a healthy diastolic blood pressure of 78. They have a triceps skin fold thickness of 0, normal plasma glucose concentration of 120, and low 2-hour serum insulin levels. With a moderate body mass index of 25.0 and a diabetes pedigree function score of 0.409, this individual appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"A 28-year-old individual with a low diastolic blood pressure, no triceps skin fold thickness, and normal 2-hour serum insulin level. They have a healthy body mass index of 23.7 and a low diabetes pedigree function score of 0.19. The individual has been pregnant 6 times and their plasma glucose concentration after a glucose tolerance test is 96, indicating a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 57-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 29. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 196, with a 2-hour serum insulin level of 280. Her body mass index is 37.5, and she has a diabetes pedigree function of 0.605.###\nHence this label was consent."
"This individual is 34 years old and has been pregnant 3 times. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 23. In a glucose tolerance test, their plasma glucose concentration at 2 hours is 130. Their 2-hour serum insulin level is 79. They have a body mass index of 28.4 and a diabetes pedigree function of 0.323.###\nHence this label was consent."
"A 32-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 75. They have a triceps skin fold thickness of 0 and a plasma glucose concentration of 156 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin levels are 0, with a body mass index of 48.3 and a diabetes pedigree function of 0.238.###\nHence this label was consent."
"The patient is a 27-year-old female who has been pregnant twice. She has a healthy diastolic blood pressure of 70 and a low triceps skin fold thickness of 16. Her plasma glucose concentration after a glucose tolerance test is normal at 99, and her insulin levels are moderate at 44. With a body mass index of 20.4, she is within the healthy weight range. The diabetes pedigree function score of 0.235 indicates a low genetic predisposition to diabetes.###\nHence this label was avoid."
"This 27-year-old individual has been pregnant 6 times and has a diastolic blood pressure of 60. Their triceps skin fold thickness is 27, plasma glucose concentration after a 2-hour glucose tolerance test is 109, and 2-hour serum insulin is 0. They have a body mass index of 25.0 and a diabetes pedigree function of 0.206.###\nHence this label was avoid."
"The patient is a 22-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, a moderately high triceps skin fold thickness, and elevated plasma glucose concentration after a glucose tolerance test. Her insulin level is low, and she has a high body mass index. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 24-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 72, a triceps skin fold thickness of 33, and a body mass index of 33.3. Her plasma glucose concentration after a glucose tolerance test is 171, with a 2-hour serum insulin level of 135. Her diabetes pedigree function is 0.199, suggesting a low genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 62-year-old female who has been pregnant twice. She has a diastolic blood pressure of 70, very high triceps skin fold thickness of 99, and elevated plasma glucose concentration at 2 hours of 197. Her 2-hour serum insulin level is very low at 0. She has a body mass index of 34.7 and a moderately high diabetes pedigree function of 0.575.###\nHence this label was consent."
"This 26-year-old individual has never been pregnant and has normal diastolic blood pressure. They have a moderate triceps skin fold thickness and high plasma glucose concentration after a glucose tolerance test. Their insulin levels are low and they have a high body mass index. The diabetes pedigree function score indicates a low genetic risk for diabetes.###\nHence this label was consent."
"This patient is a 28-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 64, triceps skin fold thickness of 29, plasma glucose concentration of 129, and 2-hour serum insulin level of 115. Her body mass index is 26.4, and she has a diabetes pedigree function score of 0.219. These measurements provide insight into her current health status and risk of developing diabetes.###\nHence this label was consent."
"The patient is a 37-year-old female who has been pregnant 10 times. She has a low diastolic blood pressure of 70 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 179. She has a 2-hour serum insulin level of 0 and a high body mass index of 35.1. Her diabetes pedigree function is low at 0.2.###\nHence this label was avoid."
"This is a data entry of a 21-year-old individual who is pregnant for the first time. The person has a normal diastolic blood pressure of 74 and a healthy triceps skin fold thickness of 22. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 143, with a corresponding 2-hour serum insulin level of 61. With a body mass index of 26.2, this individual has a low risk of developing diabetes as indicated by a low diabetes pedigree function of 0.256.###\nHence this label was avoid."
"A 45-year-old individual who has been pregnant 6 times, with a diastolic blood pressure of 94. Triceps skin fold thickness and 2-hour serum insulin levels are 0. Plasma glucose concentration after a glucose tolerance test is 183. The individual has a body mass index of 40.8 and a diabetes pedigree function of 1.461. Overall, these measurements indicate a potential risk for developing diabetes.###\nHence this label was avoid."
"This patient is a 45-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 18, and a body mass index of 28.9. Her plasma glucose concentration after a glucose tolerance test is 125, and her 2-hour serum insulin level is 122. She has a diabetes pedigree function score of 1.144.###\nHence this label was consent."
"A 38-year-old woman who has never been pregnant has a slightly elevated diastolic blood pressure and a healthy body mass index. Her glucose levels after a 2-hour oral glucose tolerance test are normal. She has no detectable insulin levels and a low diabetes pedigree function score.###\nHence this label was consent."
"A 36-year-old woman who has never been pregnant has normal diastolic blood pressure and a slightly below-average triceps skin fold thickness. Her glucose levels after a glucose tolerance test are within a healthy range, and she has low insulin levels. She has a moderate body mass index and a relatively low diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 70-year-old who has been pregnant 4 times. She has a diastolic blood pressure of 82, triceps skin fold thickness of 18, plasma glucose concentration of 145, and 2-hour serum insulin level of 0. Her body mass index is 32.5 and her diabetes pedigree function is 0.235.###\nHence this label was consent."
"This individual is a 39-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 28, and a high plasma glucose concentration of 129 after a glucose tolerance test. Her 2-hour serum insulin level is 122, indicating potential insulin resistance. With a body mass index of 35.9, she is considered obese. Her diabetes pedigree function is low at 0.28, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a young adult woman, aged 21, who is pregnant for the first time. She has a healthy diastolic blood pressure reading of 66 and a slightly above-average body mass index of 38.1. Her triceps skin fold thickness is 36 and her plasma glucose concentration after a glucose tolerance test is 114. Additionally, her 2-hour serum insulin level is high at 200, indicating a potential risk of developing diabetes. However, her diabetes pedigree function is relatively low at 0.289, suggesting a lower genetic predisposition to the disease.###\nHence this label was avoid."
"This patient is a 62-year-old woman who has been pregnant once. She has a very low diastolic blood pressure of 54 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 135. She has no serum insulin levels after 2 hours. Her body mass index is 26.7, indicating she is slightly overweight. The diabetes pedigree function score is 0.687, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 25-year-old woman who has been pregnant 3 times shows normal blood pressure and insulin levels. She has low triceps skin fold thickness, low glucose concentration, and a healthy body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 29-year-old female who has been pregnant twice. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 37mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120, and her 2-hour serum insulin level is 105. With a body mass index of 39.7 and a low diabetes pedigree function of 0.215, she appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"A 25-year-old female who has been pregnant 3 times shows normal diastolic blood pressure and a slightly elevated triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 193, while her insulin level is low. She has a high body mass index of 34.9 and a relatively low diabetes pedigree function score of 0.241.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 84, triceps skin fold thickness of 33, plasma glucose concentration of 173, 2-hour serum insulin of 474, and a body mass index of 35.7. Her diabetes pedigree function is 0.258.###\nHence this label was consent."
"A 30-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure and moderately high triceps skin fold thickness. Their plasma glucose concentration is elevated after a 2-hour oral glucose tolerance test, along with high serum insulin levels. Despite having a high body mass index, their diabetes pedigree function indicates a relatively low genetic risk for diabetes.###\nHence this label was consent."
"The individual in the dataset is a 21-year-old who has never been pregnant. She has a diastolic blood pressure of 86 mmHg and a triceps skin fold thickness of 27 mm. Her plasma glucose concentration after a glucose tolerance test is 126 mg/dL, and her 2-hour serum insulin level is 120 μU/mL. With a body mass index of 27.4, she has a low diabetes pedigree function score of 0.515.###\nHence this label was avoid."
"The patient is a 31-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 107, with 0 insulin level. Her body mass index is 29.6 and her diabetes pedigree function is 0.254.###\nHence this label was consent."
"This individual is a 41-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 0, indicating low fat under the skin. Her plasma glucose concentration after a two-hour oral glucose tolerance test is 112, and she has no insulin in her serum after 2 hours. With a body mass index of 37.8 and a low diabetes pedigree function of 0.261, she may have a lower risk of developing diabetes.###\nHence this label was consent."
"This 49-year-old individual has been pregnant 6 times and shows a healthy diastolic blood pressure of 78. Their triceps skin fold thickness is 31, indicating a moderate amount of body fat. With a plasma glucose concentration of 125, they are within a normal range for a 2-hour oral glucose tolerance test. Their insulin levels are low at 0, and they have a body mass index of 27.6, which is considered overweight. The diabetes pedigree function score of 0.565 suggests a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"This data belongs to a 27-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 72 and a triceps skin fold thickness of 25. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours was 128, and they have a 2-hour serum insulin level of 190. Their body mass index is 32.4, and their diabetes pedigree function is 0.549.###\nHence this label was consent."
"This is a young individual who has never been pregnant, with a low diastolic blood pressure and no triceps skin fold thickness. Their glucose levels after a GTT are normal, as well as their insulin levels. Despite having a high body mass index, their risk of developing diabetes is relatively low based on a low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 86, triceps skin fold thickness of 16, and plasma glucose concentration of 81 after a glucose tolerance test. Her 2-hour serum insulin level is 66 and body mass index is 27.5. The diabetes pedigree function value is 0.306. Overall, the patient appears to have a relatively healthy profile with normal glucose levels and moderate insulin levels.###\nHence this label was avoid."
"This individual is a 21-year-old who has been pregnant 2 times. They have a normal diastolic blood pressure of 64 and no triceps skin fold thickness. Their glucose levels are within normal range at 108, and they have no insulin in their blood. Despite having a relatively high body mass index of 30.8, their diabetes pedigree function is low at 0.158, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 39-year-old woman who has been pregnant 8 times. She has a healthy diastolic blood pressure of 74 and a good triceps skin fold thickness of 31. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 84, and her 2-hour serum insulin level is 0. She has a high body mass index of 38.3 and a low diabetes pedigree function score of 0.457.###\nHence this label was avoid."
"A 23-year-old woman who is pregnant for the first time is showing normal values in most of her diagnostic measurements for diabetes. She has low diastolic blood pressure, a healthy body mass index, and a low blood glucose level after a glucose tolerance test. However, her insulin level is slightly elevated, indicating her body may be working harder to regulate blood sugar. Overall, her risk of developing diabetes appears to be low based on these measurements.###\nHence this label was avoid."
"A 24-year-old individual, who has been pregnant 6 times, with a diastolic blood pressure of 64, a triceps skin fold thickness of 39, a plasma glucose concentration of 111 after a glucose tolerance test, no insulin detected after 2 hours, a body mass index of 34.2, and a diabetes pedigree function of 0.26.###\nHence this label was avoid."
"This individual is a 21-year-old who is pregnant for the first time. They have normal diastolic blood pressure and a low triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within a healthy range. They have very low 2-hour serum insulin levels. Their body mass index indicates they are slightly overweight. The diabetes pedigree function score suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 40-year-old woman who has been pregnant 6 times. She has a low diastolic blood pressure of 60 and a relatively high triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115, with no detectable serum insulin levels. She has a body mass index of 33.7, indicating obesity, and a low diabetes pedigree function of 0.245, suggesting a lower genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 42-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 84, triceps skin fold thickness of 35, and a plasma glucose concentration of 136 after a glucose tolerance test. Her 2-hour serum insulin level is 130, and her body mass index is 28.3. The diabetes pedigree function for this patient is 0.26.###\nHence this label was consent."
"This data describes a 21-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 58 and a relatively low triceps skin fold thickness of 10. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 99, indicating a normal blood sugar level. She has no insulin present in her serum after 2 hours. Her body mass index is within the normal range at 25.4, and her diabetes pedigree function score is 0.551, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"A 42-year-old individual who has been pregnant 8 times with a diastolic blood pressure of 72. Their triceps skin fold thickness is 23, plasma glucose concentration after a glucose tolerance test is 65, and 2-hour serum insulin level is 0. They have a body mass index of 32.0 and a diabetes pedigree function of 0.6.###\nHence this label was avoid."
"This 48-year-old individual has been pregnant 7 times and has a diastolic blood pressure of 92. Their triceps skin fold thickness is 18, plasma glucose concentration at 106, and no serum insulin present. With a body mass index of 22.7 and a low diabetes pedigree function of 0.235, the risk of developing diabetes for this individual may be on the lower side.###\nHence this label was avoid."
"This is data from a 23-year-old individual who is 1 time pregnant and has a diastolic blood pressure of 58. They have a triceps skin fold thickness of 36, a plasma glucose concentration of 118 after a glucose tolerance test, and a 2-hour serum insulin level of 94. Their body mass index is 33.3, and the diabetes pedigree function is 0.261.###\nHence this label was avoid."
"The patient is a 37-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 82 and a body mass index of 39.1, indicating obesity. Her triceps skin fold thickness and 2-hour serum insulin levels are both 0. Despite having a relatively normal plasma glucose concentration at 130, her diabetes pedigree function is high at 0.956, suggesting a genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 22-year-old who has never been pregnant. She has a diastolic blood pressure of 84 mmHg, a triceps skin fold thickness of 26 mm, and a Body Mass Index of 32.4, indicating she is overweight. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 141 mg/dL, and she has normal 2-hour serum insulin levels. Her diabetes pedigree function is 0.433, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This data belongs to a 24-year-old individual who is 1 time pregnant and has a diastolic blood pressure of 72. The individual's triceps skin fold thickness is 21, and their plasma glucose concentration at 2 hours in an oral glucose tolerance test is 157. They have a 2-hour serum insulin level of 168 and a body mass index of 25.6. The diabetes pedigree function for this individual is 0.123. Overall, the data suggests a moderately high risk of developing diabetes.###\nHence this label was avoid."
"The patient is 34 years old and has been pregnant 4 times. She has a diastolic blood pressure of 80, triceps skin fold thickness of 15, and a plasma glucose concentration of 123 after a glucose tolerance test. Her 2-hour serum insulin level is 176, and her body mass index is 32.0. The diabetes pedigree function is 0.443.###\nHence this label was avoid."
"A 26-year-old woman who has been pregnant three times shows low diastolic blood pressure, moderate triceps skin fold thickness, low glucose levels after an oral glucose tolerance test, moderate serum insulin levels, high body mass index, and a low diabetes pedigree function score.###\nHence this label was consent."
"A 29-year-old woman who has never been pregnant has a diastolic blood pressure of 80. She has no triceps skin fold thickness and a plasma glucose concentration of 129 after a glucose tolerance test. Her 2-hour serum insulin is 0, and she has a body mass index of 31.2. The diabetes pedigree function value is 0.703.###\nHence this label was avoid."
"The patient is a 28-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 98, no triceps skin fold thickness, and a plasma glucose concentration of 115 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a high body mass index of 52.9. Her diabetes pedigree function is 0.209, indicating a potential risk for developing diabetes.###\nHence this label was consent."
"This is a 33-year-old individual who has been pregnant 8 times. Despite having a normal diastolic blood pressure of 70, their triceps skin fold thickness and 2-hour serum insulin levels are both remarkably low at 0. However, their plasma glucose concentration after a glucose tolerance test is 108, indicating normal blood sugar levels. With a body mass index of 30.5 and a relatively high diabetes pedigree function score of 0.955, this individual may have an increased risk of developing diabetes in the future.###\nHence this label was consent."
"The patient is a 59-year-old woman who has been pregnant once. She has a low diastolic blood pressure of 60, a triceps skin fold thickness of 23, and a high plasma glucose concentration of 189 after a glucose tolerance test. Additionally, she has a very high 2-hour serum insulin level of 846, indicating possible insulin resistance. Her body mass index is 30.1, indicating that she is overweight. The diabetes pedigree function score is 0.398, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The data belongs to a 22-year-old individual who has never been pregnant. They have a normal diastolic blood pressure of 68 and a healthy triceps skin fold thickness of 22. Their glucose concentration after a 2-hour oral glucose tolerance test is 105, and their insulin level is 0. The person has a low body mass index of 20.0 and a low diabetes pedigree function of 0.236.###\nHence this label was avoid."
"The patient is a 21-year-old female who is pregnant for the first time. She has a normal diastolic blood pressure of 66 and a slightly below average triceps skin fold thickness of 23. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 89, which is within the normal range. However, her 2-hour serum insulin level is elevated at 94. She has a body mass index (BMI) of 28.1, indicating she is overweight. The diabetes pedigree function score is low at 0.167, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is 33 years old and has been pregnant 9 times. They have low diastolic blood pressure and no triceps skin fold thickness. Their glucose level after a 2-hour oral glucose tolerance test is 89, with no insulin present. The patient has a low body mass index of 22.5 and a low diabetes pedigree function of 0.142.###\nHence this label was avoid."
"A young adult woman, aged 28, with one pregnancy, has a normal diastolic blood pressure of 82. She has no triceps skin fold thickness, possibly indicating a slim build. Her glucose levels after a GTT are slightly elevated at 138. There is no indication of insulin production two hours post glucose intake. She has a high body mass index of 40.1, suggesting obesity. The diabetes pedigree function score is low at 0.236, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 55-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 70, triceps skin fold thickness of 33, plasma glucose concentration of 195 after a glucose tolerance test, 2-hour serum insulin level of 145, body mass index of 25.1, and a low diabetes pedigree function of 0.163.###\nHence this label was consent."
"This is a data record of a 28-year-old individual who has been pregnant once. \nHer diastolic blood pressure is 82, and her triceps skin fold thickness is 40. \nIn an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 144. \nShe has zero insulin level at 2 hours. \nHer body mass index is 41.3, and her diabetes pedigree function is 0.607.###\nHence this label was avoid."
"This individual is a 25-year-old who has been pregnant twice. Their diastolic blood pressure is 70 mmHg. They have a triceps skin fold thickness of 32 mm. After a 2-hour oral glucose tolerance test, their plasma glucose concentration is 68 mg/dL. Their 2-hour serum insulin level is 66 μU/mL. They have a body mass index of 25.0 and a low diabetes pedigree function score of 0.187.###\nHence this label was avoid."
"This individual is a young adult, age 21, who has never been pregnant. They have a diastolic blood pressure of 90, a triceps skin fold thickness of 46, and a high plasma glucose concentration of 151 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, indicating potential insulin sensitivity issues. With a body mass index of 42.1, this person is considered obese. The diabetes pedigree function value of 0.371 suggests a mild genetic predisposition to diabetes.###\nHence this label was consent."
"This individual is a 21-year-old woman who has been pregnant twice. She has a relatively low diastolic blood pressure of 62 and a moderate triceps skin fold thickness of 32. Her plasma glucose concentration 2 hours after an oral glucose tolerance test is 108, and her 2-hour serum insulin level is 56. With a body mass index of 25.2 and a diabetes pedigree function of 0.128, she appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"A 24-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 32mm. They have a plasma glucose concentration of 95 mg/dL after a 2-hour oral glucose tolerance test, no insulin level detected, and a body mass index of 32.1 kg/m^2. Their diabetes pedigree function is 0.612, indicating a potential risk for developing diabetes.###\nHence this label was avoid."
"The patient is 58 years old and has never been pregnant. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 32. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 173 mg/dL. They have a 2-hour serum insulin level of 265 uU/mL and a body mass index of 46.5, indicating obesity. Their diabetes pedigree function is 1.159, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This data is from a 54-year-old individual who has been pregnant 7 times. They have a diastolic blood pressure of 78, a triceps skin fold thickness of 29, and a plasma glucose concentration of 150 after a GTT. Their 2-hour serum insulin level is 126, and they have a body mass index of 35.2. The diabetes pedigree function indicates a genetic predisposition of 0.692 towards diabetes.###\nHence this label was consent."
"This patient is a 22-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 0 mmHg, triceps skin fold thickness of 0 mm, and 2-hour serum insulin level of 0 microU/mL. Her plasma glucose concentration after a glucose tolerance test is 80 mg/dL. Additionally, she has a body mass index of 0.0 and a diabetes pedigree function score of 0.174.###\nHence this label was avoid."
"The patient is a 58-year-old female who has been pregnant 12 times. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 43. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 140, and her 2-hour serum insulin level is 325. With a body mass index of 39.2 and a diabetes pedigree function of 0.528, she may be at risk for developing diabetes.###\nHence this label was consent."
"This is a data entry for a 22-year-old individual who is pregnant for the first time. She has a healthy diastolic blood pressure of 66 and a moderately high 2-hour serum insulin level of 140. Her triceps skin fold thickness is 15, indicating average fat distribution. Despite having a normal plasma glucose concentration of 97, her body mass index is relatively low at 23.2. The diabetes pedigree function score is 0.487, suggesting a low genetic risk of developing diabetes.###\nHence this label was avoid."
"This is a profile of a 31-year-old individual with 4 pregnancies. They have a low diastolic blood pressure of 78, no triceps skin fold thickness, and a high plasma glucose concentration of 158 after a GTT. Their 2-hour serum insulin level is 0, indicating a potential issue. They have a body mass index of 32.9, suggesting they may be overweight. The diabetes pedigree function value is 0.803, indicating a moderate genetic risk for diabetes.###\nHence this label was consent."
"This patient is a 39-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 38. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 126, with a 2-hour serum insulin level of 75. Her body mass index is 25.9 and her diabetes pedigree function is 0.162.###\nHence this label was avoid."
"This individual is a 47-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 86 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a glucose tolerance test is 161 mg/dL and her 2-hour serum insulin level is 0 µU/mL. She has a body mass index of 30.4 and a low diabetes pedigree function of 0.165.###\nHence this label was consent."
"This data belongs to a 23-year-old individual who is 1 time pregnant. Their diastolic blood pressure is 82, triceps skin fold thickness is 42, plasma glucose concentration after a 2-hour oral glucose tolerance test is 153, 2-hour serum insulin is 485, body mass index is 40.6, and diabetes pedigree function is 0.687.###\nHence this label was avoid."
"This individual is a 41-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 25 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 94 mg/dL, and her 2-hour serum insulin level is 79 mU/mL. She has a body mass index of 33.3 kg/m² and a diabetes pedigree function value of 0.738.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant 4 times and shows no diastolic blood pressure or triceps skin fold thickness. Their plasma glucose concentration after a GTT is 132, while their 2-hour serum insulin level is 0. With a body mass index of 32.9 and a diabetes pedigree function of 0.302, this individual's risk of developing diabetes may be influenced by these factors.###\nHence this label was consent."
"This is a data entry for a 23-year-old female who is pregnant for the first time. She has low diastolic blood pressure of 54 and a healthy body mass index of 25.2. Her triceps skin fold thickness is normal at 25, and her oral glucose tolerance test result is 91, indicating normal glucose levels. She has a moderate level of insulin at 100, and her diabetes pedigree function score is low at 0.234. Overall, this data suggests a low risk of developing diabetes for this individual.###\nHence this label was avoid."
"This 22-year-old individual, who has been pregnant once, has a diastolic blood pressure of 78. Their triceps skin fold thickness is 42, and their plasma glucose concentration after a glucose tolerance test is 181. Their 2-hour serum insulin level is 293. With a body mass index of 40.0 and a diabetes pedigree function of 1.258, this individual's overall risk of developing diabetes may be on the higher side.###\nHence this label was consent."
"A 22-year-old individual who has never been pregnant shows normal diastolic blood pressure and low triceps skin fold thickness. They had a slightly lower plasma glucose concentration after a GTT and very low insulin levels. Despite having a high body mass index, their diabetes pedigree function suggests a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 33-year-old woman who has been pregnant 9 times. She has a low diastolic blood pressure of 56 and no triceps skin fold thickness. In an oral glucose tolerance test, her plasma glucose concentration after 2 hours is 122. Her 2-hour serum insulin level is 0. With a body mass index of 33.3, she has a high diabetes pedigree function score of 1.114.###\nHence this label was consent."
"This 22-year-old individual has been pregnant twice and shows normal diastolic blood pressure. They have a moderately low triceps skin fold thickness and a healthy plasma glucose concentration following an oral glucose tolerance test. A high level of serum insulin is detected and their body mass index is within the normal range. The diabetes pedigree function value indicates a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 24-year-old female who has been pregnant 3 times. She has a low diastolic blood pressure of 58 and zero triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within the normal range at 125. She has no insulin in her blood after 2 hours. Despite having a body mass index of 31.6, which is considered overweight, her diabetes pedigree function is low at 0.151.###\nHence this label was avoid."
"This individual is 38 years old and has been pregnant 5 times. They have a diastolic blood pressure of 92 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a GTT is 117, with a 2-hour serum insulin level of 0. Their body mass index is 34.1 and their diabetes pedigree function is 0.337.###\nHence this label was avoid."
"A 57-year-old individual with 5 pregnancies, normal blood pressure, and low triceps skin fold thickness. Their glucose levels after a meal are within a healthy range. They have little insulin in their system, a healthy body mass index, and a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 30-year-old female who has been pregnant 10 times. She has normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115 mg/dL, with no insulin detected in her serum. Her body mass index is 0.0, and her diabetes pedigree function score is 0.261. Overall, this patient appears to have some abnormal glucose metabolism markers, which may warrant further investigation for potential diabetes risk.###\nHence this label was consent."
"The patient is a 25-year-old woman who is pregnant for the first time. She has a healthy diastolic blood pressure of 70 mmHg and a normal triceps skin fold thickness of 24 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125 mg/dL. The 2-hour serum insulin level is elevated at 110 μU/mL. She has a body mass index of 24.3, indicating she is within the healthy weight range. The diabetes pedigree function value is low at 0.221, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 24-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. However, she has a slightly elevated plasma glucose concentration after a glucose tolerance test. Despite having a healthy body mass index, her low diabetes pedigree function suggests a low risk of developing diabetes.###\nHence this label was consent."
"This is a 21-year-old individual who is pregnant for the first time. They have a low diastolic blood pressure of 64 and a healthy triceps skin fold thickness of 19. Their plasma glucose concentration after a glucose tolerance test is 97, with a relatively low 2-hour serum insulin level of 82. The individual has a low body mass index of 18.2 and a diabetes pedigree function value of 0.299.###\nHence this label was avoid."
"This individual is 22 years old and has been pregnant twice. They have normal diastolic blood pressure, no triceps skin fold thickness, and a low plasma glucose concentration after a 2-hour glucose tolerance test. Their 2-hour serum insulin level is at a normal range. They have a very low body mass index and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"A 60-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 75 mmHg. They have a triceps skin fold thickness of 26 mm and a plasma glucose concentration of 109 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0 uU/mL, and their body mass index is 36.0 kg/m^2. The diabetes pedigree function value is 0.546.###\nHence this label was avoid."
"A 25-year-old individual who has been pregnant three times, with a diastolic blood pressure of 50 mmHg and a triceps skin fold thickness of 10 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 113 mg/dL, and their 2-hour serum insulin level is 85 µU/mL. They have a body mass index of 29.5 and a diabetes pedigree function of 0.626.###\nHence this label was avoid."
"The patient is a 21-year-old female who has never been pregnant. She has a diastolic blood pressure of 64, triceps skin fold thickness of 46, and a plasma glucose concentration of 102 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 78, and she has a body mass index of 40.6. The diabetes pedigree function, a measure of the hereditary risk of diabetes, is 0.496.###\nHence this label was avoid."
"This patient is a 25-year-old female who has been pregnant twice. She has low diastolic blood pressure, no triceps skin fold thickness, and a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are low, and she has a healthy body mass index. Additionally, her diabetes pedigree function score is low, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"A 22-year-old woman, who has been pregnant 2 times, with low diastolic blood pressure, moderate triceps skin fold thickness, low plasma glucose concentration after a glucose test, moderate serum insulin level, healthy body mass index, and low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 54-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 92 and a body mass index of 42.7, indicating obesity. Her triceps skin fold thickness and 2-hour serum insulin levels are both 0, which might suggest poor nutritional status. Despite having a relatively low plasma glucose concentration of 109, her diabetes pedigree function is 0.845, indicating a potential genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 7 times. She has a healthy diastolic blood pressure of 66 mmHg and a slightly elevated triceps skin fold thickness of 32 mm. Her glucose levels after a glucose tolerance test are normal at 103 mg/dL, and she has no serum insulin after 2 hours. With a body mass index of 39.1, she is classified as obese. Her diabetes pedigree function, a measure of hereditary risk for diabetes, is moderate at 0.344.###\nHence this label was consent."
"The individual is a 23-year-old who has never been pregnant. They have normal diastolic blood pressure, but slightly higher triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within normal range. They have elevated serum insulin levels and a higher body mass index, indicating potential risk for diabetes. Additionally, their diabetes pedigree function score suggests a moderate genetic predisposition to the disease.###\nHence this label was avoid."
"This is a 21-year-old individual who has been pregnant 2 times. Their diastolic blood pressure is low at 50, while their triceps skin fold thickness is 23, indicating a moderate amount of subcutaneous fat. Their plasma glucose concentration after a glucose tolerance test is 84, which is within a normal range. The 2-hour serum insulin level is 76, suggesting the body is able to regulate blood sugar effectively. The individual's body mass index is 30.4, which falls into the obese category. Their diabetes pedigree function score is 0.968, indicating a high genetic risk for diabetes.###\nHence this label was avoid."
"A 24-year-old woman who has been pregnant twice has a relatively low diastolic blood pressure of 80. Her triceps skin fold thickness is 14, indicating a moderate amount of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 90, within a healthy range. She has a 2-hour serum insulin level of 55 and a body mass index of 24.4, both of which are normal. Her diabetes pedigree function, a measure of the hereditary risk of diabetes, is low at 0.249. Overall, she appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"The patient is a 59-year-old who has never been pregnant. She has normal diastolic blood pressure, a below average triceps skin fold thickness, and slightly elevated plasma glucose concentration after a GTT. Her insulin level is low, indicating possible insulin resistance. She has a healthy body mass index and a low diabetes pedigree function, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"The individual is a 31-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 0, a triceps skin fold thickness of 0, and a 2-hour serum insulin level of 0. Her plasma glucose concentration after a glucose tolerance test is 90. She has a body mass index of 28.0 and a diabetes pedigree function of 0.61.###\nHence this label was avoid."
"This 33-year-old individual has been pregnant 2 times and has a relatively low diastolic blood pressure of 64. Their triceps skin fold thickness is 24, indicating a moderate amount of body fat. The plasma glucose concentration at 2 hours is 75, which is within the healthy range. The 2-hour serum insulin level is 55, suggesting normal insulin production. With a body mass index of 29.7, they are classified as overweight. The diabetes pedigree function value is 0.37, indicating a somewhat low genetic predisposition to diabetes. Overall, this individual's data suggests a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This 27-year-old patient who has been pregnant 3 times has a normal diastolic blood pressure of 72 and a healthy body mass index of 27.6. Their glucose levels are within normal range at 103, but their insulin levels after a glucose tolerance test are high at 152. They have a moderate triceps skin fold thickness of 30 and a low diabetes pedigree function score of 0.73.###\nHence this label was avoid."
"This 28-year-old individual has been pregnant twice and shows no history of high diastolic blood pressure or triceps skin fold thickness. Their plasma glucose concentration after a 2-hour glucose tolerance test is 146, with no significant insulin levels. They have a body mass index of 27.5 and a low diabetes pedigree function score of 0.24.###\nHence this label was consent."
"The patient is a 29-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 50 and a slightly below average body mass index of 28.3. Her triceps skin fold thickness is 19, indicating a moderate amount of subcutaneous fat. Her glucose levels are normal at 107, and she has low insulin levels at 0. The diabetes pedigree function score of 0.181 suggests a low genetic predisposition to diabetes. Overall, she appears to have a low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"A 22-year-old individual who has never been pregnant shows normal diastolic blood pressure and a healthy body mass index. Their glucose levels are within the acceptable range after a 2-hour oral glucose tolerance test. They have a moderate triceps skin fold thickness and slightly elevated serum insulin levels. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This data belongs to a 35-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 74, a triceps skin fold thickness of 29, and a plasma glucose concentration of 116 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 32.3. The diabetes pedigree function score is 0.66.###\nHence this label was consent."
"A 22-year-old woman, who has been pregnant twice, exhibits low diastolic blood pressure (52 mmHg) and no triceps skin fold thickness. Her fasting plasma glucose level is normal (92 mg/dL), with no insulin present after a 2-hour glucose tolerance test. She has a slightly elevated body mass index of 30.1 and a low diabetes pedigree function score of 0.141, indicating a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This individual is 46 years old and has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and a slightly low plasma glucose concentration after a glucose tolerance test. Their insulin levels are also low. However, they have a slightly elevated body mass index and a relatively low diabetes pedigree function.###\nHence this label was avoid."
"The patient is a 45-year-old woman who has been pregnant 9 times. She has a low diastolic blood pressure of 70 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 130. She has no insulin in her serum after a 2-hour test. Her body mass index is 34.2 and her diabetes pedigree function is 0.652.###\nHence this label was consent."
"This is a dataset for a 52-year-old individual who is pregnant for the first time. She has normal diastolic blood pressure and a slightly elevated plasma glucose concentration after a glucose tolerance test. Her insulin levels are low, and she has a high body mass index. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was consent."
"The patient is a young adult woman who is one month pregnant, with very low diastolic blood pressure and no triceps skin fold thickness. She has normal levels of plasma glucose and insulin, is underweight with a body mass index of 19.1, and has a low diabetes pedigree function score.###\nHence this label was avoid."
"A 22-year-old woman who has never been pregnant shows normal diastolic blood pressure, slightly above average triceps skin fold thickness, and normal plasma glucose concentration at 2 hours. Her 2-hour serum insulin levels are also within the normal range. Despite having a slightly elevated body mass index, she has a low diabetes pedigree function score indicating a low risk of developing diabetes.###\nHence this label was consent."
"This patient, a 24-year-old female, has been pregnant twice and has a low diastolic blood pressure of 54. Her triceps skin fold thickness is 28mm, and her plasma glucose concentration is normal at 100mg/dL after a 2-hour oral glucose tolerance test. She has a relatively high 2-hour serum insulin level of 105mu U/ml. With a body mass index of 37.8, she is considered obese. Her diabetes pedigree function score is 0.498, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 24-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 64 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 114, with no insulin present. She has a body mass index of 28.9 and a low diabetes pedigree function of 0.126.###\nHence this label was avoid."
"The patient is 37 years old and has been pregnant 4 times. They have a diastolic blood pressure of 72, a triceps skin fold thickness of 29, and a body mass index of 31.3. Their plasma glucose concentration after a GTT is 154, with a 2-hour serum insulin level of 126. The diabetes pedigree function is 0.338.###\nHence this label was avoid."
"The individual in the dataset is a 40-year-old who has been pregnant 3 times. They have a normal diastolic blood pressure of 78 and a very low triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour glucose tolerance test is 122, and they have no 2-hour serum insulin. With a healthy body mass index of 23.0 and a low diabetes pedigree function of 0.254, this individual appears to have a relatively low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"This is a dataset of a 30-year-old individual who has been pregnant 5 times. Their diastolic blood pressure is 54 mmHg. They have a triceps skin fold thickness of 28 mm. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 99 mg/dL. Their 2-hour serum insulin level is 83 μU/mL. They have a body mass index of 34.0 and a diabetes pedigree function of 0.499.###\nHence this label was avoid."
"The patient is a 42-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, slightly above average triceps skin fold thickness, and a healthy plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are higher than usual, indicating good pancreatic function. She has a body mass index within the overweight range and a low diabetes pedigree function score, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"This 24-year-old patient has been pregnant 5 times and shows normal diastolic blood pressure. They have a moderate amount of triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is low. The 2-hour serum insulin level is also low. The patient's body mass index is within the overweight range. Overall, the patient has a low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"This is a dataset of a 27-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 94, a triceps skin fold thickness of 41, and a high plasma glucose concentration of 147 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 49.3. The diabetes pedigree function value is 0.358. These measurements suggest a potential risk for developing diabetes, warranting further monitoring and evaluation.###\nHence this label was consent."
"This 26-year-old individual has been pregnant 6 times and has a diastolic blood pressure, triceps skin fold thickness, 2-hour serum insulin, and body mass index of 0. Despite these low values, their plasma glucose concentration after a glucose tolerance test is 114, indicating a potential risk for developing diabetes. Additionally, their diabetes pedigree function score is 0.189, suggesting a genetic predisposition to the disease.###\nHence this label was avoid."
"This patient is a 46-year-old woman who has been pregnant 8 times. Her diastolic blood pressure is within the normal range at 72. She has a low triceps skin fold thickness of 19, indicating low body fat levels. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 118, which is slightly below the normal range. She has no insulin in her bloodstream after 2 hours. Her body mass index is 23.1, which is considered healthy. The diabetes pedigree function value is 1.476, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 21-year-old who has been pregnant twice. They have a low diastolic blood pressure of 60 and a moderate triceps skin fold thickness of 17. Their plasma glucose concentration after a glucose tolerance test is within normal range at 99, but their 2-hour serum insulin level is high at 160. They have a high body mass index of 36.6 and a moderate diabetes pedigree function of 0.453.###\nHence this label was avoid."
"This is a record of a 22-year-old individual who is 1 time pregnant, with a diastolic blood pressure of 78. They have a triceps skin fold thickness of 27, a plasma glucose concentration of 87, and a 2-hour serum insulin level of 32. Their body mass index is 34.6, and they have a diabetes pedigree function of 0.101.###\nHence this label was avoid."
"This individual is a 29-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 110, with a 2-hour serum insulin level of 0. She has a body mass index of 31.9 and a diabetes pedigree function of 0.471.###\nHence this label was avoid."
"The patient is a 53-year-old woman who has been pregnant 9 times. Her diastolic blood pressure is 86, and she has no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 156. She has no serum insulin after 2 hours. Her body mass index is 24.8, and her diabetes pedigree function is 0.23.###\nHence this label was consent."
"This patient is 52 years old and has never been pregnant. They have a healthy diastolic blood pressure of 72 mmHg and a normal triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 123 mg/dL. They have no detectable 2-hour serum insulin levels. The patient has a high body mass index of 36.3 and a relatively low diabetes pedigree function score of 0.258.###\nHence this label was consent."
"This is a young adult female who is 21 years old and pregnant for the first time. She has a low diastolic blood pressure of 58 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 105, with a low 2-hour serum insulin level of 0. She has a healthy body mass index of 24.3 and a low diabetes pedigree function of 0.187.###\nHence this label was avoid."
"This is a dataset of a 25-year-old individual who has been pregnant three times. Their diastolic blood pressure is 62, triceps skin fold thickness is 24, and plasma glucose concentration after a glucose tolerance test is 108. They have a fasting serum insulin level of 0, a body mass index of 26.0, and a diabetes pedigree function of 0.223.###\nHence this label was avoid."
"This data belongs to a 30-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 92 mmHg, no triceps skin fold thickness, and a plasma glucose concentration of 110 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0 μU/mL, and their body mass index is 37.6 kg/m². The diabetes pedigree function value is 0.191, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"The individual is a 24-year-old woman who has never been pregnant. She has a diastolic blood pressure of 84, triceps skin fold thickness of 29, and a body mass index of 30.7, indicating she may be overweight. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 126, which is slightly above normal. She has a high level of 2-hour serum insulin at 215 and a diabetes pedigree function score of 0.52, suggesting a potential risk for developing diabetes.###\nHence this label was avoid."
"A 23-year-old woman, who is currently pregnant for the first time, has a healthy diastolic blood pressure of 70. Her triceps skin fold thickness is 31, indicating a moderate amount of subcutaneous fat. Her plasma glucose concentration after a glucose tolerance test is 93, within the normal range. She has no significant insulin levels after 2 hours. With a body mass index of 30.4, she is considered obese. Her diabetes pedigree function is low at 0.315, suggesting a relatively lower genetic risk for diabetes.###\nHence this label was avoid."
"A 22-year-old woman, who is pregnant for the first time, has normal diastolic blood pressure, a moderate triceps skin fold thickness, low blood sugar levels after a glucose tolerance test, no insulin present, elevated body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"This patient is a young adult female who has never been pregnant. She has optimal blood pressure, low triceps skin fold thickness, and low insulin levels. Her glucose concentration after a glucose tolerance test is on the lower side. Despite having a low body mass index, she has a slight risk of developing diabetes according to her diabetes pedigree function score.###\nHence this label was avoid."
"A 21-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure and has no Triceps skin fold thickness. Her Plasma glucose concentration after a glucose tolerance test is 90, with 0 insulin levels. She has a high body mass index of 42.7 and a low diabetes pedigree function of 0.559. This data suggests a potential risk for diabetes due to high BMI and glucose levels, despite low insulin production and pregnancy history.###\nHence this label was avoid."
"The patient is a 50-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 82 mmHg. The triceps skin fold thickness is 43mm. After a 2-hour oral glucose tolerance test, her plasma glucose concentration is 164 mg/dL. Her 2-hour serum insulin level is 67 mu U/mL. She has a body mass index of 32.8, indicating she is overweight. The diabetes pedigree function is 0.341, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"A 41-year-old individual who has been pregnant 10 times, with normal diastolic blood pressure and no triceps skin fold thickness, has a plasma glucose concentration of 122 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 31.2. The diabetes pedigree function value for this person is 0.258.###\nHence this label was avoid."
"The patient is a 23-year-old who has never been pregnant. They have a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 27 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 179 mg/dL. They have a fasting serum insulin level of 0 uU/mL and a body mass index of 44.1 kg/m². The patient has a diabetes pedigree function value of 0.686, indicating a potential genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 26-year-old woman who is pregnant for the first time. She has a healthy diastolic blood pressure of 66 and a relatively low triceps skin fold thickness of 15. Her glucose levels after a 2-hour oral glucose tolerance test are normal at 100. She has a moderate insulin level of 56 and a body mass index indicating a healthy weight of 23.6. The diabetes pedigree function score is low at 0.666, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 23-year-old who has been pregnant twice. She has a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 17. Her glucose tolerance test results show a normal plasma glucose concentration at 101, but a high 2-hour serum insulin level of 265. Despite this, her body mass index is in the healthy range at 24.2, and her diabetes pedigree function score is 0.614, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 44-year-old female who has been pregnant 12 times. She has a low diastolic blood pressure of 62 and a relatively low triceps skin fold thickness of 7. Her plasma glucose concentration after a glucose tolerance test is 92, and her 2-hour serum insulin level is high at 258. Despite her high insulin level, her body mass index is within the normal range at 27.6. The patient has a moderate diabetes pedigree function score of 0.926, indicating a potential risk for developing diabetes.###\nHence this label was consent."
"This data describes a young, non-pregnant individual with normal diastolic blood pressure and slightly elevated body mass index. The individual has a healthy glucose concentration, insulin level, and a moderate triceps skin fold thickness. The diabetes pedigree function suggests a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 76, no triceps skin fold thickness, and a plasma glucose concentration of 147 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 39.4. The diabetes pedigree function for this patient is 0.257.###\nHence this label was consent."
"This 25-year-old individual has been pregnant twice and shows normal diastolic blood pressure. They have a moderately high triceps skin fold thickness, but very low insulin levels. Despite a healthy body mass index, their plasma glucose concentration after a glucose tolerance test is below normal. The individual also has a moderate risk of developing diabetes based on their diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 42-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 42. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 150, and her 2-hour serum insulin level is 342. She has a body mass index of 34.7 and a diabetes pedigree function of 0.718.###\nHence this label was avoid."
"This data belongs to a 28-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 90, a triceps skin fold thickness of 39, and a plasma glucose concentration of 102 after a glucose tolerance test. Their 2-hour serum insulin level is 0. With a body mass index of 35.7 and a diabetes pedigree function of 0.674, this individual's risk of developing diabetes may be concerning.###\nHence this label was avoid."
"The individual is a 22-year-old who has never been pregnant. She has a healthy diastolic blood pressure of 64. Her triceps skin fold thickness is within normal range at 41mm. Her glucose levels after a 2-hour oral glucose tolerance test are 105, indicating normal blood sugar levels. However, her 2-hour serum insulin levels are elevated at 142. She has a moderately high body mass index of 41.5, and a low diabetes pedigree function of 0.173.###\nHence this label was avoid."
"A 31-year-old woman, who is pregnant for the first time, has a diastolic blood pressure of 90 mmHg. She has a significant triceps skin fold thickness of 51 mm and a high plasma glucose concentration of 122 mg/dL after a 2-hour oral glucose tolerance test. Additionally, her 2-hour serum insulin level is 220 μU/mL, and her body mass index is 49.7 kg/m². Despite these values, her diabetes pedigree function is relatively low at 0.325.###\nHence this label was consent."
"This patient is a 46-year-old female who has been pregnant once. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 46. Her plasma glucose concentration after a glucose tolerance test is 144, and her 2-hour serum insulin level is 180. With a body mass index of 46.1 and a diabetes pedigree function of 0.335, she may have an increased risk of developing diabetes.###\nHence this label was consent."
"This is a data record of a 47-year-old individual who has been pregnant 5 times. They have normal diastolic blood pressure of 78 and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 143, with no insulin detected after 2 hours. The individual has a high body mass index of 45.0 and a low diabetes pedigree function score of 0.19.###\nHence this label was avoid."
"A 21-year-old individual, who has been pregnant twice, with a healthy diastolic blood pressure of 64 and triceps skin fold thickness of 22. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 115. They have normal 2-hour serum insulin levels of 0. Despite having a slightly elevated body mass index of 30.8, their diabetes pedigree function is low at 0.421, indicating a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"The individual is 39 years old and has been pregnant 7 times. They have a diastolic blood pressure of 54 and a triceps skin fold thickness of 32. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 160, with a 2-hour serum insulin level of 175. They have a body mass index of 30.5 and a diabetes pedigree function of 0.588.###\nHence this label was consent."
"The patient is a 28-year-old who has been pregnant three times. Their diastolic blood pressure is 68, triceps skin fold thickness is 23, and plasma glucose concentration after a glucose tolerance test is 100. They have a 2-hour serum insulin level of 81 and a body mass index of 31.6. Their diabetes pedigree function is 0.949.###\nHence this label was avoid."
"This individual, a 21-year-old, has low diastolic blood pressure, moderate triceps skin fold thickness, normal plasma glucose concentration, slightly elevated insulin levels, a healthy body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 28-year-old woman, who is pregnant for the first time, has a diastolic blood pressure of 64 mmHg. She has a triceps skin fold thickness of 23 mm and a plasma glucose concentration of 84 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 115 μU/mL, and she has a body mass index of 36.9. The diabetes pedigree function value for this individual is 0.471. This data provides valuable insights into her current health status and risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 25-year-old woman who has never been pregnant before. She has a low diastolic blood pressure of 66 and a moderate triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 180. She has no insulin in her blood after 2 hours. Despite her young age, she has a high body mass index of 42.0 and a relatively high diabetes pedigree function score of 1.893, indicating a potential risk for developing diabetes.###\nHence this label was consent."
"This individual is a 37-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 84, no triceps skin fold thickness, and a plasma glucose concentration of 133 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, but she has a high body mass index of 40.2. Her diabetes pedigree function is 0.696, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual, a 46-year-old female, has never been pregnant. She has a diastolic blood pressure of 76 mmHg, no triceps skin fold thickness, and a low plasma glucose concentration of 67 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 0 μU/mL, indicating low insulin production. Despite this, she has a high body mass index of 45.3, suggesting obesity. Her diabetes pedigree function, a measure of diabetes history in relatives, is low at 0.194.###\nHence this label was avoid."
"A 24-year-old woman who has been pregnant twice has normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness is within normal range, and she has a low level of insulin. Despite a slightly elevated plasma glucose concentration after a glucose tolerance test, her diabetes pedigree function indicates a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 40-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 72, triceps skin fold thickness of 27, and a plasma glucose concentration of 144 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 228, and she has a body mass index of 33.9. The diabetes pedigree function value is 0.255, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 29-year-old female who has never been pregnant. She has normal diastolic blood pressure, zero triceps skin fold thickness, and zero 2-hour serum insulin. Her plasma glucose concentration after a GTT is 141, which is within the normal range. She has a high body mass index of 42.4, indicating obesity. Her diabetes pedigree function score is low at 0.205, suggesting a lower genetic predisposition to diabetes.###\nHence this label was consent."
"This patient is a 21-year-old female who is 1 time pregnant. She has low diastolic blood pressure (50), low triceps skin fold thickness (10), low plasma glucose concentration after a glucose tolerance test (73), no serum insulin after 2 hours, and a healthy body mass index of 23.0. Her diabetes pedigree function is low at 0.248. Overall, this patient appears to have a low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"The 24-year-old patient, who has been pregnant twice, shows normal diastolic blood pressure and low triceps skinfold thickness. Their glucose levels after a 2-hour oral test are within a healthy range, while their insulin levels are at a minimum. Despite having a slightly elevated body mass index, the patient has a low diabetes pedigree function score of 0.13.###\nHence this label was avoid."
"The individual is 60 years old and has been pregnant 8 times. They have a diastolic blood pressure of 68, triceps skin fold thickness of 36, and a high plasma glucose concentration of 181 after a GTT. Their 2-hour serum insulin level is at 495, indicating a potential risk for diabetes. With a body mass index of 30.1 and a diabetes pedigree function of 0.615, this individual may be at high risk for developing diabetes.###\nHence this label was consent."
"This patient is a 27-year-old female who is pregnant for the first time. She has normal diastolic blood pressure and a low triceps skin fold thickness. Her glucose levels are within the normal range after a 2-hour oral glucose tolerance test. She has low insulin levels and a healthy body mass index. Additionally, her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 37-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 12 mm. Her plasma glucose concentration is 116 mg/dL 2 hours after an oral glucose tolerance test, and she has a 2-hour serum insulin level of 87 uU/ml. With a body mass index of 22.1 and a diabetes pedigree function of 0.463, she is at a moderate risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 45-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure reading of 94 and a triceps skin fold thickness of 0. In a glucose tolerance test, their plasma glucose concentration at 2 hours is 140. The 2-hour serum insulin level is 0, and their body mass index is 32.7. The diabetes pedigree function for this individual is 0.734.###\nHence this label was consent."
"A 56-year-old individual who has been pregnant four times with a diastolic blood pressure of 72, triceps skin fold thickness of 47, and a high plasma glucose concentration of 111 after a glucose tolerance test. They also have a 2-hour serum insulin level of 207 and a body mass index of 37.1, indicating a potential risk for developing diabetes based on a diabetes pedigree function score of 1.39.###\nHence this label was consent."
"The patient is a 37-year-old female who has been pregnant once. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 39 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 128 mg/dL. She has a 2-hour serum insulin level of 110 mu U/ml, and her body mass index is 36.5 kg/m^2. Additionally, she has a diabetes pedigree function of 1.057, indicating a potential genetic predisposition to diabetes.###\nHence this label was consent."
"This individual is a young adult, 25 years old, who has been pregnant once. She has a normal diastolic blood pressure of 62 and a relatively low triceps skin fold thickness of 18. Her blood glucose levels after a glucose tolerance test are within the normal range at 90. She has moderate insulin levels at 59, a healthy body mass index of 25.1, and a slightly elevated diabetes pedigree function score of 1.268.###\nHence this label was avoid."
"This patient is a 66-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 88, but no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 114, with no insulin detected after 2 hours. She has a body mass index of 27.8 and a low diabetes pedigree function of 0.247.###\nHence this label was avoid."
"The patient is a 57-year-old individual who has been pregnant 13 times. They have a healthy diastolic blood pressure of 82 and a relatively low triceps skin fold thickness of 19. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 145, with a 2-hour serum insulin level of 110. Despite their low body mass index of 22.2, their diabetes pedigree function is 0.245, indicating a potential genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 23-year-old female who is 4 times pregnant. She has a diastolic blood pressure of 62, a triceps skin fold thickness of 31, and a body mass index of 32.8. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 154, and her 2-hour serum insulin level is 284. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.237.###\nHence this label was avoid."
"This patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 84 and a body mass index of 39.9, indicating obesity. Her triceps skin fold thickness and 2-hour serum insulin levels are both 0. Despite having a high plasma glucose concentration of 178, her diabetes pedigree function is relatively low at 0.331. Overall, these measurements suggest a potential risk for developing diabetes due to obesity and high glucose levels.###\nHence this label was consent."
"A 22-year-old female who has never been pregnant has a below-average diastolic blood pressure of 65 mmHg. She has a healthy triceps skin fold thickness of 28mm and a normal plasma glucose concentration of 101mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is low at 0 μU/mL. With a body mass index of 24.6, she is within the normal weight range. Her diabetes pedigree function score is low at 0.237, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"This 22-year-old individual who has never been pregnant has a diastolic blood pressure of 82 mmHg. They have a triceps skin fold thickness of 14 mm, a plasma glucose concentration of 188 mg/dL after a GTT, and a 2-hour serum insulin level of 185 mu U/ml. With a body mass index of 32.0, and a diabetes pedigree function of 0.682, this individual's risk of developing diabetes may be worth monitoring.###\nHence this label was consent."
"The patient is a 53-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 27, and a high plasma glucose concentration of 187 after a glucose tolerance test. Her 2-hour serum insulin level is elevated at 207, and she has a body mass index of 43.6. Additionally, she has a diabetes pedigree function value of 1.034, indicating a potential genetic predisposition to diabetes.###\nHence this label was consent."
"A 28-year-old woman, who has been pregnant twice, has low diastolic blood pressure and a high triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is normal. She has elevated insulin levels and a high body mass index, indicating a risk for developing diabetes. However, her diabetes pedigree function is relatively low.###\nHence this label was avoid."
"This 26-year-old individual has been pregnant 2 times and shows normal diastolic blood pressure. They have a moderately high triceps skin fold thickness and a slightly elevated plasma glucose concentration at 2 hours. Their insulin level after 2 hours is above average. The individual has a high body mass index and a moderate diabetes pedigree function score, indicating a low to moderate risk of developing diabetes.###\nHence this label was avoid."
"A 23-year-old woman who has been pregnant six times is being monitored for diabetes risk. Her diastolic blood pressure is 50, triceps skin fold thickness is 30, and plasma glucose concentration after a glucose tolerance test is 93. She has a 2-hour serum insulin level of 64 and a body mass index of 28.7. Her diabetes pedigree function is 0.356.###\nHence this label was avoid."
"A 29-year-old woman who has been pregnant twice shows slightly elevated diastolic blood pressure of 76. She has a moderately high body mass index of 38.2 and higher-than-average triceps skin fold thickness of 35. Her plasma glucose concentration after a glucose tolerance test is 146, accompanied by a relatively high 2-hour serum insulin level of 194. Despite these values, her diabetes pedigree function is low at 0.329, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"A 46-year-old individual who has been pregnant 9 times shows normal diastolic blood pressure and average triceps skin fold thickness. Their glucose levels after a 2-hour oral test are within a healthy range, with no detectable insulin levels. The individual has a slightly elevated body mass index and a moderate diabetes pedigree function score.###\nHence this label was consent."
"A 42-year-old individual who has been pregnant 8 times shows low diastolic blood pressure of 55. Their triceps skin fold thickness is 20, indicating a healthy level of subcutaneous fat. With a plasma glucose concentration of 85 after a glucose tolerance test, the individual has normal blood sugar levels. A 0 reading for 2-hour serum insulin suggests normal insulin production. Their body mass index is 24.4, within the healthy range. The diabetes pedigree function score of 0.136 indicates a low genetic risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 23-year-old woman who has been pregnant 2 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a glucose tolerance test is 107, with a 2-hour serum insulin level of 100. She has a body mass index of 33.6 and a diabetes pedigree function value of 0.404.###\nHence this label was avoid."
"This individual is 45 years old and has been pregnant 9 times. They have a healthy diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 30 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 154 mg/dL, and their 2-hour serum insulin level is 100 μU/mL. With a body mass index of 30.9, they are considered overweight. Their diabetes pedigree function score is 0.164, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 32-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 102. The 2-hour serum insulin level is 0. Her body mass index is 29.5 and she has a diabetes pedigree function of 0.121.###\nHence this label was avoid."
"This 31-year-old individual, who has been pregnant twice, shows signs that may indicate a risk for developing diabetes. With a slightly elevated diastolic blood pressure of 78 and a high body mass index of 43.3, coupled with increased glucose levels at 128, and high insulin levels at 182, there is potential concern. The triceps skin fold thickness of 37 and a diabetes pedigree function of 1.224 further contribute to the overall health assessment.###\nHence this label was consent."
"This patient is a 40-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 159 mg/dL, with a 2-hour serum insulin level of 0 μU/mL. Her body mass index is 27.4 kg/m^2 and her diabetes pedigree function is 0.294.###\nHence this label was avoid."
"This is a data record of a 24-year-old individual who is pregnant for the first time. They have a normal diastolic blood pressure of 68 and a moderate triceps skin fold thickness of 19. Their glucose levels are within normal range at 107 after a 2-hour oral glucose tolerance test, with very low insulin levels. The individual has a healthy body mass index of 26.5 and a low diabetes pedigree function score of 0.165.###\nHence this label was avoid."
"This 28-year-old individual has been pregnant 5 times and shows signs that may indicate a risk of developing diabetes. Their diastolic blood pressure is within normal range at 72, but their triceps skin fold thickness, plasma glucose concentration at 2 hours, and body mass index are elevated. The 2-hour serum insulin level is also high. However, their diabetes pedigree function is relatively low. Overall, these measurements suggest a potential concern for diabetes and warrant further monitoring and medical attention.###\nHence this label was avoid."
"The patient is a 41-year-old woman who has been pregnant 7 times. She has a normal diastolic blood pressure of 68 and a slightly below average triceps skin fold thickness of 28. Her plasma glucose concentration after a GTT is high at 194, but her 2-hour serum insulin level is low at 0. She has a high body mass index of 35.9, indicating overweight. Her diabetes pedigree function is moderate at 0.745, suggesting a potential genetic predisposition to diabetes.###\nHence this label was consent."
"A 33-year-old individual with 4 pregnancies shows normal diastolic blood pressure and slightly high triceps skin fold thickness. Their glucose levels are within the normal range after a 2-hour GTT, but they have elevated serum insulin levels. They have a healthy BMI, and their diabetes pedigree function score indicates a moderate genetic risk for diabetes.###\nHence this label was avoid."
"A 21-year-old individual who has been pregnant 3 times and has a low diastolic blood pressure of 60. Their triceps skin fold thickness is 18, plasma glucose concentration after a GTT is 87, and 2-hour serum insulin level is 0. With a body mass index of 21.8 and a diabetes pedigree function value of 0.444, this person appears to have a low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"This 22-year-old individual, who has been pregnant once, has a healthy diastolic blood pressure of 70. Their triceps skin fold thickness measures 13, indicating moderate levels of subcutaneous fat. With a plasma glucose concentration of 130 after a glucose tolerance test, their blood sugar levels appear to be normal. The 2-hour serum insulin level is 105, suggesting good regulation of blood sugar. Their body mass index is 25.9, indicating they are in the normal weight range. The diabetes pedigree function score of 0.472 suggests a low genetic risk of diabetes.###\nHence this label was avoid."
"The patient is a 60-year-old who has been pregnant 6 times. They have a diastolic blood pressure of 90, triceps skin fold thickness of 7, and a plasma glucose concentration of 129. Additionally, their 2-hour serum insulin level is high at 326. Despite this, their body mass index is low at 19.6, and their diabetes pedigree function is 0.582.###\nHence this label was avoid."
"The data belongs to a 32-year-old individual who has been pregnant 5 times. Their diastolic blood pressure is 74, while their triceps skin fold thickness is 27. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 99, with a 2-hour serum insulin level of 0. The individual has a body mass index of 29.0 and a low diabetes pedigree function of 0.203.###\nHence this label was avoid."
"This is a record of a 25-year-old individual who has never been pregnant and shows no signs of diabetes so far. Their blood pressure, skin fold thickness, and plasma glucose level are within normal ranges. However, they have a slightly elevated body mass index. The insulin level and diabetes pedigree function suggest a low risk of developing diabetes in the future.###\nHence this label was consent."
"A 25-year-old individual who has been pregnant twice with a relatively low diastolic blood pressure of 58. They have a moderate triceps skin fold thickness of 24 and a slightly elevated plasma glucose concentration of 127 after a glucose tolerance test. Their 2-hour serum insulin levels are high at 275, and they have a healthy body mass index of 27.7. The individual also has a moderate diabetes pedigree function score of 1.6.###\nHence this label was avoid."
"This individual is a 21-year-old woman who is 1 time pregnant. Her diastolic blood pressure is 60, triceps skin fold thickness is 8, and plasma glucose concentration after a glucose tolerance test is 109. She has a high level of 2-hour serum insulin at 182, a body mass index of 25.4, and a diabetes pedigree function of 0.947.###\nHence this label was avoid."
"This data belongs to a 25-year-old individual who has been pregnant once. They have a diastolic blood pressure of 62, triceps skin fold thickness of 25, and a plasma glucose concentration of 92 after a glucose tolerance test. Their 2-hour serum insulin level is 41 and their body mass index is 19.5. The diabetes pedigree function value is 0.482.###\nHence this label was avoid."
"The patient is a 42-year-old female who has been pregnant twice. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 30 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 89 mg/dL, and she has a 2-hour serum insulin level of 0 μU/mL. Her body mass index is 33.5, and her diabetes pedigree function is 0.292.###\nHence this label was avoid."
"This individual is 29 years old and has been pregnant 4 times. They have normal diastolic blood pressure and Triceps skin fold thickness. Their blood glucose level after a glucose tolerance test is within normal range. They have low serum insulin levels and a high body mass index. The diabetes pedigree function indicates a low genetic risk of developing diabetes.###\nHence this label was avoid."
"A 36-year-old female who is pregnant for the first time has a normal diastolic blood pressure and low triceps skin fold thickness. Her glucose levels are within normal range after a 2-hour oral glucose tolerance test, with extremely low insulin levels. She maintains a healthy body mass index and has a slightly elevated diabetes pedigree function.###\nHence this label was avoid."
"A 30-year-old individual who has been pregnant 4 times with a low diastolic blood pressure of 62. They have a slight triceps skin fold thickness of 12, normal glucose levels of 117, and insulin levels of 0. Their body mass index is 29.7, indicating they are slightly overweight. With a low diabetes pedigree function of 0.38, this individual shows relatively low risk of developing diabetes.###\nHence this label was consent."
"The patient is 81 years old and has been pregnant 9 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 33. Her plasma glucose concentration after a glucose tolerance test is 134, with a 2-hour serum insulin level of 60. Her body mass index is 25.9, and her diabetes pedigree function is 0.46.###\nHence this label was avoid."
"This 43-year-old individual has been pregnant 13 times and has a diastolic blood pressure of 90. They have a triceps skin fold thickness of 33, a plasma glucose concentration of 152 after a glucose tolerance test, and a 2-hour serum insulin level of 29. Their body mass index is 26.8 and they have a diabetes pedigree function of 0.731.###\nHence this label was consent."
"This individual is a 43-year-old woman who has been pregnant once. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 25. Her plasma glucose concentration is 95 after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 180. With a body mass index of 35.0 and a low diabetes pedigree function score of 0.233, she may be at risk for developing diabetes.###\nHence this label was consent."
"A 38-year-old individual who has been pregnant 5 times with normal diastolic blood pressure and no triceps skin fold thickness. They have a moderately high plasma glucose concentration after a glucose tolerance test, normal insulin levels, and a high body mass index. Their familial history predicts a low risk of developing diabetes.###\nHence this label was consent."
"The patient is a 54-year-old who has been pregnant 9 times. They have a diastolic blood pressure of 110 mmHg, triceps skin fold thickness of 24 mm, and a plasma glucose concentration of 171 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 240 mu U/ml, and their body mass index is 45.4 kg/m^2. The diabetes pedigree function indicates a moderate genetic risk of developing diabetes.###\nHence this label was consent."
"The patient is a 26-year-old who has been pregnant 3 times. Despite having a low diastolic blood pressure of 44, they have a relatively high triceps skin fold thickness of 20. Their glucose levels after a GTT are normal at 102, but their insulin levels are high at 94. The patient has a body mass index of 30.8, indicating they are overweight. The diabetes pedigree function score is low at 0.4, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 42-year-old female who has been pregnant 11 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 103. She has no insulin present after 2 hours. Her body mass index is 46.2 and her diabetes pedigree function is 0.126.###\nHence this label was avoid."
"A 25-year-old woman who has never been pregnant shows normal diastolic blood pressure and a slightly elevated plasma glucose concentration after a glucose tolerance test. She has a high body mass index, but her insulin levels are within the normal range. Overall, her diabetes risk seems to be moderate based on these measurements.###\nHence this label was consent."
"This data belongs to a 22-year-old individual who is pregnant for the first time. Their diastolic blood pressure is 68 mmHg, triceps skin fold thickness is 21 mm, and they have a plasma glucose concentration of 97 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0 uU/ml, and they have a body mass index (BMI) of 27.2. The diabetes pedigree function value is 1.095, indicating a potential genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 37-year-old female who has been pregnant six times. She has a diastolic blood pressure of 70, triceps skin fold thickness of 32, and a plasma glucose concentration of 105 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 68, and she has a body mass index of 30.8. The diabetes pedigree function, a measure of the hereditary risk of diabetes, is 0.122.###\nHence this label was avoid."
"This individual is 32 years old, has never been pregnant, and has a diastolic blood pressure of 88. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 131 after a glucose tolerance test, and 0 insulin levels after 2 hours. Their body mass index is 31.6 and their diabetes pedigree function is 0.743.###\nHence this label was consent."
"The patient is a 23-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 60 mmHg and a triceps skin fold thickness of 0 mm, indicating low body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 111 mg/dL. She has no detectable serum insulin levels. With a body mass index of 26.2, she is considered overweight. The diabetes pedigree function score is 0.343, suggesting a low genetic risk for diabetes. Overall, this patient shows a mix of normal and low risk factors for developing diabetes.###\nHence this label was avoid."
"A 40-year-old individual who has been pregnant 3 times shows a normal diastolic blood pressure of 78 mmHg, with a slightly higher triceps skin fold thickness of 39 mm. They have a relatively low plasma glucose concentration of 96 mg/dL after a 2-hour oral glucose tolerance test, along with a low 2-hour serum insulin level of 0 mU/mL. Despite having a high body mass index of 37.3 kg/m², their diabetes pedigree function score is low at 0.238.###\nHence this label was avoid."
"A 31-year-old individual who has been pregnant twice, with a healthy diastolic blood pressure of 60. They have a moderately high triceps skin fold thickness of 20, and their plasma glucose concentration after a glucose tolerance test is within normal range at 125. Their 2-hour serum insulin level is slightly elevated at 140. They have a body mass index of 33.8, indicating overweight status. The diabetes pedigree function score is low at 0.088, suggesting a relatively low genetic risk for diabetes.###\nHence this label was avoid."
"This data belongs to a 27-year-old individual who has been pregnant 5 times. They have a healthy diastolic blood pressure of 72 and a moderately thick triceps skin fold of 33. Their plasma glucose concentration after a 2-hour GTT is within normal range at 95. Their 2-hour serum insulin level is low at 0. Despite a slightly elevated body mass index of 37.7, their diabetes pedigree function score is low at 0.37, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"This patient is a young, non-pregnant individual with normal diastolic blood pressure and slightly elevated body mass index. They have low triceps skin fold thickness and normal glucose levels after a glucose tolerance test. Their insulin levels are slightly elevated, and they have a low diabetes pedigree function score, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 44-year-old who has been pregnant 5 times. Their diastolic blood pressure is 76, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. They have a plasma glucose concentration of 115, a body mass index of 31.2, and a diabetes pedigree function of 0.343.###\nHence this label was consent."
"A 24-year-old individual who has never been pregnant, with below-normal diastolic blood pressure and above-normal triceps skin fold thickness. They have a slightly elevated plasma glucose concentration after a glucose tolerance test and high serum insulin levels. Their body mass index indicates obesity, but their diabetes pedigree function score is relatively low.###\nHence this label was consent."
"The patient is a young adult female, 26 years old, who is pregnant for the first time. She has low diastolic blood pressure, high triceps skin fold thickness, and normal plasma glucose concentration after a 2-hour oral glucose tolerance test. She also has elevated insulin levels, high body mass index, and a moderately low diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 23-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 26. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 140, and her 2-hour serum insulin level is 180. With a body mass index of 24.1 and a diabetes pedigree function of 0.828, she is at risk for developing diabetes.###\nHence this label was avoid."
"A 54-year-old individual who has been pregnant 8 times shows normal diastolic blood pressure, no triceps skin fold thickness, and a normal plasma glucose concentration 2 hours after an oral glucose tolerance test. Additionally, they have 0 insulin level, a BMI of 0.0, and a slightly elevated diabetes pedigree function score of 0.232.###\nHence this label was consent."
"This patient is a young adult female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a low plasma glucose concentration after a glucose tolerance test. Her insulin levels are normal, and she has a very low body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 29-year-old female who has been pregnant four times. She has a diastolic blood pressure of 60 mmHg. Her triceps skin fold thickness is 27 mm. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 148 mg/dL. Her 2-hour serum insulin level is 318 uU/mL. She has a body mass index of 30.9, indicating she is overweight. Her diabetes pedigree function is 0.15, suggesting a low genetic risk for diabetes. Overall, the patient appears to have certain risk factors for diabetes, such as high insulin levels and elevated BMI, but her glucose levels are within normal range. Regular monitoring and lifestyle modifications may be recommended to reduce her risk of developing diabetes in the future.###\nHence this label was consent."
"This data belongs to a 42-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 68, triceps skin fold thickness of 29, and a plasma glucose concentration of 149. Additionally, their 2-hour serum insulin level is 127, body mass index is 29.3, and diabetes pedigree function is 0.349.###\nHence this label was consent."
"The patient is a 63-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 158 mg/dL, and she has a 2-hour serum insulin level of 0 mIU/L. Her body mass index is 29.8, indicating she is overweight. The diabetes pedigree function, which predicts the likelihood of developing diabetes based on family history, is 0.207.###\nHence this label was avoid."
"This 25-year-old individual has been pregnant three times and has a very low diastolic blood pressure of 52. They have no skin fold thickness, which may indicate a lean body composition. Despite an average plasma glucose concentration of 121, their insulin levels are remarkably low. With a high body mass index of 36.0 and a low diabetes pedigree function of 0.127, there may be a low risk of developing diabetes in the future.###\nHence this label was consent."
"This 23-year-old individual is pregnant for the first time and shows normal diastolic blood pressure. They have a moderate triceps skin fold thickness and a low plasma glucose concentration after a 2-hour oral glucose tolerance test. Their serum insulin level is relatively low. Despite a high body mass index, their risk of developing diabetes is considered moderate based on their diabetes pedigree function score.###\nHence this label was avoid."
"The data represents a 50-year-old individual who has been pregnant 11 times, with a diastolic blood pressure of 74. They have a triceps skin fold thickness of 26, a plasma glucose concentration of 138 following a glucose tolerance test, and a 2-hour serum insulin level of 144. Their body mass index is 36.1 and they have a diabetes pedigree function of 0.557.###\nHence this label was consent."
"A 37-year-old woman who has been pregnant 4 times shows elevated diastolic blood pressure of 110. She has a slightly above-average triceps skin fold thickness of 31 and her plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 189. Surprisingly, her 2-hour serum insulin levels are at 0. Despite her body mass index being 28.5, which is considered overweight, her diabetes pedigree function is relatively low at 0.68.###\nHence this label was avoid."
"This is a data entry of a 66-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 74, no triceps skin fold thickness, and a plasma glucose concentration of 166 mg/dL after a glucose tolerance test. Their 2-hour serum insulin level is 0, with a body mass index of 26.6. The diabetes pedigree function value for this individual is 0.304.###\nHence this label was avoid."
"This patient is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 49. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 129, and her 2-hour serum insulin level is 125. She has a body mass index of 38.5 and a diabetes pedigree function of 0.439.###\nHence this label was consent."
"This patient is a 27-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 0, and a high plasma glucose concentration of 166 after a 2-hour oral glucose tolerance test. Additionally, her 2-hour serum insulin level is 0, and her body mass index is 45.7, indicating obesity. The diabetes pedigree function score is low at 0.34. Based on these measurements, she may be at risk for developing diabetes.###\nHence this label was consent."
"The patient is a 65-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 108, a triceps skin fold thickness of 37, and a plasma glucose concentration of 103 after a glucose tolerance test. Her 2-hour serum insulin level is 0. With a body mass index of 39.2 and a diabetes pedigree function of 0.305, she may be at risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 48-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 0, and a plasma glucose concentration of 104 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 28.8. The diabetes pedigree function, a measure of diabetes risk based on family history, is 0.153.###\nHence this label was avoid."
"The patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 62, and her 2-hour serum insulin level is 0. Additionally, she has a body mass index of 32.6 and a diabetes pedigree function of 0.391.###\nHence this label was avoid."
"This individual is a 65-year-old who has never been pregnant, with a low diastolic blood pressure of 50. They have no triceps skin fold thickness, a plasma glucose concentration of 161 after a glucose tolerance test, and zero 2-hour serum insulin levels. With a body mass index of 21.9 and a low diabetes pedigree function of 0.254, this person may have a lower risk of developing diabetes.###\nHence this label was avoid."
"This 23-year-old individual, who has been pregnant once, shows a low diastolic blood pressure of 56. Despite having a relatively low triceps skin fold thickness of 21, the plasma glucose concentration after a glucose test is within normal range at 109. The 2-hour serum insulin level is elevated at 135. The body mass index is 25.2, indicating a healthy weight. The diabetes pedigree function score is 0.833, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 39-year-old individual, who has been pregnant 8 times, with a diastolic blood pressure of 70, triceps skin fold thickness of 40, plasma glucose concentration of 74, 2-hour serum insulin level of 49, and a body mass index of 35.3. The diabetes pedigree function is calculated to be 0.705.###\nHence this label was avoid."
"A 21-year-old female who has been pregnant once with normal blood pressure, moderate triceps skin fold thickness, average glucose levels, low insulin levels, high body mass index, and a low diabetes risk based on her family history.###\nHence this label was avoid."
"This is a profile of a 24-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 30 mm. Her plasma glucose concentration after a glucose tolerance test is 107 mg/dL, and her 2-hour serum insulin level is 82 µU/mL. She has a body mass index of 30.8 and a diabetes pedigree function of 0.821.###\nHence this label was avoid."
"This is a data record of a 29-year-old individual who has never been pregnant and shows no insulin level after a 2-hour oral glucose tolerance test. Despite having a relatively high body mass index of 35.2, the individual's blood pressure and glucose levels are within normal range. The individual also has a low diabetes pedigree function score of 0.197.###\nHence this label was avoid."
"The patient is a 28-year-old who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a high plasma glucose concentration after a glucose tolerance test. Despite having no insulin in her bloodstream, she has a high body mass index and a moderate diabetes pedigree function.###\nHence this label was consent."
"A 28-year-old woman who has been pregnant twice shows normal diastolic blood pressure and a healthy body mass index. Her oral glucose tolerance test results indicate a glucose level within the normal range, and she has low insulin levels. Her triceps skin fold thickness suggests a healthy amount of subcutaneous fat. Additionally, her diabetes pedigree function value is elevated, indicating a potential genetic predisposition to diabetes.###\nHence this label was avoid."
"A 46-year-old woman who has been pregnant 4 times shows normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115, with no detectable insulin. She has a body mass index of 28.9 and a low diabetes pedigree function of 0.376.###\nHence this label was consent."
"This individual is a 29-year-old who has been pregnant twice. She has a diastolic blood pressure of 70, triceps skin fold thickness of 38, and a plasma glucose concentration of 146. Additionally, her 2-hour serum insulin level is 360, her body mass index is 28.0, and her diabetes pedigree function is 0.337. This combination of factors provides valuable insight into her current health status and potential risk for developing diabetes.###\nHence this label was consent."
"A 50-year-old individual, who has been pregnant 9 times, with a diastolic blood pressure of 82. Their triceps skin fold thickness is 24, plasma glucose concentration is 112 after a glucose tolerance test, and they have no insulin after 2 hours. The individual has a body mass index of 28.2 and a diabetes pedigree function value of 1.282.###\nHence this label was consent."
"A 52-year-old individual who has been pregnant twice shows normal diastolic blood pressure and minimal triceps skin fold thickness. Their glucose tolerance test results indicate a healthy level, with no significant insulin presence. The individual has a moderate body mass index and a low likelihood of developing diabetes based on their family history.###\nHence this label was consent."
"This patient is a 43-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 24 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 142 mg/dL, and her 2-hour serum insulin level is 480 μU/mL. She has a body mass index of 30.4 and a low diabetes pedigree function score of 0.128.###\nHence this label was consent."
"This individual is a 62-year-old woman who has been pregnant 12 times. She has a healthy diastolic blood pressure of 78 and a moderately low triceps skin fold thickness of 17. Her plasma glucose concentration after a meal is normal at 121. Despite not having any insulin in her system after a 2-hour glucose tolerance test, her body mass index is within a healthy range at 26.5. Additionally, her diabetes pedigree function, a measure of diabetes history in relatives, is relatively low at 0.259.###\nHence this label was avoid."
"A 43-year-old woman, who has been pregnant 6 times, with a low diastolic blood pressure of 58, moderate triceps skin fold thickness of 33, normal plasma glucose concentration of 98 after a glucose tolerance test, high insulin level of 190 after a 2-hour serum test, slightly elevated body mass index of 34.0, and a low diabetes pedigree function score of 0.43.###\nHence this label was avoid."
"A 24-year-old individual who has been pregnant 3 times is observed to have a low diastolic blood pressure of 54. Additionally, they have a triceps skin fold thickness of 19, a plasma glucose concentration of 99 following a glucose tolerance test, and a 2-hour serum insulin level of 86. Their body mass index is 25.6, and their diabetes pedigree function value is 0.154.###\nHence this label was avoid."
"This data describes a 50-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 80, no triceps skin fold thickness, and a plasma glucose concentration of 147 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, their body mass index is 29.5, and their diabetes pedigree function is 0.178.###\nHence this label was consent."
"This patient is a 21-year-old woman who has been pregnant 2 times. She has a diastolic blood pressure of 82, triceps skin fold thickness of 18, plasma glucose concentration of 142 after a glucose tolerance test, and 2-hour serum insulin level of 64. Her body mass index is 24.7 and she has a diabetes pedigree function score of 0.761. Overall, this patient's health markers indicate a relatively normal physiological state with low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 45-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 102, a triceps skin fold thickness of 28, and a body mass index of 32.8. Her plasma glucose concentration after a glucose tolerance test is 133 mg/dL and her 2-hour serum insulin level is 140 μU/mL. Additionally, her diabetes pedigree function is 0.234, indicating a lower risk of developing diabetes based on genetic factors.###\nHence this label was consent."
"The individual is a 26-year-old woman who has never been pregnant. She has a slightly elevated diastolic blood pressure of 76 and a high plasma glucose concentration of 165 after a 2-hour oral glucose tolerance test. Her triceps skin fold thickness is 43, indicating a higher level of subcutaneous fat. The 2-hour serum insulin level is considerably high at 255. She also has a high body mass index of 47.9 and a relatively low diabetes pedigree function of 0.259. Overall, this individual shows signs of potentially being at risk for developing diabetes.###\nHence this label was avoid."
"This data represents a 21-year-old individual who has never been pregnant, with lower than normal diastolic blood pressure, moderate triceps skin fold thickness, high plasma glucose concentration after a glucose tolerance test, very high serum insulin levels, elevated body mass index, and a relatively high diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 26-year-old female who has never been pregnant. She has a high diastolic blood pressure of 88 and a high triceps skin fold thickness of 44. Her plasma glucose concentration after a GTT is elevated at 181, and her 2-hour serum insulin level is very high at 510. She has a high body mass index of 43.3 and a relatively low diabetes pedigree function of 0.222. Overall, based on these measurements, the patient may be at risk for developing diabetes.###\nHence this label was consent."
"The individual is a 24-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 50 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 136 mg/dL, and her 2-hour serum insulin level is 204 μU/mL. She has a body mass index of 37.4 and a diabetes pedigree function value of 0.399.###\nHence this label was avoid."
"A 25-year-old woman, who has been pregnant twice, shows a low diastolic blood pressure of 58. Although her triceps skin fold thickness is normal at 16, her plasma glucose level after a glucose tolerance test is lower than average at 87. She has a moderate 2-hour serum insulin level of 52 and a slightly elevated body mass index of 32.7. Her family history indicates a low risk of diabetes with a diabetes pedigree function of 0.166.###\nHence this label was avoid."
"This data describes a 34-year-old individual who has been pregnant 9 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 33. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 124, and her 2-hour serum insulin level is at 402. She has a body mass index of 35.4 and a low diabetes pedigree function of 0.282.###\nHence this label was avoid."
"A 37-year-old woman who has been pregnant 7 times has a diastolic blood pressure of 70 mmHg. Her triceps skin fold thickness is 33 mm. She had a plasma glucose concentration of 124 mg/dL in a GTT, with a 2-hour serum insulin level of 215 mu U/ml. Her body mass index is 25.5, and her diabetes pedigree function is 0.161.###\nHence this label was avoid."
"The patient is a 41-year-old who has been pregnant 13 times. She has low diastolic blood pressure (60 mmHg) and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 76 mg/dL, and she has no 2-hour serum insulin. Despite a body mass index of 32.8, her diabetes pedigree function is relatively low at 0.18.###\nHence this label was avoid."
"This 22-year-old individual has been pregnant twice and shows a normal diastolic blood pressure. They have a low triceps skin fold thickness and have a high plasma glucose concentration after a glucose tolerance test. There is no serum insulin present, indicating a potential issue. With a healthy body mass index and a fairly low diabetes pedigree function, this individual may have a moderate risk of developing diabetes in the future.###\nHence this label was avoid."
"This is a data entry for a 22-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 82 mmHg, a triceps skin fold thickness of 17 mm, and a plasma glucose concentration of 128 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 183 mu U/ml, and she has a body mass index of 27.5. The diabetes pedigree function value is 0.115.###\nHence this label was avoid."
"The patient is a 29-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 33. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 189, with a 2-hour serum insulin level of 325. She has a body mass index of 31.2 and a diabetes pedigree function of 0.583. These measurements suggest a potential risk for developing diabetes and warrant further medical evaluation.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 0, and a plasma glucose concentration of 136 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 31.2. The diabetes pedigree function value is 1.182.###\nHence this label was consent."
"A 35-year-old woman, who has been pregnant 11 times, presents with a diastolic blood pressure of 74. She has zero triceps skin fold thickness and zero 2-hour serum insulin. Her plasma glucose concentration after a GTT is 85, and her body mass index is 30.1. Additionally, her diabetes pedigree function is 0.3.###\nHence this label was avoid."
"This patient is a 29-year-old female who is pregnant for the first time. She has very low diastolic blood pressure at 56 mmHg and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 146 mg/dL, with no detectable serum insulin. She has a body mass index (BMI) of 29.7, which is considered overweight. Additionally, her diabetes pedigree function is 0.564, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"A 22-year-old female who has been pregnant four times has a low diastolic blood pressure of 60. Despite having a low level of triceps skin fold thickness at 23, her plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 97. She has a low 2-hour serum insulin level of 0. Her body mass index is in the healthy range at 28.2, and her diabetes pedigree function score is low at 0.443.###\nHence this label was avoid."
"The patient is a 21-year-old who has never been pregnant. She has low diastolic blood pressure (52) and no triceps skin fold thickness. Her glucose level after a GTT is within normal range (102), and she has low insulin levels. Despite having a healthy BMI of 25.1, she has a low risk of developing diabetes based on her low diabetes pedigree function score of 0.078.###\nHence this label was avoid."
"This 22-year-old individual, who has been pregnant once, has normal diastolic blood pressure and a slightly above average triceps skin fold thickness. Their glucose levels after a 2-hour oral GTT are within the normal range, but their serum insulin levels are elevated. With a BMI indicating obesity, and a low diabetes pedigree function value, there may be a moderate risk of developing diabetes.###\nHence this label was avoid."
"A 23-year-old woman who has never been pregnant has a normal diastolic blood pressure of 82. Her triceps skin fold thickness is 31mm, and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 84mg/dL. She has high levels of 2-hour serum insulin at 125 μU/mL and a body mass index of 38.2, indicating obesity. Her diabetes pedigree function is low at 0.233, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old woman who has been pregnant 10 times. She has a low diastolic blood pressure of 62 and a normal body mass index of 25.9. However, she has no triceps skin fold thickness, which may indicate low muscle mass. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 92, which is within normal range. Additionally, her 2-hour serum insulin level is 0, suggesting low insulin production. The patient has a low diabetes pedigree function score of 0.167, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 22-year-old who has never been pregnant and has a below-average diastolic blood pressure of 50. They have a moderate triceps skin fold thickness of 36 and a high plasma glucose concentration of 179 after a glucose tolerance test. Their insulin level after 2 hours is elevated at 159. Despite their young age, they have a high body mass index of 37.8 and a relatively low diabetes pedigree function score of 0.455.###\nHence this label was consent."
"The patient is a 68-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 82 and a triceps skin fold thickness of 0. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 91 with a 2-hour serum insulin level of 0. The patient has a body mass index of 35.6 and a diabetes pedigree function of 0.587.###\nHence this label was avoid."
"The patient is a 52-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 104, no triceps skin fold thickness, and a plasma glucose concentration of 162 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 37.7. The diabetes pedigree function value is 0.151.###\nHence this label was consent."
"This data belongs to a 35-year-old individual who has been pregnant 11 times. They have a diastolic blood pressure of 76 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 138. They have no insulin present in their serum after 2 hours. Their body mass index is 33.2 and their diabetes pedigree function is 0.42.###\nHence this label was avoid."
"The patient is a young adult female who has never been pregnant. She has a low diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness is within normal range. Her glucose levels after a glucose tolerance test are normal. Although her insulin levels are slightly elevated, her overall risk of developing diabetes is relatively low based on her diabetes pedigree function score.###\nHence this label was avoid."
"A 22-year-old individual who has been pregnant twice, with a diastolic blood pressure of 60. They have a triceps skin fold thickness of 17, a plasma glucose concentration of 98 after a GTT, and a 2-hour serum insulin level of 120. Their body mass index is 34.7, and they have a low diabetes pedigree function of 0.198.###\nHence this label was avoid."
"This 38-year-old individual, who has been pregnant once, shows low diastolic blood pressure and no triceps skin fold thickness. Despite recording high plasma glucose concentration of 173, their 2-hour serum insulin level is 0. With a body mass index of 36.8 and a low diabetes pedigree function score of 0.088, this person may have a risk of developing diabetes due to the high plasma glucose concentration.###\nHence this label was consent."
"This patient is a 41-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 84, a triceps skin fold thickness of 33, and a body mass index of 35.5, indicating obesity. Her plasma glucose concentration is 184 after a glucose tolerance test, and she has no detectable insulin levels after 2 hours. The diabetes pedigree function score is 0.355, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 31-year-old who has never been pregnant. She has a diastolic blood pressure of 88, triceps skin fold thickness of 60, and a 2-hour serum insulin level of 110. Her plasma glucose concentration after a glucose tolerance test is 100. Additionally, she has a body mass index of 46.8 and a diabetes pedigree function of 0.962.###\nHence this label was avoid."
"The patient is a 29-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 74 and a high plasma glucose concentration of 182 after a glucose tolerance test. Her triceps skin fold thickness and 2-hour serum insulin levels are both low, while her body mass index is in the overweight range at 30.5. The diabetes pedigree function, which indicates genetic predisposition to diabetes, is relatively low at 0.345.###\nHence this label was consent."
"The patient is a 41-year-old female who has been pregnant 12 times. She has a diastolic blood pressure of 85 and a triceps skin fold thickness of 33. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 140. She has no detectable 2-hour serum insulin. With a body mass index of 37.4 and a low diabetes pedigree function value of 0.244, she may have a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"This data represents a 29-year-old individual who has been pregnant 6 times. They have a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 124, and their 2-hour serum insulin level is 0. They have a healthy body mass index of 27.6 and a low diabetes pedigree function score of 0.368.###\nHence this label was consent."
"A 30-year-old individual who has been pregnant 6 times with normal diastolic blood pressure, no triceps skin fold thickness, and an average glucose level. They have no insulin level after a glucose tolerance test, a healthy body mass index, and a low diabetes pedigree function.###\nHence this label was avoid."
"A 24-year-old woman who has been pregnant once, with a diastolic blood pressure of 60. She has a triceps skin fold thickness of 46, a plasma glucose concentration of 108 after a glucose tolerance test, and a high 2-hour serum insulin level of 178. Her body mass index is 35.5, and her diabetes pedigree function is relatively low at 0.415.###\nHence this label was avoid."
"This patient is a 43-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 18. Her plasma glucose concentration after a glucose tolerance test is 96, with a 2-hour serum insulin level of 67. She has a body mass index of 33.6 and a diabetes pedigree function value of 0.997. The data suggests that she may be at risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 32-year-old woman who has been pregnant 7 times. She has normal diastolic blood pressure and zero triceps skin fold thickness. She has a normal plasma glucose concentration of 100 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is zero. She has a body mass index of 30.0, indicating she is overweight. Her diabetes pedigree function is 0.484, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 39-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 72 and a low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 133, and her 2-hour serum insulin levels are normal. She has a body mass index of 32.9 and a low diabetes pedigree function of 0.27.###\nHence this label was consent."
"This data belongs to a 29-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 75 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 139 mg/dL, and their 2-hour serum insulin level is 0 µU/mL. They have a body mass index of 25.6 kg/m² and a diabetes pedigree function value of 0.167.###\nHence this label was avoid."
"A 72-year-old individual who has been pregnant twice shows no diastolic blood pressure or triceps skin fold thickness. They have a relatively low plasma glucose concentration of 119 and no insulin level after a 2-hour oral glucose tolerance test. Their body mass index is 19.6, indicating they are at a healthy weight. Despite these factors, their diabetes pedigree function is 0.832, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 22-year-old individual, who has been pregnant once, with a diastolic blood pressure of 80, a triceps skin fold thickness of 25, a plasma glucose concentration at 2 hours of 79, 2-hour serum insulin of 37, a body mass index of 25.4, and a diabetes pedigree function of 0.583.###\nHence this label was avoid."
"The patient is a 34-year-old individual who has been pregnant 10 times. They have a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 0mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 168 mg/dL, and their 2-hour serum insulin level is 0 μU/mL. The patient has a body mass index of 38.0 and a diabetes pedigree function value of 0.537.###\nHence this label was consent."
"A 25-year-old individual who has been pregnant twice has a diastolic blood pressure of 58. They have a triceps skin fold thickness of 40, a plasma glucose concentration of 105 after a GTT, and a 2-hour serum insulin level of 94. With a body mass index of 34.9 and a diabetes pedigree function of 0.225, this individual's risk of developing diabetes may be assessed.###\nHence this label was avoid."
"This individual is 33 years old with no previous pregnancies. They have low diastolic blood pressure of 40 mmHg and high triceps skin fold thickness of 35 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 137 mg/dL, with a high 2-hour serum insulin level of 168 mu U/ml. They have a high body mass index of 43.1 and a relatively high diabetes pedigree function score of 2.288.###\nHence this label was consent."
"A 23-year-old woman, who is pregnant for the first time, has a diastolic blood pressure of 62. She has a triceps skin fold thickness of 24 mm. Her plasma glucose concentration 2 hours after an oral glucose tolerance test is 88 mg/dL, with a 2-hour serum insulin level of 44 μU/mL. Her body mass index is 29.9, and her diabetes pedigree function is 0.422. This information provides insights into her health status and risk of developing diabetes.###\nHence this label was avoid."
"A 25-year-old individual who has never been pregnant has a diastolic blood pressure of 76 mmHg. Their triceps skin fold thickness is 56mm, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 162 mg/dL. Their 2-hour serum insulin level is 100 μU/mL. With a body mass index of 53.2, they have a diabetes pedigree function of 0.759.###\nHence this label was consent."
"The individual in the dataset is a 24-year-old who is pregnant for the first time. They have a healthy diastolic blood pressure of 68 mmHg and a moderate triceps skin fold thickness of 34 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 87 mg/dL, with a relatively low 2-hour serum insulin level of 77 μU/mL. They have a high body mass index of 37.6, and a low diabetes pedigree function score of 0.401.###\nHence this label was avoid."
"A 28-year-old woman who is slightly underweight and has had one pregnancy displays normal diastolic blood pressure, low triceps skin fold thickness, and average plasma glucose concentration. Her 2-hour serum insulin level is normal, and her diabetes pedigree function is low, indicating a low risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 25-year-old female who has been pregnant 5 times and has a diastolic blood pressure of 80. She has a triceps skin fold thickness of 35, a plasma glucose concentration of 139 after a 2-hour oral glucose tolerance test, and 160 2-hour serum insulin level. Her body mass index is 31.6, and her diabetes pedigree function is 0.361.###\nHence this label was consent."
"The patient is a 51-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 19. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 166, and her 2-hour serum insulin level is 175. She has a body mass index of 25.8 and a diabetes pedigree function of 0.587.###\nHence this label was consent."
"The patient is a 44-year-old woman who has been pregnant 13 times. She has normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a GTT. She has no serum insulin levels, a high body mass index, and a low diabetes pedigree function score.###\nHence this label was consent."
"A 33-year-old woman, who is pregnant for the first time, has a diastolic blood pressure of 98 mmHg. Her triceps skin fold thickness is 41mm. She had a plasma glucose concentration of 128 mg/dL during a GTT, with a 2-hour serum insulin level of 58 μU/mL. Her body mass index is 32.0, and her diabetes pedigree function is 1.321.###\nHence this label was consent."
"A 49-year-old patient who has been pregnant 9 times shows normal diastolic blood pressure but lacks triceps skin fold thickness. They have high plasma glucose concentration after a GTT, but their insulin levels are low. The patient has a slightly elevated body mass index and a relatively low diabetes pedigree function score.###\nHence this label was consent."
"A 26-year-old woman who has never been pregnant has high diastolic blood pressure (110 mmHg) and a high triceps skin fold thickness (46 mm). Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range (129 mg/dL), but she has elevated 2-hour serum insulin levels (130 mu U/mL). She also has a high body mass index of 67.1 and a low diabetes pedigree function of 0.319.###\nHence this label was consent."
"A 30-year-old woman who has been pregnant twice is being monitored for diabetes risk. Her diastolic blood pressure is 68, triceps skin fold thickness is 28, and BMI is 32.9. She had a plasma glucose concentration of 124 after a glucose tolerance test, and her 2-hour serum insulin level is 205. Her diabetes pedigree function is 0.875.###\nHence this label was consent."
"A 27-year-old woman, who has been pregnant once, with a good diastolic blood pressure of 60. She has a slightly below average triceps skin fold thickness of 23, and a normal plasma glucose concentration of 117 after a glucose tolerance test. Her insulin level at 2 hours is slightly elevated at 106. Despite having a body mass index of 33.8, she has a lower risk of developing diabetes, indicated by her low diabetes pedigree function score of 0.466.###\nHence this label was avoid."
"A 39-year-old individual who has been pregnant 3 times with lower diastolic blood pressure, moderately high triceps skin fold thickness, normal glucose levels after a 2-hour oral glucose tolerance test, elevated insulin levels, healthy body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"This data belongs to a 26-year-old individual who has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. However, their plasma glucose concentration after a glucose tolerance test is slightly elevated. They have a high body mass index and a low diabetes pedigree function score. This person may have a risk of developing diabetes due to their elevated glucose levels and high BMI.###\nHence this label was consent."
"The patient is a 42-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a GTT is 108 and she has no insulin in her system after a 2-hour serum test. Her body mass index is 32.4 and her diabetes pedigree function is 0.272.###\nHence this label was consent."
"The individual is a 37-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 108 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 137. Her 2-hour serum insulin level is 0. She has a high body mass index of 48.8 and a low diabetes pedigree function of 0.227.###\nHence this label was consent."
"The patient is a 41-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 80, triceps skin fold thickness of 37, and a low plasma glucose concentration of 57 after a glucose tolerance test. Her 2-hour serum insulin level is 0, indicating potential risk for diabetes. She has a body mass index of 32.8 and a diabetes pedigree function of 0.096.###\nHence this label was avoid."
"This data belongs to a 33-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 34. Their plasma glucose concentration after a GTT is 152, and their 2-hour serum insulin level is 171. With a body mass index of 34.2 and a diabetes pedigree function of 0.893, this individual's health indicators suggest a risk for developing diabetes.###\nHence this label was consent."
"The patient is a 67-year-old who has never been pregnant. Their diastolic blood pressure is low at 60. They have no triceps skin fold thickness and a very low plasma glucose concentration of 57 after a glucose tolerance test. The 2-hour serum insulin level is also at zero. The patient has a relatively low body mass index of 21.7 and a moderate diabetes pedigree function of 0.735.###\nHence this label was avoid."
"This data is from a 21-year-old individual who has been pregnant twice. Their diastolic blood pressure is 90, and triceps skin fold thickness is 19. Their plasma glucose concentration at 2 hours is 117, with a 2-hour serum insulin level of 71. The individual has a body mass index of 25.2 and a diabetes pedigree function of 0.313.###\nHence this label was avoid."
"The patient is a 56-year-old who has been pregnant 10 times. They have normal diastolic blood pressure, low triceps skin fold thickness, and slightly lower plasma glucose concentration after a glucose tolerance test. Their insulin level after 2 hours is at 0, indicating low insulin production. Despite having a lower body mass index, they have a moderate risk of developing diabetes based on their diabetes pedigree function score of 0.595.###\nHence this label was avoid."
"A 37-year-old individual who has been pregnant 4 times, with a diastolic blood pressure of 65, no triceps skin fold thickness, and a plasma glucose concentration of 114 after a 2-hour oral glucose tolerance test. They have 0 2-hour serum insulin, a body mass index of 21.9, and a diabetes pedigree function of 0.432.###\nHence this label was avoid."
"A 26-year-old individual, who has been pregnant 4 times, with a diastolic blood pressure of 72 and no triceps skin fold thickness. They have a high plasma glucose concentration of 171 after a 2-hour oral glucose tolerance test, but no serum insulin levels. Despite their elevated glucose levels, their body mass index is high at 43.6, and they have a relatively low diabetes pedigree function score of 0.479.###\nHence this label was consent."
"The patient is a 45-year-old female who has been pregnant 8 times. She has normal diastolic blood pressure of 78 and a moderately high triceps skin fold thickness of 32. Her plasma glucose concentration after a glucose tolerance test is elevated at 154, while her 2-hour serum insulin level is low. She has a relatively high body mass index of 32.4 and a low diabetes pedigree function score of 0.443.###\nHence this label was consent."
"A 22-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 100 mmHg. They have a triceps skin fold thickness of 35 mm and a high plasma glucose concentration of 123 mg/dL after a 2-hour GTT. Their 2-hour serum insulin level is significantly elevated at 240 mu U/ml. With a body mass index of 57.3, they have a high risk of developing diabetes according to their diabetes pedigree function score of 0.88.###\nHence this label was avoid."
"The patient is a 40-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 27. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 111, with a 2-hour serum insulin level of 0. Her body mass index is 27.5 and her diabetes pedigree function is 0.141.###\nHence this label was consent."
"This individual is 35 years old and has never been pregnant. They have a diastolic blood pressure of 100 and a high triceps skin fold thickness of 39. Their plasma glucose concentration after a glucose tolerance test is 93, with a 2-hour serum insulin level of 72. They have a high body mass index of 43.4 and a relatively high diabetes pedigree function score of 1.021.###\nHence this label was avoid."
"A 31-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 60, triceps skin fold thickness of 12, plasma glucose concentration of 129, 2-hour serum insulin level of 231, body mass index of 27.5, and a diabetes pedigree function of 0.527.###\nHence this label was avoid."
"A 21-year-old woman who has never been pregnant has a low diastolic blood pressure of 56. She has a triceps skin fold thickness of 13mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 124mg/dL. Additionally, her 2-hour serum insulin level is 105µU/mL. With a body mass index of 21.8, she has a low risk of developing diabetes according to her diabetes pedigree function of 0.452.###\nHence this label was avoid."
"This data describes a 24-year-old patient who has been pregnant twice and shows signs of high risk for developing diabetes. The patient has a normal diastolic blood pressure but high triceps skin fold thickness, indicating excess body fat. The plasma glucose concentration and 2-hour serum insulin levels are also elevated, pointing towards potential insulin resistance. The patient's body mass index is in the obese range, further highlighting the risk for diabetes. The diabetes pedigree function value is low, suggesting a possible genetic predisposition to the disease.###\nHence this label was avoid."
"The patient is a young adult, age 22, who has been pregnant once. They have normal diastolic blood pressure and triceps skin fold thickness. However, their plasma glucose concentration and serum insulin levels are both unusually low. The patient has a slightly elevated body mass index of 32.0 and a moderate diabetes pedigree function score of 0.389.###\nHence this label was avoid."
"This is a dataset of a 25-year-old individual who has never been pregnant and is at risk for diabetes. Their diastolic blood pressure is 68, triceps skin fold thickness is 32, and plasma glucose concentration after a glucose tolerance test is 91. They have a high 2-hour serum insulin level of 210 and a high body mass index of 39.9, indicating obesity. The diabetes pedigree function score is 0.381, suggesting a genetic predisposition to diabetes. Overall, these measurements indicate a high risk for developing diabetes.###\nHence this label was avoid."
"This is a 25-year-old individual who has been pregnant once. Their diastolic blood pressure is 78, triceps skin fold thickness is 29, and plasma glucose concentration after a two-hour oral glucose tolerance test is 116. They have a 2-hour serum insulin level of 180 and a body mass index of 36.1. Their diabetes pedigree function score is 0.496.###\nHence this label was avoid."
"This is a dataset of a 30-year-old individual who has been pregnant 3 times. Their diastolic blood pressure is 70 and their triceps skin fold thickness is 30. Their plasma glucose concentration during an oral glucose tolerance test is 120, and their 2-hour serum insulin level is 135. They have a body mass index of 42.9 and a diabetes pedigree function of 0.452.###\nHence this label was avoid."
"A 25-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure and moderate triceps skin fold thickness. Her glucose levels after a glucose tolerance test are low, with slightly elevated insulin levels. She has a relatively high body mass index and a moderate diabetes pedigree score.###\nHence this label was avoid."
"A 50-year-old individual who has been pregnant 6 times shows normal diastolic blood pressure and moderate triceps skin fold thickness. They have slightly elevated plasma glucose levels after a glucose tolerance test, no insulin secretion after 2 hours, and a high body mass index. Their diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was consent."
"This is a 26-year-old individual who has been pregnant 4 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 0. Her plasma glucose concentration in an oral glucose tolerance test is 118, and she has no 2-hour serum insulin. Despite having a body mass index of 44.5, her diabetes pedigree function is 0.904.###\nHence this label was avoid."
"A 49-year-old individual who has been pregnant 6 times, with a diastolic blood pressure of 68 and a triceps skin fold thickness of 26. They have a plasma glucose concentration of 165 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 168. Their body mass index is 33.6 and their diabetes pedigree function is 0.631.###\nHence this label was avoid."
"A 36-year-old individual who has been pregnant 7 times shows normal diastolic blood pressure and a good level of plasma glucose concentration after a glucose tolerance test. They have a moderately low triceps skin fold thickness, and their insulin levels are within normal range. The individual also has a slightly elevated body mass index and a low diabetes pedigree function score. Overall, this person's health indicators suggest a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This patient is 55 years old and has been pregnant 3 times. She has normal diastolic blood pressure, very low triceps skin fold thickness, and a healthy plasma glucose concentration. Her insulin levels are normal and she has a low body mass index. The diabetes pedigree function value indicates a low genetic risk for diabetes. Overall, this patient appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"The patient is a 67-year-old woman who has been pregnant 4 times. She has normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 146 mg/dL. She has no insulin present in her serum. Despite having a high body mass index of 38.5, her diabetes pedigree function is relatively low at 0.52.###\nHence this label was consent."
"This individual is a 48-year-old female who has been pregnant 11 times. She has a diastolic blood pressure of 80 and a triceps skin fold thickness of 37. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120, with a 2-hour serum insulin level of 150. She has a body mass index of 42.3 and a diabetes pedigree function of 0.785.###\nHence this label was consent."
"This individual is a 59-year-old who has been pregnant 6 times. Their diastolic blood pressure is 78. Although their triceps skin fold thickness and 2-hour serum insulin levels are both 0, they have a relatively high plasma glucose concentration at 194. Their body mass index is 23.5 and their diabetes pedigree function is 0.129.###\nHence this label was consent."
"This 22-year-old patient, who has been pregnant once, has a slightly elevated diastolic blood pressure of 84. Their triceps skin fold thickness is 23, indicating a moderate amount of subcutaneous fat. Following a glucose tolerance test, their plasma glucose concentration at 2 hours is 143. However, their 2-hour serum insulin level is high at 310, suggesting possible insulin resistance. With a body mass index of 42.4, this patient is categorized as obese. Their diabetes pedigree function value is 1.076, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 27-year-old woman who has been pregnant twice has low diastolic blood pressure, no triceps skin fold thickness, and normal 2-hour serum insulin levels. Despite having a high body mass index, her plasma glucose concentration after a glucose tolerance test is within the normal range. Additionally, she has a relatively low diabetes pedigree function score of 0.93.###\nHence this label was avoid."
"This is a data entry for a 21-year-old individual who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a healthy body mass index. Her glucose levels are within the normal range, and her insulin levels are also normal. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 43-year-old who has been pregnant eight times. Their diastolic blood pressure is 106 mmHg. They have a triceps skin fold thickness of 46mm and a high plasma glucose concentration of 167 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is elevated at 231 μU/mL. With a body mass index of 37.6, they are classified as obese. Their diabetes pedigree function score is low at 0.165, indicating a lower genetic predisposition to diabetes.###\nHence this label was consent."
"This is a data entry for a 28-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 50 and a normal triceps skin fold thickness of 40. Her plasma glucose level after a 2-hour oral glucose tolerance test is 125, and her 2-hour serum insulin level is high at 167. She has a body mass index of 33.3, indicating that she may be overweight. The diabetes pedigree function score is 0.962, suggesting a moderate genetic risk for developing diabetes.###\nHence this label was consent."
"A 55-year-old individual who has been pregnant 6 times with a diastolic blood pressure of 61. They have 0 triceps skin fold thickness and 0 serum insulin level. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 137. With a body mass index of 24.2 and a low diabetes pedigree function score of 0.151.###\nHence this label was avoid."
"A 30-year-old woman who is slightly overweight, with a low risk of diabetes, has normal blood pressure and insulin levels. She has a healthy glucose metabolism, low triceps skin fold thickness, and a low diabetes pedigree.###\nHence this label was avoid."
"A 53-year-old individual who has been pregnant twice has a diastolic blood pressure of 75. They have a triceps skin fold thickness of 0 and a plasma glucose concentration of 105 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 23.3. Additionally, their diabetes pedigree function value is 0.56.###\nHence this label was avoid."
"This individual is a 34-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 84, triceps skin fold thickness of 44, and a high plasma glucose concentration of 155 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 545, and she has a body mass index of 38.7. Her diabetes pedigree function is 0.619, indicating a potential genetic risk for diabetes.###\nHence this label was avoid."
"This is a 22-year-old female who has never been pregnant. She has a diastolic blood pressure of 82, triceps skin fold thickness of 15, and a plasma glucose concentration of 98 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 84, and she has a body mass index of 25.2. Her diabetes pedigree function is 0.299.###\nHence this label was avoid."
"The patient is a 38-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 16 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 89 mg/dL and her 2-hour serum insulin level is 85 μU/mL. She has a body mass index of 30.4 and a diabetes pedigree function of 0.551. Overall, these values indicate a moderate risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 25-year-old female who has never been pregnant. She has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin level of 0. However, she has a plasma glucose concentration of 138, which is slightly above normal. Her body mass index is 36.3, indicating she is obese. The diabetes pedigree function is 0.933, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 21-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 60 and a moderate triceps skin fold thickness of 32. Her glucose levels after a meal are 124, with no detectable insulin levels. She has a high body mass index of 35.8 and a moderate diabetes pedigree function score of 0.514.###\nHence this label was avoid."
"This individual is a 69-year-old who has been pregnant 5 times. They have a diastolic blood pressure of 82 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 136, with a 2-hour serum insulin level of 0. Their body mass index is 0.0 and they have a diabetes pedigree function value of 0.64.###\nHence this label was avoid."
"The patient is a 32-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 30 mm. Her plasma glucose concentration is 125 mg/dL after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 120 mU/mL. She has a body mass index of 30.0 and a diabetes pedigree function of 0.464. This data suggests that the patient may be at risk for developing diabetes.###\nHence this label was avoid."
"A 41-year-old individual, who has been pregnant 10 times, with a diastolic blood pressure of 70, a triceps skin fold thickness of 26, a plasma glucose concentration of 125 after a GTT, a 2-hour serum insulin level of 115, a body mass index of 31.1, and a diabetes pedigree function of 0.205.###\nHence this label was consent."
"This 27-year-old individual has been pregnant 2 times and has a diastolic blood pressure of 68. They have a triceps skin fold thickness of 42, a plasma glucose concentration of 90, and no 2-hour serum insulin. With a body mass index of 38.2 and a diabetes pedigree function of 0.503, this individual's risk of developing diabetes may be worth monitoring.###\nHence this label was consent."
"This data belongs to a 21-year-old individual who is pregnant for the first time. She has low diastolic blood pressure of 56 and a moderate triceps skin fold thickness of 29. Her plasma glucose concentration after a glucose tolerance test is 126, and she has a relatively high 2-hour serum insulin level of 152. With a body mass index of 28.7 and a diabetes pedigree function of 0.801, she may have a moderate risk of developing diabetes.###\nHence this label was avoid."
"This individual, aged 36, has been pregnant 8 times and has a diastolic blood pressure of 78. Their triceps skin fold thickness is 32, and their plasma glucose concentration after a glucose tolerance test is 151. Additionally, their 2-hour serum insulin level is 210, and they have a body mass index of 42.9. The diabetes pedigree function for this individual is 0.516.###\nHence this label was consent."
"The patient is a 32-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 84, a triceps skin fold thickness of 21, and a body mass index of 30.8. Her plasma glucose concentration after a glucose tolerance test is 164, and her 2-hour serum insulin level is 0. Her diabetes pedigree function is 0.831.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 86, a triceps skin fold thickness of 0, and a body mass index of 28.4. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120. She has no serum insulin after 2 hours. The diabetes pedigree function for this patient is 0.259.###\nHence this label was consent."
"A 28-year-old patient who has been pregnant 4 times shows slightly elevated diastolic blood pressure, below normal triceps skin fold thickness, normal plasma glucose concentration, high insulin levels, and a slightly elevated body mass index. The patient has a moderate family history of diabetes based on the diabetes pedigree function score.###\nHence this label was avoid."
"The individual is a 61-year-old woman who has been pregnant 7 times. She has a low diastolic blood pressure of 60 and a healthy triceps skin fold thickness of 33. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 142, and her 2-hour serum insulin level is 190. With a body mass index of 28.8, she is considered overweight. Her diabetes pedigree function score is 0.687, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 41-year-old female who has been pregnant 8 times. She has a low diastolic blood pressure of 66 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 143. Her 2-hour serum insulin level is 0. Despite having a body mass index of 34.9, her diabetes pedigree function is low at 0.129.###\nHence this label was consent."
"The individual is a 24-year-old who has never been pregnant. They have a normal diastolic blood pressure of 78, a moderate triceps skin fold thickness of 40, and a slightly low plasma glucose concentration at 102. Their 2-hour serum insulin level is slightly elevated at 90. They have a high body mass index of 34.5 and a relatively low diabetes pedigree function score of 0.238.###\nHence this label was avoid."
"The patient is a 63-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 48. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 101, and her 2-hour serum insulin level is 180. She has a body mass index of 32.9 and a diabetes pedigree function of 0.171.###\nHence this label was avoid."
"The patient is a 54-year-old individual who has been pregnant 6 times. They have a healthy diastolic blood pressure of 76 and a normal body mass index of 33.8. Their triceps skin fold thickness and 2-hour serum insulin levels are both at 0. Despite having a plasma glucose concentration of 125, which is slightly elevated, their diabetes pedigree function is low at 0.121, indicating a low risk of developing diabetes.###\nHence this label was consent."
"This individual is 30 years old and has been pregnant three times. They have a low diastolic blood pressure of 56 and a moderate triceps skin fold thickness of 39. Their glucose level after a 2-hour oral glucose tolerance test is 111, with no insulin present in their blood. They have a body mass index of 30.1 and a moderate diabetes pedigree function score of 0.557.###\nHence this label was avoid."
"A 28-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 70, triceps skin fold thickness of 18, plasma glucose concentration of 163, 2-hour serum insulin level of 105, and a body mass index of 31.6. Their diabetes pedigree function is 0.268.###\nHence this label was consent."
"This patient is a 41-year-old female who is pregnant for the first time. She has a high plasma glucose concentration of 180 mg/dL and a high body mass index of 43.3, indicating a risk for diabetes. However, her diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin levels are all at 0, showing potential areas of concern. Her diabetes pedigree function is low at 0.282.###\nHence this label was consent."
"A 28-year-old woman who has never been pregnant shows elevated levels of plasma glucose and serum insulin after a glucose tolerance test, along with high diastolic blood pressure and triceps skin fold thickness. Her body mass index is in the obese range, but she has a relatively low diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 45-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 94 mmHg. Her triceps skin fold thickness and 2-hour serum insulin levels are both measured at 0. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 111 mg/dL. She has a body mass index of 32.8, and her diabetes pedigree function is calculated to be 0.265.###\nHence this label was avoid."
"This individual is 40 years old and has been pregnant 11 times. They have a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. Their plasma glucose concentration after a glucose tolerance test is 135. They have a high body mass index of 52.3 and a diabetes pedigree function of 0.578. This person may have a risk for developing diabetes due to their age, high number of pregnancies, and elevated glucose levels.###\nHence this label was consent."
"This individual is 33 years old and has been pregnant 4 times. They have a healthy diastolic blood pressure of 68 and a moderate triceps skin fold thickness of 38. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range at 99. They have no insulin present in their serum after 2 hours and have a slightly elevated body mass index of 32.8. Their diabetes pedigree function, which assesses the likelihood of developing diabetes based on family history, is low at 0.145. Overall, this individual appears to have some risk factors for diabetes, such as high BMI and pregnancy history, but their glucose levels and insulin levels are currently within normal range.###\nHence this label was avoid."
"This is a 61-year-old individual who has been pregnant 4 times. Their diastolic blood pressure is 92, triceps skin fold thickness is 0, and plasma glucose concentration after a glucose tolerance test is 146. They have no serum insulin after 2 hours, a body mass index of 31.2, and a diabetes pedigree function of 0.539.###\nHence this label was consent."
"The patient is a 60-year-old female who has been pregnant 4 times. She has a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 134, and she has no insulin in her serum after 2 hours. With a body mass index of 23.8 and a low diabetes pedigree function of 0.277, she appears to have a relatively low risk of developing diabetes.###\nHence this label was consent."
"A 22-year-old woman, who is pregnant for the first time, has a low diastolic blood pressure of 48. She has a triceps skin fold thickness of 18, indicating a relatively lean body composition. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 71, which is within the normal range. Her 2-hour serum insulin level is 76. With a body mass index of 20.4, she is considered to be in the healthy weight range. Her diabetes pedigree function is 0.323, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This data describes a young individual, aged 21, who is pregnant for the first time. She has a low diastolic blood pressure of 62 and a moderate triceps skin fold thickness of 41. Her glucose level after a 2-hour oral glucose tolerance test is 139, and her insulin level is significantly high at 480. She has a relatively high body mass index of 40.7 and a slightly elevated diabetes pedigree function score of 0.536.###\nHence this label was avoid."
"The patient is a 25-year-old female who has been pregnant 2 times. She has a low diastolic blood pressure of 58 and a relatively normal triceps skin fold thickness of 33. Her plasma glucose concentration after a glucose tolerance test is 144, and her 2-hour serum insulin level is high at 135. With a body mass index of 31.6, she is considered overweight. Her diabetes pedigree function score is low at 0.422, indicating a low genetic likelihood of developing diabetes.###\nHence this label was consent."
"This patient is 36 years old and has been pregnant 7 times. Their diastolic blood pressure is 66, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. Their plasma glucose concentration after a glucose tolerance test is 159. They have a body mass index of 30.4 and a diabetes pedigree function of 0.383.###\nHence this label was consent."
"The patient is a 32-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 32, and a plasma glucose concentration of 97 after a glucose tolerance test. Her 2-hour serum insulin level is 91, and she has a body mass index of 40.9. The diabetes pedigree function indicates a moderate genetic risk of diabetes at 0.871.###\nHence this label was consent."
"This individual is a 26-year-old who has never been pregnant. They have a diastolic blood pressure of 80, triceps skin fold thickness of 45, and a plasma glucose concentration of 95 after a glucose tolerance test. Their 2-hour serum insulin level is 92, and they have a body mass index of 36.5. Their diabetes pedigree function is 0.33.###\nHence this label was avoid."
"A 46-year-old individual who has been pregnant 8 times with a diastolic blood pressure of 62, triceps skin fold thickness of 26, plasma glucose concentration of 155, 2-hour serum insulin level of 495, body mass index of 34.0, and a diabetes pedigree function of 0.543.###\nHence this label was consent."
"This 28-year-old individual has been pregnant four times and has a diastolic blood pressure of 58. They have a triceps skin fold thickness of 22, a plasma glucose concentration of 85 after a glucose tolerance test, and a 2-hour serum insulin level of 49. With a body mass index of 27.8 and a diabetes pedigree function of 0.306, this person's risk of developing diabetes may be assessed.###\nHence this label was avoid."
"The individual is a 27-year-old who has never been pregnant. Despite having a low diastolic blood pressure of 82 mmHg, they have a high triceps skin fold thickness of 39 mm, indicating excess body fat. Their plasma glucose concentration after a glucose tolerance test is elevated at 152 mg/dL, and their 2-hour serum insulin level is notably high at 272 μU/mL. With a body mass index of 41.5 and a low diabetes pedigree function of 0.27, this person may be at risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 39-year-old who has been pregnant 3 times. She has a low diastolic blood pressure of 70 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration is 78, and her 2-hour serum insulin level is 0. Despite having a body mass index of 32.5, she has a low risk of developing diabetes according to her low diabetes pedigree function of 0.27.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 70 and a normal triceps skin fold thickness of 0. The plasma glucose concentration after a glucose tolerance test is high at 195, while the 2-hour serum insulin level is at 0. She has a body mass index of 30.9, indicating she is overweight. The diabetes pedigree function score is low at 0.328, suggesting a lower risk of developing diabetes based on genetic factors.###\nHence this label was consent."
"This data belongs to a 21-year-old female who has never been pregnant. She has slightly elevated diastolic blood pressure, low triceps skin fold thickness, low plasma glucose concentration, moderate insulin levels, and a high body mass index. Her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This 30-year-old individual has been pregnant 5 times and shows normal diastolic blood pressure. They have a moderately thick triceps skin fold and a healthy plasma glucose concentration after a GTT. Their insulin levels are within normal range. With a body mass index of 24.4, they are considered to have a healthy weight. The individual has a low diabetes pedigree function score, indicating a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 30-year-old female who has been pregnant 5 times. She has a normal diastolic blood pressure of 74 and a low triceps skin fold thickness of 0. Despite her relatively low 2-hour serum insulin level of 0, her plasma glucose concentration at 2 hours is within a healthy range at 116. She has a healthy body mass index of 25.6 and a low diabetes pedigree function of 0.201, indicating a low risk of developing diabetes.###\nHence this label was avoid."
"A 22-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 58, triceps skin fold thickness of 26, plasma glucose concentration at 88 after a glucose tolerance test, 2-hour serum insulin level of 16, a body mass index of 28.4, and a diabetes pedigree function of 0.766.###\nHence this label was avoid."
"A 28-year-old individual, who has been pregnant twice, with a healthy diastolic blood pressure of 66. They have a moderate triceps skin fold thickness of 20mm and a normal plasma glucose concentration of 100mg/dL after a GTT. Their 2-hour serum insulin level is slightly elevated at 90 units. They have a body mass index of 32.9, indicating they are overweight. With a diabetes pedigree function of 0.867, there may be a familial history of diabetes.###\nHence this label was consent."
"A 29-year-old woman, who is pregnant for the first time, has a low diastolic blood pressure of 66. She has a relatively high triceps skin fold thickness of 52, but normal plasma glucose concentration at 86. Her 2-hour serum insulin level is also within a normal range at 65. Despite having a high body mass index of 41.3, her diabetes pedigree function is relatively low at 0.917.###\nHence this label was avoid."
"The patient is a 47-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 106 mmHg and a triceps skin fold thickness of 23 mm. Her plasma glucose concentration 2 hours after an oral glucose tolerance test is 68 mg/dL, and her 2-hour serum insulin level is 49 uU/mL. She has a body mass index of 35.5 and a diabetes pedigree function of 0.285. Overall, these measurements suggest that the patient may be at risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 45-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 80 mmHg, a triceps skin fold thickness of 0 mm, and a body mass index of 34.6. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 128 mg/dL, and her 2-hour serum insulin level is 0 µU/mL. The diabetes pedigree function value is 0.144.###\nHence this label was avoid."
"The individual is a 30-year-old female who has been pregnant 4 times. She has a normal diastolic blood pressure of 74 and a moderately high plasma glucose concentration of 147 after a glucose tolerance test. Her triceps skin fold thickness is 25, indicating a healthy amount of subcutaneous fat. The 2-hour serum insulin level is high at 293, suggesting potential insulin resistance. She has a body mass index of 34.9, which classifies her as obese. The diabetes pedigree function score is 0.385, indicating a moderate genetic predisposition to diabetes. Overall, this individual shows some risk factors for developing diabetes and may need further monitoring and intervention.###\nHence this label was avoid."
"The patient is a 37-year-old woman who has been pregnant 5 times. She has a healthy diastolic blood pressure of 78 and a body mass index of 27.6. Her triceps skin fold thickness is 30, indicating a normal amount of subcutaneous fat. The patient's plasma glucose concentration is 88, suggesting she has good blood sugar control. Her 2-hour serum insulin level is 0, which may be a concern. However, her diabetes pedigree function is low at 0.258, indicating a relatively low genetic risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 25-year-old female who has been pregnant 4 times. She has a very low diastolic blood pressure of 62. Her triceps skin fold thickness is 0, indicating very low subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 76, which is on the lower side. She has no serum insulin present after 2 hours. Despite her low glucose levels, her body mass index is high at 34.0, indicating she may be overweight. The diabetes pedigree function value is 0.391, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This is a data entry for a 27-year-old individual who has been pregnant five times. Their diastolic blood pressure is 60, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. Moreover, their plasma glucose concentration at 2 hours in an oral glucose tolerance test is 73. Their body mass index is 26.8, and the diabetes pedigree function is 0.268.###\nHence this label was avoid."
"A 36-year-old individual who has been pregnant 4 times shows normal diastolic blood pressure and triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is high at 183, but their insulin levels are normal. With a body mass index of 28.4 and a low diabetes pedigree function score of 0.212, this person may have a moderate risk of developing diabetes.###\nHence this label was consent."
"This individual is a 21-year-old who has been pregnant 4 times and has measurements indicating good health. They have normal blood pressure, low skin fold thickness, normal glucose levels, no insulin resistance, a healthy BMI, and a low diabetes pedigree function score.###\nHence this label was avoid."
"The individual is a 26-year-old who has never been pregnant. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 18 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120 mg/dL, and her 2-hour serum insulin level is 63 microU/mL. She has a body mass index of 30.5, indicating overweight. Her diabetes pedigree function is 0.285, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"The 40-year-old patient has been pregnant 7 times and shows elevated diastolic blood pressure, high triceps skin fold thickness, and a high plasma glucose concentration of 168 after a GTT. The 2-hour serum insulin level is notably high at 321, and the patient's body mass index is 38.2, indicating obesity. The diabetes pedigree function value is 0.787, suggesting a genetic predisposition to diabetes.###\nHence this label was consent."
"This patient is a 34-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 68, triceps skin fold thickness of 15, and a plasma glucose concentration of 191 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130, and she has a body mass index of 30.9. Her diabetes pedigree function is 0.299. Overall, these measurements suggest the patient may be at risk for developing diabetes.###\nHence this label was avoid."
"This is a 23-year-old individual who has been pregnant 3 times. She has a normal diastolic blood pressure and triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 116, and she has no insulin present in her serum after 2 hours. The individual has a healthy body mass index of 23.5 and a low diabetes pedigree function score of 0.187.###\nHence this label was avoid."
"This 27-year-old patient has been pregnant 3 times and shows signs of potential risk for diabetes with high diastolic blood pressure (88), elevated triceps skin fold thickness (41), and a high plasma glucose concentration of 126. Additionally, the patient has a 2-hour serum insulin level of 235, a high body mass index of 39.3, and a somewhat elevated diabetes pedigree function of 0.704. These factors indicate the need for further monitoring and possibly intervention to mitigate the risk of developing diabetes.###\nHence this label was avoid."
"This is a dataset of a 21-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 64, triceps skin fold thickness of 27, and a plasma glucose concentration of 96 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin is 87, body mass index is 33.2, and diabetes pedigree function is 0.289.###\nHence this label was avoid."
"The patient is a 28-year-old individual who has been pregnant 4 times. They have a low diastolic blood pressure of 60 and a slightly above average body mass index of 35.4. Their triceps skin fold thickness is 32, indicating some level of body fat. Following a glucose tolerance test, their plasma glucose concentration at 2 hours is 95, which is within a normal range. They have no insulin present in their serum after 2 hours. Their diabetes pedigree function is 0.284, suggesting a low genetic risk of diabetes.###\nHence this label was avoid."
"A 34-year-old woman who has been pregnant 7 times shows normal diastolic blood pressure, no triceps skin fold thickness, and a slightly low plasma glucose concentration after a glucose tolerance test. She has no serum insulin level, a healthy body mass index, and a moderate risk of developing diabetes based on her diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 27-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 27 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122 mg/dL, and she has no detectable 2-hour serum insulin. Her body mass index is 36.8, indicating she is overweight. The diabetes pedigree function, a measure of the hereditary component of diabetes, is 0.34.###\nHence this label was avoid."
"A 27-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 72. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 106 after a glucose tolerance test, and a 2-hour serum insulin level of 0. Their body mass index is 25.8 and they have a diabetes pedigree function of 0.207.###\nHence this label was avoid."
"A 41-year-old individual who has been pregnant 7 times shows elevated plasma glucose concentration of 196 after a glucose tolerance test, while having a high body mass index of 39.8. Other indicators such as diastolic blood pressure and insulin levels are within normal range. The individual has a low triceps skin fold thickness and a relatively low diabetes pedigree function.###\nHence this label was consent."
"The data belongs to a 26-year-old individual who has been pregnant 4 times. She has a low diastolic blood pressure of 64, a relatively high triceps skin fold thickness of 44, and a normal plasma glucose concentration of 109 following an oral glucose tolerance test. Her 2-hour serum insulin level is 99, indicating normal insulin production. With a body mass index of 34.8, she is classified as obese. The diabetes pedigree function value of 0.905 suggests a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"This dataset represents a 22-year-old individual who has been pregnant twice. Despite having a low diastolic blood pressure of 56, they have a higher triceps skin fold thickness of 27, indicating some excess body fat. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 106, which is within the normal range. However, they have a high 2-hour serum insulin level of 165, suggesting possible insulin resistance. With a body mass index (BMI) of 29.0 and a moderate diabetes pedigree function of 0.426, this individual may have a moderate risk of developing diabetes.###\nHence this label was avoid."
"A 58-year-old individual who has been pregnant 5 times, with a diastolic blood pressure of 82. They have a triceps skin fold thickness of 26, plasma glucose concentration at 144 after a glucose tolerance test, and a 2-hour serum insulin level of 285. Their body mass index is 32.0 and their diabetes pedigree function is 0.452.###\nHence this label was consent."
"A 22-year-old individual who has been pregnant 3 times with low diastolic blood pressure and no triceps skin fold thickness. They have a normal plasma glucose concentration after a glucose tolerance test, zero insulin levels, and a healthy body mass index. Their diabetes pedigree function score is low, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"This 23-year-old patient has been pregnant 2 times and shows normal diastolic blood pressure. They have no triceps skin fold thickness or serum insulin, but their plasma glucose concentration after a glucose tolerance test is 99 mg/dL. With a low body mass index of 22.2 and a low diabetes pedigree function of 0.108, this patient shows some indications of being at low risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 37-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 32 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 144 mg/dL. She has a 2-hour serum insulin level of 0 uU/mL and a body mass index of 38.5 kg/m^2. Her diabetes pedigree function is 0.554, indicating a moderate genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 52-year-old woman who has been pregnant 13 times. She has a low diastolic blood pressure of 70 and no triceps skin fold thickness. Her glucose concentration after a GTT is 106, with no insulin present. She has a high body mass index of 34.2 and a low diabetes pedigree function of 0.251.###\nHence this label was avoid."
"This 25-year-old patient has been pregnant 5 times and shows low diastolic blood pressure at 48. They have a triceps skin fold thickness of 0, indicating very little subcutaneous fat. Their glucose concentration after a glucose tolerance test is low at 78, as well as their 2-hour serum insulin at 0. The patient has a body mass index of 33.7, suggesting they may be overweight. Their diabetes pedigree function is 0.654, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 40-year-old individual who has been pregnant 9 times with a diastolic blood pressure of 80. This person has a triceps skin fold thickness of 46, plasma glucose concentration of 145, and 2-hour serum insulin level of 130. Their body mass index is 37.9, and they have a diabetes pedigree function value of 0.637. Overall, this individual's medical data indicates a risk for developing diabetes.###\nHence this label was consent."
"The individual is 42 years old and has been pregnant 13 times. They have normal diastolic blood pressure of 90 and no triceps skin fold thickness. Their glucose level after a meal is 126, with no insulin present. They have a high body mass index of 43.4 and a moderate diabetes pedigree function of 0.583.###\nHence this label was consent."
"A 45-year-old woman who has been pregnant 7 times shows normal diastolic blood pressure and a slightly elevated triceps skin fold thickness. Her glucose levels are within the normal range after a 2-hour oral glucose tolerance test, while her insulin levels are slightly higher. She has a high body mass index and a low diabetes pedigree function score, indicating a moderate risk of developing diabetes.###\nHence this label was avoid."
"The individual is a 22-year-old woman who is not currently pregnant. She has normal diastolic blood pressure and a moderately high triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within normal range, and she has no insulin present in her serum. Her body mass index indicates that she is overweight. Overall, based on these measurements, she is at low risk for developing diabetes.###\nHence this label was consent."
"This patient is 21 years old and has never been pregnant. They have normal diastolic blood pressure and triceps skin fold thickness of 0. Their glucose level after a 2-hour oral test is 132, with no serum insulin detected. They have a body mass index of 32.4 and a low diabetes pedigree function of 0.393.###\nHence this label was avoid."
"This data belongs to a 25-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 74 and a triceps skin fold thickness of 30. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 112. The individual has a 2-hour serum insulin level of 0 and a body mass index of 31.6. Their diabetes pedigree function value is 0.197.###\nHence this label was consent."
"This 37-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 80. They have a triceps skin fold thickness of 32, a plasma glucose concentration of 0 after a 2-hour oral glucose tolerance test, and 0 serum insulin level. Their body mass index is 41.0 and they have a diabetes pedigree function value of 0.346.###\nHence this label was consent."
"A 26-year-old individual has been pregnant 5 times and shows a diastolic blood pressure of 64 mmHg. Their triceps skin fold thickness measures 35 mm. During an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 139 mg/dL. The 2-hour serum insulin level is 140 mu U/ml. With a body mass index of 28.6, the individual has a low diabetes pedigree function score of 0.411.###\nHence this label was avoid."
"The 25-year-old patient, who has been pregnant twice, shows fairly normal values in most diagnostic measurements. However, there are some slightly elevated figures such as blood pressure and body mass index. Overall, the data suggests a moderate risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 38-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 0 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120 mg/dL, while her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 30.0 kg/m² and a diabetes pedigree function of 0.183.###\nHence this label was consent."
"The patient is a 48-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 72, triceps skin fold thickness of 22, and a plasma glucose concentration of 120 after a glucose tolerance test. Her 2-hour serum insulin level is 56, and she has a body mass index of 20.8. Additionally, her diabetes pedigree function is 0.733.###\nHence this label was avoid."
"This data belongs to a 23-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 34, and a plasma glucose concentration of 89 after a glucose tolerance test. Her 2-hour serum insulin level is 37, her body mass index is 31.2, and her diabetes pedigree function is 0.192.###\nHence this label was avoid."
"The patient is a 29-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin level of 0. Her plasma glucose concentration after a GTT is 115, and she has a body mass index of 35.3. The diabetes pedigree function value is low at 0.134.###\nHence this label was avoid."
"The patient is a 53-year-old female who has been pregnant twice. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 45 mm. Her plasma glucose concentration is 197 mg/dL after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 543 μU/ml. She has a body mass index of 30.5 and a low diabetes pedigree function score of 0.158.###\nHence this label was consent."
"The patient is a 42-year-old woman who has been pregnant 7 times. She has a low diastolic blood pressure of 66 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 114, with a fasting serum insulin level of 0. Her body mass index is 32.8, indicating overweight. The diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was consent."
"This 58-year-old individual has been pregnant 8 times and has a diastolic blood pressure of 90. Their triceps skin fold thickness is 34, plasma glucose concentration after a glucose tolerance test is 176, and 2-hour serum insulin level is 300. They have a body mass index of 33.7 and a diabetes pedigree function of 0.467.###\nHence this label was consent."
"A 25-year-old woman with 2 pregnancies shows normal diastolic blood pressure, a high triceps skin fold thickness, average glucose levels after a glucose tolerance test, moderate insulin levels, high body mass index, and a slightly elevated diabetes risk based on her pedigree.###\nHence this label was avoid."
"The patient is a 22-year-old female who is 1 time pregnant and has a low diastolic blood pressure of 60. She has no triceps skin fold thickness and a moderate plasma glucose concentration of 151 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is at 0, indicating potential risk of diabetes. Additionally, she has a body mass index of 26.1 and a relatively low diabetes pedigree function of 0.179.###\nHence this label was avoid."
"The individual is 34 years old, has been pregnant 10 times, and has a diastolic blood pressure of 98. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 115, and a 2-hour serum insulin level of 0. Their body mass index is 24.0 and their diabetes pedigree function is 1.022.###\nHence this label was avoid."
"This individual is a young adult female who is 26 years old and has been pregnant once. She has a unusually low diastolic blood pressure of 50 mmHg. Her triceps skin fold thickness is 15mm, indicating a relatively normal amount of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test (GTT) is 101 mg/dL, which falls within the normal range. She has a moderate insulin level of 36 µU/mL. With a body mass index of 24.2, she is considered to be in the healthy weight range. Her diabetes pedigree function value is 0.526, suggesting a moderate genetic predisposition to diabetes. Overall, based on these measurements, she appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 34-year-old female who has been pregnant twice. She has a diastolic blood pressure of 64, triceps skin fold thickness of 35, and a plasma glucose concentration of 106 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 119 μU/mL, and she has a body mass index of 30.5. Additionally, her diabetes pedigree function score is 1.4.###\nHence this label was avoid."
