"This individual is 72 years old and has been pregnant twice. They show normal diastolic blood pressure and have no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 119, with no serum insulin measured at 2 hours. Their body mass index is 19.6, indicating they are underweight. The diabetes pedigree function suggests a moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is 29 years old and has been pregnant 10 times. They have a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. Their plasma glucose concentration after a glucose tolerance test is 115. With a body mass index of 35.3 and a low diabetes pedigree function of 0.134, the patient shows potential signs of diabetes risk but also some unusual values that may require further investigation.###\nHence this label was No."
"The patient is a 26-year-old female who is slightly overweight with a body mass index of 24.2. She has been pregnant once and has a diastolic blood pressure of 50. Her triceps skin fold thickness is 15, and her plasma glucose concentration after a glucose tolerance test is 101. She has a relatively low insulin level of 36, and her diabetes pedigree function is 0.526.###\nHence this label was No."
"The patient is a 66-year-old woman who has been pregnant 6 times. She has normal diastolic blood pressure and no triceps skin fold thickness. Her glucose levels are within normal range at 114 mg/dL, and she has no insulin resistance. With a body mass index of 27.8, she is considered overweight. Her diabetes pedigree function score is low at 0.247, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"This data belongs to a 33-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 78, triceps skin fold thickness of 34, and a plasma glucose concentration of 152 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 171, and they have a body mass index of 34.2. The diabetes pedigree function for this individual is 0.893.###\nHence this label was Yes."
"This individual is a 37-year-old woman who has been pregnant 6 times. She has a normal diastolic blood pressure of 70 and a slightly elevated triceps skin fold thickness of 32. Her glucose levels are within the normal range at 105, and she has a moderate insulin level of 68. With a body mass index of 30.8, she is considered overweight. Her diabetes pedigree function is low at 0.122, indicating a relatively lower risk of developing diabetes based on her family history.###\nHence this label was No."
"The patient is a 44-year-old woman who has been pregnant 12 times. She has a normal diastolic blood pressure of 80. Her triceps skin fold thickness is 0, indicating low body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106, which is within the normal range. She has no detectable serum insulin after 2 hours. Her body mass index is 23.6, which is considered healthy. The diabetes pedigree function score is 0.137, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 39-year-old woman who has been pregnant 7 times. She has low diastolic blood pressure (54 mmHg) and a moderate triceps skin fold thickness of 32 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is elevated at 160 mg/dL. She also has a high 2-hour serum insulin level of 175 μU/mL. Despite having a slightly elevated body mass index of 30.5, her diabetes pedigree function is relatively low at 0.588.###\nHence this label was Yes."
"This patient is 35 years old and has been pregnant 11 times. Their diastolic blood pressure is 76, and triceps skin fold thickness is 0. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 138. They have no 2-hour serum insulin. The patient's body mass index is 33.2, and their diabetes pedigree function is 0.42.###\nHence this label was No."
"The patient is a 40-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 44. Her plasma glucose concentration after a glucose tolerance test is 123, and her 2-hour serum insulin level is 94. She has a body mass index of 33.1 and a diabetes pedigree function of 0.374.###\nHence this label was No."
"The patient is a 41-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 85, a triceps skin fold thickness of 33, and a plasma glucose concentration of 140 after a GTT. Her 2-hour serum insulin level is 0, and she has a body mass index of 37.4. The diabetes pedigree function for this patient is 0.244.###\nHence this label was No."
"The individual is a 54-year-old who has been pregnant 9 times. They have a diastolic blood pressure of 110 mmHg and a triceps skin fold thickness of 24 mm. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 171 mg/dL. The 2-hour serum insulin level is 240 μU/mL. They have a body mass index of 45.4 and a diabetes pedigree function value of 0.721.###\nHence this label was Yes."
"The patient is a 37-year-old woman who has been pregnant five times. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 130. She has no insulin in her serum after 2 hours. Her body mass index is 39.1, indicating obesity. The diabetes pedigree function score is 0.956, suggesting a high likelihood of diabetes in her family.###\nHence this label was Yes."
"This data describes a 43-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 106 mmHg and a triceps skin fold thickness of 46 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 167 mg/dL, and their 2-hour serum insulin level is 231 μU/ml. With a body mass index of 37.6, they have a diabetes pedigree function of 0.165.###\nHence this label was Yes."
"This is a data entry of a 25-year-old individual with 3 pregnancies. Their diastolic blood pressure is 70, triceps skin fold thickness is 0, and plasma glucose concentration after a glucose tolerance test is 82. Their 2-hour serum insulin level is 0, and their body mass index is 21.1. The diabetes pedigree function is 0.389.###\nHence this label was No."
"This 29-year-old patient has been pregnant 2 times and has a diastolic blood pressure of 70. Their triceps skin fold thickness is 38, plasma glucose concentration after a GTT is 146, and 2-hour serum insulin is 360. With a body mass index of 28.0 and a diabetes pedigree function of 0.337, this patient's risk of developing diabetes may be of concern.###\nHence this label was Yes."
"A 23-year-old female, who is pregnant for the first time, with normal diastolic blood pressure and low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is low, accompanied by high serum insulin levels. She has a low body mass index and a relatively low diabetes pedigree function score.###\nHence this label was No."
"A 29-year-old woman who has never been pregnant has normal diastolic blood pressure, no triceps skin fold thickness, and no insulin levels. Her plasma glucose concentration after a glucose tolerance test is elevated at 141, and she has a high body mass index of 42.4. Despite her family history of diabetes, her diabetes pedigree function is relatively low at 0.205.###\nHence this label was Yes."
"A 35-year-old individual who has been pregnant 5 times with slightly elevated diastolic blood pressure, moderate triceps skin fold thickness, and a normal plasma glucose concentration after a 2-hour glucose tolerance test. Their insulin levels are within the normal range, while their body mass index indicates obesity. The diabetes pedigree function score suggests a low genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 39-year-old female who has been pregnant 6 times. Despite having a relatively low diastolic blood pressure of 74, she has a high triceps skin fold thickness of 32, indicating excess body fat. Her plasma glucose concentration after a glucose tolerance test is elevated at 154, suggesting possible diabetes. Additionally, her 2-hour serum insulin level is high at 193. Despite having a body mass index of 29.3, which is considered overweight, her diabetes pedigree function is moderately high at 0.839, indicating a genetic predisposition to diabetes.###\nHence this label was No."
"A 25-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 80, triceps skin fold thickness of 35, plasma glucose concentration of 139, 2-hour serum insulin level of 160, and a body mass index of 31.6. The diabetes pedigree function is 0.361.###\nHence this label was Yes."
"This individual is a 25-year-old female who has never been pregnant. Her diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin levels are all at 0. She has a normal plasma glucose concentration of 94 mg/dL. Her body mass index is 0.0, indicating that she may be underweight. The diabetes pedigree function score is 0.256, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"This 22-year-old patient, who is pregnant for the first time, has a healthy diastolic blood pressure of 70 and a slightly above-average body mass index of 34.2. Their triceps skin fold thickness is 28, indicating a moderate amount of subcutaneous fat. Despite having a normal plasma glucose concentration of 106, their 2-hour serum insulin level is high at 135. The patient has a low diabetes pedigree function score of 0.142, suggesting a lower genetic predisposition to diabetes.###\nHence this label was No."
"This individual, a 22-year-old, has been pregnant 4 times and shows normal diastolic blood pressure. They have a low triceps skin fold thickness and a moderately high plasma glucose concentration following an oral glucose tolerance test. Their 2-hour serum insulin level is low. Despite having a high body mass index, their diabetes pedigree function indicates a moderate genetic risk for developing diabetes.###\nHence this label was Yes."
"This individual, a 22-year-old female, has been pregnant 8 times and has a diastolic blood pressure of 86. She has no triceps skin fold thickness and her 2-hour serum insulin level is 0. Her plasma glucose concentration after a glucose tolerance test is 120 mg/dL. With a body mass index of 28.4 and a diabetes pedigree function of 0.259, she may be at risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 35-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85 mg/dL, and her 2-hour serum insulin level is 0 µU/mL. She has a body mass index of 30.1, and her diabetes pedigree function is 0.3.###\nHence this label was No."
"The patient is a 45-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 154 and she has a 2-hour serum insulin level of 100. Her body mass index is 30.9 and her diabetes pedigree function is 0.164.###\nHence this label was No."
"This data describes a 22-year-old individual who has never been pregnant and has a diastolic blood pressure of 82. They have a triceps skin fold thickness of 14, a high plasma glucose concentration of 188 after a glucose tolerance test, and a 2-hour serum insulin level of 185. Their body mass index is 32.0 and their diabetes pedigree function is 0.682.###\nHence this label was Yes."
"This individual is 24 years old and has been pregnant 3 times. Their diastolic blood pressure is 74 mmHg and triceps skin fold thickness is 15 mm. They have a plasma glucose concentration of 116 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 105 μU/mL. They have a body mass index of 26.3 and a diabetes pedigree function value of 0.107.###\nHence this label was No."
"The patient is a 33-year-old individual who has been pregnant once. They have a diastolic blood pressure of 98 and a triceps skin fold thickness of 41. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 128, with a 2-hour serum insulin level of 58. The patient has a body mass index of 32.0 and a diabetes pedigree function of 1.321.###\nHence this label was Yes."
"The patient is a 21-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 78 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 90, and she has normal 2-hour serum insulin levels at 0. Despite having a high body mass index of 42.7, her diabetes pedigree function is relatively low at 0.559.###\nHence this label was No."
"The patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 90 and a high plasma glucose concentration of 196 after a glucose tolerance test. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0. She has a high body mass index of 39.8 and a relatively low diabetes pedigree function of 0.451.###\nHence this label was Yes."
"The patient is a 28-year-old female who has been pregnant twice. She has normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 146, and her 2-hour serum insulin level is normal. She has a healthy body mass index of 27.5 and a low diabetes pedigree function of 0.24. Overall, the patient shows some signs of a healthy lifestyle with normal glucose levels, blood pressure, and insulin levels.###\nHence this label was Yes."
"The patient is a 22-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 58 and a moderately low triceps skin fold thickness of 18. Her plasma glucose concentration at 2 hours is 109 mg/dL, and her 2-hour serum insulin level is 116 μU/mL. She has a body mass index of 28.5, indicating she is overweight. The diabetes pedigree function score is 0.219, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"This is a data record of a 28-year-old individual who is pregnant for the first time. She has normal diastolic blood pressure and a low triceps skin fold thickness. Her glucose concentration after a meal is normal, but her insulin levels are slightly elevated. She has a low body mass index and a low diabetes pedigree function score. Overall, the data indicates a relatively low risk for developing diabetes.###\nHence this label was No."
"A 37-year-old individual who has been pregnant 4 times shows a low diastolic blood pressure of 58 and a moderately low triceps skin fold thickness of 28. Their plasma glucose concentration after a GTT is 144, with a relatively high 2-hour serum insulin level of 140. They have a body mass index of 29.5 and a diabetes pedigree function of 0.287. These values indicate a potential risk for developing diabetes and may require further monitoring and intervention.###\nHence this label was No."
"This data represents a 26-year-old individual who has been pregnant 3 times. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 33, and a plasma glucose concentration of 124 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130, and she has a body mass index of 33.2. The diabetes pedigree function value is 0.305.###\nHence this label was No."
"This is a medical dataset of a 22-year-old individual who is pregnant for the first time. They have a low diastolic blood pressure of 60 and no triceps skin fold thickness. However, their plasma glucose concentration after a 2-hour GTT is relatively high at 151. The individual has no serum insulin after 2 hours, a body mass index of 26.1, and a relatively low diabetes pedigree function score of 0.179.###\nHence this label was No."
"This individual, a 45-year-old female, has been pregnant once. She has a diastolic blood pressure of 94 mmHg and a BMI of 32.8, indicating she may be overweight. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0, which could suggest low muscle mass and insulin sensitivity. With a plasma glucose concentration of 111 mg/dL and a diabetes pedigree function of 0.265, she shows some risk factors for developing diabetes in the future.###\nHence this label was No."
"This patient is a 22-year-old who has never been pregnant. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 40. Her plasma glucose concentration at 2 hours is 131, with a 2-hour serum insulin level of 0. Despite having a body mass index of 34.3, her diabetes pedigree function is low at 0.196.###\nHence this label was Yes."
"The patient is a 39-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 74, triceps skin fold thickness of 31, and a plasma glucose concentration of 84 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 38.3. The diabetes pedigree function for this patient is 0.457. Based on these measurements, the patient may be at risk for developing diabetes.###\nHence this label was No."
"The patient is a 48-year-old individual who has been pregnant 9 times. They have a normal diastolic blood pressure of 72 and a lower than average triceps skin fold thickness of 22. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 120, and their 2-hour serum insulin level is 56. Despite a low body mass index of 20.8, their diabetes pedigree function suggests a moderate genetic risk for developing diabetes.###\nHence this label was No."
"This 50-year-old individual with a history of 7 pregnancies has a diastolic blood pressure of 90. They have a triceps skin fold thickness of 0, indicating low subcutaneous fat. Their glucose level after a GTT is 136, despite having no insulin present. With a body mass index of 29.9 and a low diabetes pedigree function of 0.21, this person may have a low risk of developing diabetes.###\nHence this label was No."
"This is a 54-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 96 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 125. Their 2-hour serum insulin level is 0, and they have a body mass index of 0.0. The diabetes pedigree function value is 0.232.###\nHence this label was Yes."
"A 34-year-old woman who has been pregnant 6 times shows normal diastolic blood pressure of 72. She has a relatively high triceps skin fold thickness of 45, indicating excess body fat. Her plasma glucose concentration after a glucose tolerance test is 123, and she has high insulin levels at 230. With a body mass index of 33.6, she is categorized as obese. Her diabetes pedigree function score is 0.733, suggesting a moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is a 31-year-old woman who has been pregnant 6 times. She has a normal diastolic blood pressure of 70 and a low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is high at 195, with no significant insulin response. She has a slightly elevated body mass index of 30.9 and a low diabetes pedigree function score of 0.328.###\nHence this label was Yes."
"The individual in this data is a 67-year-old who has never been pregnant. They have a very low diastolic blood pressure of 60 and minimal triceps skin fold thickness of 0. Their plasma glucose concentration is extremely low at 57, and they have no insulin present in their blood after a 2-hour oral glucose tolerance test. Despite their low body mass index of 21.7, they have a moderate diabetes pedigree function of 0.735.###\nHence this label was No."
"This is a 23-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure (58), moderate triceps skin fold thickness (36), and normal plasma glucose concentration (118). Her 2-hour serum insulin is elevated (94), indicating possible insulin resistance. She has a slightly high body mass index (33.3) and a low diabetes pedigree function (0.261), suggesting a low genetic risk for diabetes development.###\nHence this label was No."
"This patient is a 21-year-old female who has never been pregnant. She has a low diastolic blood pressure of 60 and a high triceps skin fold thickness of 29. Her plasma glucose concentration after a glucose tolerance test is elevated at 177, and she also has a high 2-hour serum insulin level of 478. Her body mass index is 34.6, indicating that she is overweight. The diabetes pedigree function value is 1.072, suggesting a moderate genetic predisposition to diabetes. Overall, the data indicates a potential risk for developing diabetes due to the high glucose and insulin levels, elevated BMI, and genetic factors.###\nHence this label was Yes."
"The data belongs to a 32-year-old individual who has been pregnant 4 times. They have a low diastolic blood pressure of 75 and triceps skin fold thickness of 0. Their plasma glucose concentration after a meal is 156, while their 2-hour serum insulin level is 0. Despite having a high body mass index of 48.3, their diabetes pedigree function is relatively low at 0.238.###\nHence this label was Yes."
"A 24-year-old individual who has been pregnant twice with a diastolic blood pressure of 64, triceps skin fold thickness of 42, plasma glucose concentration of 128 after a glucose tolerance test, no insulin after 2 hours, a body mass index of 40.0, and a diabetes pedigree function value of 1.101.###\nHence this label was No."
"This 21-year-old individual is pregnant for the first time and has a diastolic blood pressure of 66. Their triceps skin fold thickness is 23mm, and their plasma glucose concentration after a glucose tolerance test is 89mg/dL. They have a 2-hour serum insulin level of 94mu U/ml and a body mass index of 28.1. With a low diabetes pedigree function score of 0.167, this individual shows some risk factors associated with developing diabetes.###\nHence this label was No."
"This 24-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 70. Their triceps skin fold thickness is 32, plasma glucose concentration after a glucose tolerance test is 95, and 2-hour serum insulin is 0. With a body mass index of 32.1 and a diabetes pedigree function of 0.612, this person's risk of developing diabetes may be relatively low.###\nHence this label was No."
"The patient is a 23-year-old female who has been pregnant 4 times. She has normal diastolic blood pressure, zero triceps skin fold thickness, and no 2-hour serum insulin. Her plasma glucose concentration after a glucose tolerance test is 132, and her body mass index is 32.9, indicating obesity. The diabetes pedigree function is 0.302, suggesting a low genetic risk of diabetes.###\nHence this label was Yes."
"This data represents a 21-year-old individual who has been pregnant 4 times. Their diastolic blood pressure is 65, triceps skin fold thickness is 22, and plasma glucose concentration after a glucose tolerance test is 94. They have no insulin in their blood after a 2-hour period, and their body mass index is 24.7. The diabetes pedigree function for this individual is 0.148.###\nHence this label was No."
"The patient is a 41-year-old woman who has been pregnant 9 times. She has a slightly low diastolic blood pressure of 80, and her triceps skin fold thickness is 37mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 57, and she has no serum insulin present. Despite a relatively high body mass index of 32.8, her diabetes pedigree function is low at 0.096.###\nHence this label was No."
"This 28-year-old individual has been pregnant 3 times, with a diastolic blood pressure of 68 and a triceps skin fold thickness of 23. Their plasma glucose concentration after a glucose tolerance test is 100, with a 2-hour serum insulin level of 81. They have a body mass index of 31.6 and a diabetes pedigree function of 0.949.###\nHence this label was No."
"This 29-year-old individual has been pregnant 4 times and has a low diastolic blood pressure of 66. They have no triceps skin fold thickness and a normal plasma glucose concentration of 110 after a glucose tolerance test. Their 2-hour serum insulin level is 0, indicating normal insulin levels. With a body mass index of 31.9, they are classified as obese. The diabetes pedigree function value of 0.471 suggests a low genetic risk of diabetes.###\nHence this label was No."
"The patient is a 31-year-old female who is pregnant for the first time. She has a healthy diastolic blood pressure of 66 and a slightly below average triceps skin fold thickness of 29. Her plasma glucose concentration after a glucose tolerance test is normal at 85. There is no insulin detected in her blood after a 2-hour test. She has a body mass index of 26.6, which falls into the overweight category. The diabetes pedigree function score is low at 0.351, indicating a lower risk of developing diabetes based on family history.###\nHence this label was No."
"This 27-year-old individual has been pregnant 3 times and has a diastolic blood pressure of 88. They have a triceps skin fold thickness of 41, a plasma glucose concentration of 126 after a glucose tolerance test, and a 2-hour serum insulin level of 235. With a body mass index of 39.3 and a diabetes pedigree function of 0.704, this individual's risk of developing diabetes may be higher.###\nHence this label was No."
"This data belongs to a 25-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 70, a triceps skin fold thickness of 52, and a plasma glucose concentration of 100 after a glucose tolerance test. Their 2-hour serum insulin level is 57, and their body mass index is 40.5. The diabetes pedigree function value for this individual is 0.677.###\nHence this label was No."
"This patient is 30 years old and has been pregnant 5 times. They have a low diastolic blood pressure of 54 and a moderate triceps skin fold thickness of 28. Their glucose tolerance test result is normal at 99, but they have a higher than average insulin level of 83. Despite this, their body mass index is in the obese range at 34.0. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.499.###\nHence this label was No."
"The individual in the dataset is a 43-year-old woman who has been pregnant 7 times. Her diastolic blood pressure is 80, triceps skin fold thickness is 31, and plasma glucose concentration after a glucose tolerance test is 109. She has no detectable serum insulin after 2 hours. Her body mass index is 35.9, and her diabetes pedigree function is 1.127.###\nHence this label was Yes."
"This 24-year-old individual has never been pregnant and has a healthy diastolic blood pressure of 85. Their triceps skin fold thickness is 54, which indicates a normal amount of subcutaneous fat. After a glucose tolerance test, their plasma glucose concentration at 2 hours is 147. They have no insulin detected in their serum after 2 hours. With a body mass index of 42.8, this individual is considered obese. The diabetes pedigree function score is 0.375, suggesting a mild genetic predisposition to diabetes.###\nHence this label was No."
"This data belongs to a 25-year-old individual who has been pregnant once. Their diastolic blood pressure is within normal range at 72, while their triceps skin fold thickness is moderate at 30. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 112, indicating a normal level. There is higher-than-average 2-hour serum insulin level at 176. The individual's body mass index is 34.4, which falls in the obese category. The diabetes pedigree function value is 0.528, suggesting a mild genetic predisposition to diabetes.###\nHence this label was No."
"A 21-year-old woman who is pregnant for the first time has a diastolic blood pressure of 64. She has a triceps skin fold thickness of 27, a plasma glucose concentration of 96 after a glucose tolerance test, and a 2-hour serum insulin level of 87. Her body mass index is 33.2, and her diabetes pedigree function is 0.289.###\nHence this label was No."
"A 22-year-old woman, who has been pregnant twice, shows low diastolic blood pressure, moderate triceps skin fold thickness, low glucose concentration after an oral glucose tolerance test, average 2-hour serum insulin levels, normal body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was No."
"This 22-year-old individual, who is pregnant for the first time, has a diastolic blood pressure of 82. Their triceps skin fold thickness is 17, with a glucose concentration of 128 after a GTT. Their 2-hour serum insulin level is 183, and they have a body mass index of 27.5. The diabetes pedigree function value is 0.115.###\nHence this label was No."
"This individual is 38 years old and has been pregnant 13 times. They have a normal diastolic blood pressure of 72 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 104, with no insulin present. They have a body mass index of 31.2 and a relatively low diabetes pedigree function value of 0.465.###\nHence this label was Yes."
"A 24-year-old individual who has never been pregnant has a slightly elevated diastolic blood pressure of 84. They have a moderate amount of triceps skin fold thickness at 29mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range at 126mg/dL. However, their 2-hour serum insulin level is relatively high at 215mu U/ml. With a body mass index of 30.7, they are classified as obese. Their diabetes pedigree function score is 0.52, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"This 23-year-old individual, who has been pregnant once, has a relatively low diastolic blood pressure of 62. Their triceps skin fold thickness is moderately low at 24, while their plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 88. The 2-hour serum insulin level is 44, indicating good insulin sensitivity. With a body mass index of 29.9, they are considered overweight. The diabetes pedigree function score is 0.422, suggesting a low genetic predisposition to diabetes.###\nHence this label was No."
"This 28-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 72. Their triceps skin fold thickness is 17, and their plasma glucose concentration after a glucose tolerance test is 99. They have a 2-hour serum insulin level of 0 and a body mass index of 25.6. Their diabetes pedigree function is 0.294.###\nHence this label was No."
"The individual is a 33-year-old who has never been pregnant. She has low diastolic blood pressure (40) and a moderately thick triceps skin fold (35). Her blood sugar level after a 2-hour oral glucose tolerance test is within normal range at 137. However, she has high insulin levels (168), a high body mass index (43.1), and a relatively high diabetes pedigree function score (2.288), indicating a potential risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 22-year-old who has never been pregnant. They have a low diastolic blood pressure of 65 and a normal triceps skin fold thickness of 28. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 101, and their insulin level is low at 0. The patient has a healthy body mass index of 24.6 and a low diabetes pedigree function score of 0.237.###\nHence this label was No."
"The individual in this dataset is a 23-year-old who has never been pregnant. Their diastolic blood pressure is low at 60, and their triceps skin fold thickness is within a normal range at 25. The plasma glucose concentration after a glucose tolerance test is 107, indicating a healthy blood sugar level. Their 2-hour serum insulin level is 0, which could suggest good insulin sensitivity. The individual has a body mass index of 26.4, which is considered overweight but not obese. Their diabetes pedigree function score is low at 0.133, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"This patient is a 21-year-old female who has been pregnant twice. She has a diastolic blood pressure of 62 mmHg and a triceps skin fold thickness of 32 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 108 mg/dL and her 2-hour serum insulin level is 56 μU/mL. With a body mass index of 25.2, she has a low risk of developing diabetes, as indicated by her diabetes pedigree function of 0.128.###\nHence this label was No."
"This is a medical dataset of a 55-year-old individual who has been pregnant 3 times. They have a normal diastolic blood pressure of 78 and no triceps skin fold thickness. Their glucose level after a 2-hour oral glucose tolerance test is 128, with no insulin present. The individual has a low body mass index of 21.1 and a relatively low diabetes pedigree function of 0.268.###\nHence this label was No."
"The patient is a 50-year-old female who is 8 times pregnant. Her diastolic blood pressure is 84, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. She has a plasma glucose concentration of 99 after an oral glucose tolerance test. Her body mass index is 35.4 and her diabetes pedigree function is 0.388.###\nHence this label was No."
"A 37-year-old individual who has been pregnant 4 times, with a diastolic blood pressure of 82, triceps skin fold thickness of 32, plasma glucose concentration of 144 after a glucose tolerance test, no insulin levels after 2 hours, a body mass index of 38.5, and a diabetes pedigree function of 0.554.###\nHence this label was Yes."
"A 21-year-old individual who has been pregnant four times shows normal diastolic blood pressure and a healthy body mass index. Their triceps skin fold thickness is on the lower side, indicating lower body fat levels. With a good plasma glucose concentration and moderate insulin levels, the individual has a low risk of developing diabetes, supported by a low diabetes pedigree function score.###\nHence this label was No."
"A 52-year-old individual who has been pregnant 13 times with low diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 106, with no 2-hour serum insulin present. They have a body mass index of 34.2 and a diabetes pedigree function of 0.251.###\nHence this label was No."
"The patient is a 24-year-old female who has been pregnant 5 times. She has a healthy diastolic blood pressure of 68 and a normal triceps skin fold thickness of 28. Her plasma glucose concentration after a 2-hour glucose tolerance test is 86, and her 2-hour serum insulin level is 71. She has a body mass index of 30.2, indicating she is overweight. Her diabetes pedigree function score is 0.364, suggesting a moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is a 25-year-old female who is relatively young and has been pregnant twice. \nShe has a very low diastolic blood pressure of 60, which is below the normal range. \nHer triceps skin fold thickness is 0, indicating very little body fat in that area. \nThe plasma glucose concentration at 2 hours is 90, which is within the normal range. \nHer 2-hour serum insulin level is 0, which is unusually low. \nWith a body mass index of 23.5, she is considered to be in the normal weight range. \nHer diabetes pedigree function is 0.191, suggesting a low genetic risk of developing diabetes.###\nHence this label was No."
"A 62-year-old woman who has been pregnant once has unusually low diastolic blood pressure, no triceps skin fold thickness, and zero insulin levels. Her plasma glucose concentration after a glucose tolerance test is within normal range. She has a healthy body mass index and a moderately low diabetes pedigree function score.###\nHence this label was No."
"The data describes a 32-year-old individual who has been pregnant 9 times. She has a diastolic blood pressure of 84 and a triceps skin fold thickness of 21. Her plasma glucose concentration after a glucose tolerance test is 164, while her 2-hour serum insulin level is 0. She has a body mass index of 30.8 and a diabetes pedigree function value of 0.831.###\nHence this label was Yes."
"A 37-year-old woman who has been pregnant 3 times shows low diastolic blood pressure of 76 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration is at a normal level of 150 after a 2-hour oral glucose tolerance test. She has no insulin in her blood after 2 hours. With a body mass index of 21.0 and a relatively low diabetes pedigree function score of 0.207, this individual appears to have a low risk of developing diabetes.###\nHence this label was No."
"A 29-year-old woman who has been pregnant 6 times shows normal diastolic blood pressure and a low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range. She has no insulin in her serum and has a healthy body mass index. Her diabetes pedigree function score is low, indicating a lower risk of developing diabetes.###\nHence this label was Yes."
"A 22-year-old woman, who is pregnant for the first time, has below-normal diastolic blood pressure and normal triceps skin fold thickness. However, her plasma glucose concentration at 2 hours in an oral glucose tolerance test is unusually low, as is her 2-hour serum insulin level. Despite these factors, her body mass index is within the normal range. The diabetes pedigree function score is low, suggesting a lower risk of developing diabetes.###\nHence this label was No."
"The individual is a 28-year-old, who has been pregnant 4 times. Their diastolic blood pressure is 60. They have a triceps skin fold thickness of 32, a plasma glucose concentration of 95, and 2-hour serum insulin level of 0. Their body mass index is 35.4, and they have a diabetes pedigree function value of 0.284.###\nHence this label was No."
"The patient is a 45-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 100 and a triceps skin fold thickness of 36. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 105. The patient's 2-hour serum insulin level is 0, and her body mass index is 43.3. Her diabetes pedigree function is 0.239.###\nHence this label was Yes."
"A 59-year-old individual with 6 previous pregnancies shows normal diastolic blood pressure and no triceps skin fold thickness. They have a high glucose concentration of 194 after a 2-hour oral glucose tolerance test, with no insulin present. Despite a low body mass index of 23.5, their diabetes pedigree function is minimal at 0.129.###\nHence this label was Yes."
"This individual is a 52-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 27, and a plasma glucose concentration of 97 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 35.6. Additionally, her diabetes pedigree function is 0.378.###\nHence this label was Yes."
"The patient is a 23-year-old female who has never been pregnant. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 37 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 127 mg/dL, and her 2-hour serum insulin level is 210 μU/mL. With a body mass index of 36.3, she has a moderate risk of developing diabetes based on her diabetes pedigree function of 0.804.###\nHence this label was No."
"The patient is a 49-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 68 mmHg, a triceps skin fold thickness of 26 mm, and a body mass index of 33.6. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 165 mg/dL, and her 2-hour serum insulin level is 168 μU/ml. Her diabetes pedigree function score is 0.631. These measurements suggest that the patient may be at risk for developing diabetes.###\nHence this label was No."
"The patient is a 21-year-old female who has been pregnant twice. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 19 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 117 mg/dL, and her 2-hour serum insulin level is 71 µU/mL. With a body mass index of 25.2, she has a low risk of developing diabetes according to the diabetes pedigree function of 0.313.###\nHence this label was No."
"The patient is a 53-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 88, a triceps skin fold thickness of 34, and a plasma glucose concentration of 145 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 165, and she has a body mass index of 30.3. The diabetes pedigree function is 0.771.###\nHence this label was Yes."
"The patient is a 58-year-old female who has been pregnant 8 times. She has slightly elevated diastolic blood pressure at 90 mmHg and a healthy triceps skin fold thickness of 34 mm. Her plasma glucose concentration after a glucose tolerance test is high at 176 mg/dL, and she has a high 2-hour serum insulin level of 300 mu U/ml. Despite this, her body mass index is in the overweight range at 33.7, and her diabetes pedigree function suggests a low genetic risk for diabetes at 0.467.###\nHence this label was Yes."
"The patient is a 21-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 58 and a low triceps skin fold thickness of 10. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 99, and her 2-hour serum insulin level is 0. The patient has a healthy body mass index of 25.4 and a relatively low diabetes pedigree function score of 0.551. Overall, this patient appears to have a low risk of developing diabetes based on the provided diagnostic measurements.###\nHence this label was No."
"The patient is a 21-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 66 mmHg and a triceps skin fold thickness of 36 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 114 mg/dL, and her 2-hour serum insulin level is 200 uIU/mL. She has a body mass index of 38.1 and a low diabetes pedigree function of 0.289. Overall, she demonstrates some risk factors for developing diabetes, such as high insulin levels and elevated BMI.###\nHence this label was No."
"This individual is a 26-year-old who has never been pregnant. They have a diastolic blood pressure of 76 and a triceps skin fold thickness of 36. Their plasma glucose concentration after a two-hour oral glucose tolerance test is 162. They have no serum insulin after two hours. With a body mass index of 49.6 and a diabetes pedigree function of 0.364, this individual's risk for developing diabetes may be elevated.###\nHence this label was Yes."
"This patient is a 50-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 0mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 147 mg/dL. She has no detectable 2-hour serum insulin level. Her body mass index is 29.5, indicating she is overweight. The diabetes pedigree function for this patient is 0.178, suggesting a low genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 42-year-old woman who has been pregnant 8 times. She has very low diastolic blood pressure of 55, and a relatively low triceps skin fold thickness of 20. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85, and she has no detectable serum insulin. Despite this, her body mass index is within the normal range at 24.4. The diabetes pedigree function indicates a low genetic predisposition for diabetes at 0.136.###\nHence this label was No."
"The individual in the data is a 40-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 27. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 111. She has no insulin in her serum after a 2-hour period. Her body mass index is 27.5 and her diabetes pedigree function is 0.141.###\nHence this label was Yes."
"This patient is a 22-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 70 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 136 mg/dL. She has no 2-hour serum insulin detected. Her body mass index is 31.2, indicating she is overweight. The diabetes pedigree function value is 1.182, suggesting a moderate genetic risk for diabetes.###\nHence this label was Yes."
"A 45-year-old individual with 5 pregnancies shows normal diastolic blood pressure and surprisingly, no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within normal range, while their insulin levels are at 0. Despite having a slightly elevated body mass index, their diabetes pedigree function is low at 0.144.###\nHence this label was No."
"This individual is a 26-year-old who has never been pregnant. They have a diastolic blood pressure of 76, a triceps skin fold thickness of 43, and a high plasma glucose concentration of 165 after a GTT. Their 2-hour serum insulin level is elevated at 255, and they have a high body mass index of 47.9. Despite these indicators, their diabetes pedigree function is low at 0.259.###\nHence this label was No."
"This individual is a 58-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 43. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 140. She has a high level of 2-hour serum insulin, measuring at 325. Her body mass index is 39.2, indicating obesity. The diabetes pedigree function score is 0.528, suggesting a moderate genetic predisposition to diabetes. Overall, this data indicates potential risk for developing diabetes due to high insulin levels, obesity, and genetic factors.###\nHence this label was Yes."
"A 32-year-old individual who has been pregnant 6 times with a diastolic blood pressure of 60, triceps skin fold thickness of 19, plasma glucose concentration of 99 after a glucose tolerance test, 2-hour serum insulin level of 54, body mass index of 26.9, and a diabetes pedigree function of 0.497.###\nHence this label was No."
"A 25-year-old woman, who has been pregnant 3 times, shows low diastolic blood pressure of 50 mmHg and a triceps skin fold thickness of 10 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 113 mg/dL, and her 2-hour serum insulin level is 85 μU/mL. With a body mass index of 29.5, she has a low diabetes pedigree function value of 0.626.###\nHence this label was No."
"This 23-year-old individual has been pregnant twice and has a diastolic blood pressure of 74. Their triceps skin fold thickness is 30, and their glucose concentration after a glucose tolerance test is 107. The 2-hour serum insulin level is 100, and they have a body mass index of 33.6. Their diabetes pedigree function is 0.404.###\nHence this label was No."
"A 22-year-old woman who has never been pregnant shows normal diastolic blood pressure and body mass index values. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is slightly elevated but her serum insulin levels are low. She has a moderate triceps skin fold thickness and a relatively low diabetes pedigree function score. Overall, she appears to be at low risk for developing diabetes based on these measurements.###\nHence this label was No."
"This individual is a 61-year-old who has been pregnant 4 times. They have a diastolic blood pressure of 92 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 146 mg/dL, with a 2-hour serum insulin level of 0 mu U/ml. They have a body mass index of 31.2 and a diabetes pedigree function of 0.539.###\nHence this label was Yes."
"A 24-year-old woman who is pregnant for the first time has a normal diastolic blood pressure and a slightly above average body mass index. She has a moderate level of triceps skin fold thickness and a high plasma glucose concentration after a glucose tolerance test, along with elevated serum insulin levels. Her diabetes pedigree function score suggests a low genetic risk for diabetes.###\nHence this label was No."
"This data belongs to a 24-year-old individual who has been pregnant 2 times. She has normal diastolic blood pressure, low triceps skin fold thickness, and average plasma glucose concentration after a 2-hour oral glucose tolerance test. She also has a moderate level of serum insulin, a healthy body mass index, and a low diabetes pedigree function score.###\nHence this label was No."
"This individual is a 25-year-old who has never been pregnant and has a low diastolic blood pressure of 78. They have a relatively high triceps skin fold thickness of 63, indicating excess body fat. Their plasma glucose concentration after a glucose tolerance test is elevated at 180, suggesting possible diabetes risk. Insulin levels after 2 hours are low at 14. Despite a high body mass index of 59.4, their diabetes pedigree function is moderate at 2.42.###\nHence this label was Yes."
"The patient is a 22-year-old female who has been pregnant 2 times. She has a healthy diastolic blood pressure of 70 and a slightly below average triceps skin fold thickness of 27. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 71. She has no serum insulin present in her body. With a body mass index of 28.0, she is considered overweight. Her diabetes pedigree function is 0.586, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 41-year-old female who has been pregnant 8 times. She has low diastolic blood pressure of 66, no triceps skin fold thickness, and a relatively high glucose concentration of 143 after a 2-hour oral glucose tolerance test. Her insulin level is also low at 0, but she has a high body mass index of 34.9. The diabetes pedigree function score is low at 0.129, indicating a lower genetic predisposition to diabetes.###\nHence this label was Yes."
"A 37-year-old woman, who has been pregnant 7 times, with a healthy diastolic blood pressure of 70. She has a moderate triceps skin fold thickness of 33, normal plasma glucose level after a GTT at 124, and high insulin levels of 215 after a 2-hour serum test. Despite this, she maintains a healthy body mass index of 25.5 and a low diabetes pedigree function of 0.161.###\nHence this label was No."
"The patient is a 22-year-old female who has never been pregnant. She has low diastolic blood pressure, high triceps skin fold thickness, and high plasma glucose concentration two hours after consuming glucose. She also has elevated serum insulin levels and a high body mass index. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was Yes."
"This is a medical dataset of a 21-year-old individual who has never been pregnant. She has a diastolic blood pressure of 90, triceps skin fold thickness of 46, and a body mass index of 42.1. Her plasma glucose concentration is 151 after a glucose tolerance test, and her 2-hour serum insulin level is 0. Her diabetes pedigree function is 0.371.###\nHence this label was Yes."
"The patient is a 33-year-old woman who has been pregnant 9 times. Her diastolic blood pressure is 62, and she has no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 89, with a 2-hour serum insulin level of 0. She has a body mass index of 22.5 and a low diabetes pedigree function of 0.142.###\nHence this label was No."
"This is a data entry of a 22-year-old individual who is 1 time pregnant and shows signs of potential diabetes risk. They have a slightly elevated diastolic blood pressure of 84, a moderately high triceps skin fold thickness of 23, and a high plasma glucose concentration of 143 after a glucose tolerance test. Their 2-hour serum insulin level is notably elevated at 310, and their body mass index is in the obese range at 42.4. Additionally, their diabetes pedigree function score is 1.076, indicating a genetic predisposition to diabetes. Overall, this individual shows multiple indicators of high risk for developing diabetes.###\nHence this label was No."
"The patient is a 39-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 0, and a plasma glucose concentration of 197 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, her body mass index is 25.9, and she has a diabetes pedigree function value of 1.191.###\nHence this label was Yes."
"The patient is a 47-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 23. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 161, and her 2-hour serum insulin level is 132. The patient has a body mass index of 25.5 and a diabetes pedigree function of 0.326. Based on these measurements, the patient's risk of developing diabetes may be assessed.###\nHence this label was Yes."
"A 28-year-old individual, who has been pregnant 4 times, with a diastolic blood pressure of 58, triceps skin fold thickness of 22, plasma glucose concentration of 85 after a glucose tolerance test, 2-hour serum insulin level of 49, and a body mass index of 27.8. Their diabetes pedigree function is 0.306.###\nHence this label was No."
"The patient is a 32-year-old female who has been pregnant 7 times. She has a diastolic blood pressure and triceps skin fold thickness of 0, indicating low values. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 100, while her 2-hour serum insulin level is 0. The patient has a body mass index of 30.0, suggesting she is overweight. Her diabetes pedigree function is 0.484, indicating a low to moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 22-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 78, a triceps skin fold thickness of 42, and a high plasma glucose concentration of 181 after a glucose tolerance test. Additionally, her 2-hour serum insulin level is 293, body mass index is 40.0, and she has a diabetes pedigree function value of 1.258.###\nHence this label was Yes."
"The patient is a 28-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 52 and a moderate triceps skin fold thickness of 43. Her plasma glucose concentration after a glucose tolerance test is 122, and her 2-hour serum insulin level is high at 158. With a body mass index of 36.2, she is considered obese. Her diabetes pedigree function is 0.816, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"The individual is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 90, a triceps skin fold thickness of 24, and a plasma glucose concentration of 142 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is high at 480. She has a body mass index of 30.4 and a low diabetes pedigree function score of 0.128.###\nHence this label was Yes."
"This 27-year-old individual, who has been pregnant twice, has a diastolic blood pressure of 74 and a triceps skin fold thickness of 17. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 155 and their 2-hour serum insulin level is 96. With a body mass index of 26.6 and a low diabetes pedigree function score of 0.433, this individual may have a relatively low risk of developing diabetes.###\nHence this label was Yes."
"This is the data of an 81-year-old individual who has been pregnant 9 times. Their diastolic blood pressure is 74, triceps skin fold thickness is 33, and plasma glucose concentration after a glucose tolerance test is 134. They have a 2-hour serum insulin level of 60 and a body mass index of 25.9. Their diabetes pedigree function is 0.46.###\nHence this label was No."
"This is a 29-year-old individual who is pregnant for the first time and has a diastolic blood pressure of 66. They have a triceps skin fold thickness of 52, plasma glucose concentration of 86, and 2-hour serum insulin level of 65. With a body mass index of 41.3 and a diabetes pedigree function of 0.917, there may be a potential risk for developing diabetes.###\nHence this label was No."
"The patient is a 29-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 76, triceps skin fold thickness of 35, and a plasma glucose concentration of 146 after a glucose tolerance test. Her 2-hour serum insulin level is 194, and she has a body mass index of 38.2. The diabetes pedigree function indicates a low genetic risk of diabetes at 0.329.###\nHence this label was No."
"A 27-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure and low insulin levels. Her triceps skin fold thickness and body mass index indicate excess body fat. Her plasma glucose concentration after a glucose tolerance test is within normal range, and her diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was No."
"This data belongs to a 26-year-old woman who is pregnant for the first time with low diastolic blood pressure. She has a moderate triceps skin fold thickness and a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is elevated, and she has a healthy body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"This patient is a 32-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125. Additionally, her 2-hour serum insulin level is 120. She has a body mass index of 30.0 and a diabetes pedigree function of 0.464.###\nHence this label was No."
"This individual is a 28-year-old who has been pregnant 6 times. They have a diastolic blood pressure and triceps skin fold thickness of 0, indicating low values. Their plasma glucose concentration after a glucose tolerance test is 96, and their 2-hour serum insulin level is 0. With a body mass index of 23.7 and a low diabetes pedigree function of 0.19, this person seems to have a generally healthy profile with low risk factors for diabetes.###\nHence this label was No."
"A 37-year-old individual who has been pregnant 8 times has a diastolic blood pressure of 90, triceps skin fold thickness of 35, and a plasma glucose concentration of 186 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 225, body mass index is 34.5, and they have a diabetes pedigree function of 0.423.###\nHence this label was Yes."
"The individual is 24 years old and has been pregnant 4 times. They have normal diastolic blood pressure, no triceps skin fold thickness, and a slightly below average plasma glucose concentration at 114. Their insulin levels are low, with a body mass index of 28.9 indicating overweight. The diabetes pedigree function is low at 0.126, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"A 27-year-old female, who has been pregnant twice, with a diastolic blood pressure of 74 mmHg. She has a triceps skin fold thickness of 29 mm, a plasma glucose concentration of 110 mg/dL after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 125 mu U/ml. Her body mass index is 32.4, and she has a diabetes pedigree function value of 0.698. These measurements provide insights into her current health status and risk factors for developing diabetes.###\nHence this label was No."
"This 31-year-old individual has been pregnant 4 times and shows low diastolic blood pressure. They have no triceps skin fold thickness and low 2-hour serum insulin levels. Their plasma glucose concentration after a GTT is normal at 95. With a body mass index of 32.0 and a low diabetes pedigree function of 0.161, this person appears to have a relatively low risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 30-year-old female who has been pregnant 10 times. She has no diastolic blood pressure, triceps skin fold thickness, or serum insulin. Her plasma glucose concentration 2 hours after a glucose tolerance test is 115. Her body mass index is 0.0, and her diabetes pedigree function is 0.261.###\nHence this label was Yes."
"This patient is a 21-year-old female who has never been pregnant. She has a very low diastolic blood pressure of 52 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 102, and she has no insulin present at the 2-hour mark. Her body mass index is 25.1, indicating she is at a healthy weight. The diabetes pedigree function score is very low at 0.078, suggesting a low genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 37-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 84 mmHg and a body mass index of 40.2, indicating obesity. Her triceps skin fold thickness and 2-hour serum insulin levels are both 0, which may suggest low muscle mass and insulin resistance. Her plasma glucose concentration after a glucose tolerance test is 133 mg/dL, indicating slightly elevated blood sugar levels. The diabetes pedigree function score of 0.696 suggests a moderate genetic predisposition to diabetes. Overall, these measurements indicate potential risk for developing diabetes and the need for further monitoring and intervention.###\nHence this label was No."
"The patient is 22 years old and has been pregnant 2 times. They have a low diastolic blood pressure of 62 and a relatively low triceps skin fold thickness of 10. Their plasma glucose concentration after a glucose tolerance test is 108, and their 2-hour serum insulin level is high at 278. The patient has a healthy body mass index of 25.3 and a moderately high diabetes pedigree function of 0.881. Overall, the data suggests a mixture of normal and elevated values, indicating some potential risk for developing diabetes.###\nHence this label was No."
"This individual is 37 years old and has been pregnant 5 times. They have normal diastolic blood pressure and triceps skin fold thickness. However, their plasma glucose concentration after a glucose tolerance test and their 2-hour serum insulin levels are both at 0. Despite having a high body mass index of 41.0, their diabetes pedigree function is relatively low at 0.346.###\nHence this label was Yes."
"The patient is a 46-year-old female who has been pregnant once. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 46 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 144 mg/dL, and her 2-hour serum insulin level is 180 uU/mL. She has a body mass index of 46.1 and a diabetes pedigree function value of 0.335.###\nHence this label was Yes."
"The patient is a 50-year-old female who has been pregnant once. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 43mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 164 mg/dL, and her 2-hour serum insulin level is 67 μU/mL. She has a body mass index of 32.8, indicating she is overweight. Her diabetes pedigree function is 0.341, suggesting a moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is a 44-year-old female who has been pregnant 13 times. She has normal diastolic blood pressure but no triceps skin fold thickness. Her glucose levels are elevated at 158 mg/dL after a 2-hour oral glucose tolerance test. She has no insulin present in her serum and has a relatively high body mass index of 42.3. Her diabetes pedigree function is low at 0.257.###\nHence this label was Yes."
"The patient is a 34-year-old female who has been pregnant 7 times. She has a low diastolic blood pressure of 64 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 114, with no 2-hour serum insulin detected. She has a body mass index of 27.4 and a diabetes pedigree function of 0.732.###\nHence this label was Yes."
"A 54-year-old individual with 2 pregnancies has normal diastolic blood pressure, no triceps skin fold thickness, and low insulin levels. Their glucose levels are within a healthy range after a 2-hour oral glucose tolerance test. They have a high body mass index and a moderate diabetes pedigree function score.###\nHence this label was No."
"This individual is a 21-year-old who has never been pregnant. Their diastolic blood pressure is 80, and their triceps skin fold thickness is 16. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 113. They have no insulin present at the 2-hour mark. Their body mass index is 31.0, and their diabetes pedigree function score is 0.874.###\nHence this label was No."
"The patient is a 34-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 33, and a plasma glucose concentration of 124 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 402, and her body mass index is 35.4. The diabetes pedigree function score is 0.282, indicating a genetic predisposition to diabetes.###\nHence this label was No."
"A 22-year-old female, pregnant for the first time, with a slightly elevated diastolic blood pressure of 76. She has a higher-than-average triceps skin fold thickness of 43, and a notably high plasma glucose concentration of 199 after a glucose tolerance test. Her 2-hour serum insulin levels are low at 0, and she has a relatively high body mass index of 42.9. Additionally, her diabetes pedigree function score is 1.394, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The individual in this data is a 26-year-old who has never been pregnant. They have elevated diastolic blood pressure of 110, above-average triceps skin fold thickness of 46, and normal plasma glucose concentration at 129. Their 2-hour serum insulin level is high at 130, and they have a high body mass index of 67.1. The individual has a low diabetes pedigree function score of 0.319.###\nHence this label was Yes."
"A 30-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 72. They have a triceps skin fold thickness of 23 and a plasma glucose concentration of 121 after a GTT. Their 2-hour serum insulin level is 112, and they have a body mass index of 26.2. The diabetes pedigree function for this individual is 0.245.###\nHence this label was No."
"This data belongs to a 46-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 80, a triceps skin fold thickness of 37, and a plasma glucose concentration of 134 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 370, and their body mass index is 46.2. The diabetes pedigree function value is 0.238.###\nHence this label was Yes."
"A 24-year-old woman, who has been pregnant once, with a diastolic blood pressure of 54. She has a triceps skin fold thickness of 13, a plasma glucose concentration of 119 after a GTT, and 2-hour serum insulin level of 50. Her body mass index is 22.3, and her diabetes pedigree function is 0.205.###\nHence this label was No."
"This data belongs to a 42-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 90, a triceps skin fold thickness of 30, and a plasma glucose concentration of 89 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and their body mass index is 33.5. The diabetes pedigree function for this individual is 0.292.###\nHence this label was No."
"The individual is a 41-year-old woman who has been pregnant 5 times. She has a low diastolic blood pressure of 66 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 112, with a 2-hour serum insulin level of 0. Despite having a high body mass index of 37.8, her diabetes pedigree function is relatively low at 0.261.###\nHence this label was Yes."
"The patient is a 31-year-old woman who has been pregnant 10 times. She has a low diastolic blood pressure of 62 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 92, and her 2-hour serum insulin level is 0. With a body mass index of 25.9, she has a low risk of developing diabetes, indicated by her low diabetes pedigree function score of 0.167.###\nHence this label was No."
"This is a profile of a young adult female who is 27 years old and pregnant for the first time. She has a low diastolic blood pressure of 68 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 83, with no serum insulin detected. She has a low body mass index of 18.2 and a moderate diabetes pedigree function of 0.624.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 100 mmHg and a triceps skin fold thickness of 35 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 123 mg/dL, and her 2-hour serum insulin level is 240 uU/mL. With a body mass index of 57.3 kg/m^2 and a diabetes pedigree function of 0.88, she may be at risk for developing diabetes.###\nHence this label was No."
"A 32-year-old woman who has been pregnant 7 times shows normal diastolic blood pressure, moderately high triceps skin fold thickness, normal glucose levels after a 2-hour oral glucose tolerance test, high insulin levels, elevated body mass index, and a moderate diabetes pedigree score.###\nHence this label was Yes."
"This data belongs to a 27-year-old individual who has been pregnant four times. They have normal diastolic blood pressure and no triceps skin fold thickness. Their glucose level after a 2-hour oral glucose tolerance test is within the normal range. They have low insulin levels, a slightly elevated body mass index, and a moderate diabetes pedigree function score.###\nHence this label was Yes."
"A 33-year-old individual who is pregnant for the first time has low diastolic blood pressure and a slightly high triceps skin fold thickness. Their glucose level after a 2-hour oral glucose tolerance test is normal, but their insulin level is slightly elevated. They have a high body mass index and a low diabetes pedigree function score.###\nHence this label was No."
"A 35-year-old woman, who has been pregnant 5 times, shows normal diastolic blood pressure and a moderately high triceps skin fold thickness. Her plasma glucose concentration after a 2-hour GTT is within the normal range. She has no insulin in her blood after the GTT. Her body mass index is in the overweight category. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 67-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 78 mmHg. Triceps skin fold thickness and 2-hour serum insulin levels are both 0. Their plasma glucose concentration after a glucose tolerance test is 146 mg/dL. They have a body mass index of 38.5 and a diabetes pedigree function of 0.52.###\nHence this label was Yes."
"This patient is a 47-year-old woman who has been pregnant 7 times. She has a normal diastolic blood pressure of 86 and a body mass index of 30.4, indicating she may be overweight. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0, which is unusual. However, her plasma glucose concentration after a glucose tolerance test is 161, suggesting a potential risk of diabetes. The diabetes pedigree function value is low at 0.165, indicating a relatively low genetic predisposition to the disease.###\nHence this label was Yes."
"This person is a 42-year-old who has been pregnant 11 times. Despite having a low diastolic blood pressure and no serum insulin, they have a high plasma glucose concentration after a glucose tolerance test. They also have a high body mass index and a relatively low diabetes pedigree function score.###\nHence this label was No."
"A 22-year-old woman who has never been pregnant has a healthy diastolic blood pressure of 82 and a slightly below average triceps skin fold thickness of 15. Her glucose levels after a 2-hour oral test are normal at 98, and she has a moderate insulin level of 84. With a healthy body mass index of 25.2 and a low diabetes pedigree function of 0.299, she appears to have a low risk of developing diabetes.###\nHence this label was No."
"A 23-year-old woman who is pregnant for the first time has slightly elevated diastolic blood pressure and a high triceps skin fold thickness. Her plasma glucose concentration is above normal after a 2-hour oral glucose tolerance test, and her serum insulin level is notably high. She also has a high body mass index and a moderate diabetes pedigree function score.###\nHence this label was No."
"The patient is a young adult female, 24 years old, who is pregnant for the first time. She has a healthy diastolic blood pressure reading of 68 and a slightly below average triceps skin fold thickness of 19. Her plasma glucose concentration after a glucose tolerance test is normal at 107, and she has no insulin present in her serum after 2 hours. She has a healthy body mass index of 26.5 and a low diabetes pedigree function score of 0.165. Overall, she appears to be in good health with no immediate risk factors for diabetes.###\nHence this label was No."
"A 28-year-old woman, who is pregnant for the first time, has normal diastolic blood pressure and lower triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is slightly elevated. She has no insulin present in her serum, and her body mass index indicates obesity. The diabetes pedigree function score is low, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"A 26-year-old individual who has been pregnant 4 times shows normal diastolic blood pressure and no triceps skin fold thickness. Their glucose level after a meal is within a healthy range, and they have no insulin in their system. Despite a high body mass index, their risk of developing diabetes is moderate based on their family history and genetic factors.###\nHence this label was No."
"The patient is a 39-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 74, triceps skin fold thickness of 38, plasma glucose concentration of 126, 2-hour serum insulin of 75, body mass index of 25.9, and a diabetes pedigree function of 0.162.###\nHence this label was No."
"The patient is a 33-year-old who has been pregnant 4 times. They have a low diastolic blood pressure of 60 and a fairly average triceps skin fold thickness of 33. Their plasma glucose concentration after a GTT is 103, and their 2-hour serum insulin level is high at 192. Despite this, their body mass index is within a healthy range at 24.0. The patient also has a moderate diabetes pedigree function score of 0.966, indicating a genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 55-year-old woman who has been pregnant 6 times. She has a low diastolic blood pressure of 61 and no triceps skin fold thickness. Her glucose level after a GTT is 137, with no serum insulin detected. She has a healthy body mass index of 24.2 and a low diabetes pedigree function score of 0.151.###\nHence this label was No."
"A 28-year-old individual who has been pregnant 3 times, with a normal diastolic blood pressure of 72. They have a slightly above average body mass index of 37.2 and a low plasma glucose concentration of 84. Despite having a triceps skin fold thickness of 32, their 2-hour serum insulin level is at 0. Their diabetes pedigree function is low at 0.267, indicating a lower risk of developing diabetes.###\nHence this label was No."
"A 43-year-old individual who has been pregnant 7 times shows a normal diastolic blood pressure of 68 mmHg. They have a slightly higher triceps skin fold thickness of 49 mm, indicating some subcutaneous fat. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 129 mg/dL, within the normal range. The 2-hour serum insulin level is 125 μU/mL, suggesting adequate insulin production. With a body mass index of 38.5, this person is categorized as obese. The diabetes pedigree function score of 0.439 indicates a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"This is a data entry for a 69-year-old individual who has been pregnant 5 times. The individual has a diastolic blood pressure of 80 mmHg, no triceps skin fold thickness, a plasma glucose concentration of 132 mg/dL after a 2-hour oral glucose tolerance test, and no serum insulin. The individual has a body mass index of 26.8 and a diabetes pedigree function of 0.186.###\nHence this label was No."
"This individual is 39 years old and has been pregnant 3 times. They have a low diastolic blood pressure of 70 and a triceps skin fold thickness of 0. Their glucose levels after a glucose tolerance test are 78, with a 2-hour serum insulin level of 0. Despite having a body mass index of 32.5, their diabetes pedigree function is low at 0.27.###\nHence this label was No."
"This patient is a 22-year-old who has never been pregnant. Her diastolic blood pressure is 68, and her triceps skin fold thickness is 22. After a 2-hour oral glucose tolerance test, her plasma glucose concentration was 105, and her 2-hour serum insulin level was 0. She has a body mass index of 20.0 and a diabetes pedigree function of 0.236.###\nHence this label was No."
"The individual is a 44-year-old who has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and a low level of insulin. Their plasma glucose concentration after a glucose tolerance test is within normal range. Despite having a high body mass index, they have a moderately elevated diabetes pedigree function score, indicating a potential genetic predisposition to diabetes.###\nHence this label was No."
"The individual is a 41-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 28 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 194 mg/dL. She has an insulin level of 0 μU/mL. Her body mass index is 35.9, indicating obesity. The diabetes pedigree function score is 0.745, suggesting a moderate genetic risk for diabetes.###\nHence this label was Yes."
"A 24-year-old woman who has never been pregnant shows normal diastolic blood pressure and insulin levels, but has a slightly above average body mass index. She has a low triceps skin fold thickness and a low diabetes pedigree function score. Despite having a relatively low plasma glucose concentration after an oral glucose tolerance test, she may have a slightly increased risk for developing diabetes.###\nHence this label was Yes."
"This patient is a 53-year-old woman who has been pregnant twice. She has a normal diastolic blood pressure of 75 and a low triceps skin fold thickness. Her glucose levels are within the normal range at 105, and her insulin levels are also low at 0. She has a healthy body mass index of 23.3 and a low diabetes pedigree function score of 0.56.###\nHence this label was No."
"A 25-year-old woman who has been pregnant twice is being tested for diabetes. Her diastolic blood pressure is low at 58, while her triceps skin fold thickness is normal at 24. Her glucose level after a GTT is within the healthy range at 127, but she has a high insulin level of 275. Despite this, her body mass index is moderate at 27.7, and her diabetes pedigree function is slightly elevated at 1.6. Overall, she shows some signs of potential risk for diabetes, but further testing may be needed for a conclusive diagnosis.###\nHence this label was No."
"The individual is a 27-year-old who has been pregnant 5 times. They have a healthy diastolic blood pressure of 72 and low triceps skin fold thickness of 28. Their plasma glucose concentration after a glucose tolerance test is 111, and they have no insulin present. With a body mass index of 23.9 and a low diabetes pedigree function of 0.407, the individual appears to have a relatively low risk of developing diabetes.###\nHence this label was No."
"A 40-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 74. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 141 after a glucose tolerance test, and no insulin detected in their serum after 2 hours. Their body mass index is 27.6, and their diabetes pedigree function is 0.244.###\nHence this label was No."
"This is a 32-year-old female who has never been pregnant. She has normal diastolic blood pressure and a slightly below average triceps skin fold thickness. Her glucose levels are within a healthy range after a 2-hour oral glucose tolerance test. She has low insulin levels, a moderate body mass index, and a low diabetes pedigree function score.###\nHence this label was No."
"This 21-year-old individual, who has been pregnant twice, has a relatively low diastolic blood pressure of 64. They have a moderate triceps skin fold thickness of 22, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range at 115. Their 2-hour serum insulin level is zero, indicating the body is effectively managing glucose. Despite having a slightly elevated body mass index of 30.8, their diabetes pedigree function is low at 0.421, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"This 22-year-old individual has been pregnant 3 times and shows normal levels in most diagnostic measurements, such as diastolic blood pressure, triceps skin fold thickness, and serum insulin. However, their plasma glucose concentration after a glucose tolerance test is low at 80. The individual has a BMI of 0.0 and a relatively low diabetes pedigree function of 0.174.###\nHence this label was No."
"A 24-year-old woman who is pregnant for the first time has normal diastolic blood pressure and a slightly below-average triceps skin fold thickness. Her glucose levels are within the normal range after a glucose tolerance test, and she has no insulin present in her blood. Her body mass index indicates that she is slightly overweight, and her diabetes pedigree function score is low. Overall, she appears to be in good health with no immediate risk factors for developing diabetes.###\nHence this label was No."
"A 24-year-old woman, who is pregnant for the first time, has a diastolic blood pressure of 50 mmHg and a triceps skin fold thickness of 16mm. Her plasma glucose concentration is high at 193 mg/dL after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is elevated at 375 uU/mL. Despite these values, her body mass index is within the normal range at 25.9, and her diabetes pedigree function is 0.655, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is a 65-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 108, triceps skin fold thickness of 37, and a plasma glucose concentration of 103 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 39.2. The diabetes pedigree function is calculated to be 0.305.###\nHence this label was No."
"The patient is a 41-year-old woman who has been pregnant 7 times. She has normal diastolic blood pressure and low triceps skin fold thickness. Her plasma glucose concentration after a GTT is high at 178, with normal insulin levels. She has a high body mass index of 39.9 and a relatively low diabetes pedigree function score of 0.331.###\nHence this label was Yes."
"A 34-year-old woman, who has been pregnant 4 times, with normal diastolic blood pressure and slightly elevated triceps skin fold thickness, has a moderate plasma glucose concentration after a 2-hour oral glucose tolerance test. She has high insulin levels, a slightly elevated body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was No."
"The patient is a 43-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 58, but a relatively high triceps skin fold thickness of 33. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range at 98. However, her 2-hour serum insulin level is elevated at 190. She has a body mass index of 34.0, indicating she is overweight. The diabetes pedigree function score is low at 0.43, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"This is a record of a 25-year-old individual who has been pregnant 3 times and shows signs of good health, with low diastolic blood pressure and a normal body mass index. They have normal glucose levels after a glucose tolerance test, but very low insulin levels. Their triceps skin fold measurement indicates a healthy amount of subcutaneous fat. Their diabetes pedigree function score is low, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"The individual is a 44-year-old woman who has been pregnant 3 times. She has a normal diastolic blood pressure of 80 and no triceps skin fold thickness recorded. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 132, with a low 2-hour serum insulin level of 0. She has a high body mass index of 34.4 and a relatively low diabetes pedigree function score of 0.402.###\nHence this label was Yes."
"The patient, a 21-year-old female, has been pregnant twice. She has normal diastolic blood pressure, no triceps skin fold thickness, and a normal plasma glucose concentration after a glucose tolerance test. Her 2-hour serum insulin level is normal, and she has a high body mass index. The patient has a low diabetes pedigree function score. Overall, based on these measurements, she is at low risk of developing diabetes.###\nHence this label was No."
"A 31-year-old woman, who has been pregnant 3 times, with a healthy diastolic blood pressure of 78, a moderate triceps skin fold thickness of 39, elevated plasma glucose concentration after a GTT at 173, high 2-hour serum insulin levels of 185, a slightly elevated body mass index of 33.8, and a relatively low diabetes pedigree function score of 0.97.###\nHence this label was Yes."
"This individual is a 45-year-old who has been pregnant 9 times. She has low diastolic blood pressure of 78 and triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 164, with 2-hour serum insulin level of 0. She has a body mass index of 32.8 and a low diabetes pedigree function of 0.148.###\nHence this label was Yes."
"This is a dataset of a 25-year-old individual who is 1 time pregnant and has low diastolic blood pressure. They have average triceps skin fold thickness and plasma glucose concentration. Their insulin level is slightly elevated. They have a high body mass index and a low diabetes pedigree function score. Overall, this individual shows some indicators of potential risk for developing diabetes.###\nHence this label was No."
"The patient is a 53-year-old female who has been pregnant twice. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 45. Her plasma glucose concentration is high at 197, and her 2-hour serum insulin level is elevated at 543. Despite having a body mass index of 30.5, which is considered overweight, her diabetes pedigree function is relatively low at 0.158. These factors indicate a potential risk for developing diabetes and may require further medical attention and monitoring.###\nHence this label was Yes."
"The patient is a 41-year-old female who is pregnant for the first time. She has normal diastolic blood pressure and zero triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is high at 180. There is no insulin present in her 2-hour serum. She has a high body mass index of 43.3, indicating obesity. The diabetes pedigree function value is low at 0.282.###\nHence this label was Yes."
"This individual is a young adult who has never been pregnant. They have normal diastolic blood pressure, minimal triceps skin fold thickness, and low insulin levels. Their plasma glucose concentration after a glucose tolerance test is within a healthy range. They have a relatively low body mass index and a moderately low diabetes pedigree function. Overall, based on these measurements, this individual appears to be at a low risk for developing diabetes.###\nHence this label was No."
"A 36-year-old woman who has been pregnant 9 times shows slightly elevated diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration after a GTT is within normal range, but her 2-hour serum insulin level is high. She has a moderately elevated body mass index and a low diabetes pedigree function score.###\nHence this label was Yes."
"The patient is a 52-year-old female who has never been pregnant. She has a normal diastolic blood pressure of 72 and a low triceps skin fold thickness. Her plasma glucose concentration is 123, and her 2-hour serum insulin is 0. Despite a high body mass index of 36.3, her diabetes pedigree function is low at 0.258.###\nHence this label was Yes."
"A 27-year-old individual who has been pregnant 5 times with low diastolic blood pressure, no triceps skin fold thickness, low 2-hour serum insulin, and a moderate body mass index. The individual also has low plasma glucose concentration after a 2-hour oral glucose tolerance test and a low diabetes pedigree function score.###\nHence this label was No."
"A 30-year-old individual who has been pregnant 3 times, with a low diastolic blood pressure of 56. They have a relatively high triceps skin fold thickness of 39, normal plasma glucose concentration of 111 after a GTT, no insulin present in their serum after 2 hours, a body mass index of 30.1, and a moderate diabetes pedigree function score of 0.557.###\nHence this label was No."
"This data belongs to a 21-year-old female who is pregnant for the first time. She has a normal diastolic blood pressure of 64 and a moderate triceps skin fold thickness of 35. Her glucose levels are within the normal range at 113 after a 2-hour oral glucose tolerance test. She is not producing any insulin after the test. Her body mass index is 33.6, indicating she is overweight. The diabetes pedigree function score is low at 0.543.###\nHence this label was Yes."
"The individual is 31 years old and has been pregnant 4 times. They have a diastolic blood pressure of 78 and triceps skin fold thickness of 39. Their plasma glucose concentration after a GTT is 184, with a 2-hour serum insulin level of 277. The individual has a body mass index of 37.0 and a diabetes pedigree function of 0.264.###\nHence this label was Yes."
"This individual is a 27-year-old who has been pregnant three times. Their diastolic blood pressure is 72, triceps skin fold thickness is 30, plasma glucose concentration after a GTT is 103, and 2-hour serum insulin level is 152. They have a body mass index of 27.6 and a diabetes pedigree function of 0.73.###\nHence this label was No."
"This is a 25-year-old individual who has never been pregnant and shows normal diastolic blood pressure. They have a slightly high triceps skin fold thickness of 32, but normal plasma glucose concentration at 91. Their 2-hour serum insulin level is elevated at 210, and they have a high body mass index of 39.9, indicating obesity. Despite these factors, their diabetes pedigree function is relatively low at 0.381, suggesting a lower genetic predisposition to diabetes.###\nHence this label was No."
"A 23-year-old individual, who is pregnant for the first time, has a low diastolic blood pressure of 54. The triceps skin fold thickness is 25mm, and their plasma glucose concentration after a GTT is 91 mg/dL. They have a 2-hour serum insulin level of 100 μU/mL and a body mass index of 25.2. The diabetes pedigree function for this individual is 0.234.###\nHence this label was No."
"A 22-year-old woman who has been pregnant twice shows relatively low diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 92, with no serum insulin detected. She has a body mass index of 30.1 and a low diabetes pedigree function of 0.141.###\nHence this label was No."
"A 42-year-old woman who has been pregnant 8 times shows relatively low diastolic blood pressure and plasma glucose concentration, with normal body mass index. Despite having a low insulin level, her overall risk of developing diabetes is assessed as not high based on these diagnostic measurements.###\nHence this label was No."
"The individual is 28 years old and has been pregnant 5 times. They have a diastolic blood pressure of 98 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 115 mg/dL and their 2-hour serum insulin level is 0 μU/mL. They have a body mass index of 52.9 and a diabetes pedigree function of 0.209.###\nHence this label was Yes."
"The data describes a 22-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 70, a triceps skin fold thickness of 32, and a plasma glucose concentration of 91 after a glucose tolerance test. Their 2-hour serum insulin level is 88, with a body mass index of 33.1. Their diabetes pedigree function value is 0.446.###\nHence this label was No."
"A 25-year-old woman who has never been pregnant has a diastolic blood pressure of 62. Her triceps skin fold thickness is 30 mm and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 107 mg/dL. She also has a 2-hour serum insulin level of 74 μU/mL and a body mass index of 36.6. Her diabetes pedigree function is 0.757.###\nHence this label was Yes."
"This individual is a 49-year-old woman who has been pregnant six times. She has a normal diastolic blood pressure of 78, a relatively low triceps skin fold thickness of 31, and a healthy plasma glucose concentration of 125. Her 2-hour serum insulin level is unusually low at 0, and her body mass index is 27.6, indicating that she is slightly overweight. Her diabetes pedigree function is 0.565, suggesting a moderate genetic risk for diabetes. Overall, she appears to be in relatively good health, but her low insulin levels may warrant further investigation.###\nHence this label was Yes."
"The patient is a 41-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 26. Her plasma glucose concentration after a GTT is 125. Her 2-hour serum insulin level is 115. She has a body mass index of 31.1 and a diabetes pedigree function of 0.205.###\nHence this label was Yes."
"The individual is a 40-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 60 and a moderate triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115. She has no 2-hour serum insulin present in her blood. Her body mass index is 33.7, indicating obesity. The diabetes pedigree function score is relatively low at 0.245.###\nHence this label was Yes."
"This patient is a young adult female in her early twenties, who has been pregnant twice. She has normal diastolic blood pressure, very low triceps skin fold thickness, and a healthy body mass index. Despite having a high plasma glucose concentration after a glucose tolerance test, her insulin levels are quite low. The diabetes pedigree function score indicates a low genetic risk for developing diabetes.###\nHence this label was No."
"This is a dataset for a 27-year-old individual who has been pregnant twice. They have normal diastolic blood pressure (70), a moderately low triceps skin fold thickness (16), and a normal plasma glucose concentration (99) after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 44, indicating normal insulin production. With a body mass index of 20.4 and a low diabetes pedigree function score of 0.235, this individual appears to be at low risk for developing diabetes.###\nHence this label was No."
"A 27-year-old woman, who has been pregnant twice, with a diastolic blood pressure of 84. She has a triceps skin fold thickness of 0, a plasma glucose concentration of 129 after a glucose tolerance test, and zero insulin levels at the 2-hour mark. Her body mass index is 28.0 and she has a diabetes pedigree function of 0.284.###\nHence this label was No."
"The patient is a 30-year-old female who has been pregnant 5 times. She has a normal diastolic blood pressure of 66 and a moderately low triceps skin fold thickness of 21. Her glucose level after a GTT is normal at 88, and her insulin level is slightly low at 23. With a healthy BMI of 24.4 and a low diabetes pedigree function of 0.342, she shows a relatively low risk of developing diabetes.###\nHence this label was No."
"This 28-year-old individual, who has been pregnant once, has a diastolic blood pressure of 64 and a triceps skin fold thickness of 23. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 84, with a 2-hour serum insulin level of 115. With a body mass index of 36.9 and a diabetes pedigree function of 0.471, this person's risk of developing diabetes may need to be monitored closely.###\nHence this label was No."
"This data describes a 33-year-old individual who is pregnant for the first time. She has normal diastolic blood pressure, moderate triceps skin fold thickness, and high plasma glucose concentration after a glucose tolerance test. Her insulin level is elevated, indicating possible insulin resistance. She has a healthy body mass index and a low diabetes pedigree function score, suggesting a lower genetic risk for diabetes.###\nHence this label was Yes."
"This is data from a 24-year-old individual who has never been pregnant. Their diastolic blood pressure is 78, triceps skin fold thickness is 40, and plasma glucose concentration after a 2-hour oral glucose tolerance test is 102. They have a 2-hour serum insulin level of 90 and a body mass index of 34.5. Their diabetes pedigree function is 0.238.###\nHence this label was No."
"A 39-year-old individual with a history of 8 pregnancies shows normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour glucose tolerance test is 133, with no detectable serum insulin level. They have a body mass index of 32.9 and a low diabetes pedigree function of 0.27.###\nHence this label was Yes."
"The patient is a 32-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 74 and a low triceps skin fold thickness of 0. Her plasma glucose concentration is 102 after a 2-hour oral glucose tolerance test, and she has no detectable serum insulin levels. Her body mass index is 29.5, indicating she is overweight. The diabetes pedigree function score is low at 0.121, suggesting a relatively lower genetic risk for diabetes.###\nHence this label was No."
"A 48-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 74. They have no triceps skin fold thickness and a plasma glucose concentration of 104 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 28.8. The diabetes pedigree function for this individual is 0.153.###\nHence this label was No."
"This data represents a 21-year-old individual who is pregnant for the first time. The person has a diastolic blood pressure of 74, a triceps skin fold thickness of 22, and a plasma glucose concentration of 143 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 61, and their body mass index is 26.2. The diabetes pedigree function, which assesses the risk of diabetes based on family history, is 0.256.###\nHence this label was No."
"A 56-year-old individual with a history of 10 pregnancies has normal diastolic blood pressure and a moderate triceps skin fold thickness. Their glucose levels after a glucose tolerance test are low, with no significant insulin levels detected. Despite having a relatively high body mass index, their diabetes pedigree function score is low, indicating a lower genetic risk for diabetes.###\nHence this label was Yes."
"The 27-year-old individual in this dataset has been pregnant 3 times. They have a healthy diastolic blood pressure of 72 and a low triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 106, and their 2-hour serum insulin level is 0. They have a body mass index of 25.8 and a low diabetes pedigree function of 0.207.###\nHence this label was No."
"This patient is a 47-year-old who has been pregnant 10 times. They have a diastolic blood pressure of 106 and a triceps skin fold thickness of 23. Their plasma glucose concentration at 2 hours in an oral glucose tolerance test is 68, with a 2-hour serum insulin level of 49. Their body mass index is 35.5 and they have a diabetes pedigree function of 0.285.###\nHence this label was No."
"The patient is a 42-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 86, triceps skin fold thickness of 30, and a plasma glucose concentration of 117 after a glucose tolerance test. Her 2-hour serum insulin level is 105, and she has a body mass index of 39.1. The diabetes pedigree function score for this patient is 0.251.###\nHence this label was No."
"A 36-year-old woman who has never been pregnant is showing low risk factors for developing diabetes based on her diagnostic measurements. Her blood pressure, triceps skin fold thickness, and insulin levels are all within healthy ranges. Despite a slightly elevated plasma glucose concentration, her body mass index and diabetes pedigree function suggest a low likelihood of developing diabetes.###\nHence this label was Yes."
"The individual in this dataset is a 39-year-old woman who has been pregnant 3 times. She has a low diastolic blood pressure of 56 and a moderate triceps skin fold thickness of 34. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 96, and her 2-hour serum insulin level is relatively high at 115. With a body mass index of 24.7, she is considered to have a healthy weight. Her diabetes pedigree function value is 0.944, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"This individual is a 23-year-old who has been pregnant 3 times. Their diastolic blood pressure is 62, triceps skin fold thickness is 13, and plasma glucose concentration at 2 hours is 107. The 2-hour serum insulin level is 48, with a body mass index of 22.9. They have a diabetes pedigree function of 0.678.###\nHence this label was Yes."
"This 54-year-old individual, who has been pregnant 7 times, has a diastolic blood pressure of 78. Their triceps skin fold thickness is 29mm, plasma glucose concentration is 150 mg/dL, and 2-hour serum insulin level is 126 uU/mL. With a body mass index of 35.2, they have a diabetes pedigree function of 0.692.###\nHence this label was Yes."
"The patient is a 45-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 130, and her 2-hour serum insulin level is 0. She has a body mass index of 34.2 and a diabetes pedigree function of 0.652.###\nHence this label was Yes."
"A 38-year-old woman who has been pregnant three times shows normal diastolic blood pressure, low triceps skin fold thickness, and normal plasma glucose levels after a glucose tolerance test. She has slightly elevated insulin levels, a high body mass index, and a moderate diabetes pedigree function score.###\nHence this label was No."
"This individual is a 27-year-old female who has never been pregnant. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 39mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 152 mg/dL, and her 2-hour serum insulin level is 272 μU/ml. She has a body mass index of 41.5, indicating obesity, and a low diabetes pedigree function of 0.27. The data suggests that this individual may be at risk for developing diabetes due to her high insulin levels and obesity.###\nHence this label was No."
"The patient is a 58-year-old who has never been pregnant and has a diastolic blood pressure of 78. She has a triceps skin fold thickness of 32, a high plasma glucose concentration of 173 after a glucose tolerance test, and a high 2-hour serum insulin level of 265. Her body mass index is 46.5, indicating obesity. Additionally, she has a diabetes pedigree function score of 1.159, suggesting a genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 36-year-old woman who has been pregnant 7 times. She has a low diastolic blood pressure of 66 and a body mass index of 30.4, indicating overweight. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0. However, her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 159, and her diabetes pedigree function is 0.383, suggesting a potential risk for developing diabetes.###\nHence this label was Yes."
"The data belongs to a 25-year-old individual who has been pregnant 3 times. The person has a normal diastolic blood pressure of 68 and a moderate triceps skin fold thickness of 30. Their blood sugar level after a glucose tolerance test is relatively low at 84, but they have a higher-than-average serum insulin level of 106. With a body mass index of 31.9, the individual is considered overweight. The diabetes pedigree function score of 0.591 indicates a moderate genetic risk for diabetes.###\nHence this label was No."
"This patient is 46 years old and has never been pregnant. They have normal diastolic blood pressure and low triceps skin fold thickness. Their glucose levels after a glucose tolerance test are within normal range. They have no insulin in their serum, a slightly elevated body mass index, and a low diabetes pedigree function score.###\nHence this label was No."
"The patient is a 34-year-old individual who has been pregnant 10 times. They have a diastolic blood pressure of 98, no triceps skin fold thickness, and a plasma glucose concentration of 115 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, their body mass index is 24.0, and they have a diabetes pedigree function value of 1.022.###\nHence this label was No."
"A 23-year-old individual who has never been pregnant has a diastolic blood pressure of 64. Their triceps skin fold thickness is 23 mm. During an oral glucose tolerance test, their plasma glucose concentration after 2 hours is 104 mg/dL. They have a 2-hour serum insulin level of 116 uU/mL. With a body mass index of 27.8, this person has a low risk of developing diabetes based on a diabetes pedigree function value of 0.454.###\nHence this label was No."
"This individual is a 46-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 62 and a triceps skin fold thickness of 32. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 92, with a 2-hour serum insulin level of 126. Her body mass index is 32.0 and has a low diabetes pedigree function of 0.085.###\nHence this label was No."
"This patient is a 65-year-old female who has never been pregnant. She has a diastolic blood pressure of 50 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 161 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. Her body mass index is 21.9, and her diabetes pedigree function is 0.254. This data suggests that the patient may be at risk for developing diabetes due to the elevated glucose levels.###\nHence this label was No."
"The patient is a 31-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 0 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 90 mg/dL, and her 2-hour serum insulin level is 0 µU/mL. She has a body mass index of 28.0 and a diabetes pedigree function of 0.61, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
