"This data belongs to a 21-year-old individual who has never been pregnant and has a diastolic blood pressure of 88. Their triceps skin fold thickness is 29, and their plasma glucose concentration is 78 after a 2-hour oral glucose tolerance test. They have a 2-hour serum insulin level of 40 and a body mass index of 36.9. The diabetes pedigree function value for this individual is 0.434.###\nHence this label was No."
"The individual is a 24-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 111, and she has a 2-hour serum insulin level of 0. Her body mass index is 34.2, and her diabetes pedigree function is 0.26.###\nHence this label was No."
"The patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 39. Her plasma glucose concentration after a glucose tolerance test is 187, with a 2-hour serum insulin level of 304. She has a body mass index of 37.7 and a diabetes pedigree function of 0.254.###\nHence this label was Yes."
"A 42-year-old individual who has been pregnant 2 times with a diastolic blood pressure of 90, a triceps skin fold thickness of 30, and a plasma glucose concentration of 89 mg/dL after a 2-hour oral glucose tolerance test. They have a 2-hour serum insulin level of 0 uU/mL, a body mass index of 33.5, and a diabetes pedigree function value of 0.292.###\nHence this label was No."
"This is data from a 22-year-old individual who has been pregnant once. They have a normal diastolic blood pressure of 68 and a moderate triceps skin fold thickness of 35. Their plasma glucose concentration is surprisingly low at 0, as well as their 2-hour serum insulin. Despite this, their body mass index is high at 32.0, indicating potential weight issues. The individual has a relatively low diabetes pedigree function score of 0.389.###\nHence this label was No."
"The patient is a 40-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 46, and a plasma glucose concentration of 145 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130, and her body mass index is 37.9. She has a diabetes pedigree function of 0.637.###\nHence this label was Yes."
"The patient is a 53-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 86 mmHg, a triceps skin fold thickness of 0 mm, and a plasma glucose concentration of 156 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0 μU/mL, and she has a body mass index of 24.8 kg/m². The diabetes pedigree function, indicating the likelihood of developing diabetes based on family history, is 0.23.###\nHence this label was Yes."
"The patient is a 22-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 86, triceps skin fold thickness of 0, and a plasma glucose concentration of 120 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 28.4. The diabetes pedigree function for this patient is 0.259.###\nHence this label was Yes."
"A 28-year-old woman who has been pregnant 4 times, with normal diastolic blood pressure and a healthy body mass index. Her blood glucose levels are normal, and she has low insulin levels. She has a moderately low triceps skin fold thickness and a low diabetes pedigree function score.###\nHence this label was No."
"This patient is a 36-year-old woman who has been pregnant 4 times. She has a normal diastolic blood pressure and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 183, and her 2-hour serum insulin level is zero. With a body mass index of 28.4, she has a low diabetes pedigree function score of 0.212.###\nHence this label was Yes."
"This patient is a 54-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 84, triceps skin fold thickness of 0, and a plasma glucose concentration of 162 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 27.7. The diabetes pedigree function for this patient is 0.182.###\nHence this label was No."
"The patient is a 60-year-old woman who has been pregnant 4 times. She has normal diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is slightly elevated at 134. There is no serum insulin detected in her system. She has a healthy body mass index of 23.8 and a low diabetes pedigree function score of 0.277.###\nHence this label was Yes."
"This data belongs to a 26-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 72, no triceps skin fold thickness, and a plasma glucose concentration of 171 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 43.6. The diabetes pedigree function for this individual is 0.479.###\nHence this label was Yes."
"This individual is 32 years old and has been pregnant 6 times. They have a healthy diastolic blood pressure of 68 and a triceps skin fold thickness of 30. Their plasma glucose concentration after a glucose tolerance test is 125, with a 2-hour serum insulin level of 120. Their body mass index is 30.0 and they have a low diabetes pedigree function score of 0.464.###\nHence this label was No."
"A 37-year-old woman, who has been pregnant five times, with a diastolic blood pressure of 108. She has no triceps skin fold thickness and a plasma glucose concentration of 137 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, while her body mass index is 48.8. She has a low diabetes pedigree function score of 0.227.###\nHence this label was Yes."
"The patient is 37 years old with a history of 7 pregnancies. They have a low diastolic blood pressure of 70 and a moderately high triceps skin fold thickness of 33. Their plasma glucose concentration after a 2-hour GTT is 124, and their 2-hour serum insulin level is elevated at 215. Despite these values, the patient has a healthy body mass index of 25.5 and a low diabetes pedigree function of 0.161.###\nHence this label was No."
"The patient is a 41-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 26 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125 mg/dL and her 2-hour serum insulin level is 115 uU/mL. With a body mass index of 31.1, she has a diabetes pedigree function value of 0.205.###\nHence this label was Yes."
"A 21-year-old woman, who is pregnant for the first time, has a diastolic blood pressure of 62 mmHg. Her triceps skin fold thickness is 41mm, and her plasma glucose concentration after a GTT is 139 mg/dL. She has a high level of 2-hour serum insulin at 480 μU/mL. With a body mass index of 40.7, she has a moderate diabetes pedigree function of 0.536.###\nHence this label was No."
"This individual is a 21-year-old who has never been pregnant and shows normal values for diastolic blood pressure and triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within the normal range. They have no insulin present in their blood after 2 hours and have a healthy body mass index. The diabetes pedigree function value indicates a low genetic risk for diabetes.###\nHence this label was No."
"This 24-year-old individual has been pregnant twice and shows moderately high levels of diastolic blood pressure and triceps skinfold thickness. Their plasma glucose concentration after a glucose tolerance test is elevated, and they have a relatively high insulin level. The individual also has a high body mass index and a moderate diabetes pedigree function score.###\nHence this label was Yes."
"The patient is a 52-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 104 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 162 mg/dL. She does not have any 2-hour serum insulin detected. Her body mass index is 37.7, indicating obesity. The diabetes pedigree function, which assesses the likelihood of developing diabetes based on family history, is 0.151, suggesting a low genetic risk.###\nHence this label was Yes."
"The person in the data is a 43-year-old who is pregnant for the first time. They have a diastolic blood pressure of 82 and a triceps skin fold thickness of 25. Their plasma glucose concentration after a glucose tolerance test is 95, with a 2-hour serum insulin level of 180. The person has a body mass index of 35.0 and a low diabetes pedigree function score of 0.233.###\nHence this label was Yes."
"A 23-year-old individual who has been pregnant twice, with a diastolic blood pressure of 58 mmHg, triceps skin fold thickness of 17 mm, plasma glucose concentration of 101 mg/dL after a glucose tolerance test, 2-hour serum insulin level of 265 μU/mL, and a body mass index of 24.2. The diabetes pedigree function is calculated as 0.614.###\nHence this label was No."
"The patient is a 50-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 74, triceps skin fold thickness of 26, and a plasma glucose concentration of 138 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 144 uU/ml, and she has a body mass index of 36.1. The diabetes pedigree function score is 0.557, indicating a moderate genetic risk for diabetes.###\nHence this label was Yes."
"A 42-year-old individual who has been pregnant 11 times shows normal diastolic blood pressure and a slightly higher triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 103, with low serum insulin levels. Despite having a high body mass index of 46.2, the individual has a low diabetes pedigree function score of 0.126.###\nHence this label was No."
"The patient is a 30-year-old female who is pregnant for the first time. She has a normal diastolic blood pressure of 74 and a slightly above average triceps skin fold thickness of 36. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range at 124. She has no insulin present in her serum, with a body mass index of 27.8 indicating she is slightly overweight. The diabetes pedigree function score is low at 0.1, suggesting a low genetic risk for diabetes. Overall, the patient shows relatively healthy measurements with no immediate indication of diabetes.###\nHence this label was No."
"A 23-year-old individual, who has been pregnant once, with a diastolic blood pressure of 62 mmHg, triceps skin fold thickness of 13 mm, plasma glucose concentration of 111 mg/dL after a glucose tolerance test, 2-hour serum insulin level of 182 μU/mL, body mass index of 24.0, and a low diabetes pedigree function score of 0.138.###\nHence this label was No."
"This individual is a 48-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 37, and a body mass index of 42.3, indicating she may be overweight. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120, and her 2-hour serum insulin level is 150. Her diabetes pedigree function, a measure of the diabetes history in relatives, is 0.785.###\nHence this label was Yes."
"A 44-year-old woman who has been pregnant 13 times is being evaluated for diabetes risk. She has a diastolic blood pressure of 114 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 158. She has no insulin in her blood after 2 hours. With a body mass index of 42.3 and a low diabetes pedigree function of 0.257, her overall risk for developing diabetes may be low.###\nHence this label was Yes."
"A 29-year-old woman, who has been pregnant twice, shows normal diastolic blood pressure and a slightly higher-than-average triceps skin fold thickness. Her glucose levels after a 2-hour glucose tolerance test are elevated, as well as her insulin levels. She has a high body mass index and a fairly low diabetes pedigree function score.###\nHence this label was No."
"The patient is a 41-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 66 and a below average triceps skin fold thickness of 30. Her plasma glucose concentration after a GTT is low at 80, and she has minimal 2-hour serum insulin of 0. Despite a slightly elevated body mass index of 26.2, her diabetes pedigree function is low at 0.313.###\nHence this label was No."
"This individual is a 36-year-old who has been pregnant 3 times. They have a diastolic blood pressure of 70, triceps skin fold thickness of 22, and a plasma glucose concentration of 187. Their 2-hour serum insulin level is 200, with a body mass index of 36.4. The diabetes pedigree function is 0.408.###\nHence this label was Yes."
"The patient is a 32-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 32, and a plasma glucose concentration of 97 after a glucose tolerance test. Her 2-hour serum insulin level is 91, and she has a body mass index of 40.9. The diabetes pedigree function is calculated to be 0.871.###\nHence this label was Yes."
"A 21-year-old individual, who has been pregnant 3 times, with a diastolic blood pressure of 60, triceps skin fold thickness of 18, plasma glucose concentration of 87 after a glucose tolerance test, 2-hour serum insulin level of 0, a body mass index of 21.8, and a diabetes pedigree function value of 0.444.###\nHence this label was No."
"This 22-year-old individual, who has been pregnant once, has a below-normal diastolic blood pressure of 48. Despite having a low triceps skin fold thickness of 18, their plasma glucose concentration after a glucose tolerance test is also low at 71. Their 2-hour serum insulin level is elevated at 76, and their body mass index is in the healthy range at 20.4. Additionally, their diabetes pedigree function, a measure of diabetes heredity, is low at 0.323.###\nHence this label was No."
"This patient is a 21-year-old female who has been pregnant twice. She has a relatively low diastolic blood pressure of 62 and a healthy body mass index of 25.2. Her triceps skin fold thickness is 32, indicating a moderate level of subcutaneous fat. Her plasma glucose concentration after a glucose tolerance test is 108, which falls within the normal range. The 2-hour serum insulin level is 56, suggesting good insulin sensitivity. Overall, her diabetes pedigree function is low at 0.128, indicating a relatively low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 90, a triceps skin fold thickness of 24, and a plasma glucose concentration of 142 after a glucose tolerance test. Her 2-hour serum insulin level is 480, and she has a body mass index of 30.4. The diabetes pedigree function is 0.128.###\nHence this label was Yes."
"This 28-year-old individual who has been pregnant twice has a healthy diastolic blood pressure of 76. Despite having a low 2-hour serum insulin level of 0, their plasma glucose concentration after a glucose tolerance test is within normal range at 92. They have a moderate triceps skin fold thickness of 20 and a body mass index of 24.2, indicating a healthy weight. With a diabetes pedigree function of 1.698, there may be a slight genetic predisposition to the disease.###\nHence this label was No."
"The patient is a 22-year-old female who has never been pregnant. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 14 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 188 mg/dL, and her 2-hour serum insulin level is 185 microIU/mL. She has a body mass index of 32.0 and a diabetes pedigree function of 0.682.###\nHence this label was Yes."
"This 28-year-old individual, who has been pregnant once, has a lower diastolic blood pressure of 50 and a moderate triceps skin fold thickness of 40. Their plasma glucose concentration after a glucose tolerance test is within normal range at 125, but their 2-hour serum insulin level is high at 167. Despite having a slightly elevated body mass index of 33.3, their diabetes pedigree function indicates a lower genetic risk for diabetes at 0.962.###\nHence this label was Yes."
"This individual is a 44-year-old woman who has been pregnant 12 times. She has normal diastolic blood pressure, no triceps skin fold thickness, and a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is normal, and she has a healthy body mass index of 23.6. Additionally, her diabetes pedigree function score is low at 0.137, indicating a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 27-year-old female who is moderately overweight and has had 6 pregnancies. She has low diastolic blood pressure and normal plasma glucose concentration. Her triceps skin fold thickness and body mass index are within the healthy range. Her insulin level is very low, and her diabetes pedigree function is also low, indicating a lower risk of developing diabetes.###\nHence this label was No."
"This patient, a 54-year-old female, has been pregnant six times and has a normal diastolic blood pressure of 76. She has no triceps skin fold thickness and her plasma glucose concentration after a glucose tolerance test is 125 mg/dL. Her 2-hour serum insulin level is 0, indicating low insulin production. With a body mass index of 33.8, she is considered obese. Her diabetes pedigree function score is 0.121, suggesting a low genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 56-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 72, triceps skin fold thickness of 47, plasma glucose concentration of 111 after a 2-hour oral glucose tolerance test, and 2-hour serum insulin level of 207. Her body mass index is 37.1 and she has a diabetes pedigree function score of 1.39.###\nHence this label was Yes."
"The data describes a 30-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 72, a triceps skin fold thickness of 23, a plasma glucose concentration of 121 after a glucose tolerance test, and a 2-hour serum insulin level of 112. Additionally, they have a body mass index of 26.2 and a diabetes pedigree function value of 0.245.###\nHence this label was No."
"This data belongs to a 25-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 72 and a triceps skin fold thickness of 15. Their plasma glucose concentration after a glucose tolerance test is 81 and their 2-hour serum insulin level is 76. They have a body mass index of 30.1 and a diabetes pedigree function value of 0.547.###\nHence this label was No."
"A 29-year-old woman who has been pregnant 4 times with a normal diastolic blood pressure and no triceps skin fold thickness. Her glucose level after a 2-hour oral glucose tolerance test is 110, and she has no insulin present. She has a body mass index of 31.9 and a low diabetes pedigree function score of 0.471.###\nHence this label was No."
"This is a 24-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 21mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 157 mg/dL and their 2-hour serum insulin level is 168 μU/mL. With a body mass index of 25.6, they have a low diabetes pedigree function score of 0.123.###\nHence this label was No."
"This data belongs to a 25-year-old individual who has been pregnant 4 times. She has a low diastolic blood pressure of 62 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 76, and her 2-hour serum insulin level is 0. Despite having a high body mass index of 34.0, her diabetes pedigree function is relatively low at 0.391.###\nHence this label was No."
"This 42-year-old individual has been pregnant 7 times and has a relatively low diastolic blood pressure of 66. They have no triceps skin fold thickness, indicating a lean body composition. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 114, and they have a 2-hour serum insulin level of 0. With a body mass index of 32.8, this person is considered overweight. Their diabetes pedigree function value is 0.258, suggesting a moderate genetic risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 42-year-old female who has been pregnant 7 times. She has a low diastolic blood pressure of 66 and a high triceps skin fold thickness of 42. Her plasma glucose concentration after a 2-hour GTT is 150, and her 2-hour serum insulin levels are elevated at 342. She has a body mass index of 34.7, indicating that she is overweight. The diabetes pedigree function score is 0.718, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 42-year-old woman who has been pregnant 9 times. She has a very low diastolic blood pressure of 52 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106, and she has no 2-hour serum insulin. Her body mass index is 31.2, and her diabetes pedigree function is 0.38.###\nHence this label was No."
"A 27-year-old woman who is pregnant for the first time underwent a diagnostic assessment for diabetes. Her blood pressure is within normal range, but her triceps skin fold thickness and body mass index are elevated. Despite having a high glucose level after an oral glucose tolerance test, her insulin level is surprisingly low. The diabetes pedigree function score indicates a low genetic risk for developing diabetes.###\nHence this label was Yes."
"This 37-year-old individual has been pregnant 6 times and has a healthy diastolic blood pressure of 70. Their triceps skin fold thickness is 32, and their plasma glucose concentration after a 2-hour GTT is 105. With a 2-hour serum insulin level of 68, a body mass index of 30.8, and a low diabetes pedigree function of 0.122, this person appears to be at low risk of developing diabetes based on the given diagnostic measurements.###\nHence this label was No."
"A 25-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 58 mmHg, triceps skin fold thickness of 24 mm, plasma glucose concentration of 127 mg/dL after a glucose tolerance test, 2-hour serum insulin level of 275 mu U/ml, body mass index of 27.7, and a diabetes pedigree function of 1.6.###\nHence this label was No."
"The patient in this example is a young adult woman who has been pregnant three times. She has low diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 80, and her 2-hour serum insulin level is low. Her body mass index is 0.0, indicating she may be underweight. The diabetes pedigree function, a measure of hereditary diabetes risk, is 0.174, suggesting a low genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 28-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 72 mmHg. Her triceps skin fold thickness is 12 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 100 mg/dL. She has a 2-hour serum insulin level of 70 mu U/ml. Her body mass index is 25.3 kg/m^2. The calculated diabetes pedigree function for her is 0.658.###\nHence this label was No."
"This patient is a 50-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 0mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 147 mg/dL. She has no detectable 2-hour serum insulin. Her body mass index is 29.5 which indicates she is overweight. The diabetes pedigree function score is 0.178, suggesting a low genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 23-year-old woman who is pregnant for the first time. She has low diastolic blood pressure, normal triceps skin fold thickness, and a healthy plasma glucose concentration after a 2-hour oral glucose tolerance test. Her serum insulin level is elevated, and she has a moderate body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"A 25-year-old woman who has been pregnant twice shows signs of potential diabetes, with a low diastolic blood pressure, high blood glucose levels, and elevated serum insulin. She also has a high body mass index and a low diabetes pedigree function score.###\nHence this label was Yes."
"The patient is a 23-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 62 and a triceps skin fold thickness of 31. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 154, and her 2-hour serum insulin level is 284. The patient has a body mass index of 32.8 and a diabetes pedigree function of 0.237.###\nHence this label was No."
"This 22-year-old individual, who has been pregnant twice, has a diastolic blood pressure of 70 and a triceps skin fold thickness of 27. Their plasma glucose concentration after a glucose tolerance test is 71, with a 2-hour serum insulin level of 0. They have a body mass index of 28.0 and a diabetes pedigree function of 0.586.###\nHence this label was No."
"The patient is a 28-year-old woman who has never been pregnant. She has a low diastolic blood pressure of 70, no triceps skin fold thickness, and a high plasma glucose concentration of 146 after a 2-hour oral glucose tolerance test. Her insulin level is low at 0, but she has a high body mass index of 37.9. The diabetes pedigree function indicates a moderate genetic risk for diabetes at 0.334.###\nHence this label was Yes."
"This is a dataset of a 21-year-old individual who has been pregnant 3 times and shows no triceps skin fold thickness. Their diastolic blood pressure is 78, plasma glucose concentration after a 2-hour oral glucose tolerance test is 90, and 2-hour serum insulin level is 0. With a body mass index of 42.7 and a diabetes pedigree function of 0.559, this individual's risk of developing diabetes may be low.###\nHence this label was No."
"A 27-year-old woman who is pregnant for the first time is being monitored for her risk of diabetes. Her diastolic blood pressure is 68, and her triceps skin fold thickness is 0. Her plasma glucose concentration after a GTT is 83, with no insulin detected after 2 hours. She has a low body mass index of 18.2 and a moderate diabetes pedigree function of 0.624.###\nHence this label was No."
"A 22-year-old individual who has been pregnant twice, with low diastolic blood pressure (52 mmHg) and no triceps skin fold thickness. They have a normal glucose level (92 mg/dL) after a 2-hour oral glucose tolerance test, no serum insulin detected, and a slightly elevated body mass index of 30.1. The diabetes pedigree function value is low at 0.141.###\nHence this label was No."
"This individual, a 66-year-old female, has been pregnant twice. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 0 mm. Her glucose levels are elevated with a plasma glucose concentration of 158 mg/dL after a glucose tolerance test. There is no insulin present in her 2-hour serum. She has a body mass index of 31.6, indicating she is overweight. The diabetes pedigree function value is 0.805, suggesting a moderate genetic predisposition to diabetes. Overall, this person shows some risk factors for developing diabetes, such as elevated glucose levels and high BMI.\n###\nHence this label was Yes."
"A 22-year-old woman, who has been pregnant twice, has slightly low diastolic blood pressure of 56. She has moderate triceps skin fold thickness of 28 and low plasma glucose concentration at 2 hours in an oral glucose tolerance test of 56. Her 2-hour serum insulin levels are also on the lower side at 45. Despite these values, her body mass index is within the normal range at 24.2 and she has a relatively low diabetes pedigree function score of 0.332.###\nHence this label was No."
"The patient is a 23-year-old female who has been pregnant 2 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 18. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 94. Her 2-hour serum insulin level is 66. She has a body mass index of 31.6 and a diabetes pedigree function of 0.649.###\nHence this label was No."
"A 34-year-old woman, who has been pregnant 4 times, shows normal diastolic blood pressure and a healthy body mass index of 32.0. Her triceps skin fold thickness is within normal range, while her plasma glucose concentration is slightly elevated at 123 mg/dL. She has high insulin levels at 176 mu U/mL and a low diabetes pedigree function of 0.443, suggesting a moderate risk of developing diabetes. Overall, her health markers indicate a need for monitoring her blood glucose levels and insulin sensitivity.###\nHence this label was No."
"This is a 21-year-old individual who is pregnant for the first time. They have a normal diastolic blood pressure, moderate triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a glucose tolerance test. Their insulin level is low, and their body mass index indicates they are overweight. Additionally, their diabetes pedigree function suggests a moderate genetic risk for diabetes.###\nHence this label was Yes."
"A 33-year-old woman who has been pregnant 9 times shows low diastolic blood pressure of 62. She has no triceps skin fold thickness and very low insulin levels. Despite a relatively low plasma glucose concentration of 89, she has a healthy body mass index of 22.5 and a low diabetes pedigree function score of 0.142.###\nHence this label was No."
"This patient is a 42-year-old female who has been pregnant once. She has a diastolic blood pressure of 66, triceps skin fold thickness of 29, and a plasma glucose concentration of 100 after a glucose tolerance test. Her 2-hour serum insulin level is 196, and she has a body mass index of 32.0. The diabetes pedigree function for this patient is 0.444.###\nHence this label was No."
"The patient is a 38-year-old woman who has been pregnant 8 times. She has normal diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120 mg/dL, and her 2-hour serum insulin level is normal. She has a body mass index of 30.0, indicating she is overweight. The diabetes pedigree function score is low at 0.183, suggesting a relatively low genetic risk for diabetes.###\nHence this label was Yes."
"This is a data entry of a 34-year-old individual who has been pregnant 10 times. They have normal diastolic blood pressure but no triceps skin fold thickness. Their plasma glucose level after a 2-hour oral glucose tolerance test is 115, and their insulin level is low. They have a healthy body mass index of 24.0 and a moderate diabetes pedigree function score of 1.022.###\nHence this label was No."
"This 22-year-old patient has been pregnant three times and has low diastolic blood pressure of 44. They have a moderate triceps skin fold thickness of 13, normal glucose levels at 113, and no insulin recorded after a glucose tolerance test. With a healthy body mass index of 22.4 and a low diabetes pedigree function of 0.14, this individual appears to have low risk of developing diabetes.###\nHence this label was No."
"The patient is 33 years old with a history of 8 pregnancies and a low diastolic blood pressure of 70. The triceps skin fold thickness is 0, indicating low fat under the skin. The plasma glucose concentration after a glucose tolerance test is 108, which is within a healthy range. The 2-hour serum insulin level is 0, suggesting normal insulin production. The patient has a body mass index of 30.5, which is in the obese range. The diabetes pedigree function is 0.955, indicating a moderate genetic risk for diabetes.###\nHence this label was Yes."
"This patient is a 23-year-old female who has been pregnant twice. She has a healthy diastolic blood pressure of 62 and a low triceps skin fold thickness of 13. Her plasma glucose concentration is below normal at 68 and her 2-hour serum insulin level is also low at 15. With a body mass index of 20.1, she is within the normal weight range. Her diabetes pedigree function is low at 0.257, indicating a lower risk of developing diabetes.###\nHence this label was No."
"This patient is a 22-year-old female who is 1 time pregnant. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 23 mm. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 143 mg/dL, with a 2-hour serum insulin level of 310 μU/mL. She has a body mass index of 42.4 and a diabetes pedigree function of 1.076.###\nHence this label was No."
"The patient is a 40-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 27 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 144 mg/dL, and her 2-hour serum insulin level is 228 μU/mL. She has a body mass index of 33.9, indicating that she is overweight. The diabetes pedigree function, a measure of the hereditary risk of diabetes, is low at 0.255.###\nHence this label was No."
"The patient is a 24-year-old who has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and zero insulin levels. Their plasma glucose concentration after a glucose tolerance test is 119 mg/dL. Despite the absence of major risk factors, their body mass index is slightly high at 32.4. The diabetes pedigree function score suggests a low genetic predisposition to diabetes.###\nHence this label was Yes."
"This 31-year-old individual has been pregnant 10 times and has a low diastolic blood pressure of 62. They have a triceps skin fold thickness of 0, which is relatively low. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 92, indicating normal levels. The individual has no insulin in their serum after 2 hours. With a body mass index of 25.9, they are considered to be in the healthy weight range. Their diabetes pedigree function is low at 0.167, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"This 22-year-old individual has been pregnant 3 times and shows normal diastolic blood pressure. Their triceps skin fold thickness is within normal range, indicating a healthy amount of subcutaneous fat. With a plasma glucose concentration of 81 mg/dL and 2-hour serum insulin level of 66 mU/L, their blood sugar and insulin levels appear to be stable. The individual's body mass index (BMI) is 27.5, suggesting they are overweight but not obese. With a low diabetes pedigree function of 0.306, the risk of developing diabetes may be relatively low.###\nHence this label was No."
"A 23-year-old individual who is pregnant for the first time has a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 36. Their glucose levels are within a normal range at 118, and their insulin levels are slightly elevated at 94. Despite having a slightly high body mass index of 33.3, their risk of developing diabetes is low based on the diabetes pedigree function value of 0.261.###\nHence this label was No."
"A 25-year-old woman who has been pregnant twice shows normal diastolic blood pressure. She has a healthy triceps skin fold thickness, and her glucose levels are slightly elevated after a glucose tolerance test. Her insulin levels are higher than average, and she has a moderate body mass index. Overall, she has a low risk of developing diabetes based on her family history.###\nHence this label was Yes."
"This is a data entry for a 29-year-old individual who is 1 time pregnant. She has a diastolic blood pressure of 86 and a triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 119. She has a 2-hour serum insulin level of 220 and a body mass index of 45.6. Her diabetes pedigree function is 0.808.###\nHence this label was Yes."
"A 27-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 74, triceps skin fold thickness of 17, plasma glucose concentration of 155 after a glucose tolerance test, 2-hour serum insulin level of 96, body mass index of 26.6, and a diabetes pedigree function of 0.433.###\nHence this label was Yes."
"The patient is a 33-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 60 mmHg and a Triceps skin fold thickness of 33 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 103 mg/dL, with a 2-hour serum insulin level of 192 mIU/L. She has a healthy body mass index of 24.0 and a relatively high diabetes pedigree function score of 0.966, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 29-year-old female who has been pregnant twice shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Her glucose levels after a GTT are within the normal range, while her insulin levels are high. She has a moderately high BMI and a relatively low diabetes pedigree function score, indicating a moderate risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 24-year-old female who is currently pregnant for the first time. She has a diastolic blood pressure of 48, a triceps skin fold thickness of 45, and a plasma glucose concentration of 128 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 194, and her body mass index is 40.5. She has a diabetes pedigree function of 0.613, indicating a moderate genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 63-year-old woman who has been pregnant 5 times. She has a normal diastolic blood pressure of 70 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 158. She has no insulin in her blood after a 2-hour serum test. Her body mass index is 29.8, indicating she is overweight. The diabetes pedigree function value is 0.207, suggesting a low genetic risk of developing diabetes.###\nHence this label was No."
"This individual is a 33-year-old female who has never been pregnant. She has a very low diastolic blood pressure of 40 and a moderate triceps skin fold thickness of 35. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 137, indicating a normal level. However, her 2-hour serum insulin is elevated at 168. She has a high body mass index of 43.1, suggesting obesity. Additionally, her diabetes pedigree function is 2.288, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"This patient is a 23-year-old female who has been pregnant twice. She has normal diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration after a 2-hour glucose tolerance test is 99 mg/dL, which is within the healthy range. She has normal insulin levels and a low body mass index of 22.2. The diabetes pedigree function, a measure of diabetes heredity, is low at 0.108. Overall, based on these diagnostic measurements, this patient is at a low risk of developing diabetes.###\nHence this label was No."
"A 42-year-old woman who has been pregnant 8 times shows normal diastolic blood pressure and low triceps skin fold thickness. Her glucose levels after a glucose tolerance test are low, and she has no insulin in her blood. Despite having a high body mass index, her risk of developing diabetes is low due to a favorable diabetes pedigree function score of 0.6.###\nHence this label was No."
"This individual is a 21-year-old woman who has been pregnant twice. She has a low diastolic blood pressure of 60, a relatively low triceps skin fold thickness of 17, and a normal plasma glucose concentration of 99. Her 2-hour serum insulin level is high at 160, and she has a body mass index of 36.6, indicating obesity. The diabetes pedigree function score is 0.453, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This individual, a 36-year-old female, has never been pregnant. She has a healthy diastolic blood pressure of 70 and a normal Triceps skin fold thickness of 20. Her glucose levels, measured at 124 during an oral glucose tolerance test, indicate a normal metabolism. She has no insulin present in her bloodstream two hours post-meal. Her body mass index is 27.4, suggesting she is slightly overweight. The diabetes pedigree function score of 0.254 indicates a low genetic risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 62-year-old woman who has never been pregnant. She has a diastolic blood pressure of 84 and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 105. She has no insulin in her serum after 2 hours. Her body mass index is 27.9 and her diabetes pedigree function is 0.741.###\nHence this label was Yes."
"This patient is a 23-year-old female who has been pregnant 2 times. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 32. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 93, and her 2-hour serum insulin level is 160. She has a body mass index of 38.0 and a diabetes pedigree function of 0.674. These measurements indicate a risk for developing diabetes.###\nHence this label was Yes."
"A 25-year-old woman, who has been pregnant once, has a diastolic blood pressure of 66, triceps skin fold thickness of 13, plasma glucose concentration of 95 after a glucose tolerance test, 2-hour serum insulin level of 38, body mass index of 19.6, and a diabetes pedigree function value of 0.334.###\nHence this label was No."
"This patient is a 44-year-old woman who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a healthy body mass index of 33.8. Her plasma glucose level after a 2-hour oral glucose tolerance test is 117, and her 2-hour serum insulin level is 0. She has a slightly elevated diabetes pedigree function score of 0.932.###\nHence this label was No."
"This is a profile of a 21-year-old individual with 1 pregnancy. They have a normal diastolic blood pressure of 60 and a relatively high triceps skin fold thickness of 32. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 124, with low 2-hour serum insulin levels of 0. Their body mass index is 35.8, indicating obesity. The diabetes pedigree function value is 0.514, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 21-year-old individual with a low risk of developing diabetes, having been pregnant twice, with good blood pressure and glucose levels, but with low insulin levels. They have a relatively healthy body mass index and a low genetic susceptibility to diabetes.###\nHence this label was No."
"The patient is a 22-year-old woman who is pregnant for the first time. She has a low diastolic blood pressure of 56 and a low triceps skinfold thickness of 11. Her plasma glucose concentration is normal at 93, and she has no insulin in her blood after a 2-hour oral glucose tolerance test. Her body mass index is low at 22.5, and her diabetes pedigree function is 0.417. Overall, these values suggest a relatively healthy and low-risk profile for developing diabetes.###\nHence this label was No."
"A 55-year-old individual, who has been pregnant 7 times, with a diastolic blood pressure of 70, triceps skin fold thickness of 33, plasma glucose concentration of 195 after a GTT, 2-hour serum insulin level of 145, and a body mass index of 25.1. Their diabetes pedigree function is 0.163.###\nHence this label was Yes."
"The patient is a 42-year-old female who has been pregnant 8 times. She has a very low diastolic blood pressure of 55 and a low triceps skin fold thickness of 20. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85, with a 2-hour serum insulin level of 0. Despite her low insulin level, her body mass index is normal at 24.4. The diabetes pedigree function score is low at 0.136, suggesting a lower risk of developing diabetes.###\nHence this label was No."
"This data belongs to a 24-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 62, triceps skin fold thickness of 28, and a plasma glucose concentration of 92 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and their body mass index is 31.6. Additionally, they have a diabetes pedigree function of 0.13.###\nHence this label was No."
"A 40-year-old individual who has been pregnant 4 times with normal diastolic blood pressure, no triceps skin fold thickness, and a healthy body mass index of 27.6. Their blood glucose level after a glucose tolerance test is 141, with no insulin present in the serum. The diabetes pedigree function value is low at 0.244.###\nHence this label was No."
"This is data from a 22-year-old individual who has been pregnant 4 times. They have a healthy diastolic blood pressure of 60 and a normal body mass index of 28.2. Their triceps skin fold thickness is 23 and they have a moderate plasma glucose concentration of 97 after a glucose tolerance test. The individual has a 2-hour serum insulin level of 0 and a relatively low diabetes pedigree function score of 0.443.###\nHence this label was No."
"This data describes a 30-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 74, a triceps skin fold thickness of 25, and a plasma glucose concentration of 147 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 293, and they have a body mass index of 34.9. The diabetes pedigree function for this individual is 0.385.###\nHence this label was No."
"This individual is a 45-year-old who has been pregnant 6 times. They have normal blood pressure, no triceps skin fold thickness, and a high plasma glucose concentration after a glucose tolerance test. Their insulin levels are low, and they have a high body mass index. Additionally, their diabetes pedigree function indicates a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 48-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 74. They have a triceps skin fold thickness of 0 and a plasma glucose concentration of 104 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, with a body mass index of 28.8. The diabetes pedigree function for this individual is 0.153.###\nHence this label was No."
"This individual is a 24-year-old woman who has been pregnant twice. She has a normal diastolic blood pressure of 80 and a relatively low triceps skin fold thickness of 14. Her glucose tolerance test indicates a normal plasma glucose concentration of 90 and her 2-hour serum insulin level is also within the normal range at 55. With a healthy body mass index of 24.4, she has a low diabetes pedigree function score of 0.249, suggesting a lower risk of developing diabetes.###\nHence this label was No."
"This individual is a 61-year-old who has been pregnant 7 times. Their diastolic blood pressure is low at 60, while their triceps skin fold thickness is normal at 33. Their plasma glucose concentration after a glucose tolerance test is 142, and they have a high insulin level of 190. Despite this, their body mass index is within the healthy range at 28.8. Their diabetes pedigree function score is 0.687, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"A 41-year-old individual who has been pregnant 5 times and has a diastolic blood pressure of 66. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 112 after a GTT, and no 2-hour serum insulin. Their body mass index is 37.8, and they have a diabetes pedigree function of 0.261.###\nHence this label was Yes."
"A 26-year-old individual who has been pregnant 6 times shows no signs of blood pressure or triceps skin fold thickness. Their glucose concentration after a 2-hour oral test is 114, with no serum insulin detected. They have a body mass index of 0.0 and a diabetes pedigree function value of 0.189.###\nHence this label was No."
"The patient is a 58-year-old who has never been pregnant. They have a diastolic blood pressure of 78, a triceps skin fold thickness of 32, and a plasma glucose concentration of 173 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 265, and they have a body mass index of 46.5. Their diabetes pedigree function is 1.159, indicating a potential genetic predisposition to diabetes.###\nHence this label was No."
"A 22-year-old woman, who is pregnant for the first time, has normal diastolic blood pressure, a moderately low triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a glucose tolerance test. Her 2-hour serum insulin level is also elevated. She has a healthy body mass index and a relatively low diabetes pedigree function score.###\nHence this label was No."
"A 22-year-old individual who has been pregnant twice, with a low diastolic blood pressure of 56. Their triceps skin fold thickness is 27, plasma glucose concentration is 106 after a 2-hour oral glucose tolerance test, and their 2-hour serum insulin level is high at 165. They have a body mass index of 29.0 and a low diabetes pedigree function of 0.426. Overall, this individual shows some signs of high insulin levels and blood glucose, indicating a risk for diabetes.###\nHence this label was No."
"This data belongs to a 25-year-old individual who has been pregnant 2 times. They have normal diastolic blood pressure and insulin levels. They have a healthy body mass index of 28.9 and a low triceps skin fold thickness of 23. Their plasma glucose concentration after a glucose tolerance test is 87, indicating normal blood sugar levels. The diabetes pedigree function value is 0.773, suggesting a moderate genetic risk for diabetes.###\nHence this label was No."
"This is a data point of a 23-year-old individual who is pregnant for the first time. \nShe has a healthy diastolic blood pressure of 74 and a normal triceps skin fold thickness of 26.\nHer plasma glucose concentration after a 2-hour oral glucose tolerance test is 140, indicating a moderate blood sugar level.\nShe has a high 2-hour serum insulin level of 180.\nWith a body mass index of 24.1, she falls within the healthy weight range. \nHer diabetes pedigree function score is 0.828, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 21-year-old individual, who has been pregnant 4 times, with a diastolic blood pressure of 76 and a triceps skin fold thickness of 15. Their plasma glucose concentration following a glucose tolerance test is 99, and their 2-hour serum insulin level is 51. With a body mass index of 23.2 and a low diabetes pedigree function of 0.223, this person shows relatively low risk for developing diabetes.###\nHence this label was No."
"The patient is a 25-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 52 mmHg and a relatively low triceps skin fold thickness of 22 mm. Her plasma glucose concentration after a glucose tolerance test is 82 mg/dL, and she has a high 2-hour serum insulin level of 115 μU/mL. Despite this, her body mass index is within the normal range at 28.5, and she has a moderately high diabetes pedigree function score of 1.699.###\nHence this label was No."
"A 33-year-old woman, who is pregnant for the first time, with a diastolic blood pressure of 98, triceps skin fold thickness of 41, plasma glucose concentration at 2 hours of 128, 2-hour serum insulin level of 58, a body mass index of 32.0, and a diabetes pedigree function of 1.321.###\nHence this label was Yes."
"This 21-year-old individual has been pregnant twice and shows normal diastolic blood pressure. They have a relatively low triceps skin fold thickness and no serum insulin level recorded. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range. Despite having a high body mass index, their diabetes pedigree function value is low, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"The individual in the dataset is a 41-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 80, triceps skin fold thickness of 48, plasma glucose concentration of 120, and 2-hour serum insulin level of 200. Her body mass index is 38.9, and her diabetes pedigree function is 1.162.###\nHence this label was No."
"This patient is a 35-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 29, and a plasma glucose concentration of 116 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 32.3. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"A 25-year-old woman who is pregnant for the first time has a healthy diastolic blood pressure of 78. She has a moderately high triceps skin fold thickness of 29, and her plasma glucose concentration after a glucose tolerance test is within normal range at 116. Her 2-hour serum insulin level is elevated at 180. She has a high body mass index of 36.1 and a relatively low diabetes pedigree function of 0.496.###\nHence this label was No."
"The patient is 40 years old and has been pregnant 11 times. They have a diastolic blood pressure of 0 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 135 mg/dL, with a 2-hour serum insulin level of 0 μU/mL. The patient has a high body mass index of 52.3 and a diabetes pedigree function of 0.578.###\nHence this label was Yes."
