"The patient is a 54-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 110, triceps skin fold thickness of 24, and a high plasma glucose concentration of 171 after a glucose tolerance test. Her 2-hour serum insulin level is 240, indicating potential insulin resistance. With a high body mass index of 45.4 and a moderate diabetes pedigree function of 0.721, she may be at risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 22-year-old who is pregnant for the first time. They have a diastolic blood pressure of 70 and a triceps skin fold thickness of 28. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 106. Their 2-hour serum insulin level is 135. They have a body mass index of 34.2 and a diabetes pedigree function of 0.142.###\nHence this label was No."
"This is a profile of a 21-year-old individual who is pregnant for the first time. She has a healthy diastolic blood pressure of 74 and a moderate triceps skin fold thickness of 22. Her plasma glucose concentration after a glucose tolerance test is 143, with a 2-hour serum insulin level of 61. With a body mass index of 26.2 and a low diabetes pedigree function of 0.256, she appears to have a relatively low risk of developing diabetes.###\nHence this label was No."
"This 32-year-old individual has been pregnant 9 times and has a diastolic blood pressure of 84. Their triceps skin fold thickness is 21, while their plasma glucose concentration after a glucose tolerance test is 164. They have no insulin detected after 2 hours and have a body mass index of 30.8. Their diabetes pedigree function is 0.831.###\nHence this label was Yes."
"This individual is a 39-year-old female who has been pregnant three times. She has a low diastolic blood pressure of 70 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 78, and her 2-hour serum insulin level is 0. Despite having a body mass index of 32.5, indicating overweight, her diabetes pedigree function is low at 0.27.###\nHence this label was No."
"The data describes a 22-year-old individual who has been pregnant twice. They have a low diastolic blood pressure of 46 and a moderate triceps skin fold thickness of 21. Their plasma glucose concentration after a glucose tolerance test is 127, and they have a high 2-hour serum insulin level of 335. With a body mass index of 34.4, the individual is considered overweight. Their diabetes pedigree function is low at 0.176, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"This individual is a 51-year-old woman who has been pregnant 7 times. Her diastolic blood pressure is 84, triceps skin fold thickness is 21, and body mass index is 35.9, indicating she is overweight. Her plasma glucose concentration after a glucose tolerance test is high at 181, and her 2-hour serum insulin level is elevated at 192. The diabetes pedigree function score is 0.586, suggesting a moderate genetic predisposition to diabetes. Overall, this data indicates a high risk for developing diabetes.###\nHence this label was Yes."
"The individual is a 45-year-old female who is pregnant for the first time. \nShe has a diastolic blood pressure of 94 mmHg and a body mass index of 32.8, indicating possible obesity.\nHer triceps skin fold thickness and 2-hour serum insulin levels are both 0, which may suggest low muscle mass and insulin production.\nPlasma glucose concentration at 2 hours is 111 mg/dL, which is within normal range.\nThe diabetes pedigree function is 0.265, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"A 36-year-old woman, who has been pregnant once, shows normal diastolic blood pressure and a healthy body mass index. Her 2-hour serum insulin and triceps skin fold thickness are within normal ranges. However, her plasma glucose concentration after a glucose tolerance test is slightly below average. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 28-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 40. Her plasma glucose concentration after a glucose tolerance test is 123, and her 2-hour serum insulin level is 77. She has a body mass index of 34.1 and a diabetes pedigree function value of 0.269.###\nHence this label was No."
"A 30-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 92. They have no triceps skin fold thickness, a plasma glucose concentration of 110 after a glucose tolerance test, and zero 2-hour serum insulin. Their body mass index is 37.6 and they have a low diabetes pedigree function of 0.191.###\nHence this label was No."
"The patient is a 28-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 98, no triceps skin fold thickness, and a plasma glucose concentration of 115 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a high body mass index of 52.9. The diabetes pedigree function indicates a low genetic predisposition to diabetes at 0.209.###\nHence this label was Yes."
"A 24-year-old woman who is pregnant for the first time is being monitored for diabetes risk. She has a diastolic blood pressure of 68, triceps skin fold thickness of 34, plasma glucose concentration of 87, and 2-hour serum insulin level of 77. Her body mass index is 37.6 and her diabetes pedigree function is 0.401.###\nHence this label was No."
"The patient is a 25-year-old female who has never been pregnant. She has a low diastolic blood pressure of 62 and a healthy triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 107, and she has a moderate insulin level of 74. With a body mass index of 36.6, she is considered obese. However, her diabetes pedigree function is low at 0.757, indicating a lower risk of developing diabetes.###\nHence this label was Yes."
"A 36-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 70, triceps skin fold thickness of 22, plasma glucose concentration of 187, 2-hour serum insulin level of 200, body mass index of 36.4, and a diabetes pedigree function of 0.408.###\nHence this label was Yes."
"This is a 23-year-old individual who has been pregnant twice. Their diastolic blood pressure is 62, triceps skin fold thickness is 13, and plasma glucose concentration after a glucose test is 68. Additionally, they have a 2-hour serum insulin level of 15, a body mass index of 20.1, and a diabetes pedigree function value of 0.257.###\nHence this label was No."
"This individual is a 22-year-old who has never been pregnant. They have a healthy diastolic blood pressure of 70 and a moderate triceps skin fold thickness of 37. Their glucose levels after a 2-hour oral glucose tolerance test are at 106, with a higher than normal insulin level of 148. They have a high body mass index of 39.4 and a relatively low diabetes pedigree function score of 0.605.###\nHence this label was No."
"This patient is a 21-year-old individual who has never been pregnant and has normal diastolic blood pressure. They have no triceps skin fold thickness, low serum insulin levels, and a healthy body mass index. Their plasma glucose concentration after a glucose tolerance test is within the normal range. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"This 31-year-old female has been pregnant four times and shows normal diastolic blood pressure. She has no triceps skin fold thickness and a slightly elevated plasma glucose concentration after a glucose tolerance test. Her insulin levels are low, and she has a high body mass index. Despite a family history of diabetes, her diabetes pedigree function is relatively low.###\nHence this label was Yes."
"A 42-year-old woman, who has been pregnant once, underwent a diagnostic test revealing lower diastolic blood pressure, moderately high triceps skin fold thickness, average plasma glucose levels after a glucose tolerance test, high insulin levels after 2 hours, slightly elevated body mass index, and a moderate diabetes pedigree function score.###\nHence this label was No."
"This individual, a 41-year-old woman, has been pregnant 12 times. She has a diastolic blood pressure of 85 and a triceps skin fold thickness of 33. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 140. She has no 2-hour serum insulin. Her body mass index is 37.4, and her diabetes pedigree function is 0.244.###\nHence this label was No."
"This young individual, aged 22, with a low number of pregnancies, has a healthy diastolic blood pressure of 70. Their triceps skin fold thickness is within normal range at 13mm, and their plasma glucose concentration after a glucose tolerance test is 130 mg/dL. The 2-hour serum insulin level is 105 μU/mL, indicating normal insulin production. With a body mass index of 25.9, this individual falls within the healthy weight category. The diabetes pedigree function score of 0.472 suggests a low genetic risk of diabetes.###\nHence this label was No."
"This individual is a 27-year-old woman who is not pregnant. She has a low diastolic blood pressure of 60 and a healthy body mass index of 25.0. Her triceps skin fold thickness is 27, indicating a moderate amount of subcutaneous fat. Her plasma glucose concentration is 109, which is within the normal range. She has no insulin present in her blood after a 2-hour oral glucose tolerance test. Her diabetes pedigree function score is low at 0.206, suggesting a lower risk of developing diabetes based on her family history.###\nHence this label was No."
"The patient is a 57-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 29, and a plasma glucose concentration of 196 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 280, and she has a body mass index of 37.5. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes at 0.605.###\nHence this label was Yes."
"The patient is a 50-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 147 mg/dL, with a 2-hour serum insulin level of 0 μU/mL. The patient's body mass index is 29.5, and her diabetes pedigree function is 0.178.###\nHence this label was Yes."
"The patient is a 33-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 38. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 99. She has low insulin levels at 0. Her body mass index is 32.8 and her diabetes pedigree function is 0.145.###\nHence this label was No."
"A 26-year-old individual who has been pregnant 4 times shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Their glucose levels after a 2-hour oral test are normal, along with their insulin levels. However, they have a high body mass index and a moderate family history of diabetes.###\nHence this label was Yes."
"The patient is a young adult female, 26 years old, who is pregnant for the first time. She has a very low diastolic blood pressure of 38 and a moderately low triceps skin fold thickness of 18. Her plasma glucose concentration is within the normal range at 109, with a high 2-hour serum insulin level of 120. Despite being pregnant, her body mass index is relatively low at 23.1. The diabetes pedigree function score is 0.407, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 22-year-old woman who has been pregnant twice shows normal diastolic blood pressure and a healthy BMI of 29.8. She has a moderate triceps skin fold thickness of 18 and a slightly elevated plasma glucose concentration of 122. Her 2-hour serum insulin level is also slightly above average at 106, and she has a low diabetes pedigree function score of 0.717, indicating a relatively lower risk of developing diabetes.###\nHence this label was No."
"The patient is a 21-year-old female who has been pregnant four times. She has a diastolic blood pressure of 65, triceps skin fold thickness of 22, and a body mass index of 24.7. Her plasma glucose concentration after a glucose tolerance test is 94, and her 2-hour serum insulin level is 0. The diabetes pedigree function for this patient is 0.148.###\nHence this label was No."
"The patient is a 49-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 165 mg/dL. She has no serum insulin levels after 2 hours. Her body mass index is 30.4, and her diabetes pedigree function is 0.302. Overall, the data suggests a potential risk for developing diabetes due to the elevated glucose levels and high BMI.###\nHence this label was Yes."
"A 50-year-old individual, who has been pregnant once, with normal diastolic blood pressure, moderate triceps skin fold thickness, high plasma glucose concentration after a GTT, moderate serum insulin level, elevated body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was No."
"The patient is a 38-year-old female who has been pregnant once. She has a normal diastolic blood pressure of 74 and a high plasma glucose concentration of 173 after a glucose tolerance test. Despite having a high BMI of 36.8, she has a very low triceps skin fold thickness of 0. This indicates a potential risk for developing diabetes, although her insulin levels are normal. The patient also has a low diabetes pedigree function score of 0.088.###\nHence this label was Yes."
"This patient is 29 years old, has been pregnant once, and has a low diastolic blood pressure of 50. Their triceps skin fold thickness is 19, which is within a healthy range. The patient's plasma glucose concentration after a glucose tolerance test is 107, indicating normal blood sugar levels. They have no insulin present after a 2-hour serum test. With a body mass index of 28.3, they are slightly overweight. The diabetes pedigree function score is low at 0.181, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"The patient is a 41-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 187, with a 2-hour serum insulin level of 304. She has a body mass index of 37.7 and a diabetes pedigree function of 0.254.###\nHence this label was Yes."
"The patient is a 31-year-old female who is 1 time pregnant. She has slightly elevated diastolic blood pressure at 90. She also has a high triceps skin fold thickness of 51, indicating excess body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122, which is within the normal range. However, her 2-hour serum insulin level is high at 220, suggesting possible insulin resistance. Her body mass index is 49.7, classified as obese. The diabetes pedigree function score is low at 0.325, indicating a lower genetic risk for diabetes.###\nHence this label was Yes."
"A young woman, aged 24, who is pregnant for the first time, has a low diastolic blood pressure of 48. She has a high triceps skin fold thickness of 45 and a moderate plasma glucose concentration of 128 after a GTT. Her 2-hour serum insulin level is high at 194, and she has a high body mass index of 40.5. The diabetes pedigree function indicates a moderate genetic risk for diabetes at 0.613.###\nHence this label was Yes."
"A 31-year-old woman who has been pregnant 7 times shows normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness is moderate and her plasma glucose concentration after a glucose tolerance test is within normal range. Although her 2-hour serum insulin level is slightly elevated, her diabetes pedigree function indicates a low risk of developing diabetes.###\nHence this label was No."
"The patient is a 25-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 62 and a healthy body mass index of 25.1. Her triceps skin fold thickness is normal at 18. The patient's plasma glucose concentration is 90, and her 2-hour serum insulin level is 59. She has a relatively high diabetes pedigree function score of 1.268, indicating a potential genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 33-year-old female who has been pregnant 9 times. She has a low diastolic blood pressure of 62 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 89, with a 2-hour serum insulin level of 0. Despite being pregnant multiple times, she maintains a low body mass index of 22.5 and has a low diabetes pedigree function of 0.142.###\nHence this label was No."
"This is a data record of a 44-year-old individual who has been pregnant 12 times and has a diastolic blood pressure of 80. They have a triceps skin fold thickness of 0 and a plasma glucose concentration of 106 after a 2-hour oral glucose tolerance test. The individual has a 2-hour serum insulin level of 0 and a body mass index of 23.6. Their diabetes pedigree function is 0.137.###\nHence this label was No."
"This individual is a 39-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 90 and a triceps skin fold thickness of 41. Her plasma glucose concentration after a GTT is 137. She has no insulin after a 2-hour serum test. Her body mass index is 32.0 and her diabetes pedigree function is 0.391.###\nHence this label was No."
"A 23-year-old individual who is 4 times pregnant with a diastolic blood pressure of 86, triceps skin fold thickness of 20, plasma glucose concentration at 129, 2-hour serum insulin level at 270, body mass index of 35.1, and a diabetes pedigree function of 0.231.###\nHence this label was No."
"A 50-year-old individual who has been pregnant 11 times, with a diastolic blood pressure of 74, triceps skin fold thickness of 26, plasma glucose concentration of 138, 2-hour serum insulin level of 144, body mass index of 36.1, and a diabetes pedigree function of 0.557.###\nHence this label was Yes."
"The patient is a 42-year-old woman who has been pregnant 13 times. She has a diastolic blood pressure of 90 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 126, and she has not produced any insulin after a 2-hour serum test. She has a body mass index of 43.4 and a diabetes pedigree function value of 0.583.###\nHence this label was Yes."
"A 29-year-old woman who has been pregnant 9 times shows slightly elevated diastolic blood pressure and average triceps skin fold thickness. Her glucose levels are within normal range after a 2-hour oral glucose tolerance test, with no significant insulin levels. She has a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was Yes."
"A 41-year-old woman who has been pregnant 9 times shows normal diastolic blood pressure (80) and a slightly low triceps skin fold thickness (37). Her glucose concentration after a glucose tolerance test is very low (57) and she has no insulin present after 2 hours. She has a high body mass index of 32.8, but a low diabetes pedigree function of 0.096.###\nHence this label was No."
"A 24-year-old individual who has been pregnant three times with a healthy diastolic blood pressure of 72. Their triceps skinfold thickness is normal at 33mm. They have a slightly elevated plasma glucose concentration at 171 mg/dL after a glucose tolerance test and a higher than average 2-hour serum insulin level of 135 μU/mL. Their body mass index is in the overweight range at 33.3, but their diabetes pedigree function value is low at 0.199, indicating a lower genetic risk for diabetes.###\nHence this label was Yes."
"This individual is a 21-year-old who has never been pregnant. Their diastolic blood pressure is at a normal level of 80. They have a relatively low triceps skin fold thickness of 16. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 113, indicating normal blood sugar levels. Their 2-hour serum insulin level is 0, suggesting they are not producing insulin at this time point. The body mass index is 31.0, placing them in the obese category. The diabetes pedigree function score is 0.874, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 23-year-old woman who has never been pregnant has slightly elevated diastolic blood pressure and a high body mass index. Her glucose levels are also elevated, indicating a risk for developing diabetes. Despite not having any insulin in her system, her family history suggests a moderate genetic predisposition to the disease.###\nHence this label was Yes."
"This is a 58-year-old individual who has been pregnant 8 times. They have a normal diastolic blood pressure of 76 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 110, and their 2-hour serum insulin level is 0. With a body mass index of 27.8 and a low diabetes pedigree function of 0.237, this individual may have a lower risk of developing diabetes.###\nHence this label was No."
"The individual is 28 years old and has been pregnant three times. Their diastolic blood pressure is 64, triceps skin fold thickness is 29, and plasma glucose concentration after a glucose tolerance test is 129. Their 2-hour serum insulin level is 115, and their body mass index is 26.4. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.219.###\nHence this label was Yes."
"The patient is a 52-year-old female who has been pregnant once. She has normal diastolic blood pressure and a slightly elevated plasma glucose concentration. She has a high body mass index and a moderate diabetes pedigree function. The patient has low 2-hour serum insulin levels and a moderate triceps skin fold thickness.###\nHence this label was Yes."
"A 46-year-old individual who has been pregnant 8 times shows low diastolic blood pressure, moderate triceps skin fold thickness, and high plasma glucose concentration after a glucose tolerance test. They have very high levels of serum insulin, are in the obese BMI range, and have a moderate diabetes pedigree score.###\nHence this label was Yes."
"The patient, a 21-year-old female who has never been pregnant, has a below-normal diastolic blood pressure of 56. She has a healthy triceps skin fold thickness of 13 and a normal plasma glucose concentration of 124 after a glucose tolerance test. Her 2-hour serum insulin level is 105, indicating good insulin sensitivity. With a body mass index of 21.8, she is within the healthy weight range. Her low diabetes pedigree function score of 0.452 suggests a lower genetic risk of developing diabetes.###\nHence this label was No."
"A 52-year-old individual who has been pregnant twice with normal blood pressure and no triceps skin fold thickness. Their glucose levels after a glucose tolerance test are within normal range. There is no insulin present in their serum. They have a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was Yes."
"The patient is a 53-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 86 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 156 mg/dL. She has no detectable insulin levels after a 2-hour serum test. Her body mass index is 24.8, and her diabetes pedigree function is 0.23.###\nHence this label was Yes."
"A 32-year-old woman who has never been pregnant presents with normal diastolic blood pressure, no triceps skin fold thickness, and slightly elevated plasma glucose levels after a 2-hour oral glucose tolerance test. She has no serum insulin present, a high body mass index, and a moderate diabetes pedigree function score.###\nHence this label was Yes."
"This data belongs to a 26-year-old individual who has never been pregnant. Their diastolic blood pressure is 76, triceps skin fold thickness is 43, and plasma glucose concentration after a GTT is 165. The 2-hour serum insulin level is 255, and their body mass index is 47.9. The diabetes pedigree function is 0.259.###\nHence this label was No."
"The individual is a 58-year-old who has never been pregnant. They have a diastolic blood pressure of 78, triceps skin fold thickness of 32, and a high plasma glucose concentration of 173 after a glucose tolerance test. Their 2-hour serum insulin level is notably high at 265, and they have a body mass index of 46.5. The diabetes pedigree function value is 1.159, indicating a genetic predisposition to diabetes.###\nHence this label was No."
"This 24-year-old individual, who has been pregnant once, shows no signs of high blood pressure, with a diastolic blood pressure of 72. Their triceps skin fold thickness is 21, indicating a healthy amount of subcutaneous fat. However, their plasma glucose concentration after a GTT is 157, which is slightly elevated. The 2-hour serum insulin level is high at 168, suggesting possible insulin resistance. With a body mass index of 25.6, this person is considered to be in the overweight category. The diabetes pedigree function score of 0.123 indicates a low genetic risk for diabetes.###\nHence this label was No."
"The individual is a 21-year-old who has never been pregnant. They have a diastolic blood pressure of 68, a triceps skin fold thickness of 14, and a plasma glucose concentration of 137 after a glucose tolerance test. Their 2-hour serum insulin level is 148, and they have a body mass index of 24.8. Their diabetes pedigree function is 0.143.###\nHence this label was No."
"The individual is a 25-year-old who has never been pregnant. She has a low diastolic blood pressure of 66 and a moderately high triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is elevated at 180. Despite having no insulin present after the test, her body mass index is high at 42.0. Additionally, she has a family history of diabetes, as indicated by her diabetes pedigree function of 1.893.###\nHence this label was Yes."
"This 23-year-old individual has been pregnant 6 times and has a low diastolic blood pressure of 50. They have a healthy triceps skin fold thickness of 30. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 93, and their 2-hour serum insulin level is 64. With a body mass index of 28.7, they are considered overweight. Their diabetes pedigree function value is 0.356, indicating a low genetic risk for diabetes.###\nHence this label was No."
