"The individual has donated blood 5 times, with the most recent donation occurring 4 months ago. In total, they have donated 1250 c.c. of blood. They have been donating blood for a period of 16 months.###\nHence this label was Yes."
"The individual has donated blood 11 times in total, with the most recent donation being 5 months ago. The total amount of blood donated is 2750 cubic centimeters. The individual has been donating blood for 75 months.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation being 21 months ago. Over the course of 35 months since their first donation, they have donated a total of 500 c.c. of blood.###\nHence this label was No."
"The individual last donated blood 16 months ago, has donated a total of 6 times, amounting to 1500 cubic centimeters. They have been donating blood for the past 50 months.###\nHence this label was No."
"The individual donated blood once, 11 months ago, contributing 250cc in total. This was their first donation, and currently, they have not donated blood since then.###\nHence this label was No."
"The individual has donated blood recently, just 2 months ago. They have a history of donating blood 5 times, with a total of 1250 c.c. donated. They have been donating blood for 16 months now.###\nHence this label was No."
"The individual has donated blood three times in the past, with the most recent donation being 14 months ago. They have donated a total of 750cc of blood over a period of 31 months since their first donation.###\nHence this label was No."
"The individual donated blood one month ago, a total of 9 times, contributing to a total of 2250 c.c. over the course of 51 months since their first donation.###\nHence this label was No."
"The individual donated blood 5 times, with the last donation occurring 4 months ago. Over a period of 26 months since the first donation, the total amount of blood donated is 1250 cubic centimeters.###\nHence this label was Yes."
"The individual donated blood 2 months ago for the 2nd time, totaling 500 c.c. of blood. They have been donating blood for 33 months.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 c.c. four months ago. They have been donating for a total of four months.###\nHence this label was Yes."
"The individual donated blood 4 times in total, with the last donation being 16 months ago. The cumulative amount of blood donated is 1000 cubic centimeters over a period of 45 months since their first donation.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation being 14 months ago. The total amount of blood donated is 1750 cubic centimeters. The individual has been donating blood for 45 months.###\nHence this label was No."
"The individual donated blood 2 times in total, with the last donation being 9 months ago. The total amount of blood donated is 500 c.c. The individual has been donating blood for 52 months.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation occurring 9 months ago. Over the course of 16 months since their first donation, they have donated a total of 500 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood twice in the past, with the last donation being 2 months ago. They have donated a total of 500 c.c. of blood over a period of 16 months since their first donation.###\nHence this label was No."
"The individual has donated blood 13 times, with the most recent donation being 2 months ago. Over the course of 32 months, they have donated a total of 3250 cubic centimeters of blood.###\nHence this label was Yes."
"The individual has donated blood once in the past, approximately 16 months ago, contributing a total of 250 cubic centimeters. This donation occurred 16 months after their first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 cubic centimeters of blood. This donation took place 2 months ago, and it was the first time this person donated blood.###\nHence this label was No."
"The individual donated blood 14 times, with the most recent donation occurring 7 months ago. In total, they donated 3500 cubic centimeters of blood over a period of 48 months since their first donation.###\nHence this label was No."
"The individual has donated blood regularly in the past, with the last donation being 4 months ago. They have donated a total of 3 times, giving a total of 750 c.c. of blood. They have been donating blood for 16 months.###\nHence this label was Yes."
"The individual donated blood 2 times in total, with the most recent donation being 7 months ago. The total amount donated is 500 c.c., and the individual has been donating for 16 months.###\nHence this label was No."
"This individual donated blood 2 times, with the most recent donation being 4 months ago. They have donated a total of 500 cubic centimeters of blood over a period of 13 months since their first donation.###\nHence this label was No."
"The individual donated blood once 23 months ago, giving a total of 250 c.c. Since then, they have not donated again. It has been 23 months since their first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 c.c. two months ago. They have been donating for only two months in total.###\nHence this label was No."
"The individual donated blood 4 times in total, with the most recent donation being 2 months ago. They have donated a total of 1000 c.c. of blood over a period of 14 months since their first donation.###\nHence this label was No."
"The individual donated blood 3 months ago for the 2nd time, totaling 500 c.c. of blood. They have been donating for 23 months.###\nHence this label was No."
"The individual donated blood 17 times, with the last donation being 4 months ago. The total amount of blood donated is 4250 cubic centimeters, and they have been donating for 71 months.###\nHence this label was Yes."
"The individual has donated blood once, giving a total of 250cc, with the most recent donation being 16 months ago. They have been donating blood for 16 months.###\nHence this label was No."
"The individual donated blood 16 times in total, with the most recent donation being 1 month ago. Over the course of 35 months, they have donated a total of 4000 cubic centimeters of blood.###\nHence this label was Yes."
"The individual had their last blood donation 16 months ago, has donated blood once, giving a total of 250 cubic centimeters, and has been donating for 16 months.###\nHence this label was No."
"The individual has not donated blood in the past 25 months. They have donated blood a total of 6 times, which amounts to 1500 cubic centimeters in total. The person has been donating blood for 50 months.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation being 21 months ago. The total amount of blood donated is 500 cubic centimeters. They have been donating blood for 33 months.###\nHence this label was No."
"The individual has donated blood three times in total, with the most recent donation being 2 months ago. Over the course of 24 months since their first donation, they have donated a total of 750 c.c. of blood.###\nHence this label was No."
"The individual donated blood once 14 months ago, giving a total of 250cc. It has been 14 months since their first donation.###\nHence this label was No."
"The individual donated blood 2 months ago for the second time, with a total of 500 c.c. donated so far over a period of 11 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 22 times, with the most recent donation occurring 11 months ago. Over the course of 98 months since first donation, the total amount of blood donated is 5500 c.c.###\nHence this label was No."
"The individual has donated blood recently, approximately 1 month ago. They have donated a total of 7 times, with a cumulative amount of 1750 cubic centimeters. This person has been donating blood for a period of 57 months.###\nHence this label was No."
"The individual has donated blood twice, with the first donation made 14 months ago and the most recent donation also 14 months ago, totaling 500cc of blood donated overall.###\nHence this label was No."
"The individual donated blood 2 months ago for the second time, contributing a total of 500cc. They have been donating for the past 4 months.###\nHence this label was No."
"The individual has donated blood 5 times, with the most recent donation being 4 months ago. Over the course of 74 months, they have donated a total of 1250 c.c. of blood.###\nHence this label was No."
"The individual donated blood 4 times, with the most recent donation being 2 months ago. They have donated a total of 1000 c.c. of blood over a period of 14 months since their first donation.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250cc, 4 months ago. This was their first time donating blood.###\nHence this label was No."
"The individual donated blood 4 months ago for the first time and has donated a total of 250cc of blood in 1 donation.###\nHence this label was No."
"The individual has donated blood 12 times, with the most recent donation being 2 months ago. Over the course of 52 months, they have donated a total of 3000 c.c. of blood.###\nHence this label was No."
"The individual has donated blood for a total of 4 times over the past 52 months. The most recent donation was done 21 months ago, contributing to a total of 1000 c.c. of blood given.###\nHence this label was No."
"The individual has donated blood 3 times, with the most recent donation being 4 months ago. In total, they have donated 750 c.c. of blood over the past 25 months since they started donating.###\nHence this label was Yes."
"The individual has donated blood 6 times, with the most recent donation being 21 months ago. In total, they have donated 1500 cubic centimeters of blood over the course of 48 months since their first donation.###\nHence this label was No."
"The individual donated blood once 14 months ago, giving a total of 250 cc of blood. They have been donating for 14 months since their first donation.###\nHence this label was No."
"The individual has donated blood 14 times, with the last donation being 20 months ago. They have donated a total of 3500 c.c. of blood over a period of 69 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 7 times, with the last donation being 16 months ago. The total amount of blood donated is 1750 cubic centimeters over a period of 39 months since the first donation.###\nHence this label was No."
"The individual has donated blood 3 times in total, with the most recent donation being 9 months ago. The total amount of blood donated is 750 c.c. and they have been donating for 34 months.###\nHence this label was No."
"The individual last donated blood 21 months ago, has donated blood once, totaling 250cc, and has been donating for a period of 21 months.###\nHence this label was No."
"The individual donated blood once 21 months ago, contributing a total of 250 c.c. This was their first donation 21 months ago.###\nHence this label was No."
"The individual donated blood once 16 months ago, giving a total of 250 c.c. of blood. This was their first donation and they have not donated since then. They have been eligible to donate for 16 months.###\nHence this label was No."
"The individual has donated blood 16 times, with the most recent donation being 4 months ago. Over the span of 98 months, they have donated a total of 4000 c.c. of blood.###\nHence this label was Yes."
"The individual donated blood once 14 months ago, amounting to a total of 250 cc. This was the first time they donated blood, and they have not donated since.###\nHence this label was No."
"The individual has donated blood 6 times in the past, with the most recent donation being 11 months ago. They have donated a total of 1500 cubic centimeters of blood over a period of 41 months since their first donation. The task is to predict whether this person will consent to donate blood again in the future.###\nHence this label was No."
"The individual last donated blood 14 months ago, has donated blood once, totaling 250 c.c., and has been donating for 14 months.###\nHence this label was No."
"The individual has donated blood relatively recently, 4 months ago, with a total of 9 donations amounting to 2250 c.c. of blood. They have been donating for a period of 26 months.###\nHence this label was Yes."
"The individual donated blood 2 months ago for the 2nd time, totaling 500 c.c. of blood. They have been donating for 14 months.###\nHence this label was No."
"The individual has donated blood 3 times in total, with the most recent donation being 21 months ago. The total amount of blood donated is 750 c.c. and they have been donating for 26 months.###\nHence this label was Yes."
"The individual has donated blood 6 times, with the most recent donation being 2 months ago. The total amount of blood donated is 1500 c.c. and they have been donating for 22 months.###\nHence this label was Yes."
"The individual has not donated blood for 14 months, has donated blood 6 times in total, totaling 1500 c.c. of blood. They have been donating blood for 51 months.###\nHence this label was No."
