"The individual last donated blood 16 months ago, has donated a total of 3 times, giving a total of 750 cubic centimeters of blood. They have been donating for 86 months.###\nHence this label was No."
"The individual has not donated blood in 16 months. They have donated blood 7 times, with a total of 1750 cc donated. They have been donating blood for 93 months.###\nHence this label was No."
"The individual donated blood once 23 months ago, giving a total of 250 c.c. of blood. This was their first donation, and they have not donated since.###\nHence this label was No."
"The individual has donated blood recently, 1 month ago, and has donated a total of 14 times, resulting in a total of 3500 c.c. of blood given. They have been donating for a period of 58 months.###\nHence this label was No."
"The individual has donated blood 10 times, with the most recent donation being 4 months ago. Over a period of 28 months since the first donation, the individual has donated a total of 2500 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood 6 times, with the most recent donation being 4 months ago. The total amount of blood donated is 1500 c.c. and they have been donating blood for 47 months.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation being 2 months ago. They have donated a total of 2000 c.c. of blood over a period of 35 months since their first donation.###\nHence this label was Yes."
"The individual donated blood once 14 months ago, giving a total of 250 cc. Since then, they have not made any additional donations.###\nHence this label was No."
"The individual has donated blood once in the past, with a total of 250cc donated. This donation occurred 2 months ago, and it has been 2 months since their first donation.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation occurring 21 months ago. They have donated a total of 500 cubic centimeters of blood over a period of 23 months since their first donation.###\nHence this label was No."
"The individual donated blood 2 times in total, with the most recent donation occurring 9 months ago. Over the course of 26 months since their first donation, they have donated a total of 500 c.c. of blood.###\nHence this label was No."
"The individual donated blood 2 times in the past, with the most recent donation made 3 months ago. The total amount of blood donated is 500 c.c. The individual has been donating blood for 23 months.###\nHence this label was No."
"The individual has donated blood 3 times in total, with the most recent donation being 14 months ago. The total amount of blood donated is 750 cubic centimeters, and the individual has been donating for 26 months.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation being 11 months ago. They have donated a total of 2000 cubic centimeters of blood over a period of 72 months since their first donation.###\nHence this label was No."
"The individual has donated blood 9 times in total, with the most recent donation being 9 months ago. The total amount of blood donated is 2250 cubic centimeters. This person has been donating blood for 16 months.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation being 2 months ago. The total amount of blood donated is 500 c.c. over a span of 11 months since their first donation.###\nHence this label was No."
"The individual donated blood 5 times, with the most recent donation being 4 months ago. Over a period of 46 months since the first donation, they have contributed a total of 1250 c.c. of blood.###\nHence this label was No."
"The individual last donated blood 14 months ago, has donated blood only once, totaling 250cc, and has been donating for 14 months.###\nHence this label was No."
"The individual has donated blood seven times, with the most recent donation being 14 months ago. Over the course of 45 months, they have donated a total of 1750 c.c. of blood.###\nHence this label was No."
"The individual donated blood 6 times, with the most recent donation being 2 months ago. They have donated a total of 1500 cubic centimeters of blood over the course of 26 months since their first donation.###\nHence this label was No."
"The individual donated blood 6 times, with the most recent donation being 11 months ago. In total, they have donated 1500 c.c. of blood over a period of 41 months since their first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250cc, just two months after their first donation, and has not donated for the past two months.###\nHence this label was No."
"The individual donated blood 4 times in the past, with the most recent donation made 2 months ago. The total amount of blood donated is 1000 c.c. and they have been donating for the past 70 months.###\nHence this label was No."
"The individual donated blood 2 months ago for the second time, contributing a total of 500 c.c. They have been donating for 2 months since they started.###\nHence this label was No."
"The individual has donated blood 5 times, with the most recent donation being 21 months ago. The total amount of blood donated is 1250 c.c. and they have been donating for a total of 60 months.###\nHence this label was No."
"The individual has donated blood 2 times, with the most recent donation being 11 months ago. The total amount of blood donated is 500 c.c. and they have been donating for 24 months now.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 14 months ago. The total amount of blood donated is 1250 c.c. The individual has been donating blood for 28 months.###\nHence this label was Yes."
"The individual donated blood 2 times, with the last donation being 21 months ago. The total amount of blood donated is 500 cubic centimeters, and they have been donating blood for 25 months.###\nHence this label was No."
"The individual has donated blood 14 times in total, with the most recent donation being 23 months ago. They have donated a total of 3500 c.c. of blood over a period of 93 months since their first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 cubic centimeters, four months ago. They have been donating for a total of four months.###\nHence this label was No."
"The individual has donated blood 5 times, with the most recent donation being 2 months ago. In total, they have donated 1250 cubic centimeters of blood. They have been donating blood for the past 16 months.###\nHence this label was No."
"The individual donated blood 4 times in total, with the most recent donation being 13 months ago. They have donated a total of 1000 c.c. of blood over a period of 21 months since their first donation.###\nHence this label was No."
"The individual donated blood 5 times with the most recent donation being 3 months ago. The total amount donated is 1250 c.c. The individual has been donating for a year.###\nHence this label was Yes."
"The individual has donated blood 6 times in the past, with the most recent donation being 21 months ago. Over a period of 86 months, they have donated a total of 1500 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood 15 times, with the most recent donation being 23 months ago. In total, they have donated 3750 cc of blood. They have been donating blood for the past 57 months.###\nHence this label was No."
"The individual has donated blood 9 times, with the most recent donation being 4 months ago. Over the course of 40 months, they have donated a total of 2250 c.c. of blood.###\nHence this label was No."
"The individual donated blood 2 months ago, has donated a total of 2 times, amounting to 500 cubic centimeters, and has been donating for 4 months.###\nHence this label was Yes."
"The individual donated blood 12 times in total, with the most recent donation being 2 months ago. They have donated a total of 3000 cubic centimeters of blood over the course of 52 months since their first donation.###\nHence this label was No."
"The individual has donated blood two months ago for the second time, amounting to a total of 500 c.c. They have been donating blood for a total of two months.###\nHence this label was No."
"The individual donated blood once 14 months ago, contributing 250 c.c. Since then, they have not donated blood again. This marks their first donation, and the donation activity has been stagnant for the past 14 months.###\nHence this label was No."
"The individual has donated blood 3 times in total. The last donation was 14 months ago, and they have been donating for 28 months. The total amount of blood donated is 750 c.c.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 c.c. The last donation was done 2 months ago, and they have been donating for a total of 2 months.###\nHence this label was No."
"The individual donated blood 4 months ago, had donated a total of 4 times, giving a total of 1000cc of blood, and has been donating for 16 months.###\nHence this label was No."
"The individual has donated blood 20 times, with the most recent donation being 2 months ago. Over the course of 45 months since first donation, they have donated a total of 5000 c.c. of blood.###\nHence this label was Yes."
"The individual donated blood 5 times in total, with the most recent donation being 4 months ago. Over the course of 28 months since their first donation, they have donated a total of 1250 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood 9 times in total, with the most recent donation being 9 months ago. The total amount of blood donated is 2250 cubic centimeters. The individual has been donating blood for the past 54 months.###\nHence this label was No."
"The individual has donated blood four times in total, with the most recent donation occurring 4 months ago. The total amount of blood donated is 1000 c.c., and they have been donating blood for the past 34 months.###\nHence this label was Yes."
"The individual last donated blood 14 months ago, has donated a total of 3 times, amounting to 750 c.c., and has been donating for 26 months.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation occurring 11 months ago. They have donated a total of 1750 c.c. of blood over a period of 64 months since their first donation.###\nHence this label was No."
"The individual donated blood 19 times, with the most recent donation being 23 months ago. In total, they have donated 4750 cubic centimeters of blood over a period of 62 months since their first donation.###\nHence this label was No."
"This individual donated blood 2 times in total, with the last donation being 11 months ago. They have donated a total of 500 c.c. of blood over the course of 21 months since they first started donating.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation being 2 months ago. The total amount of blood donated is 500 c.c. and they have been donating for 4 months.###\nHence this label was Yes."
"The individual has donated blood 7 times in total, with the most recent donation being 14 months ago. They have donated a total of 1750 cubic centimeters of blood over a period of 73 months since their first donation.###\nHence this label was No."
"The individual last donated blood 4 months ago, has donated blood a total of 5 times which amounts to 1250 c.c., and has been donating blood for 11 months.###\nHence this label was Yes."
"The individual donated blood 12 times, with the most recent donation being 23 months ago. Over a period of 86 months, they donated a total of 3000 c.c. of blood.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation being 11 months ago. Over the course of 48 months, they have donated a total of 2000 c.c. of blood.###\nHence this label was No."
"The individual donated blood 3 times in the past, with the most recent donation being 2 months ago. Over a period of 21 months since the first donation, a total of 750 cubic centimeters of blood was donated.###\nHence this label was No."
"The individual has donated blood recently, 3 months ago. They have donated a total of 16 times, with a sum of 4000 c.c. of blood donated. They have been donating for quite some time, as it has been 74 months since their first donation.###\nHence this label was No."
"The individual has donated blood 8 times, with the most recent donation being 14 months ago. They have donated a total of 2000 c.c. of blood over the past 50 months.###\nHence this label was No."
"The individual donated blood once in the past, approximately 16 months ago, contributing a total of 250cc. They have been donating blood for a total of 16 months since their first donation.###\nHence this label was No."
"The individual has donated blood 6 times in total, with the last donation being 2 months ago. The total amount of blood donated is 1500 c.c. and they have been donating for 28 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 8 times in total, with the most recent donation being 4 months ago. Over the course of 48 months, they have donated a total of 2000 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood once, 2 months ago, giving a total of 250 c.c. The first donation was also made 2 months ago.###\nHence this label was No."
"The individual has donated blood 15 times, with the most recent donation being 2 months ago. Over the course of 64 months since the first donation, they have donated a total of 3750 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the last donation being 10 months ago. The total amount of blood donated is 1000 c.c. They have been donating blood for the past 16 months.###\nHence this label was No."
"The individual donated blood 10 times, with the most recent donation being 2 months ago. Over a period of 52 months, they have donated a total of 2500 c.c. of blood.###\nHence this label was No."
"The individual has donated blood 12 times, with the last donation being 11 months ago. The total amount of blood donated is 3000 c.c. and they have been donating for 58 months.###\nHence this label was No."
"The individual donated blood 2 times in total. The last donation was done 4 months ago, and the first donation was 9 months ago, with a total of 500cc blood donated so far.###\nHence this label was No."
"The individual donated blood 3 times, with the most recent donation being 4 months ago. Over the course of 16 months since the first donation, they have donated a total of 750 c.c. of blood.###\nHence this label was Yes."
"The individual donated blood 2 times in total, with the last donation done 14 months ago. They have donated a total of 500 c.c. of blood over the span of 14 months since their first donation.###\nHence this label was No."
"The individual has donated blood six times in total, with the most recent donation being 14 months ago. Over the course of 34 months since their first donation, they have donated a total of 1500 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood 5 times, with the most recent donation being 4 months ago. They have donated a total of 1250 c.c. of blood over a period of 16 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 7 times in total, with the most recent donation being 2 months ago. Over a period of 35 months, they have donated a total of 1750 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood 6 times in total, with the most recent donation being 4 months ago. The total amount of blood donated is 1500 cubic centimeters. They have been donating blood for the past 35 months.###\nHence this label was Yes."
"The individual has donated blood recently, just 2 months ago, and has donated a total of 7 times. The total amount of blood donated is 1750 cubic centimeters. It has been 29 months since the individual's first donation.###\nHence this label was No."
"The individual donated blood once 11 months ago, giving a total of 250 c.c. They have been donating for a total of 11 months.###\nHence this label was No."
"The individual donated blood once four months ago, giving a total of 250cc. They have been donating for the past four months.###\nHence this label was No."
"The individual has donated blood 4 times in the past, with the most recent donation occurring 4 months ago. In total, they have donated 1000 cubic centimeters of blood. It has been 4 months since their first donation.###\nHence this label was No."
"The individual donated blood 4 months ago for the first time, and has donated a total of 250cc of blood. Their last donation was 4 months ago.###\nHence this label was No."
"The individual has donated blood 14 times in total, with the most recent donation being 11 months ago. The total amount of blood donated is 3500 c.c., and they have been donating blood for 73 months.###\nHence this label was Yes."
"The individual has donated blood 6 times, with the most recent donation being 2 months ago. In total, they have donated 1500 c.c. of blood over a period of 16 months since their first donation.###\nHence this label was Yes."
"The individual donated blood 10 times, with the most recent donation being 11 months ago. The total amount of blood donated is 2500 c.c. over a period of 35 months since their first donation.###\nHence this label was No."
"The individual has donated blood 12 times in total, with the most recent donation being 2 months ago. They have donated a total of 3000 c.c. of blood over the past 82 months.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation being 4 months ago. The cumulative amount of blood donated is 2000 cubic centimeters over a period of 46 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 3 times, with the last donation being 14 months ago. Over a period of 79 months since first donation, they have donated a total of 750cc of blood.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation being 14 months ago. In total, they have donated 500 c.c. of blood. The time elapsed since their first donation is also 14 months.###\nHence this label was No."
"The individual donated blood two months ago, has donated a total of two times, totaling 500 cubic centimeters of blood, and has been donating for 14 months.###\nHence this label was No."
"The individual last donated blood 11 months ago. They have donated blood once, totaling 250 c.c. Their first donation was also 11 months ago.###\nHence this label was Yes."
"The individual donated blood once 21 months ago, giving a total of 250 c.c. Since their first donation 21 months ago, they have not donated blood again.###\nHence this label was Yes."
"The individual has donated blood 3 times in total, with the last donation occurring 2 months ago. They have donated a total of 750 c.c. of blood over a period of 35 months since their first donation.###\nHence this label was No."
"The individual donated blood 6 times, with the most recent donation being 2 months ago. In total, they have donated 1500 c.c. of blood over a period of 47 months since their first donation.###\nHence this label was No."
"The individual donated blood once 4 months ago, giving a total of 250cc. They first donated blood 4 months ago and have not donated since then.###\nHence this label was No."
"The individual last donated blood 16 months ago, has donated blood once, amounting to a total of 250 c.c., and has been donating for 16 months.###\nHence this label was No."
"The individual donated blood once, giving 250cc, two months ago, and it was their first time donating.###\nHence this label was No."
"The individual donated blood 46 times, with the most recent donation being 5 months ago. Over the course of 98 months since the first donation, they have donated a total of 11500 c.c. of blood.###\nHence this label was Yes."
"The individual donated blood 6 times, with the most recent donation being 2 months ago. The total amount of blood donated is 1500 c.c. They have been donating blood for 22 months.###\nHence this label was Yes."
"The individual donated blood 3 times in total, with the most recent donation being 11 months ago. They have donated a total of 750 c.c. of blood over the course of 76 months since their first donation.###\nHence this label was No."
"The individual has donated blood once in the past, 23 months ago, giving a total of 250 c.c. of blood. This was also the first time they donated blood.###\nHence this label was No."
"The individual has donated blood 3 times, with the most recent donation being 2 months ago. They have donated a total of 750 c.c. of blood over the course of 14 months since their first donation.###\nHence this label was No."
"The individual has donated blood 17 times in total, with the most recent donation occurring 3 months ago. Over a span of 86 months since the first donation, they have contributed a total of 4250 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood once in the past, approximately 2 months ago, giving a total of 250 c.c. of blood. This is within 2 months since their first donation.###\nHence this label was No."
"The individual has donated blood 11 times, with the most recent donation being 4 months ago. Over a period of 78 months since first donation, they have contributed a total of 2750 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood once 2 months ago, contributing a total of 250 c.c. of blood. They have been donating for 2 months in total.###\nHence this label was No."
"The individual has donated blood 9 times in total, with the most recent donation being 2 months ago. The total amount of blood donated is 2250 cubic centimeters. The individual has been donating blood for 22 months.###\nHence this label was Yes."
"This individual donated blood 3 times in total, with the most recent donation being 4 months ago. They have donated a total of 750 c.c. of blood over a span of 16 months since their first donation.###\nHence this label was No."
"The individual has donated blood 8 times in the past, with the most recent donation being 11 months ago. They have donated a total of 2000 c.c. of blood over the course of 52 months since their first donation.###\nHence this label was Yes."
"The individual donated blood 4 times in total, with the most recent donation being 2 months ago. They have donated a total of 1000 c.c. of blood over a period of 16 months since their first donation.###\nHence this label was No."
"The individual has not donated blood for 16 months, has donated blood 15 times in total with a total of 3750 c.c. donated, and has been donating blood for 87 months.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation being 4 months ago. Over the course of 40 months since their first donation, they have donated a total of 2000 c.c. of blood.###\nHence this label was Yes."
"The individual last donated blood 21 months ago, has donated blood once, totaling 250 c.c., and has been donating for 21 months.###\nHence this label was No."
"The individual has donated blood 2 times, with the most recent donation being 9 months ago. Over the course of 52 months, they have donated a total of 500 cubic centimeters of blood.###\nHence this label was No."
"This individual last donated blood 9 months ago, has donated a total of 4 times, amounting to 1000 c.c., and has been donating for 65 months.###\nHence this label was No."
"The individual has donated blood within the last year (11 months ago), with a total of 17 donations amounting to 4250 c.c. of blood. They have been donating blood for almost 7 years (79 months).###\nHence this label was Yes."
"The individual has donated blood 8 times in the past, with the most recent donation being 8 months ago. Over a period of 52 months, they have donated a total of 2000 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood once two months ago, giving a total of 250 c.c. Since they started donating blood, it has been two months.###\nHence this label was No."
"The individual has donated blood twice in the past, with the last donation being 4 months ago. They have donated a total of 500 c.c. of blood so far, and have been donating for 4 months.###\nHence this label was Yes."
"The individual donated blood once 4 months ago, giving a total of 250cc of blood. This was their first donation, indicating a new donor.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation occurring 2 months ago. They have donated a total of 1750 c.c. of blood over the past 46 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood twice in the past, with the most recent donation being 23 months ago. The total amount of blood donated is 500 cubic centimeters. The individual has been donating blood for 23 months in total.###\nHence this label was No."
"The individual has donated blood 6 times in total, with the most recent donation being 4 months ago. They have donated a total of 1500 c.c. of blood. The time span since their first donation is 28 months.###\nHence this label was Yes."
"The individual has donated blood 6 times in total, with the last donation occurring 16 months ago. The total amount of blood donated is 1500 cubic centimeters. The individual has been donating blood for 81 months.###\nHence this label was No."
"The individual donated blood 6 times in total over a period of 35 months. The last donation was made 4 months ago, with a total amount of 1500 c.c. donated.###\nHence this label was No."
"The individual has donated blood 8 times, with the most recent donation made 14 months ago. Over a period of 50 months since their first donation, they have donated a total of 2000 c.c. of blood.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250 cc of blood, 2 months after their first donation, and has not donated since then, with 2 months having passed.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation occurring 21 months ago. The total amount of blood donated is 500 c.c., and the individual has been donating blood for 21 months since their first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 c.c. of blood. This donation occurred 21 months after their first donation, and they have not donated blood since then.###\nHence this label was No."
"The individual has donated blood 11 times, with the most recent donation made 4 months ago. Over the course of 28 months since their first donation, they have donated a total of 2750 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood 10 times in total, with the most recent donation made 3 months ago. Over 33 months, they have donated a total of 2500 cubic centimeters of blood.###\nHence this label was Yes."
