"The client is 33 years old, working in management, divorced, with a tertiary level of education. They do not have any credit in default but have housing and personal loans. Their average yearly balance is negative. They were last contacted via cellular communication on the 12th of May, with a call duration of 163 seconds. This is the second time they have been contacted during this campaign, with 350 days passing since they were last contacted from a previous campaign. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 54-year-old married individual working in an administrative role with a secondary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The communication type for the contact is unknown. The client was last contacted on the 12th of May for 192 seconds, as part of 2 contacts made during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 42 euros.###\nHence this label was No."
"The client is a 32-year-old single individual working as a blue-collar worker with primary education. They do not have any credit in default but have a housing loan. They were contacted via cellular phone call on the 6th day of May for a duration of 90 seconds as part of a marketing campaign. This was the first contact made to the client, and the outcome of any previous campaigns is unknown. The client's average yearly balance is 181 euros, and they do not have a personal loan.###\nHence this label was No."
"The client is a 39-year-old married individual working in the services sector with secondary education. They do not have any credit in default, but they do have a housing loan. The client does not have a personal loan. The bank contacted the client via telephone on the 10th of July and the call lasted for 29 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 41-year-old divorced individual working as a blue-collar worker with secondary education. They do not have credit in default and have a housing and personal loan. The communication type during the marketing campaign was unknown. The client was last contacted on the 13th of May for 65 seconds, and this was the 6th contact made during this campaign. There were no previous contacts with this client from previous campaigns, and the outcome of the previous campaign is unknown. The average yearly balance of the client is 14 euros.###\nHence this label was No."
"The client is a 57-year-old married individual working in a management position with a tertiary education. They do not have any credit in default, do not have a housing loan but have a personal loan. The bank contacted them via cellular communication on the 23rd of July for a duration of 288 seconds, as part of the 9th contact made during this campaign. This client had not been previously contacted. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 215 euros.###\nHence this label was No."
"The client is a 23-year-old single individual working in a blue-collar job with primary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 15th of May, and the call lasted for 224 seconds. This was the first contact made during this campaign, but they were previously contacted 2 times in a previous campaign, with the last contact being 352 days ago, resulting in a failed outcome. The client's average yearly balance is 3198 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in management with unknown education. They do not have credit in default, have a housing loan, but no personal loan. They were contacted via cellular communication on the 17th of July, and the call lasted 179 seconds. This was the first contact made during the current campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 555 euros.###\nHence this label was No."
"The client is 43 years old and unemployed, with a single marital status and tertiary education. They do not have any credit in default, housing loan, or personal loan. They were last contacted via cellular communication on the 14th of July, with a call duration of 568 seconds. This is their 8th contact during this campaign, and they were not previously contacted. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 408 euros.###\nHence this label was No."
"The client is a 54-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default, do not have a housing loan but have a personal loan. The average yearly balance is 2440 euros. The communication type for the last contact was cellular, which lasted 334 seconds. This was the first contact made during this campaign. The client was last contacted on the 17th of November, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old single technician with a secondary education. They do not have credit in default but have housing and personal loans. They were contacted via cellular communication on the 15th of May, with a call duration of 164 seconds. This is the first contact in the current campaign, following 6 previous contacts. The outcome of the previous campaign was \"other\", and the client's average yearly balance is 1270 euros.###\nHence this label was No."
"The client is a 58-year-old married individual working in a blue-collar job with a secondary level of education. They do not have any credit in default and hold a housing loan but not a personal loan. The average yearly balance is 1298 euros. The client was contacted via an unknown communication type on the 29th of May, with a call duration of 516 seconds. This is the 4th contact made to the client during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 39-year-old single technician with a secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in August, and the call lasted for 100 seconds. This was the first contact made during this campaign, and there was no previous campaign contact. The outcome of the previous marketing campaign with this client is unknown. The client's average yearly balance is 316 euros.###\nHence this label was No."
"The client is a 31-year-old single technician with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 1st of October and the call lasted for 477 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not contacted before. The client's average yearly balance is 2460 euros.###\nHence this label was No."
"The client is a 46-year-old self-employed married individual with secondary education. They do not have any credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cellular phone on the 31st of July and the call lasted for 208 seconds. This was the second time they were contacted during this campaign. There was no previous contact with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 390 euros.###\nHence this label was No."
"The client is a 35-year-old married individual working in admin, with secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication, and the last call, which lasted 80 seconds, took place on the 17th of July. This was the 5th contact made during the current campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 44-year-old married individual working in management with secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 991. The communication type for the last contact was cellular, which lasted 194 seconds. This was the first contact made during this campaign. The client was not previously contacted in any past campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working as a blue-collar worker with a secondary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 1988 euros and do not have a personal loan. The last contact was made on the 8th of May via an unknown communication type, with a duration of 211 seconds. This is the second time they have been contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and do not have a housing or personal loan. The average yearly balance is 934 euros. The contact was made through an unknown communication type on the 9th of May. The call duration was 258 seconds, and this was the 2nd contact made during this campaign to this client. There were no previous contacts with the client regarding marketing campaigns, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in the services sector with a secondary level of education. They do not have credit in default, a housing loan, or a personal loan. Communication with the client was done via cellular phone. The last contact was on the 6th of February, with a duration of 59 seconds. This was the third contact made during this campaign. The client had not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 196 euros.###\nHence this label was No."
"A 39-year-old individual, with an unknown job, is married and has primary education. They do not have credit in default and do not have a housing or personal loan. Their average yearly balance is 2860 euros. The communication type used during the marketing campaign is unknown. The client was last contacted on the 19th of June and the call duration was 133 seconds. This was the first contact made during this campaign. There is no information about previous marketing campaign outcomes or past contacts with the client.###\nHence this label was No."
"The client is a 55-year-old married individual working in administration with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 8304 euros. The last contact was made via cellular communication on the 1st day of June, with a call duration of 201 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was Yes."
"The client is a 42-year-old single individual working in an administrative role with a secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 4343 euros. The bank contacted them via cellular communication on the 31st of July, with a call duration of 245 seconds. This is the 4th contact made during this campaign. There were no previous contacts with the client in past campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old divorced technician with a secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 204. The communication type during the contact is unknown. The last contact was on the 6th of June and lasted for 97 seconds. This is the 5th contact made during this campaign to this client, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 29-year-old married individual, working as a blue-collar worker with secondary education, was contacted via cellular communication. They do not have credit in default, have a housing loan, but no personal loan. Their average yearly balance is 25 euros. In the current marketing campaign, they have been contacted 5 times, each call lasting approximately 50 seconds. They have not been previously contacted for any marketing campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old single individual working in a management position with secondary education. They do not have any credit in default and have an average yearly balance of 356 euros. They have a housing loan but no personal loan. The communication with the client was through a cellular device, with the last contact made on the 21st of November, lasting for 20 seconds. This client has been contacted 5 times during this campaign and was last contacted 114 days ago from a previous campaign, with a total of 7 contacts before this campaign. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 37-year-old married individual working in an administrative role with unknown education status. They do not have any credit in default and have a housing loan. They have an average yearly balance of 734 euros and do not have a personal loan. The client was contacted via an unknown communication type on the 21st of May, with the call lasting 1106 seconds. This was the first contact made during this campaign, and there was no previous contact with the client from a previous campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old single technician with a secondary education. They do not have credit in default and have a housing loan. They have a yearly average balance of 863 euros and do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting 146 seconds on the 3rd day of February. This is their first contact in this campaign, but they have been contacted 5 times in previous campaigns, with the last contact being 263 days ago, resulting in a successful outcome.###\nHence this label was No."
"The client is a 69-year-old retired individual who is married. Their education level is unknown. They do not have any credit in default and do not have a housing or personal loan. The bank contacted them via telephone on the 9th of December and had a conversation lasting 395 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with this client is unknown. The client has an average yearly balance of 426 euros.###\nHence this label was Yes."
"The client is a 28-year-old single technician with secondary education. They do not have credit in default but have a housing loan. Their average yearly balance is 34 euros and they do not have a personal loan. They were contacted via cellular communication and the last call lasted 16 seconds. This was the 6th time they were contacted during this campaign, with 4 contacts made before. The previous marketing campaign outcome was a failure, and the last contact was made on the 4th day of February, 268 days after the previous campaign.###\nHence this label was No."
"A 49-year-old married individual working in a management position with tertiary education was contacted via cellular communication. They have no credit in default but have housing and personal loans. Their average yearly balance is 1167 euros. The last contact was made on the 24th of September and lasted 249 seconds. This was the 1st contact during the current campaign, following 14 previous contacts. The outcome of the previous marketing campaign was successful, with 91 days passed since the last contact.###\nHence this label was Yes."
"A married 32-year-old technician with tertiary education, having no credit in default and a housing loan but no personal loan, was contacted via cellular communication on the 24th of July. They had an average yearly balance of 2553 euros. During the current campaign, they were contacted 7 times, with the last call lasting 459 seconds. This client had not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 53-year-old self-employed individual who is married and has primary education. They do not have credit in default and have an average yearly balance of 862 euros. They have a housing loan but no personal loan. The communication type for this marketing campaign was via telephone, and the last contact was on the 14th of May, with a duration of 267 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual working in administration with secondary education. They do not have any credit in default and have an average yearly balance of 607 euros. They have a housing loan but no personal loan. The last contact made was on the 13th of May, with a duration of 315 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, and the communication type is also unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their bank account is 297 euros. The bank contacted them via cellular communication on the 8th of November, and the call lasted for 188 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign with this client is unknown.###\nHence this label was Yes."
"The client is a 58-year-old retired individual who is married and has a secondary level education. They do not have credit in default and have a housing loan but no personal loan. The client's average yearly balance is 150 euros. The last contact was made on the 5th day of June, with a duration of 420 seconds. This was the 4th contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client was contacted via an unknown communication type.###\nHence this label was No."
"The client is a 31-year-old married technician with tertiary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via cellular communication on the 25th of July, with a call duration of 266 seconds. This was the 6th contact made during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is an 86-year-old retired married individual with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone, reaching out on the 18th of March. The call lasted 165 seconds, which was the 3rd contact made during this campaign. The client was previously contacted 101 days ago for a different campaign, with 1 contact made back then. The outcome of the previous campaign was categorized as \"other\". The client's average yearly balance is 1503 euros.###\nHence this label was No."
"The client is a 51-year-old divorced technician with secondary education. They do not have credit in default, do not have a housing loan but have a personal loan. The average yearly balance is -406 euros. The client was contacted via cellular communication, with the last call lasting 150 seconds on the 14th of July. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication, and the last call lasted for 173 seconds on the 5th day of May. This was the first contact made during this campaign. The outcome of the previous marketing campaign with this client is unknown. The client's average yearly balance is 23 euros.###\nHence this label was No."
"The client is a 59-year-old retired married individual with a primary education level. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 28th of August. The call lasted for 106 seconds, and this was the third contact made during this campaign. The client has not been contacted in any previous campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 4450 euros.###\nHence this label was No."
"The client is a 28-year-old single technician with secondary education. They do not have credit in default and have an average yearly balance of 584 euros. They have a housing loan but no personal loan. The communication type used for contact was cellular. The client was last contacted on the 13th of May and the call lasted 354 seconds. This was the first contact during this campaign and the client was previously contacted 370 days ago, with 2 contacts made. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 37-year-old single individual working in management with a tertiary education. They do not have credit in default, housing loan, or personal loan. Communication was made via cellular phone, with the last contact being on the 20th of November, lasting for 110 seconds. This is the second contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2875 euros.###\nHence this label was No."
"The client is a 53-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 11th of August. The client's average yearly balance is 1301 euros. They were previously not contacted for any campaign. The last call lasted 164 seconds, and it was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old self-employed individual who is married and has tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication and the last call duration was 781 seconds. This is the client's third contact in the current campaign, with a gap of 89 days since they were last contacted. The outcome of the previous marketing campaign with this client was a success. The client has an average yearly balance of 2666 euros.###\nHence this label was Yes."
"The client is a 42-year-old married individual working in management with a tertiary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 26th of August, with the call lasting 179 seconds. This was the 16th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 35-year-old married individual working in administration, with secondary education. They do not have credit in default and have a yearly balance of 2278 euros. They have a housing loan but no personal loan. The last contact was made via cellular communication on the 21st of July, with a duration of 195 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 31-year-old unemployed single individual with primary education, no credit default, no housing or personal loan, and an average yearly balance of 1 euro was contacted via cellular communication. The last contact was on the 2nd of February and lasted 19 seconds, which was the 6th contact made during this campaign. The client had not been contacted in any previous campaigns, with an unknown outcome.###\nHence this label was No."
"The client is a 45-year-old married individual working in a management role with a tertiary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication, and the last call lasted 207 seconds on the 28th of January. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1874 euros.###\nHence this label was No."
"A 36-year-old individual working in the services sector, who is divorced and has a secondary level of education, was contacted for a marketing campaign. They do not have any credit in default but have both a housing and personal loan. The average yearly balance is negative at -290 euros. The communication type used during the campaign was unknown, and the call lasted 128 seconds. This was the first contact made during this campaign. The specific details regarding the outcome of any previous marketing campaign are unknown.###\nHence this label was No."
"The client is a 24-year-old student who is single and has an unknown level of education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, reaching out on the 4th day of May. The call lasted for 90 seconds, and this was the second contact during this campaign. The client had not been contacted before. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 0 euros.###\nHence this label was No."
"The client is a 40-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default and have an average yearly balance of 1844 euros. They have a housing loan but do not have a personal loan. The client was contacted via cellular communication on the 11th of May and the call lasted for 231 seconds. This was the first contact made during this campaign. There is no information available about any previous marketing campaign outcomes.###\nHence this label was No."
"The client is a 41-year-old married individual working in a blue-collar job with primary education. They do not have credit in default but have a housing loan. Their average yearly balance is 389 euros, and they do not have a personal loan. The client was last contacted on the 16th of June for 87 seconds in an unknown communication type. This was the 6th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 29-year-old married individual working in a blue-collar job with secondary education was contacted via cellular communication. They do not have any credit in default, but have a housing loan. They were previously not contacted for any marketing campaign. During the current campaign, they were contacted once and the call lasted for 988 seconds. Their average yearly balance is €2870 and they do not have a personal loan. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 29-year-old married individual working in a management position with a tertiary education. They do not have credit in default and have an average yearly balance of 266 euros. They have a housing loan but no personal loan. The communication with the client was done via a cellular phone. The client was last contacted on the 29th of January and the call lasted for 103 seconds. This was the second contact made to the client during this campaign. There were no previous contacts with the client from any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 19-year-old student who is single and has a secondary education. They do not have credit in default and do not have any housing or personal loans. They were contacted via cellular communication and the last call duration was 169 seconds. The client was previously contacted 190 days ago and had a successful outcome from the previous marketing campaign.###\nHence this label was Yes."
"The client is a 44-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via an unknown communication type and the call lasted 61 seconds. This was the first contact made during this campaign. Previous marketing campaign outcome is unknown. The client's average yearly balance is 1196 euros. The last contact was made on the 28th of May.###\nHence this label was No."
"The client is a 42-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default and have a housing loan. They were contacted via telephone and the last call lasted for 295 seconds. This was the third call during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and has an average yearly balance of 159 euros. The last contact was made on the 12th of May.###\nHence this label was No."
"The client is a 38-year-old married technician with tertiary education. They do not have credit in default, a housing loan, or a personal loan. They were contacted via cellular communication on the 18th of November and the call lasted for 578 seconds. This was the second time they were contacted during this campaign. There is no record of previous contact with the client or the outcome of any previous marketing campaign. Their average yearly balance is 3234 euros.###\nHence this label was Yes."
"The client is a 53-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default, housing loan, or personal loan. The client was last contacted in August via cellular communication, with the call lasting 82 seconds. This was the 8th contact made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is negative, indicating a deficit of 31 euros.###\nHence this label was No."
"The client is a 52-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 1860. The communication type for the last contact is unknown, which occurred on the 20th of June and lasted for 496 seconds. This was the third contact made during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, but have housing and personal loans. They were contacted via cellular communication on the 12th of May. The client's average yearly balance is 4170 euros. Their last contact duration was 118 seconds, and this is the 2nd time they have been contacted during this campaign. It has been 357 days since they were last contacted from a previous campaign, where they had 3 contacts. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 28-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, but have a housing loan. They were contacted via cellular communication and had a relatively short call duration of 90 seconds. This was the 4th contact attempt during this campaign. There is no information about previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and their average yearly balance is negative, at -65 euros.###\nHence this label was No."
"The client is a 35-year-old married individual working in a management role with a tertiary education. They do not have credit in default, a housing loan, or a personal loan. They were contacted via cellular communication, with the last call lasting 261 seconds on the 11th of January. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous campaign is unknown. The client's average yearly balance is 323 euros.###\nHence this label was Yes."
"The client is a 37-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan but no personal loan. The average yearly balance in euros is 23. The client was contacted via an unknown communication type on the 26th day of May, with a call duration of 409 seconds. This was the second contact made during the current campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old married individual working in management with a secondary education. They do not have credit in default and have a yearly average balance of 21 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 7th of May, with a call duration of 124 seconds. This is the first contact during this campaign, but they were contacted twice in the past, with the previous campaign resulting in failure.###\nHence this label was No."
"The client is a 55-year-old divorced technician with a tertiary education. They do not have credit in default and have a yearly average balance of 525 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 15th of May, with the call lasting 28 seconds. This is the 8th contact made during this campaign, with 4 previous contacts. The client was last contacted 366 days ago. The outcome of the previous marketing campaign was categorized as \"other.\"###\nHence this label was No."
"The client is a 43-year-old single individual working in a blue-collar job with primary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The average yearly balance in their account is 30 euros. The contact communication type is unknown. The last contact was made on the 30th of May and lasted for 379 seconds. This was the 17th contact made to the client during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 26-year-old single individual working in the services sector with a secondary education was contacted via cellular communication. They do not have any credit in default, housing loan, or personal loan. With an average yearly balance of 136 euros, they were last contacted on the 20th of April for 120 seconds as part of a marketing campaign. This was their first contact in this campaign, and there is no record of previous marketing campaign outcome.###\nHence this label was Yes."
"The client is a 29-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have a housing loan. They were contacted via cellular communication and the last call duration was 785 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 912 euros and does not have a personal loan. The last contact with the client was on the 13th of May.###\nHence this label was No."
"The client is a 37-year-old married individual working in administration with secondary education. They do not have credit in default but have a housing loan. They were contacted via cellular communication and previously subscribed to a term deposit after a 179-second call in December. This was the second time they were contacted, with the previous contact being 190 days ago. The client does not have a personal loan and had an average yearly balance of 0 euros.###\nHence this label was Yes."
"The client is a 35-year-old married housemaid with primary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank made a single phone call to contact them via cellular communication in July. The call lasted 127 seconds. This was the first time they were contacted during this campaign. The outcome of any previous marketing campaigns is unknown. The client's average yearly balance is 218 euros.###\nHence this label was No."
"The client is a 57-year-old retired individual who is married with a primary level of education. They do not have credit in default and have a yearly average balance of 3518 euros. They have a housing loan but no personal loan. The communication with the client was through a cellular phone, and the last contact was on the 25th of August for a duration of 626 seconds. This is the third time they have been contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 42-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default but have a housing loan. They have an average yearly balance of 2519 euros and do not have a personal loan. The client was contacted via an unknown communication type on the 15th of May for 262 seconds, as part of the fourth contact during this campaign. There was no previous contact with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 60-year-old married individual working in a management position with tertiary education. They do not have any credit in default, do not have a housing loan but have a personal loan. They were contacted via cellular communication on the 5th day of August and the call lasted for 445 seconds. This was the third time they were contacted during this campaign. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3876 euros.###\nHence this label was No."
"The client is a 55-year-old married technician with a secondary level education. They do not have credit in default and have a housing loan. They do not have a personal loan. The contact communication type is unknown. The client was last contacted on the 16th of May for 271 seconds. This was the first contact made during this campaign. There is no information on any previous marketing campaign outcomes. The client's average yearly balance is 726 euros.###\nHence this label was No."
"The client is a 26-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 9th of July and the call lasted for 226 seconds. This was the second call made to the client during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 818 euros.###\nHence this label was No."
"The client is a 42-year-old divorced individual working as a blue-collar worker with secondary education. They do not have any credit in default but have housing and personal loans. They were contacted via cellular communication on the 10th of July, with a call duration of 272 seconds. This is the first time they have been contacted during this marketing campaign. The outcome of any previous marketing campaign is unknown. Additionally, the client has an average yearly balance of 1261 euros.###\nHence this label was No."
"A 34-year-old single individual working in management with a tertiary education was contacted via cellular communication regarding a term deposit. They have no credit in default, housing loan, or personal loan. With an average yearly balance of 454 euros, they were last contacted on the 14th of August for 76 seconds, as part of the 3rd contact during this campaign. There were no previous contacts with this client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 55-year-old married individual working in a blue-collar job with primary education. They do not have credit in default but have a housing loan. They were not previously contacted for any marketing campaigns. The client does not have a personal loan. The last contact was on the 16th of May, with a duration of 160 seconds, during which 6 contacts were made. The outcome of the previous marketing campaign is unknown. The average yearly balance is in the negative at -268 euros. The contact communication type is unknown.###\nHence this label was No."
"The client is a 46-year-old divorced technician with tertiary education. They do not have credit in default but have a personal loan. Their average yearly balance is negative. They do not have a housing loan. The communication type used for contact is cellular. The last contact was made on the 18th of July and lasted 251 seconds. This is the 5th contact made during the current campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in the services sector with secondary education. They do not have any credit in default but have a housing loan. Their average yearly balance is negative. They do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting 218 seconds on the 11th of May. This is the 4th contact made during this campaign, with 5 previous contacts. The previous marketing campaign outcome was a failure, and the client was last contacted 285 days before this current campaign.###\nHence this label was No."
"The client is a 52-year-old married individual working in an administrative role with a secondary level of education. They do not have any credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cell phone on the 19th of November and the call lasted 172 seconds. This was the third contact made to the client during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1648 euros.###\nHence this label was No."
"The client is a 29-year-old unemployed individual who is single and has a secondary level education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 14th of August for 151 seconds. This was the second time they were contacted during this campaign, with the previous contact being 106 days ago, resulting in a failed outcome. The client's average yearly balance is 486 euros.###\nHence this label was No."
"The client is a 52-year-old married individual working in the services sector with secondary education. They do not have credit in default and have a housing loan. The average yearly balance is 2257 euros and they do not have a personal loan. The bank contacted them via telephone on the 18th of November for 102 seconds. This was the second time they were contacted during this campaign, with 188 days passed since they were last contacted in a previous campaign. The client was contacted once before in a previous campaign, which ended in failure.###\nHence this label was No."
"A 50-year-old married technician with secondary education, who does not have credit in default, has a housing loan but no personal loan. The client was last contacted on the 27th of May for 353 seconds, in the current campaign which involved 3 contacts. There was no previous contact with the client before this campaign, and the outcome of the previous campaign is unknown. The client's average yearly balance is -157 euros. The current contact communication type is unknown.###\nHence this label was No."
"The client is a 56-year-old married housemaid with primary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 954 euros. The contact was made through an unknown communication type on the 20th of June, with a call duration of 81 seconds. This was the 10th contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old single technician with secondary education. They do not have credit in default and do not have any existing housing or personal loans. They were contacted via cellular communication on the 29th of July, and the call duration was 212 seconds. This was the second contact made during this campaign. The client was not contacted during any previous campaigns, and the outcome of the previous campaign is unknown. The average yearly balance in euros for this client is 736.###\nHence this label was No."
"The client is a 51-year-old married entrepreneur with tertiary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 20th of April, and the call lasted 267 seconds. This was the second call made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 83 euros.###\nHence this label was Yes."
"The client is a 45-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular phone on the 18th of November and the call lasted for 226 seconds. This was the first contact during this campaign, but they were previously contacted 2 times before. The outcome of the previous marketing campaign was a failure. The client's average yearly balance is 147 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default but have a housing loan. They were contacted via an unknown communication type in May, with the call lasting 112 seconds. This was their first contact during this campaign, and there was no previous contact. The outcome of the previous marketing campaign is unknown. Their average yearly balance is negative 98 euros, and they do not have a personal loan.###\nHence this label was No."
"The client is a 59-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default but have a housing loan. They have an average yearly balance of 3062 euros and do not have a personal loan. The bank contacted them via cellular communication on the 14th of August, with a call duration of 87 seconds. This is the client's second contact during this campaign, and they were not contacted in any previous campaigns. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is 35 years old, employed in the services sector, single, with secondary education. They do not have any credit in default and have a housing loan as well as a personal loan. They were contacted via cellular communication on the 13th of May and the call lasted for 68 seconds. This was the first contact made during this campaign, but they were contacted twice in a previous campaign, with 369 days passing since the last contact. The outcome of the previous marketing campaign was categorized as 'other'. The client's average yearly balance is 143 euros.###\nHence this label was No."
"A 32-year-old married individual working in a management position with tertiary education was contacted via cellular communication about a term deposit. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 1208. The call lasted for 221 seconds and this was the 3rd contact made during this campaign. The client was not previously contacted for a marketing campaign, and the outcome of the previous campaign is unknown. The call was made on the 11th day of August.###\nHence this label was No."
"The client is a 33-year-old married individual working in management with a tertiary education. They do not have credit in default and have a housing loan as well as a personal loan. The average yearly balance in euros is 2441. The client was contacted via cellular communication on the 19th of November, with a call duration of 154 seconds. This was the first contact made during this campaign. There is no information on previous campaign contacts or outcomes.###\nHence this label was No."
"A 32-year-old single individual working in management with a tertiary education was contacted for a marketing campaign. They do not have credit in default and have a housing loan. They were previously not contacted for any marketing campaigns. The average yearly balance is 1345 euros, and they do not have a personal loan. The contact communication type is unknown, and the last contact was on the 12th of May, lasting 289 seconds. This client has been contacted 3 times during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old married individual working in a management position with a tertiary education. They do not have any credit in default but have housing and personal loans. Their average yearly balance is 59 euros. The contact was made via an unknown communication type in July, on the 4th day of the month, with a duration of 100 seconds. This is the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 39-year-old married individual working as an admin, with secondary education. They do not have credit in default, but have a housing loan. They have an average yearly balance of 8 euros and do not have a personal loan. The client was contacted via telephone on the 15th of May and the call lasted 155 seconds. This was the 6th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old married individual working in an administrative role with a secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 18th of May. The call lasted for 143 seconds, and it was the first contact made during this campaign. The client's average yearly balance is negative at -76 euros. They have not been contacted before for any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married individual working in management with a tertiary education. They do not have credit in default and have a housing and personal loan. They were contacted via cellular communication on the 13th of April and the call lasted for 185 seconds. This was the second time they were contacted during this marketing campaign. There is no information on previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1418 euros.###\nHence this label was No."
"The client is a 54-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit in default, but have a housing loan. They have an average yearly balance of 1765 euros and do not have a personal loan. The last contact was made on the 14th of May via an unknown communication type, with a duration of 188 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 57-year-old married housemaid with primary education. They do not have credit in default, a housing loan, but they do have a personal loan. The average yearly balance is 625 euros. The contact communication type is unknown, and the last contact was on the 11th of June, with a duration of 867 seconds. This was the first contact during this campaign, and there was no previous contact. The outcome of the previous marketing campaign is also unknown.###\nHence this label was Yes."
"A 30-year-old single individual working in management with secondary education was contacted via cellular communication regarding a term deposit. They do not have any credit in default, housing loan, but do have a personal loan. They had an average yearly balance of 2785 euros. The previous marketing campaign outcome was unknown. The call lasted 548 seconds and was the first contact made during this campaign. The call took place on the 17th of November, and this client had not been previously contacted.###\nHence this label was No."
"The client is a 39-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default and have a housing loan. They were contacted via cellular communication and the last call lasted 502 seconds. This is the first time they were contacted during this campaign, but they were contacted twice in a previous campaign which resulted in failure. They do not have a personal loan and have an average yearly balance of 0 euros. The last contact was made on the 7th day of the month of May.###\nHence this label was No."
"The client is a 49-year-old married individual working in administration with secondary education. They do not have credit in default and have an average yearly balance of 1788 euros. They have a housing loan but no personal loan. The last contact made was on the 11th of June with a duration of 274 seconds. This was the second contact made during this campaign, with no previous contacts before. The outcome of the previous marketing campaign is unknown, and the communication type used is also unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working in a management role with tertiary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 12th day of the month of May. The call lasted for 132 seconds. This was the 3rd time the bank contacted this client during this campaign. There were no previous contacts with this client before this campaign. The outcome of the previous marketing campaign with this client is unknown. The average yearly balance in euros for this client is 126.###\nHence this label was No."
"The client is a 42-year-old divorced individual working in management with a secondary education. They do not have any credit in default, but have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 19th of May. The call duration was 112 seconds. This was the first contact made during this campaign. There is no record of any previous contact with the client for marketing purposes. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 830 euros.###\nHence this label was No."
"The client is a 51-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan. Their average yearly balance is 2832 euros, and they do not have a personal loan. The bank contacted them via cellular communication on the 20th of April for 122 seconds. This is the 4th contact during this campaign, following 12 previous contacts. The client was last contacted 238 days ago from a previous campaign, with the outcome being categorized as 'other'.###\nHence this label was No."
"The client is a 46-year-old divorced individual working as a blue-collar worker with secondary education. They do not have credit in default, but they have a housing loan. Their average yearly balance is 1480 euros, and they do not have a personal loan. The client was contacted via an unknown communication type on the 15th of May, with a call duration of 257 seconds. This was the first contact made with the client during this campaign. Previous outcomes of marketing campaigns with this client are unknown.###\nHence this label was No."
"The client is a 37-year-old married technician with secondary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via cellular communication, reaching out on the 8th of April for a duration of 171 seconds. This was the 2nd time they were contacted during this campaign, with 139 days passing since they were last contacted from a previous campaign where there were 4 contacts. The outcome of the previous marketing campaign was a failure. The client's average yearly balance is 523 euros.###\nHence this label was No."
"A 46-year-old married individual, working as a blue-collar worker with secondary education, was contacted by telephone for a marketing campaign. They do not have a housing loan or personal loan. Their average yearly balance is 2297 euros, and they do not have credit in default. The call lasted for 16 seconds, and this was the 4th contact made during this campaign. They were last contacted on the 31st of July, with no record of previous contacts. The outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married technician with a tertiary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 29th of July, and the call lasted 128 seconds. This was the 11th contact made to the client during this campaign. They were not contacted in any previous campaigns, and the outcome of the previous campaign is unknown. The client has an average yearly balance of 477 euros.###\nHence this label was No."
"The client is a 38-year-old married individual working in a blue-collar job with a secondary education. They do not have credit in default, have a housing loan, but do not have a personal loan. The average yearly balance is 164 euros. The communication type for the last contact is unknown, which occurred on the 7th of May and lasted 309 seconds. This is the second contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 40-year-old married individual working in a management position with a tertiary education. They do not have any credit in default and have a housing loan. The client does not have a personal loan. The bank contacted them via cellular communication. The last contact was made on the 17th of April and lasted 202 seconds. This was the second contact made to the client during this campaign. The client has not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 640 euros.###\nHence this label was No."
"The client is a 28-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit in default, have a housing loan, but no personal loan. They were contacted via cellular communication on the 14th day of May. The call lasted for 10 seconds. This is the 9th contact made during this campaign. The client was last contacted 344 days ago from a previous campaign, where the outcome was a failure.###\nHence this label was No."
"The client is a 55-year-old married individual working in a management position with tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 1433. The last contact was made on the 12th of June for 298 seconds, and this was the third contact made during this campaign. The client has not been previously contacted for any campaign. The outcome of the previous marketing campaign is unknown. The communication type used for contact is unknown.###\nHence this label was No."
"The client is a 39-year-old divorced individual working in an administrative role with tertiary education. They do not have credit in default, do not have a housing loan, but have a personal loan. The client was contacted via a cellular phone, with the call lasting for 85 seconds. This was the second contact made during this campaign, and there were no previous contacts. The client's average yearly balance is 1087 euros. The last contact was made on the 23rd of July. The outcome of the previous marketing campaign is unknown. The client's response to subscribing to a term deposit is yet to be determined.###\nHence this label was No."
"The client is a 28-year-old single individual working in the services sector with primary level education. They do not have any credit in default, housing loan, or personal loan. The bank contacted the client via cellular communication on the 30th of April for a duration of 132 seconds. This was the first time they were contacted during this campaign. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 307 euros.###\nHence this label was No."
"The client is a 31-year-old single technician with tertiary education. They do not have any credit in default, housing loan, or personal loan. The communication type used for contacting the client was cellular. The last contact was made on the 12th of August, with a duration of 111 seconds. This was the third time the client was contacted during this campaign. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 36 euros.###\nHence this label was No."
"The client is a 33-year-old single technician with secondary education. They do not have any credit in default, but they have a housing loan. They were contacted via an unknown communication type on the 21st of May. The call lasted 127 seconds, and it was the first contact made during this campaign. There is no record of any previous contact from a previous campaign, and the outcome of the previous marketing campaign is unknown. The client does not have a personal loan and has an average yearly balance of 239 euros.###\nHence this label was No."
"A 28-year-old single individual working in a blue-collar job was contacted by phone for a marketing campaign by a Portuguese banking institution. The client's education level is unknown, and they do not have any credit in default. The client has an average yearly balance of 913 euros and has a housing loan but no personal loan. The specific type of communication used during the contact is also unknown. The last contact with the client was on the 27th day of May, and the call lasted 580 seconds. This was the second time the client was contacted during this campaign, with no previous contacts recorded. The outcome of any previous marketing campaigns with this client is also unknown.###\nHence this label was No."
"A married 39-year-old technician with secondary education, having no credit in default, no housing or personal loans, was contacted via cellular communication in December. They had an average yearly balance of 2983 euros. The client was contacted once during this campaign for 472 seconds and had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 58-year-old retired married individual with tertiary education. They do not have any credit in default, do not have a housing loan but have a personal loan. The bank contacted them via cellular communication on the 9th of July, with a call duration of 254 seconds. This was the first contact made to the client during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 941 euros.###\nHence this label was No."
"The client is 36 years old, unemployed, divorced, with secondary education. They do not have credit in default and do not have any housing or personal loans. They were contacted via an unknown communication type on the 18th of June. The call lasted for 321 seconds and this was the second time they were contacted during this campaign. There is no information on previous contact with the client or the outcome of any previous marketing campaign. Additionally, the client's average yearly balance is 8267 euros.###\nHence this label was No."
"The client is a 60-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan. Their average yearly balance is 6271 euros, and they do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting 210 seconds. This is the second time they have been contacted during this campaign, after 254 days since they were last contacted in a previous campaign. Prior to this campaign, the client had been contacted 5 times with the outcome of the previous marketing campaign being a failure.###\nHence this label was No."
"The client is a 23-year-old student who is single and has tertiary education. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via cell phone on the 10th of August and had a conversation that lasted 298 seconds. This was the first time they were contacted during this marketing campaign. The outcome of any previous marketing campaigns with this client is unknown. The client's average yearly balance is 1592 euros.###\nHence this label was No."
"A 37-year-old single individual, working in a management role with tertiary education, was contacted by phone for a marketing campaign by a Portuguese banking institution. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 8828 euros. The contact communication type is unknown. The last contact was made on the 12th day of June, and it lasted for 1010 seconds. This was the third contact made to this client during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign with this client is also unknown.###\nHence this label was Yes."
"The client is a 57-year-old married individual working in management with a secondary education. They do not have credit in default and have a housing loan. They have an average yearly balance of 3381 euros and do not have a personal loan. The bank used an unknown contact communication type to reach out to them on the 15th of May, with a call duration of 75 seconds. This was the first contact made during this campaign, and there was no previous campaign contact history available. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
