"The client is a 30-year-old single blue-collar worker with a secondary education. They do not have any credit in default and have a housing loan but no personal loan. The average yearly balance is 132 euros. The client was contacted via an unknown communication type on the 16th of May for 329 seconds. This was the first contact made with the client during this campaign. The outcome of any previous marketing campaigns with this client is unknown.###\nHence this label was No."
"The client is a 49-year-old retired individual who is divorced. They have a secondary level of education and do not have any credit in default. Despite having a negative yearly balance of -268 euros, they have a housing loan. They do not have a personal loan. The client was contacted via cellular communication on the 15th of July and the call lasted for 111 seconds. This was the 5th contact made to the client during this campaign. There were no previous contacts with this client before this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 23-year-old student who is single and has secondary education. They do not have any credit in default, housing loan, or personal loan. The communication type for contacting the client is unknown. The last contact was made on the 27th of August and lasted only 4 seconds. This is the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is also unknown. The client's average yearly balance is 43 euros.###\nHence this label was No."
"The client is a 33-year-old married individual working in administration with a secondary education. They do not have any credit in default and maintain an average yearly balance of 2 euros. They have a housing loan and a personal loan. The communication type for contact is cellular. The last contact was made on the 28th of July, with a duration of 85 seconds. This client has been contacted 12 times during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 59-year-old married technician with secondary education. They do not have credit in default, do not have a housing loan but have a personal loan. They were contacted via telephone on the 23rd of July and the call lasted 226 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2342 euros.###\nHence this label was No."
"A 32-year-old single individual in a managerial role with a tertiary education was contacted via cellular communication. They have no credit in default, housing loan, or personal loan. Their average yearly balance is 27 euros. During the current marketing campaign, they have been contacted 3 times, with the last contact lasting 146 seconds on the 28th of August. This is the first time they have been contacted for this campaign, as their previous marketing campaign outcome is unknown.###\nHence this label was No."
"The client is a 52-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is 193 euros. The client was contacted via cellular communication on the 4th of August and the call lasted for 145 seconds. This was the first contact made during this campaign. There is no record of previous contact or outcome from a previous marketing campaign.###\nHence this label was No."
"The client is a 41-year-old single individual working in management with a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is 800 euros. The bank communicated with the client via cellular phone, contacting them on the 8th of August. The last contact duration was 899 seconds, and a total of 2 contacts were made during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old single admin worker with secondary education. They do not have credit in default and have a housing loan. They were contacted via cellular communication on the 7th of May for a duration of 455 seconds. This was their first contact during this campaign, and there was no previous campaign history. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 222 euros and they do not have a personal loan.###\nHence this label was No."
"The client is a 58-year-old married individual working in a management position with a tertiary education. They do not have any credit in default but have housing and personal loans. Communication with the client was done via cellular phone. The last contact was on the 6th of August and lasted 107 seconds. This was the 4th contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 138 euros.###\nHence this label was No."
"The client is a 33-year-old married individual working in a management role with tertiary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 20th of November, with a call duration of 175 seconds. This was the first contact made during this campaign. The outcome of the previous campaign is unknown. The client's average yearly balance is 3713 euros.###\nHence this label was No."
"The client is an 81-year-old retired individual who is divorced, with a secondary level of education. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via telephone on the 16th of December and had a call duration of 443 seconds. This was the first contact made with the client during this campaign. The outcome of any previous marketing campaign with this client is unknown. The client has an average yearly balance of 452 euros.###\nHence this label was Yes."
"The client is a 28-year-old student who is single and has unknown education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication. The last contact was on the 4th of December, lasting 232 seconds. This was the 3rd contact during this campaign, with 310 days passed since the previous campaign contact. There were 2 contacts before this campaign, with the outcome of the previous marketing campaign being a failure.###\nHence this label was Yes."
"The client is a 50-year-old divorced technician with unknown education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 1328 euros. Communication type is unknown. The client was last contacted on the 29th of May and the call lasted for 140 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married individual working in a management position with a tertiary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in their bank account is 423 euros. The bank contacted them via cellular communication, reaching out on the 3rd day of June for a duration of 136 seconds. This was the 6th contact made during this campaign and there were 5 previous contacts. The previous marketing campaign with this client was successful, resulting in a subscription to a term deposit.###\nHence this label was No."
"The client is a 30-year-old single individual working in a blue-collar job with secondary education. They do not have credit in default and have an average yearly balance of 5 euros. They have a housing loan but no personal loan. The communication with the client was done via a cellular phone call, with the call lasting 196 seconds. This was the first contact made during the current campaign. The outcome of any previous marketing campaign with the client is unknown.###\nHence this label was No."
"The client is a 36-year-old self-employed individual who is married with a secondary level of education. They do not have credit in default and do not have any housing or personal loans. The bank communicated with the client via a cellular phone call on the 27th of August, with a call duration of 125 seconds. This was the 15th contact made to the client during this campaign. The client had not been previously contacted during any previous campaigns, and the outcome of the last marketing campaign is unknown. The client's average yearly balance is 96 euros.###\nHence this label was No."
"A 23-year-old student, single, with primary education and no credit in default, was contacted via cellular communication. They have an average yearly balance of 1235 euros and do not have any housing or personal loans. The last contact was on the 11th of September for 122 seconds, as part of the second campaign contact out of a total of 2. Prior to this campaign, they were contacted 3 times, with the previous campaign resulting in failure.###\nHence this label was No."
"The client is a 25-year-old married individual working in administration with secondary education. They do not have credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 23rd of July for 202 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 789 euros.###\nHence this label was No."
"The client is a 62-year-old retired married individual with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 15th of October and the call lasted 280 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is 30 years old, works in management, is married, and has a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 3rd of June for a duration of 192 seconds. This was the first contact made during this campaign. There is no information on any previous marketing campaigns involving this client. The client's average yearly balance is 2694 euros.###\nHence this label was No."
"The client is a 30-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default but have a housing loan and a personal loan. The average yearly balance in euros is 68. The client was contacted during the month of May, on the 16th day, through an unknown communication type. The last contact duration was 393 seconds, and this was the second contact made to the client during this campaign. There were no previous contacts made to this client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 23-year-old housemaid who is single and has secondary education. They do not have credit in default and have an average yearly balance of 650 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 14th of May, with a call duration of 136 seconds. This is the 1st contact made during this campaign, following 4 previous contacts. The client was last contacted 367 days ago from a previous campaign, which resulted in failure.###\nHence this label was No."
"The client is a 40-year-old entrepreneur who is single and has a secondary education. They do not have credit in default and have an average yearly balance of 943 euros. They have a housing loan but do not have a personal loan. The bank contacted them via cellular communication on the 4th of February and the call lasted for 179 seconds. This is the third time they have been contacted during this campaign. The client was not previously contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with unknown education status. They do not have credit in default and have an average yearly balance of 878 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 13th of May and the call lasted for 245 seconds. This was the 4th contact made to the client during this campaign. There were no previous contacts with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old single individual working in the services sector with a secondary education. They do not have any credit in default and do not have any housing or personal loans. The client was contacted via cellular communication on the 21st of July. The call lasted for 1360 seconds and it was the 3rd contact made during this campaign. The client had not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is negative, amounting to -30 euros.###\nHence this label was Yes."
"The client is a 49-year-old married individual working in management with a tertiary education. They do not have any credit in default, but they do have a housing loan. They were contacted via cellular communication, with the last call lasting 68 seconds on the 18th day of May. This was the second time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and maintains an average yearly balance of 3063 euros.###\nHence this label was No."
"A 39-year-old married technician with a secondary education, no credit in default, and no housing or personal loans. They were contacted via cellular communication on the 12th of August and the call lasted 217 seconds. This was the 6th time they were contacted during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1986 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, a housing loan, but do have a personal loan. The average yearly balance is 830 euros. The client was contacted via cellular communication on the 25th of July, with the call lasting 795 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, indicating that the client was not contacted before.###\nHence this label was No."
"The client is a 64-year-old retired individual who is divorced. They have a tertiary education and do not have any credit in default. Their average yearly balance is 17875 euros, and they do not have housing or personal loans. The client was contacted via cellular communication on the 25th day of August. The call duration was 173 seconds, and this was the first contact made during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is negative. The bank contacted them via an unknown communication type on the 26th of May, with a call duration of 299 seconds. This was the first contact during this campaign. There is no information on previous campaign outcomes or previous contacts with the client.###\nHence this label was No."
"The client is a 31-year-old single individual working as a blue-collar worker with a secondary level of education. They do not have any credit in default, have a housing loan, but do not have a personal loan. The average yearly balance in euros is 19. The communication type during the contact is unknown, and the last contact was made on the 19th of May, with a duration of 178 seconds. This client has been contacted 5 times during this campaign and has not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married individual working in management with a tertiary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 144. The client was contacted via cellular communication on the 27th of February, with a call duration of 123 seconds. This is the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 44-year-old single technician with unknown education, who does not have credit in default, no housing loan, and no personal loan. They were contacted via cellular communication on the 16th of July for a duration of 199 seconds. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 1431 euros.###\nHence this label was No."
"The client is a 41-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default and have housing and personal loans. They were last contacted in June for a term deposit campaign. The client was previously contacted 2 times and the last call lasted for 191 seconds. Their average yearly balance is 2770 euros. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old self-employed individual who is single and has tertiary education. They do not have any credit in default and have an average yearly balance of 72 euros. They have a housing loan but no personal loan. The bank contacted them via an unknown communication type on the 2nd day of June, with a call duration of 69 seconds. This was the first and only contact made during this campaign. There was no previous contact with the client from previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working in the services sector with a secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 14th of May. The call duration was 629 seconds, and this was the 4th contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 207 euros.###\nHence this label was Yes."
"The client is a 47-year-old married housemaid with tertiary education. They do not have any credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 22nd of July, with a call lasting 89 seconds. This was the first contact during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 228 euros.###\nHence this label was No."
"The client is a 27-year-old single individual working in administration with tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted through a cellular phone call on the 26th of January, with the call lasting 98 seconds. This was the second time they were contacted during this campaign, with the previous contact occurring 307 days ago. The outcome of the previous marketing campaign for this client was a failure. The client maintains an average yearly balance of 689 euros.###\nHence this label was No."
"The client is a 33-year-old married technician with a secondary education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via cellular communication on the 29th of August and the call lasted 103 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 118 euros.###\nHence this label was No."
"The client is a 54-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 26th of August and had a conversation lasting 385 seconds. This was the 9th time they were contacted during this campaign. The client had not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1111 euros.###\nHence this label was No."
"A 37-year-old married entrepreneur with unknown education and no credit in default was contacted by phone in June. They have a housing loan but no personal loan, and their average yearly balance is 1134 euros. The call lasted 142 seconds, which was the 3rd contact made during this campaign. There were no previous contacts with the client. The outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old single individual working in management with a tertiary education. They do not have any credit in default and have an average yearly balance of 2555 euros. The client has a housing loan but no personal loan. The bank contacted them via cellular communication on the 26th of May, with a call duration of 129 seconds. This is the second time they have been contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, but have a housing loan. They also have an average yearly balance of 1934 euros and do not have a personal loan. The client was contacted via an unknown communication type on the 13th of May, with the call lasting 20 seconds. This was the first and only contact made during this campaign. There is no information on previous contacts or the outcome of any previous marketing campaigns.###\nHence this label was No."
"The client is a 35-year-old married technician with secondary education. They do not have any credit in default but have a housing loan. They were contacted via cellular communication and had a last contact duration of 772 seconds on the 16th of April. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 783 euros and does not have a personal loan.###\nHence this label was No."
"The client is a 35-year-old married technician with a secondary level of education. They do not have credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting 160 seconds on the 17th of July. This was the 6th contact made during this campaign. The client was not previously contacted. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is in the negative (-67 euros).###\nHence this label was No."
"A 27-year-old blue-collar worker who is single and holds a secondary education, with no credit default, housing loan, or personal loan. They were contacted via cellular communication on the 16th of November and had a phone call duration of 183 seconds. This was the second time they were contacted during this campaign, with the previous contact resulting in a successful outcome. They have an average yearly balance of 535 euros and were last contacted 94 days ago.###\nHence this label was Yes."
"The client is a 42-year-old married entrepreneur with tertiary education and no credit in default. They have an average yearly balance of 42045 euros and do not have a housing or personal loan. The communication with the client was done via cellular phone. The client was last contacted on the 8th of August for 205 seconds, as part of the second contact during this campaign. There were no previous contacts with the client regarding marketing campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married technician with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The communication type for contact is unknown. The client was last contacted on the 3rd day of June, with a call duration of 112 seconds. This is the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 42-year-old divorced individual working in a blue-collar job with secondary education. They do not have credit in default and have an average yearly balance of 898 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 18th of November, and the call lasted for 136 seconds. This was the second call made to the client during this campaign, with 131 days passing since they were last contacted from a previous campaign. The outcome of the previous marketing campaign with this client was a failure.###\nHence this label was No."
"The client is a 40-year-old married housemaid with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 11th of August. The call lasted for 1099 seconds, and this was the 4th contact made during this campaign. The client was not previously contacted in any previous campaign, and the outcome of the previous marketing campaign is unknown. The average yearly balance in their account is 116 euros.###\nHence this label was No."
"The client is a 75-year-old retired individual who is divorced and has a secondary level education. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via telephone on the 12th of October and the call lasted 250 seconds. This was the first contact made during this campaign, but they were contacted twice in a previous campaign where the outcome was unsuccessful. The client's average yearly balance is 1092 euros.###\nHence this label was No."
"The client is a 38-year-old married individual working in the services sector with a secondary level education. They do not have any credit in default, housing loan, or personal loan. The client was contacted via an unknown communication type on the 18th of June. The call lasted for 90 seconds, and this was the third contact made during this campaign. There were no previous contacts with the client for previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 393 euros.###\nHence this label was No."
"The client is a 46-year-old single individual working as a blue-collar worker with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via an unknown communication type on the 21st of May. The call lasted for 27 seconds, and this was the 10th contact made during this campaign. This client was not contacted in any previous campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 52-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via an unknown communication type on the 5th of May and the call lasted for 93 seconds. This was the 3rd time they were contacted during this campaign, with no previous contacts. Their average yearly balance is 782 euros. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old single person working as a blue-collar worker with secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 29. The last contact was made on the 16th of May, with a duration of 132 seconds. This was the 13th contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The communication type during the contact was classified as unknown.###\nHence this label was No."
"The client is a 43-year-old married blue-collar worker with primary education. They do not have credit in default, but they have a housing loan. They were contacted via cellular communication and the last call lasted 284 seconds. This was the third call made to the client during this campaign. The previous marketing campaign outcome is unknown. The client's average yearly balance is 289 euros and they do not have a personal loan. The last contact was on the 6th day of May, and this is the first time they have been contacted for this campaign.###\nHence this label was No."
"The client is a 29-year-old student who is single. They have a secondary level education and do not have any credit in default. Their average yearly balance is 872 euros. They have a housing loan but no personal loan. The communication type for the last contact is unknown, and the call lasted for 230 seconds. This was the first time they were contacted during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old blue-collar worker who is single and has primary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via telephone on the 14th day of May for a very short duration of 7 seconds. This was the 7th time they were contacted during this campaign. There is no record of any previous contact with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old single individual working as a blue-collar worker with a secondary level education. They do not have any credit in default and have a yearly average balance of 551 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 8th of May, and the call lasted 347 seconds. This was the second contact during the current campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 60-year-old divorced individual working in the services sector with a secondary level of education. They do not have any credit in default, housing loan or personal loan. Communication with the client was done through a cellular phone call, with the last contact being on the 3rd of February and lasting 282 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 758 euros.###\nHence this label was No."
"The client is a 36-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit default, housing loan, or personal loan. The average yearly balance in euros is 13. The client was contacted via an unknown communication type on the 3rd of June for 284 seconds as part of the current marketing campaign. This is the first time they have been contacted for this campaign, and the outcome of any previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old married individual working in administration with secondary education. They do not have any credit in default, housing loan, or personal loan. Their average yearly balance is 1595 euros. The last contact was made on the 9th of September for only 1 second. This was the 1st contact during this campaign, and there were 4 contacts made in previous campaigns. The outcome of the previous marketing campaign was successful. The communication type for this contact is unknown.###\nHence this label was No."
"The client is a 51-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default and have an average yearly balance of 230 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 17th of November and the call lasted for 174 seconds. This was the first contact during this campaign, and the previous campaign outcome was a failure. The client was last contacted 195 days ago with one contact made during the previous campaign.###\nHence this label was No."
