"The client is a 40-year-old unemployed married individual with secondary education. They do not have credit in default, have a housing loan, and do not have a personal loan. The bank contacted them via an unknown communication type on the 5th day of June for a duration of 59 seconds. This was the 7th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1779 euros.###\nHence this label was No."
"The client is a 51-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 17th of April, with a call lasting 97 seconds. This is the first contact made during this campaign. The outcome of any previous marketing campaign with this client is unknown. The client's average yearly balance is 615 euros.###\nHence this label was No."
"The client is a 37-year-old married entrepreneur with secondary education. They do not have credit in default but have both a housing and personal loan. They were contacted via an unknown communication type on the 27th of May, with the call lasting for 73 seconds. This was the 6th contact made to the client during this campaign. There were no previous contacts with the client for marketing purposes. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working in the services sector with a secondary level of education. They do not have credit in default, housing loan, or personal loan. They were contacted through an unknown communication type on the 19th of June. The call lasted for 27 seconds during which the client was contacted for the second time in the current campaign. There were no previous contacts with the client regarding marketing campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3374 euros.###\nHence this label was No."
"The client is a 58-year-old single technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via cellular communication on the 18th of November and the call lasted 61 seconds. This was the first contact made during the current campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 8600 euros.###\nHence this label was No."
"The client is a 41-year-old divorced housemaid with secondary education. They do not have credit in default but have a housing loan. They were contacted via telephone on the 17th of April and the call lasted 198 seconds. This was the first contact during this campaign, and there was no previous contact. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and has an average yearly balance of 43 euros.The client did not subscribe to a term deposit in this campaign.###\nHence this label was No."
"The client is a 29-year-old single technician with a tertiary education. They do not have credit in default but have housing and personal loans. The average yearly balance is 262 euros. The communication type is cellular, and the last contact was on the 29th of July, lasting 510 seconds. During this campaign, 9 contacts were made to the client. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old retired married individual with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via an unknown communication type on the 3rd of June. The call lasted for 290 seconds, and it was the first contact made during this campaign. There was no previous campaign contact history, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old divorced individual working as a blue-collar worker with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via cellular communication on the 22nd of July, with the call lasting 1408 seconds. This is the second time they have been contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2551 euros.###\nHence this label was No."
"The client is a 48-year-old married technician with unknown education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 460 euros. The client was contacted 3 times during this campaign, with the last contact being on the 5th of June and lasting 99 seconds. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old married individual working in management with a tertiary education. They do not have credit in default and have a housing and personal loan. They were contacted via cellular communication on the 18th of July for 104 seconds. This is the first contact made during this campaign, and there was no record of any previous contact. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1720 euros.###\nHence this label was No."
"The client is a 42-year-old married individual working in administration with a secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The communication with the client was through a cellular phone call that lasted 305 seconds. This was the first contact during the current campaign. The client was last contacted on the 10th of July. Their average yearly balance is negative 728 euros. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old single technician with tertiary education and no credit in default. They have an average yearly balance of 53 euros and do not have a housing or personal loan. The bank contacted them via cellular communication on the 29th of April, with a call duration of 375 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 40-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via cellular communication on the 16th of July and the call lasted for 1018 seconds. This was the second contact made during the current campaign. The outcome of any previous marketing campaign is unknown. The client has a negative average yearly balance of 839 euros.###\nHence this label was Yes."
"A 27-year-old self-employed single individual with a tertiary education was contacted for a direct marketing campaign. They do not have credit in default but have a housing loan. Their average yearly balance is -503 euros, indicating a negative balance. They do not have a personal loan. The contact was made via an unknown communication type, and the call lasted 98 seconds. This was the third contact made during this campaign. The previous marketing campaign's outcome is unknown.###\nHence this label was No."
"The client is a 36-year-old self-employed individual who is married with a primary level of education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 21st of August and the call lasted for 239 seconds. This was the third time they were contacted during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 161 euros.###\nHence this label was No."
"The client is a 36-year-old married individual working in management with a tertiary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 0. The contact communication type is unknown. The last contact was on the 17th of June, lasting 222 seconds. This is the third contact made during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 6th of August and the call lasted for 122 seconds. This was the second contact made to the client during this campaign. There was no previous contact from a previous campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 29 euros.###\nHence this label was No."
"The client is a 53-year-old married individual working in administration with a secondary education. They do not have any credit in default and do not have a housing loan but have a personal loan. They were contacted via cellular communication and the last call duration was 113 seconds. This client has an average yearly balance of 350 euros. They were last contacted on the 17th of November, with 3 contacts made during this campaign and 2 contacts made in previous campaigns. The outcome of the previous marketing campaign for this client was a failure.###\nHence this label was No."
"The client is a 37-year-old single technician with a secondary education. They do not have any credit in default, but they have housing and personal loans. Their average yearly balance is 884 euros. The bank contacted them via cellular communication on the last day of July for a duration of 128 seconds. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old divorced technician with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 19th of August, and the call lasted 103 seconds. This was the 4th time they were contacted during this campaign. There is no record of previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 29-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default but have a housing loan. Their average yearly balance is negative. They do not have a personal loan. They were contacted via an unknown communication type on the 4th day of June, with a call duration of 182 seconds. This is the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual working in management with a secondary education. They do not have credit in default and have an average yearly balance of 96 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 20th of November, with a call duration of 151 seconds. This is the third time they have been contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 27-year-old single technician with secondary education. They do not have credit in default and have a housing loan. They were contacted via cellular communication and the last call duration was 119 seconds. This was the 1st contact during this campaign, with 5 previous contacts made. The last contact was 314 days ago and the outcome of the previous campaign was a success. The client does not have a personal loan and their average yearly balance is 639 euros.###\nHence this label was No."
"This client is a 32-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default but have a housing loan. They were contacted via cellular communication and had a long phone call duration of 1076 seconds. This is their 2nd contact in the current campaign, with 85 days passed since they were last contacted. In the previous campaign, they were contacted 3 times and the outcome was categorized as 'other'. They do not have a personal loan and maintain an average yearly balance of 889 euros.###\nHence this label was Yes."
"This individual is a 43-year-old married entrepreneur with an unknown level of education. They do not have credit in default and have an average yearly balance of 100 euros. They have a housing loan but no personal loan. The communication type used during the last contact is unknown, which lasted for 702 seconds. This was the first contact made during the current campaign. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 33-year-old single individual working as a blue-collar worker with a tertiary education. They do not have any credit in default and have an average yearly balance of 3446 euros. They have a housing loan but do not have a personal loan. The client was contacted via cellular communication, with the last call lasting 83 seconds on the 28th of April. This was the second time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 55-year-old divorced individual working in management with primary education. They do not have credit in default but have a housing loan. Their average yearly balance is 3629 euros and they do not have a personal loan. The last contact was made on the 30th of May through an unknown communication type, lasting for 87 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 19391. The client was contacted via cellular communication on the 20th of November and the call lasted 391 seconds. This was the second contact made to the client during this marketing campaign. There were no previous contacts with the client from previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank reached out to them via cellular communication on the 17th of July, and the call lasted for 277 seconds. This was the third contact made during this campaign. The client has not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 600 euros.###\nHence this label was No."
"The client is a 39-year-old entrepreneur who is divorced and has a secondary level education. They do not have any credit in default and have a yearly balance of 990 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication and the last call lasted 55 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old divorced individual working in the services sector with secondary education. They do not have credit in default and have an average yearly balance of 41 euros. They have a housing loan but no personal loan. The communication type used for contacting them was cellular. The last contact was made on the 3rd of February and lasted 251 seconds. This is the 4th contact made during this campaign, with 187 days passed since the client was last contacted. Prior to this campaign, 11 contacts were made, with the previous marketing campaign outcome labeled as \"other\".###\nHence this label was No."
"The client is a 45-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and do not have any existing housing or personal loans. The client was contacted via cellular communication and the last call duration was 113 seconds. This was the fourth contact made during the current campaign. The client was not previously contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 419.###\nHence this label was No."
"The client is a 47-year-old married individual working in the services sector with a secondary education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cellphone in August, and the call lasted for 153 seconds. This was the 4th contact made to the client during this campaign. There were no previous contacts with the client from previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 27 euros.###\nHence this label was No."
"The client is a 33-year-old single individual working in management with secondary education. They do not have credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cell phone on the 18th of May for 19 seconds, as part of the 4th contact in the current campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 219 euros.###\nHence this label was No."
"The client is a 37-year-old divorced technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call made on the 8th of May, lasting for 268 seconds. This was the 1st contact during this campaign, following 4 previous contacts. The client was last contacted 281 days ago from a previous campaign, with the outcome being \"other\". The client's average yearly balance is 262 euros.###\nHence this label was No."
"The client is a 45-year-old married technician with secondary education and no credit in default. They have an average yearly balance of 3007 euros and do not have a housing or personal loan. The communication type for the last contact is unknown, which lasted 442 seconds on the 11th day of June. This was the first contact made during this campaign. There is no information on previous contacts or outcomes of previous marketing campaigns.###\nHence this label was No."
"The client is a 48-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication, and the last call lasted 489 seconds. This was the first contact during this campaign, but they were contacted twice before in previous campaigns. The previous campaign resulted in failure. The client's average yearly balance is 1730 euros. The last contact was made on the 4th day of February, and 178 days had passed since the previous campaign contact.###\nHence this label was Yes."
"The client is a 54-year-old retired married individual with primary education. They do not have credit in default, a housing loan, or a personal loan. The bank communicated with them via cellular phone, contacting them on the 13th of August for a duration of 969 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 309 euros.###\nHence this label was Yes."
"The client is a 30-year-old married individual working in an administrative role with secondary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via a cellular phone call on the 10th of July, and the call lasted 327 seconds. This was the first contact during this campaign. The client's average yearly balance is -68 euros. The outcome of any previous marketing campaigns is unknown.###\nHence this label was No."
"The client is a 59-year-old married individual working in a management position with tertiary education. They do not have any credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication in July and the call lasted for 1272 seconds. This was the third contact made during this campaign. The outcome of the previous marketing campaign is unknown. Additionally, the client had an average yearly balance of 553 euros.###\nHence this label was Yes."
"The client is a 47-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 12th of August, with a call duration of 864 seconds. This was the third time they were contacted during this campaign, and they had not been contacted in any previous campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 570 euros.###\nHence this label was No."
"The client is a 43-year-old single individual working in management with a tertiary education. They do not have any credit in default and have an average yearly balance of 1696 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 26th of August, with a call duration of 257 seconds. This is the first contact made during this campaign, and the client was last contacted 474 days ago in a previous campaign, where there were 3 prior contacts. The outcome of the previous campaign was a failure.###\nHence this label was Yes."
"A 51-year-old single technician with secondary education, no credit in default, and a housing loan was contacted via an unknown communication type. During the current campaign, the client was contacted twice, with the last contact lasting 364 seconds on the 5th day of May. There were no previous contacts with the client, and the outcome of the previous campaign is unknown. The client does not have a personal loan and has an average yearly balance of 0 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and do not have a housing loan, but they do have a personal loan. The client was contacted via cellular communication, and the last call lasted for 24 seconds on the 29th day of August. This was the 17th contact made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 947 euros.###\nHence this label was No."
"The client is a 44-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication, reaching out on the 5th of February for a duration of 80 seconds. This is their 7th contact during this campaign, with 80 days passing since they were last contacted from a previous campaign where there were 15 interactions. The outcome of the previous marketing campaign was deemed a failure. The client's average yearly balance is 1451 euros.###\nHence this label was No."
"This individual is a 42-year-old housemaid who is married and has a primary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their bank account is 2328 euros. They were contacted via cellular communication on the 20th of August and the call lasted for 133 seconds. This was the second time they were contacted during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married entrepreneur with tertiary education and no credit in default. They have an average yearly balance of 170 euros and a housing loan, but no personal loan. The bank contacted the client via cellular communication on the 18th of May, with a call duration of 442 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was Yes."
"The client is a 57-year-old divorced technician with tertiary education. They do not have credit in default, a housing loan, or a personal loan. The communication type used for contact is cellular. The client was last contacted on the 26th of August and the call lasted for 435 seconds. This was the 5th contact made during this campaign. The client had not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 437 euros.###\nHence this label was No."
"A 34-year-old married individual working in the administration sector, with secondary education, and no credit in default, was contacted via cellular communication. They have a housing loan but no personal loan. \nTheir average yearly balance is 2374 euros. \nThe last marketing campaign, which took place in November, resulted in a 161-second call, and it was the third contact made to this client. The outcome of the previous campaign was a failure. \n209 days had passed since the client was last contacted before this current campaign, where they have been reached only once so far.###\nHence this label was Yes."
"The client is a 40-year-old self-employed individual who is married with a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 0. The contact was made through an unknown communication type on the 19th of June, with a duration of 61 seconds. This is the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old single administrative professional with secondary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication in May. The client's average yearly balance is -281 euros. During the current campaign, they have been contacted 4 times and the last call lasted 144 seconds. The client was last contacted 340 days ago from a previous campaign, where 4 contacts were made. The outcome of the previous marketing campaign was classified as \"other.\"###\nHence this label was No."
"The client is a 44-year-old divorced individual working in the administrative field with secondary education. They do not have credit in default and do not have any existing housing or personal loans. The bank contacted them via cellular communication on the 14th of April and had a successful conversation that lasted 1594 seconds. This was the second time they were contacted during this campaign, with the previous contact occurring 148 days ago resulting in a failed outcome. The client currently has an average yearly balance of 0 euros.###\nHence this label was Yes."
"The client is a 58-year-old unemployed married individual with primary education and no credit in default. They have an average yearly balance of 3884 euros and do not have a housing or personal loan. The client was contacted via an unknown communication type in July, with the last conversation lasting 399 seconds. This was the 8th contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 60-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan but no personal loan. They were contacted via cellular communication on the 8th of July for 59 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with primary education. They do not have any credit default, housing loan but have a personal loan. The average yearly balance is 1092 euros. They were last contacted on the 30th of May for 41 seconds, as part of the current campaign which included 8 contacts. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown. The communication type is unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working in management with a secondary education. They do not have credit in default, but have a housing loan. They were contacted via cellular communication on the 18th of May for a duration of 37 seconds during the current marketing campaign, which is the second contact made. There is no record of previous contacts with this client. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and maintains an average yearly balance of 180 euros.###\nHence this label was No."
"A 23-year-old single individual working in a blue-collar job with a secondary education was contacted about a term deposit by phone. They have no credit in default and no personal loan, but do have a housing loan. The contact was made through an unknown communication type in May, and lasted for 544 seconds. This was the first contact during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown, and the client had an average yearly balance of 9 euros.###\nHence this label was No."
"The client is a 35-year-old self-employed individual who is married and has a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 5th of February. The call lasted for 142 seconds, and this was the 4th contact made during this campaign. The client was not previously contacted in any campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 137 euros.###\nHence this label was No."
"The client is a 36-year-old married technician with secondary education. They do not have any credit in default, a housing loan, but they do have a personal loan. The bank contacted them via cellular communication, and the last call lasted 146 seconds. This was the 4th day of the month of February when they were last contacted. This client has been contacted 3 times during this campaign and 1 time before. The outcome of the previous marketing campaign was categorized as 'other'. The average yearly balance of the client is 627 euros.###\nHence this label was No."
"The client is a 35-year-old married individual working in management with tertiary education. They do not have any credit in default, have a housing loan but no personal loan. The bank contacted them via cellular communication on the 21st of July, with a call duration of 295 seconds. This is the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 32-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default but have both a housing loan and a personal loan. They were contacted via an unknown communication type in May, with a call duration of 185 seconds on the 26th day of the month. This is the fourth contact made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married entrepreneur with tertiary education. They do not have credit in default but have a housing loan. They were contacted via an unknown communication type, with the last call lasting 50 seconds on the 20th of June. This was the second contact during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 59-year-old married housemaid with primary education and no credit in default. They have a relatively low yearly balance of 57 euros and do not have any housing or personal loans. The bank contacted them via cellular communication on the 22nd of August, with the call lasting 212 seconds. This was the 11th contact made during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, reaching out on the 3rd day of February. The call lasted 136 seconds, which was the 3rd contact made during this campaign. The client was not previously contacted, and the outcome of any previous marketing campaigns is unknown. The client's average yearly balance is 414 euros.###\nHence this label was No."
"The client is a 31-year-old married individual working in management with a tertiary education. They do not have any credit in default but have housing and personal loans. They were contacted via cellular communication and last contacted on the 4th of August for 182 seconds. This is their third contact during this campaign. There is no record of previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 859 euros.###\nHence this label was No."
"This client is a 49-year-old divorced individual working in an administrative role with a secondary level of education. They do not have credit in default, have a housing loan, but no personal loan. The client was contacted via cellular communication, with the last call lasting 264 seconds on the 21st of November. This was the 2nd contact made during the current campaign, following up after 172 days from the previous attempt. There was 1 contact made in a previous campaign, which ended in failure. The client's average yearly balance is 771 euros.###\nHence this label was No."
"The client is a 35-year-old married technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via cellular communication and the last call duration was 524 seconds. This was the 1st contact during this campaign, with 5 contacts made in previous campaigns. The previous marketing campaign was successful, and the client was last contacted 96 days ago. Their average yearly balance is 0 euros.###\nHence this label was Yes."
"The client is a 39-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, housing loan, or personal loan. The bank communicated with the client via cellular phone on the 13th day of August. The call lasted for 69 seconds, and it was the first contact made during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous campaign is unknown. The client's average yearly balance is 52 euros.###\nHence this label was No."
"The client is a 33-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication and the last call lasted 46 seconds on the 27th of August. This was the 10th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1940 euros.###\nHence this label was No."
"The client is a 51-year-old married individual working in a blue-collar job with primary education. They do not have credit in default but have housing and personal loans. The client was last contacted via cellular communication for 438 seconds on the 2nd day of February. This was the 4th contact made during the current campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2095 euros.###\nHence this label was No."
"The client is a 46-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have housing and personal loans. The average yearly balance is 15 euros. The contact was made via cellular phone on the 19th of November, with a call duration of 46 seconds. This was the second time they were contacted during this campaign, after 91 days since they were last contacted from a previous campaign, where there were a total of 3 contacts. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 50-year-old divorced technician with secondary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 17th of July, with a call duration of 903 seconds. This was the 4th contact made to the client during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 8016 euros.###\nHence this label was No."
"A 29-year-old single technician with secondary education who does not have credit in default, but has a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 3rd of March and the call lasted 156 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with this client is unknown. The client's average yearly balance is 316 euros.###\nHence this label was Yes."
"The client is a 38-year-old married entrepreneur with tertiary education. They do not have credit in default, do not have a housing loan but have a personal loan. The average yearly balance is 678 euros. The bank contacted them via cellular communication on the 18th of November, with a call duration of 82 seconds. This is the second time they have been contacted during this campaign, with 152 days passing since the last contact from a previous campaign. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"A 33-year-old married individual working in a management role with tertiary education was contacted via cellular communication. They do not have credit in default and have a housing loan. Their average yearly balance is 1782 euros, and they do not have a personal loan. During the current campaign, they were contacted 4 times, with the last call lasting 437 seconds on the 20th of November. They have not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 60-year-old retired individual who is divorced. They have a secondary level education and do not have any credit in default. The client's average yearly balance is 1091 euros, and they do not have a housing or personal loan. The bank contacted them via cell phone on the 30th of July and the call lasted 441 seconds. This was the 5th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 26-year-old student who is single. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 611 euros and no housing or personal loans, the client was contacted via cellular communication. The last contact was on the 5th of June and lasted for 455 seconds. This was the third contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old divorced individual working in an administrative role with a secondary education. They do not have credit in default and do not have any housing or personal loans. They were contacted via cellular communication on the 28th of January, with the call lasting 246 seconds. This was the second contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 399 euros.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with tertiary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 21st of August and the call lasted for 310 seconds. This was the second call made to them during this campaign. There is no record of previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 185 euros.###\nHence this label was No."
"The client is a 44-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default, but have a housing loan. They were contacted via unknown communication type on the 18th of June. The call lasted 149 seconds, and this was the second contact made during this campaign. There is no record of any previous contact. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and has an average yearly balance of -448 euros.###\nHence this label was No."
"The client is a 35-year-old single blue-collar worker with secondary education. They do not have any credit in default, but they have a housing loan. They were contacted via cellular communication and the last call lasted 371 seconds. This campaign was the second time they were contacted, with the previous one resulting in failure. The client was last contacted 305 days ago. They do not have a personal loan.###\nHence this label was No."
"The client is a 32-year-old blue-collar worker who is divorced and has primary education. They do not have credit in default and have an average yearly balance of 158 euros. They have a housing loan but no personal loan. The communication type used for contact is cellular. The last contact was made on the 5th of February and lasted for 728 seconds. This is the 4th contact during this campaign and 1 contact was made in a previous campaign 253 days ago, which resulted in failure.###\nHence this label was No."
"The client is a 28-year-old married technician with secondary education. They do not have credit in default, have a housing loan but no personal loan. The average yearly balance is 1180 euros. The last contact was made on the 29th of May, with a duration of 637 seconds. This was the third contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The communication type for this contact was unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working as a blue-collar worker with a secondary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 14th of April and the call lasted for 283 seconds. This was the second time they were contacted during this marketing campaign. There is no record of any previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 91 euros.###\nHence this label was No."
"The client is a 37-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan but no personal loan. Their average yearly balance is 5052 euros. The communication type during the campaign was unknown, and the last contact was made on the 20th of June, lasting 37 seconds. This was the third contact in the current campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married technician with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 31st of July and had a conversation that lasted 309 seconds. This was the 4th contact made during this campaign. The client has not been previously contacted. The outcome of the previous marketing campaign is unknown. Their average yearly balance is in the negative at -195 euros.###\nHence this label was No."
"A 29-year-old married individual working in management with a tertiary education was contacted by phone for a marketing campaign. They do not have credit in default and have a housing loan. Their average yearly balance is 1671 euros, and they do not have a personal loan. The contact was made through an unknown communication type in May, and the call lasted 182 seconds. This was the first contact made to this client during this campaign. The outcome of any previous marketing campaigns is unknown.###\nHence this label was No."
"The client is a 46-year-old divorced individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 452 euros. The client was contacted via an unknown communication type on the 9th day of May and the call lasted 113 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The client was last contacted in August via cellular communication and the call lasted for 132 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 604 euros.###\nHence this label was No."
"The client is a 35-year-old married technician with secondary education. They do not have credit in default and have a housing and personal loan. They were contacted via an unknown communication type on the 16th of May, with a call duration of 95 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaigns with this client is unknown. The client's average yearly balance is 523 euros.###\nHence this label was No."
"The client is a 32-year-old single individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their bank account is 470 euros. The bank contacted them via a cellular phone call on the 19th of August, and the call lasted 286 seconds. This was the second time they were contacted during the current campaign, with no previous contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 49-year-old married individual working as an admin, with secondary education. They do not have any credit in default, but have a housing loan. They were contacted via telephone on the 11th day of May. The call lasted 226 seconds and it was the 2nd time they were contacted during this campaign. There is no record of them being contacted in any previous campaign. They do not have a personal loan. Their average yearly balance is 1120 euros. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 27-year-old single individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication. The client was last contacted on the 29th of January and the call lasted for 76 seconds. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign with this client is unknown. Their average yearly balance is 170 euros.###\nHence this label was No."
"The client is a 30-year-old student who is single and has a secondary level education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone and the last call lasted 595 seconds. This was the 3rd contact made during this campaign, with 1 previous contact. The previous marketing campaign outcome was a failure. The client's average yearly balance is 2046 euros. The last contact was made on the 21st of April, and 254 days had passed since they were last contacted from a previous campaign.###\nHence this label was Yes."
"The client is a 43-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The average yearly balance in euros is 757. The client was last contacted in May on the 9th day, and the call lasted for 315 seconds. This was the 4th contact made to the client during this campaign. There were no previous contacts with the client before this campaign. The outcome of the previous marketing campaign is unknown, as is the communication type used during the contact.###\nHence this label was No."
"The individual is a 32-year-old single blue-collar worker with a secondary education. They do not have any credit in default and have a yearly average balance of 8 euros. They have a housing loan but no personal loan. The contact communication type is unknown, and the last contact was made on the 16th of May, with a duration of 265 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 43-year-old single individual working in management with tertiary education. They do not have credit in default but have both a housing loan and a personal loan. They were contacted via cellular communication and had a short conversation lasting 30 seconds during the call. This is the second time they have been contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown. Despite having a negative average yearly balance, the client is being targeted for a term deposit subscription.###\nHence this label was No."
"A 30-year-old self-employed married individual with a tertiary education was contacted via cellular communication. They do not have credit in default but have both housing and personal loans. Despite a negative yearly balance of 517 euros, they were contacted twice during the campaign in August. The last call lasted 123 seconds, and there were no previous contacts with this client. The outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default but have a housing loan. They were contacted via an unknown communication type on the 13th of May for 53 seconds. This was their first contact in the current campaign, and there is no information about any previous interactions or outcomes from past campaigns.###\nHence this label was No."
"The client is a 44-year-old blue-collar worker who is divorced. They have secondary education and do not have any credit in default. Their average yearly balance is 1781 euros. They have a housing loan but do not have a personal loan. The client was contacted via cellular communication on the 29th of July, with a call duration of 48 seconds. This is the third contact made during this campaign. There was no previous contact with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 39-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, reaching out on the 28th of August. The call lasted for 93 seconds. This was the 25th contact made to the client during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 52-year-old divorced technician with primary education, who does not have credit in default and does not have any housing or personal loans, was contacted three times during the current campaign. The last contact was made on the 15th of May, with a call duration of 148 seconds. This client had not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The average yearly balance is 1500 euros, and the communication type used for contact is unknown.###\nHence this label was No."
"The client is a 57-year-old individual with an unknown job and education level, who is married and does not have any credit in default. They have an average yearly balance of 2266 euros and do not have a housing or personal loan. The communication type used for contacting the client is unknown. The client was last contacted on the 20th of June and the call lasted 42 seconds. This is the 5th contact made to the client during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old divorced individual working in management with tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 19th of November, with a call duration of 140 seconds. This was the third contact made during this campaign. There was no previous contact with the client, and the outcome of the previous marketing campaign is unknown. Their average yearly balance is 16 euros.###\nHence this label was No."
"The client is a 48-year-old divorced technician with tertiary education. They have no credit in default, do not have a housing or personal loan, and have an average yearly balance of 855 euros. They were contacted via cellular communication on the 6th of August and the call lasted for 68 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old single technician with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 9th of May. The call lasted for 128 seconds. This was the first contact made during this campaign. There is no data on previous contacts or outcomes of previous campaigns. The client's average yearly balance is -320 euros.###\nHence this label was No."
"The client is a 34-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank communicated with them via cellular contact. The client was last contacted on the 5th of May and the call lasted for 399 seconds. This was the first contact made during this marketing campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 188 euros.###\nHence this label was No."
"The client is a 57-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 856. The communication type used for the campaign was cellular. The client was last contacted on the 11th of August and the call lasted for 194 seconds. This was the 6th contact made during this campaign. There were no previous contacts with the client from previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working in a blue-collar job with tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 1784. The communication type used for contact was cellular. The client was last contacted on the 19th of November, with a call duration of 1184 seconds. They have been contacted 3 times during this campaign and 1 time before. The outcome of the previous marketing campaign was a failure, and the client was last contacted 160 days ago.###\nHence this label was No."
"The client is a 57-year-old single individual working in a blue-collar job with primary education. They do not have any credit in default and do not have a housing loan but have a personal loan. The average yearly balance in euros is 3495. The client was contacted via cellular communication, with the last call lasting 362 seconds on the 19th of November. This was the third contact made during this campaign. There were no previous contacts with this client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old divorced admin worker with secondary education. They do not have credit in default but have a housing loan. Their average yearly balance is 2353 euros and they do not have a personal loan. The bank contacted them via cellular communication on the 5th of March for 182 seconds. This was the first contact during this campaign, but they were contacted twice in a previous campaign, 107 days ago. The outcome of the previous marketing campaign was categorized as \"other\".###\nHence this label was Yes."
"The client is a 37-year-old single individual working in the services sector with secondary education. They do not have credit in default and have an average yearly balance of 43 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 17th of July for a 36-second conversation. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 49-year-old entrepreneur who is single and has secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 13th of May, with a call duration of 149 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 259 euros.###\nHence this label was No."
"The client is a 42-year-old married individual working in management with unknown educational background. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 19th of July and the call lasted for 268 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1519 euros.###\nHence this label was Yes."
"The client is a 30-year-old single individual working in the services sector with secondary education. They do not have any credit in default but have housing and personal loans. They were contacted via cellular communication and the last call duration was 109 seconds. This client was contacted 3 times during this campaign and had not been previously contacted. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 726 euros.###\nHence this label was No."
"The client is a 33-year-old married technician with a tertiary education. They have credit in default and do not have a housing loan or personal loan. The bank contacted them via cellular communication on the 20th of August, with a call duration of 75 seconds. This was the second contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 56 euros.###\nHence this label was No."
"The client is a 30-year-old married individual working in management with a tertiary education. They do not have credit in default and have a housing loan. Their average yearly balance is 74 euros, and they do not have a personal loan. The bank contacted them via cellular communication on the 21st of July, with a call duration of 106 seconds. This is the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is 3311 euros. They were contacted through an unknown communication type on the 26th of May and the call lasted for 243 seconds. This was the 6th contact made to the client during this campaign. There were no previous contacts with the client from previous campaigns, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"A 32-year-old individual working in management, who is divorced and holds a tertiary education, was contacted via cellular communication. They do not have any credit in default, housing loan, or personal loan. With an average yearly balance of 387 euros, they were contacted 4 times during this campaign, with the last call lasting 99 seconds on the 26th of August. There is no record of previous contacts or outcomes from past marketing campaigns.###\nHence this label was No."
"The client is a 29-year-old married individual working as a blue-collar worker with primary education. They have credit in default and a negative yearly balance. They have a housing loan but no personal loan. The contact communication type is unknown. The last contact was on the 9th of May and lasted 484 seconds. This was the first contact during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 60-year-old retired individual who is married and has primary education. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 19th of August. The call lasted for 245 seconds and this was the second time they were contacted during this campaign. There is no record of any previous contact with this client. The outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 420 euros.###\nHence this label was No."
"The client is a 44-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default but have housing and personal loans. Despite having a negative yearly balance, they were contacted via cellular communication for a short 10-second call on the 14th day of May. This was the 10th contact made to them during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 30-year-old single individual with a tertiary education and working in a management role was contacted via cellular communication for a marketing campaign. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is 685 euros. The call, which lasted 299 seconds, was the second contact made during this campaign. The client had not been previously contacted for any other campaign. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 54-year-old divorced individual working as a blue-collar worker with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via an unknown communication type on the 29th of May. The call lasted for 273 seconds, and this was the second time they were contacted during this campaign. There is no record of previous contact with the client for marketing purposes. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 51-year-old married individual working in the services sector with secondary education. They do not have any credit default, housing loan, or personal loan. The average yearly balance is 135 euros. The communication with the client was via cellular phone. The last contact was made on the 25th of August, with a duration of 105 seconds. This was the 4th contact during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan but no personal loan. During the last marketing campaign, the client was contacted once via an unknown communication type, and the call lasted for 78 seconds. This contact was made on the 14th day of May. The client had not been previously contacted for marketing purposes. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 7831 euros.###\nHence this label was No."
"This is a 31-year-old single male working as a blue-collar worker with a secondary education. He does not have any credit in default but has a housing loan. He was contacted via cellular phone on the 12th of May and the call lasted for 313 seconds. This was the first time he was contacted during this campaign. His average yearly balance is 4978 euros and he does not have a personal loan. The outcome of the previous marketing campaign for him is unknown.###\nHence this label was No."
"The client is a 37-year-old single individual working in the administrative sector with a tertiary education. They do not have any credit in default and have an average yearly balance of 224 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 9th of July, and the call lasted for 128 seconds. This was the second contact made to the client during this campaign. There was no previous contact with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working in the services sector with a secondary education. They do not have credit in default, have a housing loan but no personal loan. The client's average yearly balance is 450 euros. They were contacted by phone on the 4th of June for 121 seconds, as part of the fourth interaction in the current campaign. There is no record of previous contact or outcome from a previous marketing campaign. The communication type during the call was unknown.###\nHence this label was No."
"A 26-year-old married individual working in a blue-collar job with secondary education was contacted by phone for a marketing campaign by a Portuguese banking institution. They do not have any credit in default, but they have housing and personal loans. The communication type used for contact was unknown. The client was contacted on the 4th day of June for 165 seconds. This was the second time they were contacted during this campaign, with no previous contact history noted. The outcome of the previous marketing campaign with this client is unknown. The client's average yearly balance is 127 euros.###\nHence this label was No."
"The client is a 64-year-old retired married individual with primary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 9th of September. The last call duration was 167 seconds, and this was the 3rd contact during this campaign. The client was last contacted 92 days ago from a previous campaign, where the outcome was successful. Their average yearly balance is 48 euros.###\nHence this label was Yes."
"The client is a 27-year-old single individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 1840. The client was contacted via cellular communication on the 1st day of June and the call lasted for 220 seconds. This was the 1st contact made during this campaign and the 9th contact overall. The previous marketing campaign's outcome was classified as \"other\", and the client was contacted 28 days after the last campaign.###\nHence this label was Yes."
"The client is a 60-year-old married individual working in management with a secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, with the last call lasting 321 seconds. This was the 4th call made to the client during this campaign, with 87 days passed since the client was last contacted from a previous campaign. Before this campaign, the client had been contacted 8 times, with the previous marketing campaign resulting in failure. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 34-year-old married individual working in the services sector with secondary education. They do not have any credit in default but have a housing loan. They were contacted via cellular communication during the month of July. The last contact duration was 75 seconds, and this was the 3rd contact made during this campaign. There were no previous contacts before this campaign. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and has an average yearly balance of 0 euros.###\nHence this label was No."
"The client is a 59-year-old married individual working in management with tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, and the last call lasted for 386 seconds on the 29th of January. This was the 1st contact made during this campaign, preceded by 4 contacts in previous campaigns that took place 168 days ago, resulting in a previous marketing campaign outcome of failure. The client's average yearly balance is 1857 euros.###\nHence this label was No."
"A 25-year-old single individual, working as a blue-collar worker with secondary education, was contacted via cellular communication for a direct marketing campaign. They have no credit in default, housing loan, or personal loan. With an average yearly balance of 377 euros, they were last contacted on the 15th of July for a duration of 1412 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old single individual working in administration with tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication for a marketing campaign in May. The client has an average yearly balance of 994 euros. The last contact with the client lasted for 211 seconds, and it was the 1st contact during this campaign, following 6 contacts from a previous campaign where the outcome was successful. The client was last contacted 90 days before the current campaign.###\nHence this label was Yes."
"A 37-year-old married individual working in a management role with tertiary education was contacted via cellular communication. They have no credit in default, a housing loan, or personal loan. With an average yearly balance of 393 euros, this person was previously contacted 104 days ago, resulting in a successful outcome. During the current campaign, they were contacted twice, with the last call lasting 62 seconds.###\nHence this label was No."
"The client is a 47-year-old married individual working in the services sector with secondary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 29th of May. The call duration was 42 seconds, and this was the third contact made during this campaign. There was no previous contact with the client before this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 795 euros.###\nHence this label was No."
"The client is a 46-year-old married entrepreneur with a tertiary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 8th of April. The call lasted 126 seconds, and this was the 6th contact made to the client during this campaign. They have not been contacted in any previous campaigns, and the outcome of the previous campaign is unknown. The client's average yearly balance is 9 euros.###\nHence this label was No."
"The client is a 56-year-old retired married individual with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the last day of January, and the call lasted for 479 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1454 euros.###\nHence this label was No."
"The client is a 26-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default but have a housing loan. They have an average yearly balance of 647 euros and do not have a personal loan. The bank contacted them via cellular communication on the 17th of April, with a call duration of 357 seconds. This is their second contact during this campaign, after 331 days since they were last contacted from a previous campaign. The outcome of the previous marketing campaign was categorized as 'other'.###\nHence this label was No."
"The client is a 39-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default, housing loan, or personal loan. The bank communicated with them via cellular phone and the last call, which lasted 334 seconds, was made on the 9th of June. This was the second call made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 276 euros.###\nHence this label was Yes."
"The client is a 55-year-old married individual working in an administrative role with a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 9329. The client was contacted via cellular communication on the 19th of March and the call lasted 181 seconds. This was the first contact made during this campaign. There is no information available about any previous marketing campaign outcome or contact history with the client.###\nHence this label was No."
"The client is a 36-year-old married entrepreneur with tertiary education. They do not have credit in default but have a housing loan. They were contacted via cellular communication and previously made 4 calls during this campaign. The client was last contacted on the 20th of April for 22 seconds. Their average yearly balance is negative at -502 euros, and they do not have a personal loan. The outcome of the previous marketing campaign is unknown, as this is the first time they have been contacted.###\nHence this label was No."
"The client is a 44-year-old divorced individual working in management with tertiary education. They do not have credit in default, housing loan, or personal loan. The communication type used in the last contact is unknown, which lasted for 491 seconds. This client was contacted 3 times during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 29-year-old self-employed single individual with secondary education and no credit in default. They have a housing and personal loan and their average yearly balance is 3672 euros. They were contacted through an unknown communication type on the 28th of May and the call duration was 1210 seconds. This was the first contact during this campaign and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married individual working in a management role with tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is 5 euros. The client was contacted via an unknown communication type on the 5th of June and the call lasted for 178 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 27-year-old single individual with a management job and tertiary education was contacted via cellular communication for a direct marketing campaign. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is 1277 euros. During this campaign, they were contacted 4 times, with the last call lasting 267 seconds on the last day of January. This is the first time they have been contacted for a campaign, and the outcome of any previous campaigns is unknown.###\nHence this label was No."
"The client is a 47-year-old married technician with secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is in negative. The communication type used for contact is cellular. The client was last contacted on the 14th of August and the call duration was 457 seconds. This is the second time they have been contacted during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default, have a housing loan but no personal loan. The average yearly balance is 844 euros. The client was last contacted on the 27th of May, with a call duration of 157 seconds. This was the second contact made during the current campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 39-year-old single technician with a secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 25th of August. The call lasted 194 seconds, and this was the 9th contact made during this campaign. The client had not been contacted previously. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 32-year-old single individual working in the services sector with secondary level education. They do not have any credit in default but have a housing loan. The client does not have a personal loan. The communication type for contacting the client is unknown. The client was last contacted on the 17th of June, with a call duration of 236 seconds. This is the second time they have been contacted during this campaign. There is no information on previous contacts or outcomes of past marketing campaigns. The client's average yearly balance is 914 euros.###\nHence this label was No."
"The client is a 32-year-old married individual working in a management role with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 28th of August and the call lasted for 73 seconds. This was the 7th time they were contacted during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2213 euros.###\nHence this label was No."
"The client is a 49-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 6613. The client was last contacted on the 19th of November via cellular communication and the call duration was 106 seconds. This was the first contact made during the current campaign, with 3 previous contacts made before. The outcome of the previous marketing campaign was a failure, and the last contact was made 155 days ago.###\nHence this label was No."
"The client is a 53-year-old married individual working in the services sector with a secondary level of education. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is 579 euros. The last contact was made on the 4th of June via an unknown communication type, with a duration of 1224 seconds. This was the 7th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with a tertiary education. They do not have credit in default, housing loan, or personal loan. They were contacted via telephone on the 3rd day of February, with a call duration of 1776 seconds. This was the second contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1308 euros.###\nHence this label was Yes."
"A 26-year-old single individual working in the services sector with tertiary education and no credit defaults, housing loans, or communication type via telephone. They have a personal loan and an average yearly balance of 0 euros. The client was contacted 4 times during this campaign, with the last contact lasting 261 seconds in July on the 1st day of the month. The client was not previously contacted, and the outcome of the previous campaign is unknown.###\nHence this label was Yes."
"The client is a 34-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit in default and have housing and personal loans. They were contacted via cellular communication on the 21st of November for a duration of 18 seconds. This is the 7th contact made during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 328 euros.###\nHence this label was No."
"The client is a 60-year-old married technician with secondary education. They do not have credit in default, have a housing loan but no personal loan. The average yearly balance is 2639 euros. They were contacted via an unknown communication type on the 14th of May, with a call duration of 483 seconds. This is the second contact made during this campaign. The client has not been previously contacted for any campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 19-year-old student who is single and has a primary education. They do not have any credit in default, housing loan, or personal loan. The bank reached out to them via cellular communication. The client was last contacted on the 10th of July and the call lasted for 104 seconds. This was the second contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign with this client is unknown. The client's average yearly balance is 103 euros.###\nHence this label was Yes."
"The client is a 56-year-old retired individual who is divorced and holds a tertiary education degree. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 2774 euros. The last contact was made on the 6th day of June, with a duration of 1288 seconds. This was the third contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The communication type used for contact is unknown.###\nHence this label was No."
"The client is a 52-year-old self-employed married individual with secondary education. They do not have any credit in default and have a housing loan but no personal loan. They were last contacted in May on the 16th day via an unknown communication type, with a call duration of 65 seconds. This was the third contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1066 euros.###\nHence this label was No."
"The client is a 52-year-old single individual working in management with a tertiary education. They do not have any credit in default, do not have a housing loan but have a personal loan. The average yearly balance in euros is 4. The client was contacted via cellular communication on the 28th of July for 30 seconds. This is the 9th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working in management with secondary education. They do not have credit in default and have a yearly average balance of 5888 euros. They have a housing loan but no personal loan. The communication type for the last contact is unknown and it lasted for 45 seconds on the 26th of May. This was the 5th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old married individual working in a management position with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 18th of November and the call lasted for 1855 seconds. This was the first contact made during this campaign. There is no information on any previous marketing campaigns with this client.###\nHence this label was Yes."
"The client is a 55-year-old married entrepreneur with primary education and no credit in default. They have a personal loan but no housing loan. The average yearly balance is 38 euros. The contact communication type is unknown and the last contact was on the 19th of June for 63 seconds. This was the first time they were contacted for this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old divorced individual working in a management position with tertiary education. They do not have credit in default and have an average yearly balance of 697 euros. They have a housing loan but no personal loan. The communication with the client was done via cellular phone. The last contact was on the 30th of January and lasted 139 seconds. This was the first contact during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 1403. The client was contacted via an unknown communication type on the 9th of October for 14 seconds. This is the first contact made to the client during this campaign, and there is no information about any previous marketing campaign outcome or contact history.###\nHence this label was No."
"The client is a 26-year-old divorced technician with tertiary education. They do not have any credit in default but have housing and personal loans. They were last contacted via cellular communication on the 30th of January and the call lasted 350 seconds. This is the third contact made during this campaign, with 248 days passing since the previous campaign contact. There was one contact made with the client before this campaign, resulting in a failure outcome. The client's average yearly balance is 3154 euros.###\nHence this label was No."
"The client is a 32-year-old single individual working in a management position with a tertiary education. They do not have any credit in default and have an average yearly balance of 974 euros. They have a housing loan but no personal loan. The communication type for the campaign is unknown. The client was last contacted on the 3rd day of June and the call lasted for 228 seconds. This is the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 73-year-old retired individual who is married with a secondary education. They do not have credit in default, housing loan, or personal loan. The bank communicated with them via cellular phone and the last call lasted 300 seconds. This client was contacted once during this campaign, 40 days after the previous campaign where they were contacted 8 times. The outcome of the previous campaign was a failure. The client's average yearly balance is 2850 euros.###\nHence this label was Yes."
"The client is a 48-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 2960. The communication type during the marketing campaign was unknown, and the call duration was 86 seconds. This was the first time they were contacted during this campaign. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 34-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default and have a housing loan but no personal loan. The average yearly balance in euros is 68. The client was contacted 6 times during this campaign, with the last contact lasting 192 seconds at the end of May. They had not been previously contacted for any marketing campaigns. The outcome of the previous marketing campaign is unknown, and the communication type for this campaign is listed as unknown as well.###\nHence this label was No."
"The client is a 40-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default but have a housing loan. Their average yearly balance is negative. They do not have a personal loan. They were contacted via cellular communication and the last call lasted 275 seconds on the 6th day of May. This was the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 30-year-old married individual working in management with a secondary level of education. They do not have any credit in default and have a housing loan. Their average yearly balance is 1439 euros, and they do not have a personal loan. The bank contacted them via cellular communication on the 18th of November, with a call duration of 373 seconds. This is the first contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old married individual working in the services sector with secondary education. They do not have credit in default and have a housing loan. They were contacted via cellular communication and the last call duration was 154 seconds on the 22nd of June. This was the second time they were contacted during this campaign, with 124 days passing since they were last contacted from a previous campaign. The client does not have a personal loan and had an average yearly balance of 0 euros. The outcome of the previous marketing campaign was 'other'.###\nHence this label was No."
"The client is a 34-year-old self-employed individual who is married with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 4th of May for a duration of 203 seconds. This was the first contact made during this campaign, with 78 days passed since the client was last contacted from a previous campaign. Prior to this campaign, the client was contacted 8 times. The outcome of the previous marketing campaign was categorized as \"other\".###\nHence this label was No."
"The client is a 43-year-old single individual working in management with primary education. They have a credit default, a housing loan, but no personal loan. The average yearly balance is negative. The communication type used for contact is cellular. The last contact was on the 31st of July for only 9 seconds. This client has been contacted 23 times during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 53-year-old retired individual who is divorced. They have secondary education and do not have credit in default. Their average yearly balance is 84 euros and they do not have a housing loan or personal loan. The client was contacted via cellular communication on the 23rd of July, with a call duration of 336 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not contacted before.###\nHence this label was No."
"The client is a 52-year-old married individual working in the services sector with a secondary level of education. They do not have credit in default, housing loan, or personal loan. They were contacted via an unknown communication type on the 6th day of June. The call lasted 100 seconds. This is the first contact made to the client during this campaign. There is no information on any previous marketing campaigns. The client's average yearly balance is 1386 euros.###\nHence this label was No."
"The client is a 37-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default and have an average yearly balance of 1184 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 20th of November, with a call duration of 149 seconds. This is the second call made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old divorced individual working as an admin, with tertiary education and no credit in default. They have an average yearly balance of 1586 euros and do not have housing or personal loans. The last contact was made via cellular communication on the 20th of April, with a duration of 39 seconds. This is the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old divorced housemaid with secondary education. They do not have credit in default but have a housing loan. They were contacted via an unknown communication type on the 5th of June for 27 seconds. This was the 8th contact during this campaign, with no previous contacts. Their average yearly balance is in the negative, specifically at -18 euros, and they do not have a personal loan. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working as a blue-collar worker with a secondary level education. They do not have any credit in default and have an average yearly balance of 2700 euros. They have a housing loan but no personal loan. The last contact was made on the 20th of May through an unknown communication type, lasting 446 seconds. This is the second time they have been contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working in management with a tertiary level of education. They have credit in default and a personal loan. They do not have a housing loan. The average yearly balance in euros is 89. The contact communication type is unknown. The last contact was on the 8th of May and lasted 166 seconds. This was the 3rd time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 40-year-old unemployed single individual with secondary education was contacted for a marketing campaign. They do not have credit in default, have a housing loan but no personal loan. The communication type was unknown, and the contact lasted for 43 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 49-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 4140 euros. The client was last contacted via cellular communication on the 7th of July, with a call duration of 205 seconds. This is the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married technician with a tertiary education. They do not have credit in default, housing loan, or personal loan. The communication type used was cellular. The client was last contacted on the 29th of August and the call lasted for 150 seconds. This was the second contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 393 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with a secondary education. They do not have any credit in default and have a housing loan. Their average yearly balance is 1612 euros and they do not have a personal loan. The client was contacted via cellular communication, with the last call lasting 1164 seconds on the 2nd of April. This was the first contact made during this campaign. There is no information available on any previous marketing campaign outcomes or contacts with this client.###\nHence this label was Yes."
"The client is a 41-year-old married blue-collar worker with primary education. They do not have credit in default, have a housing loan, and do not have a personal loan. The average yearly balance is 1250 euros. The last contact was made on the 20th of May, lasting 1392 seconds. This was the second contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, and the communication type is also unknown.###\nHence this label was Yes."
"The client is a 41-year-old divorced individual working in a blue-collar job with secondary education. They do not have credit in default and have an average yearly balance of 174 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 14th of May, with a call duration of 367 seconds. This is the second time they have been contacted during this campaign, after 297 days from the previous contact. The outcome of the previous marketing campaign was categorized as 'other'.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with a tertiary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in their account is 326 euros. The bank contacted them via cellular communication on the 8th of August, and the call lasted for 236 seconds. This was the second time they were contacted during this campaign, with no prior contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 36-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, but they have a housing loan. Their average yearly balance is 3266 euros and they do not have a personal loan. The client was contacted via cellular communication on the 21st of November and the call duration was 94 seconds. This is the first time they have been contacted during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 30-year-old married individual working in the services sector with primary education. They do not have any credit in default and have an average yearly balance of 997 euros. They have a housing loan but do not have a personal loan. The bank contacted them via cellular communication, on the 28th day of July, with a call duration of 76 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 53-year-old divorced admin with secondary education. They do not have credit in default but have a housing loan. Their average yearly balance is negative. They do not have a personal loan. The last contact was made on the 15th of May for 599 seconds, and this was the second contact in the current campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The communication type used is unknown.###\nHence this label was No."
"The client is a 49-year-old married individual working as an admin, with secondary education and no credit in default. They have an average yearly balance of 1788 euros and have a housing loan. They have not taken a personal loan. The client was contacted via an unknown communication type on the 11th of June and the call lasted for 274 seconds. This is the second time they have been contacted during the current campaign. There is no information on previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 59-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via an unknown communication type on the 28th of May for 109 seconds. This was the first contact made during this campaign. There is no information about any previous contact or outcome from a previous marketing campaign.###\nHence this label was No."
"The client is a 59-year-old divorced individual working as a blue-collar worker with primary education. They do not have any credit in default, do not have a housing loan but have a personal loan. They were contacted via cellular communication on the 7th of July and the call lasted 849 seconds. This was the first time they were contacted during this marketing campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1265 euros.###\nHence this label was Yes."
"The client is a 30-year-old self-employed individual who is single and has a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. The bank made a phone call to their cellular phone on the 12th of July, with a call duration of 537 seconds. This was the first time they were contacted during this campaign. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 251 euros.###\nHence this label was Yes."
"The client is a 32-year-old blue-collar worker who is divorced and has secondary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via cell phone on the 16th of July, with a call duration of 226 seconds. This was the first contact during this campaign, and there was no previous contact history. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 8 euros.###\nHence this label was No."
"The client is a 34-year-old married individual working in an administrative role with secondary education. They do not have credit in default and have a housing loan. They have an average yearly balance of 626 euros and do not have a personal loan. The communication type for the marketing campaign was cellular, with the last contact made on the 14th of May. The call duration was 142 seconds, and this was the 2nd contact made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance in euros is 2689. The communication type for the marketing campaign was cellular, with the last contact being on the 15th of April for a duration of 135 seconds. This was the first contact during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 25-year-old married individual working in the services sector with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via telephone on the 21st of July and the call lasted 218 seconds. This was the second contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1078 euros.###\nHence this label was No."
"The client is a 36-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in euros is 0. The bank contacted them via an unknown communication type on the 6th of June, and the call lasted 149 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 42-year-old self-employed married individual with secondary education, no credit default, a housing loan, and no personal loan. They were contacted via cellular communication on the 23rd of April and had a 296-second long conversation. This was the second time they were contacted, with the previous contact happening 521 days ago, resulting in a failed outcome. Their average yearly balance is 1216 euros.###\nHence this label was Yes."
"The client is a 31-year-old single individual working in the services sector with secondary education. They do not have credit in default and have a housing loan but no personal loan. Their average yearly balance is negative at -32 euros. The client was contacted via an unknown communication type on the 23rd day of May. The call duration was 157 seconds, and it was the first contact made during this campaign. There is no information on any previous marketing campaign outcome or contact history with this client.###\nHence this label was No."
"The client is a 59-year-old retired individual who is divorced. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 2651 euros, they do not have a housing loan or personal loan. The communication with the client was done via telephone, and the last contact was on the 31st of July for 258 seconds. This was the second contact made during the current campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 26-year-old single student with secondary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication, and the last call lasted 76 seconds. This was the third time the client was contacted during this campaign, with the previous attempt resulting in success. The client's average yearly balance is 620 euros. The last contact was made on the 26th of August, and the client was previously contacted 96 days ago.###\nHence this label was No."
"The client is a 26-year-old single individual working in a blue-collar job with primary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is negative at 35 euros. The communication with the client was done via cellular phone in July, and the last call lasted for 243 seconds. This was the first contact made during this campaign, and there is no record of previous campaign contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 26-year-old single individual working as a blue-collar worker with primary education. They do not have credit in default and have an average yearly balance of 17 euros. They have a housing loan but no personal loan. The client was last contacted via cellular communication on the 15th of May, with a call duration of 86 seconds. This is the second contact during this campaign, following up after 367 days from the previous contact. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 46-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, housing loans, or personal loans. The bank communicated with them via a cellular phone call on the 20th of August, with the call lasting 381 seconds. This is the third contact made to the client during this campaign. Previous contact history is unknown. The client's average yearly balance is 123 euros.###\nHence this label was No."
"The client is a 27-year-old student who is single and has a secondary level of education. They do not have any credit in default and have an average yearly balance of 217 euros. They have a housing loan but do not have a personal loan. The client was contacted via an unknown communication type on the 8th day of May. The call duration was 319 seconds, and this was the first contact made during the current campaign. There was no previous contact with the client for a previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in management with tertiary education. They do not have any credit in default and do not have any housing or personal loans. The average yearly balance is 224 euros. The bank contacted the client via cellular communication on the 25th of August, with a call duration of 108 seconds. This is the 5th contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 51-year-old entrepreneur who is divorced. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 1 euro, they have housing and personal loans. The communication with the client was done via cellular phone, with the last contact being on the 31st of July. The call duration was 300 seconds, and this was the first contact made during this campaign. There is no information on previous contacts with the client or the outcome of any previous marketing campaigns.###\nHence this label was No."
"The client is a 35-year-old single individual working in a management position with a tertiary education. They do not have any credit in default, but they have a housing loan. The client does not have a personal loan. They were contacted via cellular communication, with the last call lasting 460 seconds on the 14th day of May. This was the second call made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 916 euros.###\nHence this label was Yes."
"The client is a 31-year-old married blue-collar worker with primary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 20th of November for 21 seconds. This was their first contact during this campaign, and they were not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 347 euros.###\nHence this label was No."
"The client is a 56-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 5th of February and the call lasted for 151 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign with this client is unknown. The client's average yearly balance is 121 euros.###\nHence this label was No."
"The client is a 46-year-old individual working in the services sector, who is divorced and has a secondary level of education. They do not have any credit in default and have an average yearly balance of 864 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication, with the last call lasting 225 seconds on the 17th of April. This was the 3rd call made during this campaign, with 150 days passed since the client was last contacted from a previous campaign, where 7 contacts were made. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 27-year-old single entrepreneur with tertiary education. They do not have credit in default but have housing and personal loans. The average yearly balance is 512 euros. The contact was made through an unknown communication type, with the call lasting 220 seconds on the 3rd day of June. This is the first time they have been contacted during this campaign. The outcome of any previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 50-year-old divorced technician with a secondary education. They do not have credit in default and have a housing loan. They were contacted via cellular communication on the 6th of May for 127 seconds. This was the 2nd contact made during this campaign and the 23rd overall. The client was last contacted 254 days ago. The outcome of the previous marketing campaign was categorized as \"other\". The client does not have a personal loan and has an average yearly balance of 636 euros.###\nHence this label was No."
"The client is a 44-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. The client was contacted via an unknown communication type on the 28th of May and the call lasted for 61 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous campaign is unknown. The client's average yearly balance is 1196 euros.###\nHence this label was No."
"The client is a 44-year-old divorced individual working in management with tertiary education. They have credit in default, a negative average yearly balance, and do not have housing or personal loans. The bank contacted them via cellular communication on the 22nd of August for 92 seconds, as part of the fourth contact during this campaign. The client has not been contacted in previous campaigns and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 24-year-old student who is single and has a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via a cellular phone call on the 9th of November, and the call lasted for 118 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaigns with this client is unknown. The client's average yearly balance is 235 euros.###\nHence this label was Yes."
"The client is a 31-year-old single individual working in the services sector with a tertiary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 1025 euros. The last contact was made on the 20th of May, with a duration of 72 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, as well as the communication type used for contact.###\nHence this label was No."
"The client is a 51-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default, housing loan, but have a personal loan. The average yearly balance is 48 euros. The contact was made using an unknown communication type on the 17th of June, and the call lasted for 130 seconds. This is the first contact made to the client during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old individual working in the services sector, who is divorced. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 1400 euros and no housing or personal loans, they were contacted via cellular communication. The last contact was made on the 28th of January, lasting for 191 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 26-year-old single individual working in management with a tertiary education was contacted via cellular communication for a direct marketing campaign. They have no credit in default, housing loan, or personal loan. With an average yearly balance of 383 euros, they were last contacted on the 6th of February for 645 seconds. This was the second time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old married technician with secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 21st day of August for 68 seconds. This was their first contact during this campaign, and there was no previous record of being contacted. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 7621 euros.###\nHence this label was No."
"A 33-year-old married individual working in management with a tertiary education was contacted for a marketing campaign. They do not have any credit in default, but have a housing loan. Their average yearly balance is 1808 euros and they do not have a personal loan. The contact communication type is unknown, and the last contact was made on the 4th of June, with a duration of 99 seconds. This was the 4th contact made to this client during this campaign. The outcome of any previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working in administration with a secondary education. They do not have any credit in default and have an average yearly balance of 125 euros. They have a housing loan but no personal loan. The communication type used for contact is cellular. The last contact was made on the 16th of August and lasted 140 seconds. This is the 3rd contact made during this campaign, with 1 previous contact made. The client was last contacted 116 days ago from a previous campaign, with the outcome being described as 'other'.###\nHence this label was No."
"The client is a 28-year-old student who is single. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 330 euros, they do not have a housing or personal loan. The communication type used for contacting the client was via telephone. The last contact was made on the 2nd day of February, with a duration of 197 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not contacted before.###\nHence this label was No."
"The client is a 36-year-old single technician with tertiary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 12th of August for a duration of 338 seconds. This was the second time they were contacted during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1072 euros.###\nHence this label was No."
"The client is a 38-year-old retired married individual with unknown education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication, reaching out on the 11th of May. The call lasted 94 seconds. This was the 6th time the bank had contacted the client, with the previous contact being 350 days ago, resulting in no subscription to a term deposit.###\nHence this label was No."
"The client is a 48-year-old married individual working in the services sector with a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 328. The client was contacted via an unknown communication type on the 6th of June and the call duration was 189 seconds. This was the first contact made during this campaign. There is no record of previous contact or outcome from a previous marketing campaign.###\nHence this label was No."
"The client is a 37-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default and have a housing loan. They were contacted via cellular communication and the last call duration was 80 seconds. This is the 4th contact made during this campaign, with 1 previous contact before. The last contact was 358 days ago. The outcome of the previous campaign was categorized as 'other'. The client does not have a personal loan and holds an average yearly balance of 120 euros.###\nHence this label was No."
"The client is a 29-year-old student who is single and has a secondary education. They do not have credit in default and have an average yearly balance of 200 euros. The client has a housing loan but no personal loan. They were contacted via an unknown communication type on the 4th of June, with the call lasting 87 seconds. This was the second contact made to the client during this campaign. There were no previous contacts with this client from earlier campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old single technician with unknown education. They do not have credit in default and have an average yearly balance of 317 euros. They have a housing loan but no personal loan. The communication type used for contact is unknown. The client was last contacted on the 21st of May and the call lasted 394 seconds. This is the second time they have been contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default and have an average yearly balance of 1415 euros. They have a housing loan but do not have a personal loan. The communication type used for contacting the client is unknown. The last contact was made on the 7th of May and lasted for 485 seconds. This is the first contact made to this client during this campaign. The outcome of the previous marketing campaign to this client is unknown.###\nHence this label was No."
"A 26-year-old single individual working in management with a tertiary education was contacted via cellular communication. They have no credit in default, housing loan, or personal loan. Their average yearly balance is 2725 euros. The last contact was on the 28th of January, lasting 267 seconds. This was the first contact during this campaign, with unknown outcome from any previous campaigns.###\nHence this label was No."
"The client is a 48-year-old single individual working in management with a tertiary education. They do not have a credit in default, do not have a housing loan but have a personal loan. The average yearly balance is negative (-295 euros). The last contact was made via cellular communication, on the 28th of January, lasting 121 seconds. This is the third time they have been contacted during this campaign, with the previous outcome being a failure. A previous campaign contact occurred 190 days ago.###\nHence this label was No."
"The client is a 50-year-old individual with an unknown job and education status, who is married. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance is 200 euros. The communication type used for contacting the client is unknown. The last contact was made on the 18th day of June, and it lasted for 18 seconds. This was the 6th contact made during this campaign. The client was not previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 31-year-old single technician with tertiary education. They do not have any credit in default nor any existing housing or personal loans. They were contacted via cellular communication on the 21st of August for a duration of 794 seconds. This was the first contact made during this campaign. There is no information on any previous marketing campaign outcome. The client has an average yearly balance of 50 euros.###\nHence this label was No."
"The client is a 60-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default but have a housing loan. Their average yearly balance is 6271 euros and they do not have a personal loan. The bank contacted them via cellular communication and the last call lasted 210 seconds. This is the second time they have been contacted during this campaign, with 2 contacts in total. It has been 254 days since they were last contacted from a previous campaign, where they had 5 previous contacts and the outcome was a failure.###\nHence this label was No."
"The client is a 33-year-old single technician with tertiary education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 28th of August for a short call lasting 13 seconds. This client has been contacted 30 times during this campaign and had not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old single individual working in the services sector with a secondary level of education. They do not have any credit in default, but have a housing loan. The client does not have a personal loan. The bank contacted them via cellular communication on the 15th of May and the call lasted for 256 seconds. This was the first contact made during this campaign, but they were contacted 3 times in previous campaigns. The outcome of the previous marketing campaign was successful, despite the client having a negative average yearly balance of -198 euros. The client was last contacted 359 days ago.###\nHence this label was No."
"The client is a 44-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default, have a housing loan, but do not have a personal loan. The bank communicated with them via a cellular phone call on the 17th of November, with a call duration of 158 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 508 euros.###\nHence this label was No."
"The client is a 34-year-old married individual working in management with a tertiary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 13th of August, and the call lasted 168 seconds. This was the second time they were contacted during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1293 euros.###\nHence this label was No."
"The client is a 58-year-old retired individual who is married with an unknown level of education. They do not have credit in default and do not have a housing loan, but they do have a personal loan. The average yearly balance is negative at -230 euros. The communication type used for contact was cellular. The client was last contacted on the 8th of July and the call duration was 133 seconds. This was the second contact made during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married technician with a secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is 11016 euros. The communication type during the campaign was unknown. The last contact was on the 9th of June and lasted for 252 seconds. This was the third contact made during this campaign. The client had not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication on the 15th of May, with the call lasting 463 seconds. This was the client's first contact during this campaign, but they were contacted 4 times in previous campaigns. The outcome of the previous marketing campaign was a failure, and it had been 175 days since the client was last contacted. The client's average yearly balance is 2198 euros.###\nHence this label was No."
"The client is a 53-year-old married individual working in management, with unknown education level. They do not have any credit in default and have a housing loan. They were contacted via cellular communication and had a previous contact duration of 71 seconds. This is the third time they have been contacted during this campaign. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 527 euros and they do not have a personal loan.###\nHence this label was No."
"The client is a 56-year-old married individual working in administration with a secondary level education. They do not have any credit in default and have a housing loan. The client does not have a personal loan and was contacted through their cellular phone. The last contact was on the 19th of August, with a duration of 97 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 33 euros.###\nHence this label was No."
"The client is a 53-year-old divorced individual working in the administrative field with secondary education. They do not have any credit in default, but they do have a housing loan. They were contacted via cellular communication on the 29th of January and had a call duration of 373 seconds. This was the first contact during this campaign, and there were no previous contact days. The outcome of the previous marketing campaign is unknown. The client does not have a personal loan and has an average yearly balance of 2687 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in August, and the last call lasted 121 seconds. This was the second call made to the client during this campaign, and they have not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 17 euros.###\nHence this label was No."
