"A 27-year-old individual who has been pregnant twice with low diastolic blood pressure, no triceps skin fold thickness, average plasma glucose concentration, no insulin after a glucose tolerance test, healthy body mass index, and a moderate family history of diabetes.###\nHence this label was No."
"A 26-year-old woman who has been pregnant twice shows normal diastolic blood pressure and slightly above average triceps skin fold thickness. Her blood glucose level after a 2-hour oral glucose tolerance test is normal, but her insulin level is slightly elevated. She has a high body mass index and a low diabetes pedigree score, indicating a moderate risk of developing diabetes.###\nHence this label was No."
"A 23-year-old individual who has never been pregnant has a diastolic blood pressure of 90 and a triceps skin fold thickness of 27. Their plasma glucose concentration after a glucose tolerance test is 179, with a 2-hour serum insulin level of 0. They have a high body mass index of 44.1 and a diabetes pedigree function of 0.686.###\nHence this label was Yes."
"This individual is 62 years old and has been pregnant once. They have low diastolic blood pressure, no triceps skin fold thickness, and normal plasma glucose concentration after a glucose tolerance test. Their insulin level after 2 hours is zero. Despite having a slightly elevated body mass index, their diabetes pedigree function is relatively low.###\nHence this label was No."
"A 21-year-old individual who has never been pregnant and has extremely low diastolic blood pressure, no triceps skin fold thickness, and very low serum insulin levels. Their plasma glucose concentration after a glucose tolerance test is normal, and their body mass index indicates a healthy weight. The diabetes pedigree function value suggests a low genetic risk for diabetes.###\nHence this label was No."
"This patient is a 33-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 17. Her plasma glucose concentration after a glucose tolerance test is 167 mg/dL, and her 2-hour serum insulin level is 144 µU/mL. She has a body mass index of 23.4 and a diabetes pedigree function value of 0.447.###\nHence this label was Yes."
"The individual is a 64-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 78 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120. She has no insulin in her serum, and her body mass index is 25.0, indicating she is at a healthy weight. Her diabetes pedigree function is 0.409, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 40-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 78, triceps skin fold thickness of 27, plasma glucose concentration of 126 after a glucose tolerance test, 2-hour serum insulin level of 22, body mass index of 29.6, and a diabetes pedigree function of 0.439.###\nHence this label was No."
"The patient is a 25-year-old who has been pregnant once. Their diastolic blood pressure is normal at 72. They have a moderate triceps skin fold thickness of 30mm. The plasma glucose concentration after a GTT is within the normal range at 112. The 2-hour serum insulin level is elevated at 176. The patient has a high body mass index of 34.4, indicating obesity. Their diabetes pedigree function score is relatively low at 0.528.###\nHence this label was No."
"The patient is a 66-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 92 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 190. Additionally, their 2-hour serum insulin level is 0, and they have a body mass index of 35.5. The diabetes pedigree function for this individual is 0.278.###\nHence this label was Yes."
"A 21-year-old woman who is 1 time pregnant has a diastolic blood pressure of 72 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 99, with a 2-hour serum insulin level of 18. She has a body mass index of 38.6 and a diabetes pedigree function of 0.412.###\nHence this label was No."
"This 29-year-old individual has a low chance of developing diabetes, as indicated by their low diastolic blood pressure, minimal triceps skin fold thickness, and normal plasma glucose concentration. Their body mass index is within a healthy range, and their diabetes pedigree function score is relatively low.###\nHence this label was No."
"The patient is a 27-year-old female who has been pregnant two times. She has a healthy diastolic blood pressure of 70 and a normal triceps skin fold thickness of 16. Her plasma glucose concentration after a glucose tolerance test is within the normal range at 99. The 2-hour serum insulin level is 44, indicating proper insulin production. She has a low body mass index of 20.4 and a relatively low diabetes pedigree function score of 0.235, suggesting a lower risk of developing diabetes.###\nHence this label was No."
"The 35-year-old patient has been pregnant 11 times and has a diastolic blood pressure of 76. Their triceps skin fold thickness and 2-hour serum insulin levels are both 0. However, their plasma glucose concentration after a glucose tolerance test is 138. The patient has a body mass index of 33.2 and a low diabetes pedigree function score of 0.42.###\nHence this label was No."
"The patient is a 65-year-old female who has never been pregnant. She has very low diastolic blood pressure of 50, no triceps skin fold thickness, and a normal body mass index of 21.9. Her plasma glucose concentration after a glucose tolerance test is 161, and she has no insulin present in her blood. Her diabetes pedigree function score is low at 0.254.###\nHence this label was No."
"A 23-year-old woman who has never been pregnant underwent a diagnostic test showing she has normal diastolic blood pressure, moderately high triceps skin fold thickness, and low plasma glucose concentration after a glucose tolerance test. Despite having high insulin levels, she has a high body mass index and a low risk of developing diabetes based on her family history.###\nHence this label was No."
"The patient is a young adult female, 21 years old, who is pregnant for the first time. She has a low diastolic blood pressure of 58 and a relatively low triceps skin fold thickness of 10. Her plasma glucose concentration after a glucose tolerance test is within the normal range at 99, and she has low levels of insulin at 0. Her body mass index is healthy at 25.4, and her diabetes pedigree function is moderate at 0.551. Overall, she appears to have a low risk of developing diabetes based on these measurements.###\nHence this label was No."
"This 23-year-old patient has been pregnant 3 times and has a diastolic blood pressure of 68. Their triceps skin fold thickness is 28, plasma glucose concentration at 74, and 2-hour serum insulin level at 45. With a body mass index of 29.7 and a low diabetes pedigree function score of 0.293, this individual shows some indicators related to diabetes risk.###\nHence this label was No."
"This is a data entry for a 21-year-old individual who has never been pregnant. They have normal diastolic blood pressure of 68 and a healthy body mass index of 24.7. Their plasma glucose concentration after a 2-hour glucose tolerance test is 125, indicating normal blood sugar levels. The individual has no triceps skin fold thickness and no serum insulin at the 2-hour mark. Their diabetes pedigree function score is low at 0.206, suggesting a lower risk of developing diabetes.###\nHence this label was No."
"The patient is a 58-year-old woman who has been pregnant 9 times. She has a normal diastolic blood pressure of 68 and a low triceps skin fold thickness of 0. Her plasma glucose concentration is at a healthy level of 91, and she has no insulin present in her bloodstream. With a body mass index of 24.2, she is in the normal weight range. Her diabetes pedigree function is low at 0.2, indicating a lower risk of developing diabetes.###\nHence this label was No."
"A 41-year-old woman, who has been pregnant 6 times, with normal diastolic blood pressure and low triceps skin fold thickness. Her glucose tolerance test showed a low plasma glucose concentration after 2 hours, accompanied by very low insulin levels. She has a healthy body mass index and a relatively low diabetes pedigree function score.###\nHence this label was No."
"This individual is a 47-year-old woman who has been pregnant 5 times. She has a normal diastolic blood pressure of 78, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration of 143 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin levels are at 0, indicating potential insulin resistance. She has a high body mass index of 45.0 and a low diabetes pedigree function score of 0.19, suggesting a lower genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 29-year-old woman who has never been pregnant. She has slightly elevated diastolic blood pressure and a moderate amount of triceps skin fold thickness. Her glucose levels after a 2-hour GTT are within normal range. She has no insulin present in her blood at the 2-hour mark. Her body mass index is in the obese range. The diabetes pedigree function score is low, indicating a lower risk of developing diabetes.###\nHence this label was No."
"This is a 39-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 74, a triceps skin fold thickness of 38, and a plasma glucose concentration of 126 after a glucose tolerance test. Their 2-hour serum insulin level is 75, and they have a body mass index of 25.9. The diabetes pedigree function for this individual is 0.162.###\nHence this label was No."
"This individual is 33 years old and has been pregnant 9 times. Their diastolic blood pressure is relatively low at 56, and they have no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 122 mg/dL, and their 2-hour serum insulin level is 0. They have a body mass index of 33.3 and a relatively high diabetes pedigree function score of 1.114. Overall, based on these measurements, this person may be at risk for developing diabetes.###\nHence this label was Yes."
"A 30-year-old individual, who has been pregnant 3 times, with a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 37 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 170 mg/dL, and their 2-hour serum insulin level is 225 μU/mL. They have a body mass index of 34.5 and a diabetes pedigree function score of 0.356.###\nHence this label was Yes."
"This individual is a 26-year-old female who is pregnant for the first time. She has a very low diastolic blood pressure of 62 and a triceps skin fold thickness of 0, indicating very little body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 71. Additionally, her 2-hour serum insulin level is 0, suggesting low insulin production. Despite her low body mass index of 21.8, her diabetes pedigree function is 0.416, which may indicate a genetic predisposition to diabetes.###\nHence this label was No."
"This individual is a 32-year-old woman who has been pregnant 8 times. She has a low diastolic blood pressure of 64 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 183, but she has low 2-hour serum insulin levels at 0. Despite a normal body mass index of 23.3, she has a relatively high diabetes pedigree function score of 0.672, indicating a potential genetic predisposition to diabetes.###\nHence this label was Yes."
"This patient is a young woman in her thirties, with only one pregnancy. She has a healthy diastolic blood pressure of 64 and a slightly above average triceps skin fold thickness of 32. Her glucose levels are normal at 122 after a GTT, but her insulin levels are slightly high at 156. She has a BMI indicating obesity at 35.1 and a moderate genetic predisposition to diabetes with a pedigree score of 0.692.###\nHence this label was Yes."
"The patient is a 24-year-old female who has never been pregnant. She has normal diastolic blood pressure, zero triceps skin fold thickness, and zero insulin levels. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 119 mg/dL. She has a slightly elevated body mass index of 32.4 and a low diabetes pedigree function score of 0.141.###\nHence this label was Yes."
"This individual is a 42-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 78, a triceps skin fold thickness of 40, and a plasma glucose concentration of 81 after a GTT. Her 2-hour serum insulin level is 48, and her body mass index is 46.7. She has a diabetes pedigree function of 0.261. Overall, these measurements indicate a risk factor for developing diabetes.###\nHence this label was No."
"A 43-year-old individual, with 13 pregnancies, has a diastolic blood pressure of 90. They have a triceps skin fold thickness of 33, plasma glucose concentration of 152, and 2-hour serum insulin of 29. Their body mass index is 26.8 and diabetes pedigree function is 0.731.###\nHence this label was Yes."
"The patient in this case study is a 60-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 68 and a triceps skin fold thickness of 36. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 181. The 2-hour serum insulin level is 495. Overall, their body mass index is 30.1 and their diabetes pedigree function is 0.615.###\nHence this label was Yes."
"A 21-year-old woman who is pregnant for the first time has a normal diastolic blood pressure of 60. She has a slightly below average triceps skin fold thickness of 8 and a healthy plasma glucose concentration of 109 after a 2-hour oral glucose tolerance test. Despite her high 2-hour serum insulin level of 182, her body mass index is within the normal range at 25.4. Additionally, she has a low diabetes pedigree function score of 0.947, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"This 39-year-old individual has been pregnant 7 times and has a diastolic blood pressure of 90. They have a triceps skin fold thickness of 41, a plasma glucose concentration of 137, and no insulin after a 2-hour glucose tolerance test. With a body mass index of 32.0 and a diabetes pedigree function of 0.391, this person's risk of developing diabetes may be worth monitoring.###\nHence this label was No."
"This patient, a 54-year-old female, has been pregnant twice. She has a diastolic blood pressure of 92, no triceps skin fold thickness, and a plasma glucose concentration of 109 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 42.7. The diabetes pedigree function is 0.845.###\nHence this label was No."
"The patient is 24 years old and has been pregnant 3 times. They have a low diastolic blood pressure of 58 and no triceps skin fold thickness. Their plasma glucose concentration after a GTT is 125, with a 2-hour serum insulin level of 0. Despite a slightly high body mass index of 31.6, the patient has a low diabetes pedigree function of 0.151, indicating a relatively low risk of developing diabetes.###\nHence this label was No."
"The patient is a 21-year-old female who has been pregnant 3 times. She has a low diastolic blood pressure of 78 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 90, and her 2-hour serum insulin level is 0. Despite this, she has a high body mass index of 42.7 and a moderate diabetes pedigree function of 0.559.###\nHence this label was No."
"The patient is a 48-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 74, triceps skin fold thickness of 40, plasma glucose concentration at 88, 2-hour serum insulin level of 54, and a body mass index of 35.3. Her diabetes pedigree function is 0.378.###\nHence this label was No."
"This is a record of a 22-year-old woman who has never been pregnant. She has a low diastolic blood pressure of 65 and a slightly above-average body mass index of 24.6. Her triceps skin fold thickness is 28, and she has normal plasma glucose concentration at 101. Her 2-hour serum insulin level is at 0, indicating low insulin production. The diabetes pedigree function score is low at 0.237. Overall, this individual appears to have a relatively low risk of developing diabetes based on these measurements.###\nHence this label was No."
"The data belongs to a 21-year-old individual who is pregnant for the first time. She has a healthy diastolic blood pressure of 66 and a moderate triceps skin fold thickness of 23. Her plasma glucose concentration after a glucose tolerance test is 89, and her 2-hour serum insulin level is 94. With a body mass index of 28.1 and a low diabetes pedigree function score of 0.167, this individual shows some signs of a healthy pregnancy with a low risk of developing diabetes.###\nHence this label was No."
"This data belongs to a 25-year-old individual who has been pregnant twice. They have a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 24. Their plasma glucose concentration after a glucose tolerance test is 127, and their 2-hour serum insulin level is high at 275. They have a healthy body mass index of 27.7 and a slightly elevated diabetes pedigree function score of 1.6.###\nHence this label was No."
"A 22-year-old female who has been pregnant twice shows signs of high risk for developing diabetes, with low diastolic blood pressure but high triceps skin fold thickness, plasma glucose concentration, serum insulin levels, and body mass index. Her genetic predisposition to diabetes, as indicated by the diabetes pedigree function, is relatively low.###\nHence this label was No."
"This data belongs to a 26-year-old individual who is pregnant for the first time. They have a very low diastolic blood pressure of 38, a moderately low triceps skin fold thickness of 18, and a normal plasma glucose concentration of 109 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is high at 120, and their body mass index is in the normal range at 23.1. The individual has a relatively low diabetes pedigree function score of 0.407.###\nHence this label was No."
"The patient is a 23-year-old female who is pregnant for the first time. She has low diastolic blood pressure, normal triceps skin fold thickness, and slightly low plasma glucose concentration after a 2-hour oral glucose tolerance test. The patient has a moderate level of serum insulin, a healthy body mass index, and a low diabetes pedigree function score. Overall, the patient seems to be at a relatively low risk of developing diabetes.###\nHence this label was No."
"This patient is a young adult, 22 years old, who is pregnant for the first time. They have low diastolic blood pressure (48 mmHg) and a healthy body mass index of 24.7. However, their triceps skin fold thickness is 20mm, which could indicate excess fat storage. The patient has normal plasma glucose concentration and insulin levels after a 2-hour oral glucose tolerance test. Their diabetes pedigree function is low at 0.14, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"This 24-year-old individual has been pregnant 4 times and shows normal diastolic blood pressure. They have a moderately low triceps skin fold thickness and a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is slightly elevated. They have a slightly high body mass index and a low diabetes pedigree function score.###\nHence this label was No."
"This is a 22-year-old individual who has been pregnant 4 times and shows normal diastolic blood pressure. Their triceps skin fold thickness is within a healthy range. The plasma glucose concentration after a glucose tolerance test is below the standard threshold. They have no detectable insulin levels after a 2-hour period. The individual has a moderate body mass index and a low diabetes pedigree function score.###\nHence this label was No."
"This patient is a young, non-pregnant individual with normal blood pressure and slightly high body mass index. They have a moderate amount of triceps skin fold thickness, indicating some level of body fat. Their glucose levels are within normal range after a glucose tolerance test, but they have elevated insulin levels. Overall, this individual may have a moderate risk for developing diabetes due to their high insulin levels and BMI.###\nHence this label was No."
"The data belongs to a 24-year-old individual who has been pregnant 3 times. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 13. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 158, and her 2-hour serum insulin level is 387. She has a body mass index of 31.2 and a diabetes pedigree function of 0.295.###\nHence this label was No."
"A 23-year-old woman who has been pregnant 4 times shows normal diastolic blood pressure. She has a slightly below-average triceps skin fold thickness and a normal plasma glucose concentration. Her 2-hour serum insulin levels are relatively high. She has a high body mass index and a low diabetes pedigree function score.###\nHence this label was No."
"A 22-year-old individual who has never been pregnant shows normal levels of diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin. Their plasma glucose concentration after a GTT is 99, indicating a healthy blood sugar level. With a body mass index of 25.0 and a low diabetes pedigree function of 0.253, this individual exhibits a low risk of developing diabetes based on the diagnostic measurements provided.###\nHence this label was No."
"A 63-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 70. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 158 following a glucose tolerance test, and 2-hour serum insulin level of 0. Their body mass index is 29.8 and their diabetes pedigree function is 0.207.###\nHence this label was No."
"This data belongs to a 57-year-old individual who has been pregnant 13 times. Their diastolic blood pressure is 82, and triceps skin fold thickness is 19. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 145, and their 2-hour serum insulin level is 110. They have a body mass index of 22.2 and a diabetes pedigree function value of 0.245.###\nHence this label was No."
"The patient is a 46-year-old female who has been pregnant 12 times. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 31mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 84 mg/dL. She has no detectable insulin in her serum. Her body mass index is 29.7 and her diabetes pedigree function is 0.297.###\nHence this label was Yes."
"A 29-year-old woman, who has been pregnant 4 times, with a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 0mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122 mg/dL and she has a 2-hour serum insulin level of 0 μU/mL. Her body mass index is 35.0 and her diabetes pedigree function is 0.394. These measurements provide insight into her current health status and risk of developing diabetes.###\nHence this label was No."
"The patient is a 29-year-old female who has been pregnant twice. She has a diastolic blood pressure of 76, triceps skin fold thickness of 35, plasma glucose concentration of 146, 2-hour serum insulin level of 194, and a body mass index of 38.2. Her diabetes pedigree function is 0.329. Based on these measurements, the patient may have a risk of developing diabetes.###\nHence this label was No."
"This patient is a 42-year-old female who has been pregnant 8 times. She has a healthy diastolic blood pressure of 72 and a slightly below average triceps skin fold thickness of 23. Her plasma glucose concentration after a glucose tolerance test is low at 65, and her 2-hour serum insulin level is also low at 0. She has a body mass index of 32.0, indicating she is overweight. Her diabetes pedigree function score is low at 0.6, suggesting a slightly lower risk of developing diabetes.###\nHence this label was No."
"A 22-year-old woman who is pregnant for the first time with low diastolic blood pressure, moderate triceps skin fold thickness, slightly elevated plasma glucose concentration, normal serum insulin level, and a healthy body mass index. The diabetes pedigree function indicates a low hereditary risk of diabetes.###\nHence this label was No."
"The data describes a 28-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 66, a triceps skin fold thickness of 39, a plasma glucose concentration of 115 after a glucose tolerance test, and a 2-hour serum insulin level of 140. Their body mass index is 38.1, and their diabetes pedigree function is 0.15.###\nHence this label was No."
"A 29-year-old woman who has been pregnant 9 times shows normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness is slightly above average. However, her 2-hour serum insulin levels are at zero, and her plasma glucose concentration after a glucose tolerance test is slightly below normal. Despite a low diabetes pedigree function score, these measurements may suggest a potential risk for developing diabetes in the future.###\nHence this label was Yes."
"This 28-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 74. Their triceps skin fold thickness is 40, plasma glucose concentration after a GTT is 123, and 2-hour serum insulin level is 77. With a body mass index of 34.1 and a diabetes pedigree function of 0.269, this person's risk for developing diabetes may be of interest.###\nHence this label was No."
"This individual is a 24-year-old who has been pregnant twice. They have a healthy diastolic blood pressure of 62 and a relatively low triceps skin fold thickness of 28. Their plasma glucose concentration after a glucose tolerance test is 92, and their 2-hour serum insulin level is 0. Despite having a body mass index of 31.6, which is considered overweight, their diabetes pedigree function is low at 0.13, indicating a lower risk of developing diabetes.###\nHence this label was No."
"A 45-year-old individual who has been pregnant 9 times with a diastolic blood pressure of 78. This person has a triceps skin fold thickness of 0 and a plasma glucose concentration of 164 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, with a body mass index of 32.8 and a diabetes pedigree function of 0.148.###\nHence this label was Yes."
"This data belongs to a 23-year-old individual who is pregnant for the first time. She has a normal diastolic blood pressure, a slightly below-average triceps skin fold thickness, and a healthy plasma glucose concentration following an oral glucose tolerance test. She has no insulin in her bloodstream, indicating good insulin sensitivity. With a body mass index of 30.1, she is considered obese. Her diabetes pedigree function value is low, suggesting a lower genetic risk of developing diabetes.###\nHence this label was No."
"The patient, aged 42, has been pregnant 9 times. She has a very low diastolic blood pressure of 52 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106. There is no level of serum insulin recorded. Her body mass index is 31.2, indicating she is overweight. The diabetes pedigree function value is 0.38, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 27-year-old female who has never been pregnant. She has normal diastolic blood pressure, very low triceps skin fold thickness, and low 2-hour serum insulin. Despite having a below-average body mass index, the patient's plasma glucose concentration is within normal range. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was No."
"A 48-year-old individual, who has been pregnant 5 times, with a diastolic blood pressure of 74. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 104 after a 2-hour oral glucose tolerance test, and 2-hour serum insulin level of 0. Their body mass index is 28.8, and they have a diabetes pedigree function value of 0.153.###\nHence this label was No."
"A 21-year-old individual who has never been pregnant shows normal diastolic blood pressure, but slightly lower triceps skin fold thickness and higher plasma glucose concentration than average. Their 2-hour serum insulin levels are significantly elevated, indicating possible insulin resistance. Despite a slightly elevated body mass index, their risk of developing diabetes is moderate based on the diabetes pedigree function.###\nHence this label was No."
"A 36-year-old woman who has never been pregnant has a diastolic blood pressure of 70. Her triceps skin fold thickness is 20, and her plasma glucose concentration after a glucose tolerance test is 124. She has no insulin after 2 hours, and her body mass index is 27.4. Her diabetes pedigree function is 0.254.###\nHence this label was Yes."
"This patient is a 26-year-old female who is pregnant for the first time. She has very low diastolic blood pressure, high triceps skin fold thickness, and normal plasma glucose concentration after a glucose tolerance test. Her insulin levels are elevated, and she has a high body mass index. The calculated diabetes pedigree function is moderate.###\nHence this label was Yes."
"This patient is a 22-year-old female who has been pregnant twice. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 19 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 88 mg/dL. The 2-hour serum insulin level is 53 μU/mL. She has a body mass index of 29.0 kg/m² and a diabetes pedigree function of 0.229. These measurements provide insight into her risk for developing diabetes.###\nHence this label was No."
"This data belongs to a 22-year-old female who is pregnant for the first time. Her diastolic blood pressure is low at 56, and she has a relatively low triceps skin fold thickness of 11. Her glucose levels are normal at 93 after a 2-hour GTT, and she has no insulin in her serum. Despite her low body mass index of 22.5, her diabetes pedigree function is 0.417, indicating a potential risk for developing diabetes.###\nHence this label was No."
"This individual is a 69-year-old who has been pregnant 5 times. They have a diastolic blood pressure of 80 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 132, with a 2-hour serum insulin level of 0. Their body mass index is 26.8 and they have a low diabetes pedigree function score of 0.186.###\nHence this label was No."
"A 30-year-old individual who has been pregnant 5 times and has a healthy diastolic blood pressure of 72. They have a triceps skin fold thickness of 23, indicating moderate fat levels. Their plasma glucose concentration after a GTT is 121 and they have a 2-hour serum insulin level of 112, suggesting good blood sugar control. With a body mass index of 26.2, they are classified as overweight. The diabetes pedigree function value of 0.245 indicates a low genetic risk for diabetes.###\nHence this label was No."
"A 38-year-old individual who has been pregnant 10 times shows normal diastolic blood pressure and low insulin levels. Despite a slightly elevated body mass index, the individual has a healthy plasma glucose concentration and triceps skin fold thickness. The diabetes pedigree function suggests a moderate genetic predisposition to the condition.###\nHence this label was Yes."
"This is a data record of a 33-year-old individual who has never been pregnant. She has a low diastolic blood pressure of 66 mmHg and a moderate triceps skin fold thickness of 30 mm. Her plasma glucose concentration after a glucose tolerance test is normal at 121 mg/dL, but her 2-hour serum insulin level is high at 165 mU/mL. She has a slightly elevated body mass index of 34.3 and a low diabetes pedigree function score of 0.203.###\nHence this label was Yes."
"A 24-year-old individual with a low number of pregnancies has a normal diastolic blood pressure of 80. They have a moderately high triceps skin fold thickness of 45, with a slightly elevated plasma glucose concentration after a glucose tolerance test. Additionally, their 2-hour serum insulin level is high and their body mass index is in the overweight range. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"A 25-year-old woman, who has been pregnant twice, has a diastolic blood pressure of 52 and a triceps skin fold thickness of 22. Her plasma glucose concentration after a glucose tolerance test is 82, with a 2-hour serum insulin level of 115. She has a body mass index of 28.5 and a diabetes pedigree function of 1.699.###\nHence this label was No."
"A 27-year-old female who is pregnant for the first time shows normal diastolic blood pressure (68 mmHg) and low triceps skin fold thickness. Her plasma glucose concentration after a GTT is normal (83 mg/dL), with no insulin detected at the 2-hour mark. She has a low body mass index of 18.2 and a moderate diabetes pedigree function of 0.624.###\nHence this label was No."
"A 22-year-old woman who has been pregnant twice is being monitored for diabetes risk. She has a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 35. Her plasma glucose concentration after a glucose tolerance test is normal at 101, and her 2-hour serum insulin level is also within the normal range at 90. With a body mass index of 21.8 and a low diabetes pedigree function score of 0.155, she appears to have a relatively low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"This 21-year-old patient, who has been pregnant twice, shows normal diastolic blood pressure and no triceps skin fold thickness. Their glucose tolerance test result is within normal range at 118, with no insulin present after 2 hours. Despite having a high body mass index of 42.9, their diabetes pedigree function is relatively low at 0.693.###\nHence this label was Yes."
"The patient is a 45-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 94 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 140 mg/dL. She has an insulin level of 0 μU/mL and a body mass index of 32.7 kg/m². The diabetes pedigree function for this patient is 0.734.###\nHence this label was Yes."
"This patient is 32 years old and has been pregnant 4 times. They have a diastolic blood pressure of 75 and triceps skin fold thickness of 0. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 156. The 2-hour serum insulin level is 0. This patient has a body mass index of 48.3 and a diabetes pedigree function of 0.238.###\nHence this label was Yes."
"This patient is a 24-year-old who has never been pregnant. She has a diastolic blood pressure of 80 mmHg, triceps skin fold thickness of 31 mm, and a plasma glucose concentration of 117 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 53 μU/ml, and her body mass index is 45.2. The diabetes pedigree function value for this patient is 0.089, indicating a low genetic risk for diabetes.###\nHence this label was No."
"This data belongs to a 42-year-old individual who is pregnant for the first time. They have normal diastolic blood pressure at 68, a triceps skin fold thickness of 29, and a plasma glucose concentration of 149 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 127, with a body mass index of 29.3. The diabetes pedigree function score is 0.349.###\nHence this label was Yes."
"The patient is a 29-year-old woman who has been pregnant four times. She has a normal diastolic blood pressure of 66 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 110, with no detectable insulin levels. She has a moderately elevated body mass index of 31.9 and a low diabetes pedigree function score of 0.471.###\nHence this label was No."
"This is a profile of a 43-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 74 and a triceps skin fold thickness of 40. Their plasma glucose concentration after a glucose tolerance test is 100, and their 2-hour serum insulin level is 215. With a body mass index of 39.4 and a diabetes pedigree function of 0.661, this individual's health profile suggests a potential risk for developing diabetes.###\nHence this label was Yes."
"This is a 24-year-old individual who has never been pregnant and has a diastolic blood pressure of 84. Their triceps skin fold thickness is 29, plasma glucose concentration after a glucose tolerance test is 126, and 2-hour serum insulin level is 215. They have a body mass index of 30.7 and a diabetes pedigree function of 0.52.###\nHence this label was No."
"The patient is a 28-year-old woman who has been pregnant 6 times. She has normal diastolic blood pressure and low triceps skin fold thickness. Her glucose levels after a glucose tolerance test are at a normal level. She has a low level of insulin in her blood. The patient has a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was No."
"This patient is a 26-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 0 mmHg, a triceps skin fold thickness of 0 mm, and a 2-hour serum insulin level of 0 uU/ml. Her plasma glucose concentration after a glucose tolerance test is 114 mg/dL. She has a body mass index of 0.0 and a diabetes pedigree function of 0.189.###\nHence this label was No."
"The individual is a 21-year-old who has been pregnant 4 times. They have a diastolic blood pressure of 76, triceps skin fold thickness of 15, plasma glucose concentration of 99 after a glucose tolerance test, and 2-hour serum insulin level of 51. Their body mass index is 23.2 and the diabetes pedigree function value is 0.223.###\nHence this label was No."
"The patient is a 41-year-old woman who has been pregnant 7 times. She has a low diastolic blood pressure of 78 and no triceps skin fold thickness. Her glucose levels after a GTT are low at 62, with no insulin detected after 2 hours. Despite a relatively high body mass index of 32.6, her diabetes pedigree function is low at 0.391.###\nHence this label was No."
"The patient is a 21-year-old who has never been pregnant. They have a low diastolic blood pressure of 60 and a healthy body mass index of 34.6. However, their triceps skin fold thickness is slightly high at 35. In a glucose tolerance test, their plasma glucose concentration at 2 hours is 138, indicating normal levels. They also have a relatively high 2-hour serum insulin level of 167. The diabetes pedigree function score is 0.534, suggesting a moderate familial risk of developing diabetes.###\nHence this label was Yes."
"The patient in this example is 42 years old and has been pregnant 7 times. They have a low diastolic blood pressure of 66 and a high triceps skin fold thickness of 42. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 150, and their 2-hour serum insulin level is elevated at 342. With a body mass index of 34.7, this patient is considered overweight. The diabetes pedigree function, which predicts the likelihood of developing diabetes based on family history, is 0.718.###\nHence this label was No."
"This data describes a 31-year-old individual who has been pregnant 3 times. Their diastolic blood pressure is 78, triceps skin fold thickness is 39, plasma glucose concentration after a GTT is 173, 2-hour serum insulin is 185, body mass index is 33.8, and diabetes pedigree function is 0.97. This information can be used to assess the individual's risk of developing diabetes.###\nHence this label was Yes."
"This individual is a 33-year-old who has been pregnant 5 times. They have a normal diastolic blood pressure of 86 and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 122, with no insulin present. They have a body mass index of 34.7 and a low diabetes pedigree function score of 0.29.###\nHence this label was No."
"The patient is a 43-year-old female who has been pregnant 8 times. She has a low diastolic blood pressure of 78 and a high body mass index of 47.9, indicating obesity. Her triceps skin fold thickness is 0, which may suggest a lack of subcutaneous fat. Despite her high plasma glucose concentration of 188, her 2-hour serum insulin level is 0, which could indicate insulin resistance. The patient has a low diabetes pedigree function score of 0.137, suggesting a relatively low genetic risk for diabetes.###\nHence this label was Yes."
"This data belongs to a 21-year-old individual who is pregnant for the first time. They have a normal diastolic blood pressure of 64 and a slightly below average triceps skin fold thickness of 24. Their glucose level after a 2-hour oral glucose tolerance test is normal at 91. They have no insulin present in their 2-hour serum, and their body mass index is within the overweight range at 29.2. The diabetes pedigree function, which predicts the likelihood of developing diabetes based on family history, is relatively low at 0.192.###\nHence this label was No."
"This 21-year-old patient has been pregnant twice and shows no significant values for diastolic blood pressure, triceps skin fold thickness, 2-hour serum insulin, and body mass index. Their plasma glucose concentration after a glucose tolerance test is 84, indicating normal blood sugar levels. The patient has a low diabetes pedigree function score of 0.304.###\nHence this label was No."
"This 27-year-old individual, who has been pregnant 4 times, has normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range. Despite having no serum insulin level, they have a slightly elevated body mass index. The diabetes pedigree function result indicates a low genetic risk for diabetes.###\nHence this label was Yes."
"This is a record of a 25-year-old individual with 1 pregnancy. They have low diastolic blood pressure of 44 and a moderate triceps skin fold thickness of 47. Their glucose level after a GTT is normal at 119, while their insulin level is slightly elevated at 63. The individual has a high body mass index of 35.5 and a relatively low diabetes pedigree function of 0.28.###\nHence this label was No."
"The patient, a 44-year-old woman, has been pregnant 12 times and shows signs of good overall health: low diastolic blood pressure, normal glucose levels, and a healthy body mass index. However, she has a relatively low triceps skin fold thickness and high serum insulin levels, which may indicate a risk for developing diabetes. A family history of diabetes is also suggested by her high diabetes pedigree function score.###\nHence this label was Yes."
"This patient is a 41-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 168 mg/dL, with a 2-hour serum insulin level of 0 μU/ml. She has a body mass index of 32.9 and a diabetes pedigree function of 0.135.###\nHence this label was Yes."
"The patient is a 30-year-old female who has been pregnant 10 times. She has normal diastolic blood pressure and a low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115 mg/dL, and she has a low 2-hour serum insulin level. Her body mass index is very low at 0.0, indicating she may be underweight. The diabetes pedigree function score is low at 0.261, suggesting a lower genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 52-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 76 mmHg and a triceps skin fold thickness of 24 mm. Her plasma glucose concentration after a glucose tolerance test is 124 mg/dL. Her 2-hour serum insulin level is 600 μU/mL, and her body mass index is 28.7 kg/m². She has a diabetes pedigree function of 0.687, indicating a moderate genetic risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 45-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 154, and her 2-hour serum insulin level is 100. She has a body mass index of 30.9 and a diabetes pedigree function of 0.164.###\nHence this label was No."
"The patient is a 58-year-old female who has been pregnant 8 times. She has a normal diastolic blood pressure of 76 and a low triceps skin fold thickness of 0. Her glucose levels appear to be stable at 110, with no insulin present in her system. The patient has a healthy body mass index of 27.8 and a low diabetes pedigree function of 0.237.###\nHence this label was No."
"A 26-year-old woman, who has been pregnant twice, with a diastolic blood pressure of 48, triceps skin fold thickness of 32, plasma glucose concentration of 123 after a GTT, 2-hour serum insulin level of 165, BMI of 42.1, and a diabetes pedigree function of 0.52.###\nHence this label was No."
"A 28-year-old female who has been pregnant twice and has a diastolic blood pressure of 76. She has a triceps skin fold thickness of 20, a plasma glucose concentration of 92 after a GTT, and 0 insulin level after 2 hours. With a body mass index of 24.2 and a diabetes pedigree function of 1.698.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant 3 times. She has a low diastolic blood pressure of 44 and a low triceps skin fold thickness of 13. Her plasma glucose concentration after a glucose tolerance test is 113, with a 2-hour serum insulin level of 0. She has a healthy body mass index of 22.4 and a low diabetes pedigree function score of 0.14.###\nHence this label was No."
"This 34-year-old individual has been pregnant six times and has a diastolic blood pressure of 72. Their triceps skin fold thickness is 45, plasma glucose concentration is 123, and 2-hour serum insulin level is 230. With a body mass index of 33.6 and a diabetes pedigree function of 0.733, this person's diabetes risk profile is notable.###\nHence this label was No."
"A 25-year-old individual, who is pregnant for the first time, has normal diastolic blood pressure and a low triceps skin fold thickness. Their blood glucose level is within a healthy range after a glucose tolerance test. Additionally, they have moderate insulin levels, a low body mass index, and a relatively low diabetes pedigree score.###\nHence this label was No."
"This is a data entry for a 23-year-old individual who has never been pregnant. Their diastolic blood pressure is 64, with a triceps skin fold thickness of 18. They have a plasma glucose concentration of 119 after a 2-hour oral glucose tolerance test, along with a 2-hour serum insulin level of 92. Their body mass index is 34.9 and their diabetes pedigree function is 0.725. This data provides insight into the individual's health markers related to diabetes risk.###\nHence this label was No."
"The patient is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 28. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 155, and her 2-hour serum insulin level is 150. With a body mass index of 33.3 and a diabetes pedigree function of 1.353, she may be at risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 42-year-old female who has been pregnant twice. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 30mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 89 mg/dL, and her 2-hour serum insulin level is 0 µU/mL. Her body mass index is 33.5 kg/m², and her diabetes pedigree function is 0.292.###\nHence this label was No."
"This patient is 34 years old and has been pregnant 4 times. Their diastolic blood pressure is 86, triceps skin fold thickness is 19, and plasma glucose concentration at 2 hours is 83. They have no 2-hour serum insulin and a body mass index of 29.3. The diabetes pedigree function value is 0.317.###\nHence this label was No."
"This is data from a 37-year-old individual who has been pregnant 3 times. Their diastolic blood pressure is 76, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. Their plasma glucose concentration after a glucose tolerance test is 150, and they have a body mass index of 21.0. Additionally, their diabetes pedigree function is 0.207.###\nHence this label was No."
"A 25-year-old woman who has never been pregnant has normal diastolic blood pressure and low triceps skin fold thickness. Her glucose levels are within a healthy range after a 2-hour oral glucose tolerance test. She has no insulin present in her serum, indicating good insulin sensitivity. However, her body mass index is moderately high at 35.8, and her diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 32-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 92, triceps skin fold thickness of 49, plasma glucose concentration of 129, and 2-hour serum insulin level of 155. Her body mass index is 36.4 and her diabetes pedigree function is 0.968. These measurements indicate a risk for developing diabetes and suggest the need for monitoring and potential interventions to manage her health.###\nHence this label was Yes."
"This is a data record of a 33-year-old female who is pregnant for the first time and shows some concerning health indicators. Though her diastolic blood pressure is in the normal range at 72, it is noteworthy that her triceps skin fold thickness is 0, indicating low body fat. Her plasma glucose concentration after a glucose tolerance test is high at 163, which could be a sign of hyperglycemia. Additionally, her 2-hour serum insulin level is 0, which may suggest issues with insulin production or utilization. With a body mass index of 39.0, she is classified as obese. The diabetes pedigree function score of 1.222 indicates a moderate genetic predisposition to diabetes. Overall, these factors suggest a potential high risk for developing diabetes and highlight the importance of monitoring and managing her health closely during pregnancy.###\nHence this label was Yes."
"This patient is 21 years old and has never been pregnant. They have a healthy diastolic blood pressure of 64 and a relatively low triceps skin fold thickness of 17. Their glucose levels after a GTT are normal at 101. They have no insulin in their serum after a 2-hour period. Their body mass index is within the normal range at 21.0. The diabetes pedigree function value is low at 0.252, suggesting a lower risk of developing diabetes.###\nHence this label was No."
"A 33-year-old individual who has been pregnant 8 times shows normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 108, with no insulin detected after 2 hours. Their body mass index is 30.5 and they have a relatively high diabetes pedigree function score of 0.955, indicating a potential genetic predisposition to diabetes.###\nHence this label was Yes."
"A 36-year-old individual, who has been pregnant 3 times, with a diastolic blood pressure of 58. They have a triceps skin fold thickness of 22 and a plasma glucose concentration of 174. Their 2-hour serum insulin level is 194, and they have a body mass index of 32.9. Their diabetes pedigree function is 0.593.###\nHence this label was Yes."
"This patient is a 25-year-old who has never been pregnant and has a diastolic blood pressure of 64. She has a triceps skin fold thickness of 36mm and a plasma glucose concentration of 97mg/dL after a GTT. Additionally, her 2-hour serum insulin level is 100mu U/ml and her body mass index is 36.8. Her diabetes pedigree function is 0.6. These measurements provide insight into her current health status and risk of developing diabetes.###\nHence this label was No."
"This 23-year-old individual is pregnant for the first time and has a low diastolic blood pressure of 58. They have a relatively normal triceps skin fold thickness of 36 and a plasma glucose concentration of 118 after a 2-hour oral glucose tolerance test. Their insulin level is 94, which is within a healthy range. Despite a slightly elevated body mass index of 33.3, their diabetes pedigree function is low at 0.261, indicating a relatively low risk of developing diabetes.###\nHence this label was No."
"A 27-year-old individual, who has been pregnant 4 times, with a diastolic blood pressure of 85, a triceps skin fold thickness of 27, a plasma glucose concentration of 146 after a glucose tolerance test, 2-hour serum insulin level of 100, a body mass index of 28.9, and a diabetes pedigree function of 0.189.###\nHence this label was No."
"This individual, a 41-year-old female, has never been pregnant. She has slightly elevated diastolic blood pressure (104 mmHg) and a relatively low level of triceps skin fold thickness (25 mm). Her plasma glucose concentration after a glucose tolerance test is high at 189 mg/dL. She has no detectable insulin levels after the test. With a body mass index of 34.3, she is classified as obese. Her diabetes pedigree function, a measure of the hereditary risk of diabetes, is 0.435.###\nHence this label was Yes."
"This 22-year-old individual has been pregnant twice and has low diastolic blood pressure. Their triceps skin fold thickness, plasma glucose concentration, and body mass index are within normal ranges. The 2-hour serum insulin level is moderate, and their diabetes pedigree function suggests a relatively low genetic predisposition to diabetes.###\nHence this label was No."
"A 42-year-old woman who has been pregnant 6 times shows no measurements for triceps skin fold thickness and 2-hour serum insulin. She has a diastolic blood pressure of 78 and a plasma glucose concentration of 85 after a glucose tolerance test. With a body mass index of 31.2 and a diabetes pedigree function of 0.382, she may have a low risk of developing diabetes based on these initial findings.###\nHence this label was No."
"A 28-year-old woman, who has been pregnant twice, with low diastolic blood pressure and high triceps skin fold thickness, had a plasma glucose concentration of 122 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level was 158 mu U/mL, and she has a body mass index of 36.2, indicating she is overweight. Her diabetes pedigree function score is 0.816, suggesting a moderate genetic risk of developing diabetes.###\nHence this label was No."
"This data belongs to a 24-year-old individual who has been pregnant 3 times. They have a low diastolic blood pressure of 54 and a normal triceps skin fold thickness of 19. Their glucose levels are at a healthy 99 after a GTT, and their insulin levels are within the normal range at 86. With a body mass index of 25.6, the individual is in the overweight category. Their diabetes pedigree function score is low at 0.154, indicating a lower risk of developing diabetes.###\nHence this label was No."
"The patient is a 24-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 68 mmHg, triceps skin fold thickness of 28 mm, plasma glucose concentration of 86 mg/dL after a glucose tolerance test, and 2-hour serum insulin level of 71 μU/mL. Her body mass index is 30.2 kg/m2 and her diabetes pedigree function is 0.364.###\nHence this label was No."
"The patient is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 94 mmHg and a triceps skin fold thickness of 33 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 143 mg/dL, and her 2-hour serum insulin level is 146 μU/mL. She has a body mass index of 36.6, and her diabetes pedigree function is 0.254.###\nHence this label was Yes."
"This is a dataset of a 45-year-old individual who has been pregnant once. They have a diastolic blood pressure of 102 mmHg and a moderately low triceps skin fold thickness of 28 mm. Their plasma glucose concentration after a 2-hour GTT is 133 mg/dL and their 2-hour serum insulin level is high at 140 μU/mL. They have a body mass index of 32.8, indicating they are overweight. The individual has a low diabetes pedigree function score of 0.234, suggesting a lower genetic risk for diabetes.###\nHence this label was Yes."
"This data belongs to a 23-year-old individual who has never been pregnant. \nHer diastolic blood pressure is within normal range at 76 mmHg. \nShe has no triceps skin fold thickness measurement recorded. \nHer plasma glucose concentration after a standard glucose tolerance test is 113 mg/dL. \nThere is no insulin level recorded after a 2-hour serum test. \nHer body mass index is 33.3, indicating she is in the obese category. \nThe diabetes pedigree function value is 0.278, suggesting a low genetic risk for diabetes.###\nHence this label was Yes."
"This is a data entry for a 29-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 50, a moderate triceps skin fold thickness of 19, and a normal plasma glucose concentration of 107 after a GTT. Her 2-hour serum insulin level is 0, indicating good insulin sensitivity. With a body mass index of 28.3, she is considered overweight. The diabetes pedigree function score is low at 0.181, suggesting a lower risk of developing diabetes based on family history.###\nHence this label was No."
"This individual is a 27-year-old who has never been pregnant and has normal diastolic blood pressure. Their triceps skin fold thickness is slightly above average. They have a moderate plasma glucose concentration following a glucose tolerance test. Their 2-hour serum insulin level is high. They have a high body mass index, indicating obesity. The diabetes pedigree function value is low, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"The patient is a 42-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 103. She has no detectable insulin levels after 2 hours. She has a body mass index of 46.2 and a diabetes pedigree function of 0.126.###\nHence this label was No."
"This individual is a 43-year-old woman who has been pregnant 7 times and has a diastolic blood pressure of 80. Her triceps skin fold thickness is 31, and her plasma glucose concentration following a glucose tolerance test is 109. She has no insulin present in her serum after a 2-hour period. Her body mass index is 35.9, and her diabetes pedigree function is 1.127.###\nHence this label was Yes."
"A 32-year-old woman who has never been pregnant has a healthy diastolic blood pressure of 68. She has a moderately low triceps skin fold thickness of 20, normal glucose levels at 108 after a glucose tolerance test, and no detectable insulin levels after 2 hours. Her body mass index is within the normal range at 27.3, and she has a moderately low diabetes pedigree function score of 0.787.###\nHence this label was No."
"This data belongs to a 49-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 85 and a triceps skin fold thickness of 15. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 184. They have a 2-hour serum insulin level of 0 and a body mass index of 30.0. The diabetes pedigree function value for this individual is 1.213.###\nHence this label was Yes."
"The patient is a 37-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 90 and a triceps skin fold thickness of 35. In a glucose tolerance test, her plasma glucose concentration at 2 hours is 186, and her 2-hour serum insulin level is 225. Her body mass index is 34.5, and her diabetes pedigree function is 0.423.###\nHence this label was Yes."
"This 39-year-old individual has been pregnant 8 times and has a diastolic blood pressure of 74. They have a triceps skin fold thickness of 0 and a plasma glucose concentration of 197 after a glucose tolerance test. Their 2-hour serum insulin is 0, and they have a body mass index of 25.9. With a diabetes pedigree function of 1.191, this individual's risk for developing diabetes may be elevated.###\nHence this label was Yes."
"This 43-year-old individual has been pregnant 7 times and has a diastolic blood pressure of 68. Their triceps skin fold thickness is 49, plasma glucose concentration after a GTT is 129, and 2-hour serum insulin level is 125. With a body mass index of 38.5 and a diabetes pedigree function of 0.439, this person's health profile indicates some risk factors for developing diabetes.###\nHence this label was Yes."
"This patient is 35 years old and has been pregnant 5 times. She has a diastolic blood pressure of 82, a triceps skin fold thickness of 41, and a body mass index of 35.8, indicating a higher risk for diabetes. Her plasma glucose concentration after a glucose tolerance test is 77, and her 2-hour serum insulin level is 42. The diabetes pedigree function score is low at 0.156, suggesting a lower genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 42-year-old female who has been pregnant 5 times. She has diastolic blood pressure of 86, triceps skin fold thickness of 30, plasma glucose concentration of 117 after a glucose tolerance test, and 2-hour serum insulin level of 105. Her body mass index is 39.1, and her diabetes pedigree function is 0.251.###\nHence this label was No."
"The patient is a 57-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 80 and a triceps skin fold thickness of 0, indicating low levels of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 139. She has no insulin in her serum after 2 hours. Her body mass index is 27.1, and her diabetes pedigree function is 1.441, suggesting a potential genetic predisposition to diabetes.###\nHence this label was No."
"A 25-year-old individual, who has been pregnant 2 times, with a diastolic blood pressure of 70 and a triceps skin fold thickness of 32. Their plasma glucose concentration is 68 after a 2-hour oral glucose tolerance test, and they have a 2-hour serum insulin level of 66. With a body mass index of 25.0 and a low diabetes pedigree function of 0.187.###\nHence this label was No."
"A 21-year-old individual, who has been pregnant once, has a low diastolic blood pressure of 50. Their triceps skin fold thickness is 10, indicating a moderate amount of subcutaneous fat. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 73. They have very low 2-hour serum insulin levels of 0. With a body mass index of 23.0, they are within the normal weight range. Their diabetes pedigree function is low at 0.248, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"A 33-year-old individual who has been pregnant 6 times shows a diastolic blood pressure of 50 and a triceps skin fold thickness of 22. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 119, with a 2-hour serum insulin level of 176. They have a body mass index of 27.1 and a diabetes pedigree function of 1.318.###\nHence this label was Yes."
"A 26-year-old individual who has been pregnant 3 times with normal diastolic blood pressure, moderate triceps skin fold thickness, and healthy plasma glucose concentration. They have slightly elevated 2-hour serum insulin levels, low body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was No."
"The patient is a 40-year-old female who has been pregnant 3 times. She has a low diastolic blood pressure of 78 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration is at a normal level of 122, while her 2-hour serum insulin is 0. She has a healthy body mass index of 23.0 and a low diabetes pedigree function of 0.254.###\nHence this label was No."
"This patient is a 46-year-old female who has been pregnant 4 times. She has a normal diastolic blood pressure of 72 and a low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 115, and her 2-hour serum insulin level is low. Despite having a slightly elevated body mass index of 28.9, her diabetes pedigree function is low at 0.376.###\nHence this label was Yes."
"A 54-year-old individual who has been pregnant 7 times shows normal diastolic blood pressure and elevated triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within a healthy range, but their insulin levels are higher than average. With a body mass index of 35.2 and a moderately high diabetes pedigree function score of 0.692, this individual may have an increased risk of developing diabetes.###\nHence this label was Yes."
"A 43-year-old woman who has been pregnant 9 times shows normal diastolic blood pressure, slightly elevated plasma glucose concentration after a glucose tolerance test, and high body mass index. Her triceps skin fold thickness indicates some fat accumulation, but her insulin levels are surprisingly low. The diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was Yes."
"The individual is a 25-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 62 and a triceps skin fold thickness of 41. Her plasma glucose concentration after a glucose tolerance test is 109, and her 2-hour serum insulin level is 129. She has a body mass index of 35.8 and a diabetes pedigree function of 0.514.###\nHence this label was Yes."
"The patient is a 24-year-old female who is pregnant for the first time. She has low diastolic blood pressure of 50 mmHg. The triceps skin fold thickness measurement is 16 mm. During a glucose tolerance test, her plasma glucose concentration after 2 hours is high at 193 mg/dL. She also has a high insulin level of 375 μU/mL. Her body mass index is within the normal range at 25.9, and her diabetes pedigree function is 0.655, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 23-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 76. They have a triceps skin fold thickness of 18, a plasma glucose concentration of 94 after a glucose tolerance test, and a 2-hour serum insulin level of 66. Their body mass index is 31.6 and they have a diabetes pedigree function value of 0.649.###\nHence this label was No."
"The patient is a 24-year-old who is pregnant for the first time. She has a diastolic blood pressure of 74, triceps skin fold thickness of 50, and a plasma glucose concentration of 136 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 204, and she has a body mass index of 37.4. The diabetes pedigree function indicates a low genetic risk of diabetes at 0.399.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant three times. She has a normal diastolic blood pressure of 86 and a slightly below average triceps skin fold thickness of 16. Her plasma glucose concentration after a 2-hour GTT is low at 81, and her 2-hour serum insulin level is also on the lower side at 66. She has a healthy body mass index of 27.5 and a low diabetes pedigree function of 0.306, indicating a low risk of developing diabetes.###\nHence this label was No."
"A 33-year-old individual who has been pregnant 4 times, with a diastolic blood pressure of 70 mmHg and triceps skin fold thickness of 14 mm. Their plasma glucose concentration was 173 mg/dL after a 2-hour oral glucose tolerance test, and they had a serum insulin level of 168 uU/ml. Additionally, they have a body mass index of 29.7 and a diabetes pedigree function of 0.361.###\nHence this label was Yes."
"This individual is 38 years old and has been pregnant 5 times. Their diastolic blood pressure is 92. They have no triceps skin fold thickness and no 2-hour serum insulin. Their plasma glucose concentration at 2 hours is 117. They have a body mass index of 34.1 and a diabetes pedigree function of 0.337.###\nHence this label was No."
"A 30-year-old individual who has been pregnant 3 times has a diastolic blood pressure of 80. Their triceps skin fold thickness is 11, plasma glucose concentration is 99 after a 2-hour oral glucose tolerance test, and 2-hour serum insulin level is 64. With a body mass index of 19.3 and a diabetes pedigree function of 0.284, this individual's health profile suggests they may be at low risk for developing diabetes.###\nHence this label was No."
"The patient is a 30-year-old female who is relatively young and has been pregnant four times. Her diastolic blood pressure is within normal range at 92. She has no triceps skin fold thickness, indicating a low amount of subcutaneous fat. Her plasma glucose concentration after a glucose tolerance test is 110, which is at a healthy level. She also has no serum insulin present after 2 hours. Despite having a high body mass index of 37.6, her risk of developing diabetes is low based on her diabetes pedigree function score of 0.191.###\nHence this label was No."
"This individual, aged 52, has never been pregnant and has normal diastolic blood pressure. They have very low triceps skin fold thickness and zero serum insulin. Their plasma glucose level after a 2-hour glucose tolerance test is 123, indicating normal blood sugar levels. Despite having a high body mass index of 36.3, their diabetes pedigree function value is low at 0.258, suggesting a relatively lower risk of developing diabetes.###\nHence this label was Yes."
"A 25-year-old woman, who has been pregnant three times, with a diastolic blood pressure of 70 and a triceps skin fold thickness of 31. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 193, while her 2-hour serum insulin level is 0. She has a body mass index of 34.9 and a low diabetes pedigree function score of 0.241.###\nHence this label was Yes."
"The patient is a 40-year-old female who has been pregnant 4 times. She has a normal diastolic blood pressure of 74 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 141, with a 2-hour serum insulin level of 0. She has a healthy body mass index of 27.6 and a low diabetes pedigree function of 0.244.###\nHence this label was No."
"The individual is 46 years old and has been pregnant 14 times. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 25. Their plasma glucose concentration after a glucose tolerance test is 100, with a 2-hour serum insulin level of 184. The individual has a body mass index of 36.6 and a diabetes pedigree function value of 0.412.###\nHence this label was Yes."
"The patient is 31 years old and has been pregnant 6 times. They have a diastolic blood pressure reading of 0, triceps skin fold thickness of 0, and 2-hour serum insulin level of 0. However, their plasma glucose concentration after a glucose tolerance test is 91, indicating a normal level. The patient has a body mass index of 29.8 and a diabetes pedigree function of 0.501. Overall, the diagnostic measurements suggest a relatively low risk of developing diabetes.###\nHence this label was No."
"The patient is a 24-year-old woman who is pregnant for the first time. She has a low diastolic blood pressure of 56, normal triceps skin fold thickness of 30, and a healthy plasma glucose concentration of 77. Her 2-hour serum insulin level is also within the normal range at 56. Despite being pregnant, she has a slightly elevated body mass index of 33.3. Her diabetes pedigree function indicates a mild genetic predisposition to diabetes.###\nHence this label was No."
"This individual is a young adult with no history of pregnancy. Their diastolic blood pressure is within the healthy range, while their triceps skin fold thickness is normal. The plasma glucose concentration after a glucose tolerance test is also within the normal range. They have no insulin in their blood after 2 hours. Their body mass index is very low at 0.0, which is unusually low and should be investigated further. The diabetes pedigree function score is moderate, indicating a potential genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 39-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 28. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 129, and her 2-hour serum insulin level is 122. She has a body mass index of 35.9 and a diabetes pedigree function of 0.28.###\nHence this label was No."
"This patient is a 21-year-old who is pregnant for the first time. She has a normal diastolic blood pressure of 70 and a healthy triceps skin fold thickness of 28. Her plasma glucose concentration after a GTT is 116, and her 2-hour serum insulin level is normal at 0. With a body mass index of 27.4, she is within the overweight range. Her diabetes pedigree function score is low at 0.204, indicating a potentially lower risk of developing diabetes.###\nHence this label was No."
"A 29-year-old woman who has been pregnant four times with normal blood pressure and no triceps skin fold thickness. She has a low plasma glucose concentration after a glucose tolerance test and no insulin level at 2 hours. Despite having a high body mass index, her diabetes pedigree function is low.###\nHence this label was No."
"This individual, at the age of 65, has been pregnant 5 times. She has a healthy diastolic blood pressure of 78 and a normal body mass index of 33.7. However, her triceps skin fold thickness and 2-hour serum insulin levels are both at zero. Her plasma glucose concentration after a glucose tolerance test is 147, indicating a moderate risk of developing diabetes. The diabetes pedigree function value is low at 0.218, suggesting a relatively lower genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 41-year-old female who has been pregnant 13 times. She has very low diastolic blood pressure of 60 mmHg and no triceps skin fold thickness. Her glucose levels after a 2-hour oral GTT are low at 76 mg/dL, and she has no serum insulin present. Despite having a BMI of 32.8, her diabetes pedigree function is relatively low at 0.18. Overall, this patient exhibits some atypical values that may require further monitoring and intervention.###\nHence this label was No."
"A 31-year-old individual, who has been pregnant 3 times, with a diastolic blood pressure of 74, triceps skin fold thickness of 19, plasma glucose concentration of 169 after a 2-hour oral glucose tolerance test, 2-hour serum insulin level of 125, body mass index of 29.9, and a diabetes pedigree function value of 0.268.###\nHence this label was Yes."
"A 31-year-old woman, who has been pregnant seven times, with a diastolic blood pressure of 66 mmHg, a triceps skin fold thickness of 32mm, and a body mass index of 39.1 kg/m², shows no insulin presence after a 2-hour oral glucose tolerance test. Her plasma glucose concentration at 2 hours is 103 mg/dL, and her diabetes pedigree function is 0.344.###\nHence this label was Yes."
"A 24-year-old woman who has been pregnant three times has a low diastolic blood pressure of 54. She has a triceps skin fold thickness of 21 and a plasma glucose concentration of 106 after a glucose tolerance test. Her 2-hour serum insulin level is high at 158. With a body mass index of 30.9 and a low diabetes pedigree function of 0.292, she may have a moderate risk of developing diabetes.###\nHence this label was No."
"A 21-year-old individual who has been pregnant twice with a low diastolic blood pressure of 52 and a relatively normal plasma glucose concentration of 99. Despite having a low triceps skin fold thickness of 15, a high 2-hour serum insulin level of 94. The individual has a healthy body mass index of 24.6 and a moderate diabetes pedigree function of 0.637.###\nHence this label was No."
"A 29-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure, slightly lower triceps skin fold thickness, normal plasma glucose levels after a glucose tolerance test, moderate serum insulin levels, a slightly elevated body mass index, and a moderate diabetes pedigree function score. Overall, the individual appears to have a moderate risk of developing diabetes.###\nHence this label was No."
"A 31-year-old woman who has never been pregnant is being evaluated for diabetes risk. She has slightly elevated diastolic blood pressure (84 mmHg) and a high triceps skin fold thickness (47 mm), indicating excess body fat. Her plasma glucose concentration after a glucose tolerance test is normal (118 mg/dL), but her 2-hour serum insulin level is very high (230 μU/mL). With a BMI of 45.8, she is classified as severely obese. Her diabetes pedigree function score is 0.551, suggesting a moderate genetic predisposition to the disease. Overall, these factors indicate a high risk for developing diabetes in the future.###\nHence this label was Yes."
"The patient is a 43-year-old woman who has been pregnant 6 times. She has a lower than normal diastolic blood pressure of 58 and a slightly above average triceps skin fold thickness of 33. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within a healthy range at 98. She has a high insulin level of 190 after 2 hours. Her body mass index is 34.0, indicating obesity. The diabetes pedigree function score is low at 0.43, suggesting a lower genetic risk of diabetes.###\nHence this label was No."
"The patient is a 53-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 27, and a body mass index of 43.6. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours was 187. Additionally, her 2-hour serum insulin level is 207, and she has a diabetes pedigree function value of 1.034.###\nHence this label was Yes."
"The patient is a 63-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 80, triceps skin fold thickness of 15, and a body mass index of 32.4. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 142. The 2-hour serum insulin level is 0, and her diabetes pedigree function is 0.2.###\nHence this label was No."
"The patient is a 52-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 27, and a plasma glucose concentration of 97 following an oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 35.6. The diabetes pedigree function for this patient is 0.378.###\nHence this label was Yes."
"This 21-year-old individual has been pregnant once. They have a low diastolic blood pressure of 58 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a GTT is 105, with a 2-hour serum insulin level of 0. They have a healthy body mass index of 24.3 and a low diabetes pedigree function of 0.187.###\nHence this label was No."
"The patient is a 27-year-old female who has been pregnant 5 times. She has a healthy diastolic blood pressure of 72 and a low triceps skin fold thickness of 28. Her plasma glucose concentration after a glucose tolerance test is 111, and she has a low 2-hour serum insulin level of 0. With a body mass index of 23.9 and a diabetes pedigree function score of 0.407, she is at a relatively low risk of developing diabetes.###\nHence this label was No."
"A 37-year-old individual, who has been pregnant 4 times, with a diastolic blood pressure of 72. They have a triceps skin fold thickness of 29, a plasma glucose concentration of 154 after a GTT, and a 2-hour serum insulin level of 126. Their body mass index is 31.3 and their diabetes pedigree function is 0.338.###\nHence this label was No."
"The patient is a 60-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 90, triceps skin fold thickness of 7, and a plasma glucose concentration of 129 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 326 uU/mL and her body mass index is 19.6. She has a diabetes pedigree function score of 0.582.###\nHence this label was No."
"This 24-year-old individual, who has been pregnant once, has normal diastolic blood pressure and a relatively low triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within normal range, and their insulin level is not particularly high. With a healthy body mass index and a moderately low diabetes pedigree function score, this person appears to have a low risk of developing diabetes based on these indicators.###\nHence this label was No."
"A 52-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 104. They have no measurable triceps skin fold thickness or 2-hour serum insulin levels. Their plasma glucose concentration after a glucose tolerance test is 162, and they have a high body mass index of 37.7. The diabetes pedigree function score is low at 0.151.###\nHence this label was Yes."
"A 24-year-old individual with a history of 3 pregnancies shows normal diastolic blood pressure and a slightly above average triceps skin fold thickness. Their plasma glucose concentration is elevated at 171 mg/dL after a 2-hour oral glucose tolerance test, with a relatively high serum insulin level of 135 μU/mL. Despite this, their body mass index falls within the healthy range at 33.3, and their diabetes pedigree function is low at 0.199.###\nHence this label was Yes."
"The patient is a 26-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 28 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 105 mg/dL. She has no 2-hour serum insulin. Her body mass index is 32.5, and her diabetes pedigree function is 0.878. Overall, this data suggests that the patient may have a moderate risk of developing diabetes.###\nHence this label was No."
"This patient is a 21-year-old female who has never been pregnant. She has a low diastolic blood pressure of 64 and a high triceps skin fold thickness of 46. Her glucose levels are normal at 102, but her insulin levels are slightly elevated at 78. She has a high body mass index of 40.6 and a moderate diabetes pedigree function of 0.496. Overall, this patient shows some risk factors for developing diabetes, such as high BMI and insulin levels, despite normal glucose levels.###\nHence this label was No."
"A 27-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 74, a triceps skin fold thickness of 17, a plasma glucose concentration of 155 after a glucose tolerance test, 96 units of insulin in their blood after 2 hours, a body mass index of 26.6, and a diabetes pedigree function value of 0.433.###\nHence this label was Yes."
"This 31-year-old individual has been pregnant 6 times and has a diastolic blood pressure of 88. They have no triceps skin fold thickness and a plasma glucose concentration of 107 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 36.8. The diabetes pedigree function for this individual is 0.727.###\nHence this label was No."
"The individual in this data is a 22-year-old who has never been pregnant. Their diastolic blood pressure is 64, triceps skin fold thickness is 39, and plasma glucose concentration after a glucose tolerance test is 95. Their 2-hour serum insulin level is 105, body mass index is 44.6, and diabetes pedigree function is 0.366.###\nHence this label was No."
"The data is from a 43-year-old individual who has been pregnant 15 times. Despite having a relatively low diastolic blood pressure of 70 and a healthy triceps skin fold thickness of 32, their plasma glucose concentration after a 2-hour oral glucose tolerance test is 136, indicating a moderate level. With a 2-hour serum insulin level of 110, a high body mass index of 37.1, and a low diabetes pedigree function of 0.153, this individual may be at risk for developing diabetes.###\nHence this label was Yes."
"A 22-year-old woman who has never been pregnant shows normal diastolic blood pressure and triceps skin fold thickness. She has high plasma glucose concentration and insulin levels after a glucose tolerance test, indicating possible risk for diabetes. She also has a slightly elevated body mass index and a moderate diabetes pedigree function score.###\nHence this label was Yes."
"The patient is a 22-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 11. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 80, and her 2-hour serum insulin level is 60. She has a body mass index of 30.0 and a diabetes pedigree function of 0.527.###\nHence this label was No."
"This is a 28-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 90 and a triceps skin fold thickness of 39. Their plasma glucose concentration after a glucose tolerance test is 102, with a 2-hour serum insulin level of 0. They have a body mass index of 35.7 and a diabetes pedigree function of 0.674.###\nHence this label was No."
"This is a 22-year-old individual who is pregnant for the first time. She has a normal diastolic blood pressure and a moderately low triceps skin fold thickness. Her glucose levels after a 2-hour oral test are normal, and she has low insulin levels. Her body mass index indicates that she is slightly overweight. Additionally, her diabetes pedigree function score suggests a moderate genetic risk for developing diabetes.###\nHence this label was No."
"The patient is a 68-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 82 mmHg and a very low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 91 mg/dL, and she has no insulin present in her serum. Despite having a body mass index of 35.6, which is considered obese, her diabetes pedigree function score is relatively low at 0.587.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 56, a moderately low triceps skin fold thickness of 28, and a low plasma glucose concentration at 56 from a GTT. Her 2-hour serum insulin level is also low at 45, and she has a healthy body mass index of 24.2. The diabetes pedigree function indicates a slight genetic predisposition to diabetes at 0.332.###\nHence this label was No."
"A 21-year-old individual, who has been pregnant 2 times, with a diastolic blood pressure of 64. Their triceps skin fold thickness is 22, plasma glucose concentration at 2 hours is 115, and 2-hour serum insulin level is 0. They have a body mass index of 30.8 and a low diabetes pedigree function of 0.421.###\nHence this label was No."
"This 24-year-old individual, who has been pregnant twice, has a low diastolic blood pressure of 54. They have a moderate triceps skin fold thickness of 28, and their plasma glucose concentration after a glucose tolerance test is at a normal level of 100. Additionally, their 2-hour serum insulin level is slightly elevated at 105. Despite having a high body mass index of 37.8, their diabetes pedigree function score is relatively low at 0.498.###\nHence this label was No."
"This 22-year-old individual has been pregnant twice and has relatively low diastolic blood pressure of 54. They have a moderate triceps skin fold thickness of 14, and their plasma glucose concentration after a glucose tolerance test is within normal range at 95. Their 2-hour serum insulin level is 88, indicating normal insulin production. With a body mass index of 26.1, they are considered overweight. Their diabetes pedigree function score is 0.748, suggesting a moderate genetic susceptibility to diabetes.###\nHence this label was No."
"This 23-year-old individual, who has been pregnant twice, has a relatively low diastolic blood pressure of 70. They have no triceps skin fold thickness, which may indicate a lean body composition. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 134, suggesting normal blood sugar levels. With a 2-hour serum insulin level of 0, it is likely that their pancreas is functioning properly. Their body mass index is 28.9, indicating they are overweight but not obese. The diabetes pedigree function score of 0.542 suggests a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 28-year-old woman who has been pregnant six times. She has a normal diastolic blood pressure of 80 and a slightly above average triceps skin fold thickness of 36. Her plasma glucose concentration after a glucose tolerance test is normal at 80, and she has no insulin in her system after 2 hours. Despite having a high body mass index of 39.8, she has a low diabetes pedigree function score of 0.177, indicating a relatively low risk of developing diabetes.###\nHence this label was No."
"The patient is a 44-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 0, and a plasma glucose concentration of 115 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 31.2. The diabetes pedigree function, a measure of the diabetes history in relatives, is 0.343.###\nHence this label was Yes."
"The patient is a 46-year-old woman who has never been pregnant. She has normal diastolic blood pressure, a low triceps skin fold thickness, and a slightly below average plasma glucose concentration after a glucose tolerance test. Her 2-hour serum insulin level is low, and she has a moderate body mass index. The diabetes pedigree function score indicates a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 40-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 60 and a triceps skin fold thickness of 39, indicating a moderate amount of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115, which is within the normal range. Her 2-hour serum insulin level is 0, suggesting no insulin production at that time. With a body mass index of 33.7, she is considered obese. The diabetes pedigree function value of 0.245 indicates a low genetic risk for diabetes.###\nHence this label was Yes."
"This individual is a 51-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 86 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125. She has a 2-hour serum insulin level of 0 and a body mass index of 37.6. Her diabetes pedigree function is 0.304.###\nHence this label was No."
"This patient is a 32-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 22mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85 mg/dL. She has a fasting serum insulin level of 0 µU/mL and a body mass index of 29.0 kg/m². The diabetes pedigree function, which predicts the likelihood of developing diabetes based on family history, is 1.224 for this patient. Overall, these measurements suggest a relatively low risk of developing diabetes.###\nHence this label was Yes."
"A 36-year-old individual who has been pregnant 5 times, with low diastolic blood pressure, no triceps skin fold thickness, low plasma glucose concentration after a glucose tolerance test, no insulin secretion after 2 hours, a healthy body mass index, and a moderately low diabetes pedigree function score.###\nHence this label was No."
"The patient is a 23-year-old female who has been pregnant 4 times. Despite having a normal diastolic blood pressure and triceps skin fold thickness, she has a slightly elevated plasma glucose concentration of 132 mg/dL after a 2-hour oral glucose tolerance test. Her insulin levels are normal, but she has a high body mass index of 32.9, indicating obesity. The diabetes pedigree function value is 0.302, suggesting a moderate genetic predisposition to diabetes. Overall, this patient presents with some risk factors for developing diabetes and may benefit from further monitoring and lifestyle interventions.###\nHence this label was Yes."
"A 46-year-old woman who has been pregnant 3 times has a diastolic blood pressure of 82. Her triceps skin fold thickness is 28, while her plasma glucose concentration after a 2-hour oral glucose tolerance test is 61. She has no insulin present in her serum. Her body mass index is 34.4, and her diabetes pedigree function is 0.243.###\nHence this label was No."
"A 31-year-old woman, who has been pregnant 10 times, with low diastolic blood pressure of 62. She has no triceps skin fold thickness and her 2-hour serum insulin level is 0. Despite having a normal plasma glucose concentration of 92, her body mass index is 25.9. Her diabetes pedigree function is low at 0.167.###\nHence this label was No."
"This is data from a 22-year-old individual who has never been pregnant. They have a diastolic blood pressure of 66 and a triceps skin fold thickness of 27. Their plasma glucose concentration after a glucose tolerance test is 119, with a 2-hour serum insulin level of 0. The individual has a body mass index of 38.8 and a diabetes pedigree function value of 0.259.###\nHence this label was No."
"The patient is a 46-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 37, and a plasma glucose concentration of 102 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 32.9. The diabetes pedigree function for this patient is 0.665.###\nHence this label was Yes."
"This data represents a 32-year-old patient who is pregnant for the first time. She has a diastolic blood pressure of 70, triceps skin fold thickness of 30, and a plasma glucose concentration of 115 after a glucose tolerance test. Her 2-hour serum insulin level is 96, and her body mass index is 34.6. The diabetes pedigree function for this patient is 0.529.###\nHence this label was Yes."
"The individual is a 32-year-old woman who has never been pregnant. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 131 mg/dL. She has no detectable serum insulin levels. With a body mass index of 31.6 and a diabetes pedigree function of 0.743, she may have a risk of developing diabetes in the future.###\nHence this label was Yes."
"The patient is a 38-year-old female who has been pregnant 4 times. She has a normal diastolic blood pressure of 78 mmHg and a slightly high triceps skin fold thickness of 40 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range at 112 mg/dL, but her 2-hour serum insulin level is very low at 0 μU/mL. She has a high body mass index of 39.4, indicating obesity. The patient has a low diabetes pedigree function score of 0.236, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"This 24-year-old individual has been pregnant twice and has a diastolic blood pressure of 65. Their triceps skin fold thickness is 28, plasma glucose concentration after a GTT is 83, and 2-hour serum insulin level is 66. With a body mass index of 36.8 and a diabetes pedigree function of 0.629, this person's risk of developing diabetes may be evaluated.###\nHence this label was No."
"The individual is a young 23-year-old who has never been pregnant. They have a low diastolic blood pressure of 60 and a healthy body mass index of 26.4. Their plasma glucose concentration is within normal range at 107, and they have a low 2-hour serum insulin level. Despite having a low risk of diabetes, their triceps skin fold thickness is moderate at 25, indicating average subcutaneous fat levels. Their diabetes pedigree function score is very low at 0.133, suggesting a minimal genetic predisposition to diabetes.###\nHence this label was No."
"A 26-year-old woman who has been pregnant 3 times shows lower than normal diastolic blood pressure and skin fold thickness. Her glucose levels after a GTT are on the lower side, along with a slightly elevated insulin level. She has a BMI indicating overweight and a low diabetes pedigree function score.###\nHence this label was Yes."
"A 28-year-old woman who has been pregnant twice shows normal diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. Her plasma glucose concentration after a GTT is slightly elevated. She has a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was Yes."
"This individual is 37 years old and has been pregnant once. They have a diastolic blood pressure of 88, triceps skin fold thickness of 39, plasma glucose concentration of 128, and 2-hour serum insulin level of 110. Their body mass index is 36.5 and their diabetes pedigree function is 1.057. These measurements provide insight into the individual's health and risk of developing diabetes.###\nHence this label was Yes."
"This 22-year-old individual has been pregnant 3 times and shows low diastolic blood pressure, triceps skin fold thickness, and insulin levels. Their plasma glucose concentration after a glucose tolerance test is 80, body mass index is 0.0, and diabetes pedigree function is 0.174.###\nHence this label was No."
"The patient is a 38-year-old who has been pregnant 14 times. She has a low diastolic blood pressure of 62 and a moderately high triceps skin fold thickness of 30. Her plasma glucose concentration after a glucose tolerance test is elevated at 175. However, her 2-hour serum insulin level is at a very low level of 0. Despite her high BMI of 33.6, her diabetes pedigree function is relatively low at 0.212.###\nHence this label was Yes."
"A 28-year-old woman who has never been pregnant has a diastolic blood pressure of 70, no triceps skin fold thickness, a plasma glucose concentration of 146 after a glucose tolerance test, no insulin at the 2-hour mark, a high body mass index of 37.9, and a moderately low diabetes pedigree function score of 0.334.###\nHence this label was Yes."
"This individual is 51 years old and has been pregnant 11 times. They have normal diastolic blood pressure, no triceps skin fold thickness, and normal plasma glucose concentration at 2 hours. Their 2-hour serum insulin level is zero. They have a high body mass index of 39.0 and a low diabetes pedigree function of 0.19.###\nHence this label was No."
"The patient is a 29-year-old woman who has been pregnant 3 times. She has a normal diastolic blood pressure of 74 and a slightly high plasma glucose concentration of 182 after a glucose tolerance test. Her body mass index is in the overweight range at 30.5. Other measurements such as triceps skin fold thickness and 2-hour serum insulin levels are at the lower end of the spectrum. Overall, her diabetes pedigree function score is low at 0.345, indicating a relatively lower risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 23-year-old female who has been pregnant 2 times. She has a low diastolic blood pressure of 58 mmHg. Her triceps skin fold thickness is average at 17 mm. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 101 mg/dL. She has a high 2-hour serum insulin level of 265 μU/mL. Her body mass index is within the normal range at 24.2. The diabetes pedigree function score is 0.614, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 50-year-old individual who has been pregnant 11 times has a diastolic blood pressure of 74. They have a triceps skin fold thickness of 26, a plasma glucose concentration of 138 after a glucose tolerance test, and a 2-hour serum insulin level of 144. With a body mass index of 36.1 and a diabetes pedigree function of 0.557, this individual's health markers indicate a need for monitoring and potential risk for developing diabetes.###\nHence this label was Yes."
"This is a 27-year-old individual who has never been pregnant and has normal blood pressure. They have a slightly below average triceps skin fold thickness, a normal plasma glucose concentration, and moderate serum insulin levels. Their body mass index indicates they are slightly overweight. Overall, their risk for developing diabetes appears to be low based on these measurements.###\nHence this label was No."
"This is data from a 24-year-old individual who has been pregnant 6 times. Their diastolic blood pressure is 64, triceps skin fold thickness is 39, and plasma glucose concentration at 2 hours in an oral glucose tolerance test is 111. They have 0 insulin after a 2-hour serum test. Their body mass index is 34.2 and their diabetes pedigree function is 0.26.###\nHence this label was No."
"This individual is a 47-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 86, no triceps skin fold thickness, and a plasma glucose concentration of 161 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, with a body mass index of 30.4. Additionally, her diabetes pedigree function is 0.165.###\nHence this label was Yes."
"A 25-year-old female who has been pregnant 3 times, with a diastolic blood pressure of 58, triceps skin fold thickness of 31, plasma glucose concentration of 83 after a glucose tolerance test, 2-hour serum insulin level of 18, and a body mass index of 34.3. Her diabetes pedigree function is 0.336.###\nHence this label was No."
"A 30-year-old individual who has been pregnant twice shows a diastolic blood pressure of 74 mmHg. Their triceps skin fold thickness measures 35 mm. After a 2-hour oral glucose tolerance test, their plasma glucose concentration is 157 mg/dL. Additionally, their 2-hour serum insulin level is 440 uU/mL. With a body mass index of 39.4, the individual has a low diabetes pedigree function score of 0.134.###\nHence this label was No."
"This 27-year-old individual has been pregnant 5 times, with a diastolic blood pressure of 76. They have no triceps skin fold thickness, no serum insulin, and a high plasma glucose concentration of 166. Their body mass index is 45.7, and their diabetes pedigree function is 0.34.###\nHence this label was Yes."
"The patient is a 41-year-old woman who has been pregnant seven times. She has a diastolic blood pressure of 84, triceps skin fold thickness of 33, and a body mass index of 35.5. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 184. Despite having a 0 level of 2-hour serum insulin, her diabetes pedigree function is 0.355.###\nHence this label was Yes."
"The patient is a 36-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 72 and a high triceps skin fold thickness of 42. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is elevated at 179, as well as her 2-hour serum insulin level at 130. Her body mass index is 32.7, indicating she is overweight. The diabetes pedigree function score is 0.719, suggesting a moderate genetic predisposition to diabetes. Overall, this data indicates potential risk for developing diabetes.###\nHence this label was Yes."
"This individual is a 41-year-old woman who has been pregnant twice. She has diastolic blood pressure and triceps skin fold thickness measurements of 0. Her plasma glucose level after a 2-hour oral glucose tolerance test is 129. She has no insulin present in her serum after 2 hours. Her body mass index is 38.5, indicating obesity. The diabetes pedigree function, a measure of diabetes heredity, is 0.304.###\nHence this label was No."
"This person is a 22-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 60 and a moderately high triceps skin fold thickness of 18. Her glucose levels are within normal range at 122, while her insulin levels are elevated at 106. Despite having a slightly high body mass index of 29.8, her diabetes pedigree function is relatively low at 0.717. Overall, she may have a moderate risk of developing diabetes based on these measurements.###\nHence this label was No."
"This is a data record of a 26-year-old individual who is pregnant for the first time. She has normal diastolic blood pressure, a moderately low triceps skin fold thickness, and a healthy plasma glucose concentration during an oral glucose tolerance test. Her 2-hour serum insulin level is within a normal range, and she has a low body mass index. The calculated diabetes pedigree function indicates a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 37-year-old woman who has been pregnant 7 times shows normal diastolic blood pressure and no triceps skinfold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 133, with no serum insulin detected. She has a high body mass index of 40.2 and a moderate diabetes pedigree function of 0.696.###\nHence this label was No."
"A 47-year-old woman who has been pregnant once with a low diastolic blood pressure of 60, no triceps skin fold thickness, a plasma glucose concentration of 126 after a 2-hour oral glucose tolerance test, no serum insulin, a body mass index of 30.1, and a low diabetes pedigree function of 0.349.###\nHence this label was Yes."
"This patient is a 25-year-old woman who has never been pregnant. She has very low diastolic blood pressure of 60 mmHg, no triceps skin fold thickness, and low 2-hour serum insulin levels. Her plasma glucose concentration after a glucose tolerance test is normal at 93 mg/dL. Despite having a high body mass index of 35.3, her diabetes pedigree function indicates a low genetic risk for diabetes at 0.263.###\nHence this label was No."
"This data belongs to a 22-year-old female who has never been pregnant. She has a low diastolic blood pressure of 50 and a high triceps skin fold thickness of 36. Her plasma glucose concentration after a glucose tolerance test is 179, with a 2-hour serum insulin level of 159. Despite her young age, she has a high body mass index of 37.8 and a moderate diabetes pedigree function score of 0.455.###\nHence this label was Yes."
"A 25-year-old woman who has been pregnant twice shows no diastolic blood pressure and minimal triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 87 mg/dL, with no significant insulin level detected. She has a body mass index of 28.9, indicating she is overweight, and her diabetes pedigree function score is 0.773, suggesting a moderate genetic risk for diabetes.###\nHence this label was No."
"A 21-year-old woman, who has been pregnant twice, with a low diastolic blood pressure of 60, moderate triceps skin fold thickness of 17, normal plasma glucose concentration of 99 after a glucose tolerance test, high 2-hour serum insulin level of 160, elevated body mass index of 36.6, and a relatively low diabetes pedigree function score of 0.453.###\nHence this label was No."
"This patient is 42 years old and has been pregnant 8 times. They have a relatively normal diastolic blood pressure of 76 and a low triceps skin fold thickness of 0. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 100, and they have no serum insulin level. Despite having a high body mass index of 38.7, their diabetes pedigree function is low at 0.19.###\nHence this label was No."
"This individual is 40 years old and has been pregnant 7 times. They have low diastolic blood pressure of 64 and minimal triceps skin fold thickness. Their glucose level after a GTT is 159, with no insulin present. They have a healthy body mass index of 27.4 and a low diabetes pedigree function of 0.294.###\nHence this label was No."
