"The patient is a 26-year-old woman who is pregnant for the first time. She has a low diastolic blood pressure of 62 and triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 71, with no serum insulin detected. She has a healthy body mass index of 21.8 and a relatively low diabetes pedigree function score of 0.416.###\nHence this label was No."
"The patient is a 42-year-old woman who has been pregnant 9 times. She has a very low diastolic blood pressure of 52 and a triceps skin fold thickness of 0, indicating very low fat content. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106. She has no insulin present in her blood after 2 hours. Despite her low fat content, she has a body mass index of 31.2, indicating that she may be overweight. Her diabetes pedigree function is 0.38, suggesting a low genetic predisposition to diabetes.###\nHence this label was No."
"This individual is a 36-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 72 mmHg, a triceps skin fold thickness of 42 mm, and a plasma glucose concentration of 179 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130 mIU/L and her body mass index is 32.7 kg/m^2. Additionally, she has a diabetes pedigree function score of 0.719. These measurements suggest that she may be at risk for developing diabetes.###\nHence this label was Yes."
"This is a 25-year-old woman who has never been pregnant and shows normal values for diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin. Her plasma glucose concentration after a glucose tolerance test is also within the normal range. However, she has a high body mass index of 35.8 and a low diabetes pedigree function of 0.238, indicating a relatively lower genetic risk for diabetes.###\nHence this label was No."
"This individual is a 45-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 0, indicating low body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 130. She has no detectable 2-hour serum insulin. With a body mass index of 34.2 and a diabetes pedigree function of 0.652, she may be at risk for developing diabetes due to her weight and genetic factors.###\nHence this label was Yes."
"A 29-year-old woman who has been pregnant four times has normal diastolic blood pressure and triceps skin fold thickness. Her glucose levels after a glucose tolerance test are within a healthy range. She does not have insulin present in her system after 2 hours. However, she has a high body mass index, indicating potential risk for diabetes.###\nHence this label was No."
"This patient is a young adult female who has never been pregnant. She has a normal diastolic blood pressure of 70 and a slightly above average triceps skin fold thickness of 38. Her glucose levels after a glucose tolerance test are within normal range at 137. She has low insulin levels and a relatively high body mass index of 33.2, indicating possible obesity. Her diabetes pedigree function score is low at 0.17, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"This is a dataset of a 30-year-old individual who has been pregnant 6 times. Their diastolic blood pressure is 96, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. They have a plasma glucose concentration of 117 after a glucose tolerance test and a body mass index of 28.7. Their diabetes pedigree function is 0.157.###\nHence this label was No."
"A 28-year-old individual who has been pregnant three times has a diastolic blood pressure of 64 and a triceps skin fold thickness of 29. Their plasma glucose concentration after a glucose tolerance test is 129, with a 2-hour serum insulin level of 115. They have a body mass index of 26.4 and a low diabetes pedigree function score of 0.219.###\nHence this label was Yes."
"A 28-year-old individual who has been pregnant 3 times has a diastolic blood pressure of 66 and triceps skin fold thickness of 39. Their plasma glucose concentration after a 2-hour GTT is 115, with a 2-hour serum insulin level of 140. They have a body mass index of 38.1 and a diabetes pedigree function of 0.15.###\nHence this label was No."
"This individual is a 52-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 104 and a body mass index of 37.7, indicating obesity. Her triceps skin fold thickness and 2-hour serum insulin levels are both 0. Despite having a high plasma glucose concentration of 162, her diabetes pedigree function is low at 0.151, suggesting a lower genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 38-year-old woman who has been pregnant 10 times. She has a normal diastolic blood pressure of 82 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 75, and her 2-hour serum insulin level is 0. Despite having a body mass index of 33.3, which is considered overweight, her diabetes pedigree function is low at 0.263.###\nHence this label was No."
"The patient is a 31-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 39. Her plasma glucose concentration after a glucose tolerance test is 184, and her 2-hour serum insulin level is 277. She has a body mass index of 37.0 and a diabetes pedigree function of 0.264.###\nHence this label was Yes."
"A 25-year-old woman who has been pregnant three times has a low diastolic blood pressure of 52 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 121, with a 2-hour serum insulin level of 0. Despite having a high body mass index of 36.0, her diabetes pedigree function is low at 0.127.###\nHence this label was Yes."
"This 35-year-old patient, who has been pregnant 11 times, has a diastolic blood pressure of 74. Although their triceps skin fold thickness and 2-hour serum insulin levels are both at 0, their plasma glucose concentration after a 2-hour oral glucose tolerance test is 85. With a body mass index of 30.1 and a diabetes pedigree function of 0.3, the patient's risk of developing diabetes may be worth monitoring.###\nHence this label was No."
"This is a case of a young 23-year-old woman who has never been pregnant and has a normal diastolic blood pressure, but slightly lower than average triceps skin fold thickness. She has a healthy plasma glucose concentration 2 hours after a glucose tolerance test, high insulin levels, and a moderate body mass index. Her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"A 55-year-old individual, who has been pregnant 6 times, with a diastolic blood pressure of 72. They have a triceps skin fold thickness of 32, plasma glucose concentration of 103 after a glucose tolerance test, and a 2-hour serum insulin level of 190. With a body mass index of 37.7 and a diabetes pedigree function of 0.324, this individual's health data suggests a risk for developing diabetes.###\nHence this label was No."
"A 23-year-old woman, who has been pregnant once, with a diastolic blood pressure of 74, a triceps skin fold thickness of 26, a plasma glucose concentration of 140 after a GTT, 2-hour serum insulin level of 180, a body mass index of 24.1, and a diabetes pedigree function of 0.828.###\nHence this label was No."
"The patient is a 26-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 64, a triceps skin fold thickness of 25, and a plasma glucose concentration of 180 after a glucose tolerance test. Her 2-hour serum insulin level is 70, and she has a body mass index of 34.0. The diabetes pedigree function for this patient is 0.271.###\nHence this label was No."
"This individual is a 59-year-old who has never been pregnant. They have a diastolic blood pressure of 84 and a triceps skin fold thickness of 27. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 137. They have a 2-hour serum insulin level of 0. Their body mass index is 27.3 and their diabetes pedigree function is 0.231.###\nHence this label was No."
"This data describes a young individual, aged 24, who has experienced one pregnancy. Their diastolic blood pressure is low at 54, and their triceps skin fold thickness is relatively low at 13. They have a normal plasma glucose concentration of 119 after a 2-hour oral glucose tolerance test and a moderate serum insulin level of 50. With a body mass index of 22.3, which is within the healthy range, and a low diabetes pedigree function of 0.205, this individual appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"A 21-year-old individual, who has been pregnant once, has a healthy diastolic blood pressure of 66. Additionally, they have a triceps skin fold thickness of 23, a plasma glucose concentration of 89 after a glucose tolerance test, and a 2-hour serum insulin level of 94. Their body mass index is 28.1 and they have a low diabetes pedigree function score of 0.167.###\nHence this label was No."
"The patient is a 52-year-old who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration at 2 hours. Her 2-hour serum insulin level is zero, indicating potential risk for diabetes. She has a high body mass index and a low diabetes pedigree function score.###\nHence this label was Yes."
"This patient is 66 years old and has been pregnant twice. Her diastolic blood pressure is 90, triceps skin fold thickness is 0, and plasma glucose concentration after a glucose tolerance test is 158. Her 2-hour serum insulin is 0, body mass index is 31.6, and diabetes pedigree function is 0.805.###\nHence this label was Yes."
"The patient is a 24-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 45 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 112 mg/dL, with a 2-hour serum insulin level of 132 μU/mL. She has a body mass index of 34.8 kg/m² and a diabetes pedigree function of 0.217.###\nHence this label was No."
"This individual is a 41-year-old woman who has been pregnant 10 times. She has a low diastolic blood pressure of 68 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 122, with no insulin detected in her serum. Despite having a body mass index of 31.2, indicating overweight, her diabetes pedigree function is relatively low at 0.258.###\nHence this label was No."
"A 54-year-old individual, who has been pregnant 7 times, with diastolic blood pressure of 78 and triceps skin fold thickness of 29. Their plasma glucose concentration after a glucose tolerance test is 150, with a 2-hour serum insulin level of 126. They have a body mass index of 35.2 and a diabetes pedigree function value of 0.692.###\nHence this label was Yes."
"This is a data record of a 24-year-old individual who has been pregnant twice. Their diastolic blood pressure is 80, triceps skin fold thickness is 14, plasma glucose concentration after a glucose tolerance test is 90, 2-hour serum insulin level is 55, body mass index is 24.4, and diabetes pedigree function is 0.249.###\nHence this label was No."
"This 44-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 76. Their triceps skin fold thickness is 0, indicating low body fat. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 115. They have no serum insulin after 2 hours and a body mass index of 31.2, suggesting overweight. The diabetes pedigree function score is 0.343, indicating a low genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 39 mm. Her plasma glucose concentration is 187 mg/dL after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 304 uU/mL. She has a body mass index of 37.7 kg/m^2 and a diabetes pedigree function of 0.254.###\nHence this label was Yes."
"A 24-year-old woman who has been pregnant twice has a relatively low diastolic blood pressure of 65. She has a moderate triceps skin fold thickness of 28 and a normal plasma glucose concentration of 83 after a glucose tolerance test. Her 2-hour serum insulin level is slightly elevated at 66, and she has a high body mass index of 36.8. Her diabetes pedigree function score is 0.629, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is a 28-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 21. Her plasma glucose concentration after a GTT is 131 and her 2-hour serum insulin level is 166. She has a body mass index of 33.1 and a diabetes pedigree function of 0.16.###\nHence this label was No."
"This individual is a 60-year-old who has been pregnant 5 times. Despite having a low diastolic blood pressure of 75, their triceps skin fold thickness is 26, indicating higher body fat percentage. The plasma glucose concentration after a glucose tolerance test is 109, which is within the normal range. However, the 2-hour serum insulin level is 0, suggesting potential insulin sensitivity issues. With a body mass index of 36.0 and a moderate diabetes pedigree function of 0.546, this person may have an increased risk of developing diabetes.###\nHence this label was No."
"A 22-year-old woman who has never been pregnant shows slightly elevated diastolic blood pressure and normal triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is high, accompanied by elevated serum insulin levels. She has a body mass index in the obese range and a moderate diabetes pedigree score.###\nHence this label was Yes."
"This data describes a 41-year-old individual who has been pregnant 12 times. They have a diastolic blood pressure of 85, a triceps skin fold thickness of 33, and a body mass index of 37.4. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 140, and their 2-hour serum insulin level is 0. The diabetes pedigree function for this individual is 0.244.###\nHence this label was No."
"A 57-year-old individual who has been pregnant 13 times with a diastolic blood pressure of 82. They have a triceps skin fold thickness of 19, plasma glucose concentration of 145 after a glucose tolerance test, and 110 serum insulin level after 2 hours. Their body mass index is 22.2, and they have a diabetes pedigree function of 0.245.###\nHence this label was No."
"The patient is a 37-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 72, a triceps skin fold thickness of 12, and a body mass index of 22.1. Her plasma glucose concentration after a glucose tolerance test is 116, and her 2-hour serum insulin level is 87. The diabetes pedigree function indicates a moderate genetic risk for diabetes at 0.463.###\nHence this label was No."
"The patient is a 26-year-old woman who has been pregnant 3 times. She has a healthy diastolic blood pressure of 62 and a relatively low triceps skin fold thickness of 19. Her glucose levels are normal at 99, and her insulin levels are also within the normal range at 74. She has a low body mass index of 21.8 and a low diabetes pedigree function score of 0.279. Overall, the data suggests that she is at a lower risk for developing diabetes.###\nHence this label was No."
"The patient is a 44-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 80 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour GTT is 132, and she has no insulin present in her serum. She has a high body mass index of 34.4 and a low diabetes pedigree function of 0.402.###\nHence this label was Yes."
"This individual is 37 years old and has been pregnant 5 times. They have a diastolic blood pressure of 82 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 130, with a 2-hour serum insulin level of 0. They have a body mass index of 39.1 and a diabetes pedigree function of 0.956.###\nHence this label was Yes."
"The patient is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 94 and a triceps skin fold thickness of 33. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 143, with a 2-hour serum insulin level of 146. She has a body mass index of 36.6 and a diabetes pedigree function value of 0.254.###\nHence this label was Yes."
"The individual is a 45-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 94 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 183, with a 2-hour serum insulin level of 0. She has a body mass index of 40.8 and a diabetes pedigree function of 1.461.###\nHence this label was No."
"This 21-year-old individual, who has been pregnant once, has normal diastolic blood pressure and a healthy body mass index. Their triceps skin fold thickness is average, and their plasma glucose concentration after a glucose tolerance test is within a healthy range. They have very low insulin levels and a low diabetes pedigree function score, indicating a low risk of developing diabetes.###\nHence this label was No."
"This is a profile of a 38-year-old individual with a high risk of developing diabetes. They have been pregnant 12 times and have a diastolic blood pressure of 70. Their triceps skin fold thickness is 40, indicating excess body fat. The individual's plasma glucose concentration after a glucose tolerance test is 151, and their 2-hour serum insulin level is high at 271. With a body mass index of 41.8 and a diabetes pedigree function of 0.742, this person shows multiple indicators of high diabetes risk.###\nHence this label was Yes."
"A 51-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 84 mmHg. They have a triceps skin fold thickness of 21 mm and a plasma glucose concentration of 181 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 192 mu U/ml and they have a body mass index of 35.9. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes at 0.586.###\nHence this label was Yes."
"This 28-year-old individual, who has been pregnant 5 times, shows normal diastolic blood pressure and zero triceps skin fold thickness. They have a relatively high plasma glucose concentration after a 2-hour oral glucose tolerance test, combined with low 2-hour serum insulin levels. Despite having a slightly elevated body mass index, their diabetes pedigree function is on the lower side.###\nHence this label was No."
"This 26-year-old individual has been pregnant twice and has a diastolic blood pressure of 68. Their triceps skin fold thickness is 25, plasma glucose concentration after a glucose tolerance test is 100, and 2-hour serum insulin is 71. With a body mass index of 38.5 and a diabetes pedigree function of 0.324, this person's risk of developing diabetes may need to be monitored closely.###\nHence this label was No."
"This 28-year-old individual has been pregnant 6 times and has normal diastolic blood pressure. They have no skin fold thickness, low glucose concentration, and no serum insulin level. With a low body mass index and a relatively low diabetes pedigree function, this person appears to be at a low risk for developing diabetes.###\nHence this label was No."
"A 55-year-old individual, who has been pregnant 7 times, with a diastolic blood pressure of 70, triceps skin fold thickness of 33, plasma glucose concentration after a glucose tolerance test of 195, 2-hour serum insulin level of 145, and a body mass index of 25.1, shows a low diabetes pedigree function of 0.163.###\nHence this label was Yes."
"A 32-year-old woman who has never been pregnant, with normal diastolic blood pressure, no triceps skin fold thickness, and slightly elevated plasma glucose concentration after a glucose tolerance test. She has no insulin production after 2 hours, but has a high body mass index and a moderate diabetes pedigree function score.###\nHence this label was Yes."
"This data belongs to a 21-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 60 and a moderate triceps skin fold thickness of 23. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 130, and she has a high level of 2-hour serum insulin at 170. With a body mass index of 28.6, she is in the overweight range. Her diabetes pedigree function, a measure of hereditary risk, is 0.692, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This data is from a young adult woman who is 22 years old and has been pregnant once. She has a healthy diastolic blood pressure of 60 and a moderately high triceps skin fold thickness of 37. Her glucose levels after a GTT test are within normal range at 87, while her insulin levels are slightly elevated at 75. Despite this, her body mass index is high at 37.2, indicating she may be overweight. The diabetes pedigree function suggests a low genetic risk for developing diabetes. Overall, this individual's health profile shows some concerning factors such as high BMI and insulin levels, but her glucose levels and genetic predisposition to diabetes are relatively low.###\nHence this label was No."
"This individual is a 21-year-old who has never been pregnant. Their diastolic blood pressure is 62, triceps skin fold thickness is 17, and plasma glucose concentration after a glucose tolerance test is 139. Their 2-hour serum insulin level is 210, body mass index is 22.1, and diabetes pedigree function is 0.207. Overall, these measurements indicate a relatively healthy individual with a moderate risk of developing diabetes.###\nHence this label was No."
"A 22-year-old individual who has been pregnant twice, with a healthy diastolic blood pressure of 62. They have no triceps skin fold thickness and a normal plasma glucose concentration of 91. Their 2-hour serum insulin level is low at 0, and their body mass index is within a healthy range at 27.3. The diabetes pedigree function indicates a moderate genetic risk of developing diabetes at 0.525.###\nHence this label was No."
"The patient is a 46-year-old woman who has been pregnant 4 times. She has a normal diastolic blood pressure of 72 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115, and she has no insulin present. With a body mass index of 28.9 and a low diabetes pedigree function of 0.376, she appears to be at low risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 31-year-old female who has been pregnant twice. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 37 mm. Her glucose level after a 2-hour oral glucose tolerance test is 128 mg/dL and her serum insulin level is 182 μU/mL. With a body mass index of 43.3, she has a high risk of developing diabetes as indicated by her diabetes pedigree function of 1.224.###\nHence this label was Yes."
"The data describes a 70-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 82, triceps skin fold thickness of 18, and a plasma glucose concentration of 145 after a 2-hour oral glucose tolerance test. The individual has 0 insulin levels after 2 hours, a body mass index of 32.5, and a diabetes pedigree function value of 0.235.###\nHence this label was Yes."
"A 27-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure and low insulin levels. She has a healthy body mass index and a moderate diabetes pedigree function. Her triceps skin fold thickness is within normal range, and her plasma glucose concentration after a glucose tolerance test is also normal.###\nHence this label was No."
"The patient is a 29-year-old who has never been pregnant. Their diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin levels are all at 0. However, their plasma glucose concentration after a glucose tolerance test is 141, and their body mass index is 42.4, indicating a high risk of developing diabetes. The patient also has a low diabetes pedigree function of 0.205.###\nHence this label was Yes."
"This 37-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 72. Their triceps skin fold thickness is 29, plasma glucose concentration from an oral glucose tolerance test is 154, and 2-hour serum insulin level is 126. With a body mass index of 31.3 and a diabetes pedigree function of 0.338, this data suggests a profile that warrants monitoring for potential diabetes risk.###\nHence this label was No."
"A 32-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 102, with no serum insulin detected. She has a body mass index of 29.5 and a low diabetes pedigree function score of 0.121.###\nHence this label was No."
"The patient is 49 years old and has been pregnant 9 times. She has normal diastolic blood pressure and a moderately thick triceps skin fold. Her glucose levels are elevated after a 2-hour oral glucose tolerance test. She has low insulin levels, a high body mass index, and a family history of diabetes.###\nHence this label was Yes."
"The individual is a 25-year-old woman who has never been pregnant. Her diastolic blood pressure is within normal range at 64. She has a healthy triceps skin fold thickness of 36. Her glucose tolerance test results show a normal plasma glucose concentration of 97. Her 2-hour serum insulin level is 100, indicating good insulin sensitivity. Despite having a slightly high body mass index of 36.8, her diabetes pedigree function is low at 0.6, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"A 27-year-old individual who has been pregnant 6 times with a diastolic blood pressure of 78, a triceps skin fold thickness of 41, a plasma glucose concentration of 154 after a GTT, a 2-hour serum insulin level of 140, a body mass index of 46.1, and a diabetes pedigree function of 0.571.###\nHence this label was No."
