"The patient is a young adult woman, 26 years old, who is pregnant for the first time. She has low diastolic blood pressure and a slightly below average triceps skin fold thickness. Her glucose levels after a 2-hour oral glucose tolerance test are normal. However, her serum insulin levels are higher than usual. She has a high body mass index and a relatively low diabetes pedigree function score.###\nHence this label was Yes."
"This individual is a 24-year-old female who has never been pregnant. She has a diastolic blood pressure of 85 mmHg and a triceps skin fold thickness of 25 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 95 mg/dL, and her 2-hour serum insulin level is 36 μU/mL. With a body mass index of 37.4, she has a low diabetes pedigree function score of 0.247.###\nHence this label was Yes."
"The individual is 33 years old and has been pregnant 9 times. They have a low diastolic blood pressure of 62 and a minimal triceps skin fold thickness. Their glucose concentration after a 2-hour GTT is 89, with no insulin detected. With a lean body mass index of 22.5 and a low diabetes pedigree function of 0.142, this individual appears to have a relatively low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"This 21-year-old individual has been pregnant three times and has low diastolic blood pressure, low triceps skin fold thickness, and a normal plasma glucose concentration after a glucose tolerance test. They have very low serum insulin levels, a healthy body mass index, and a moderately low diabetes pedigree function score.###\nHence this label was No."
"The person in the data is 40 years old, has been pregnant 6 times, and has a diastolic blood pressure of 72. They have a triceps skin fold thickness of 27, plasma glucose concentration of 144 after a glucose tolerance test, and a 2-hour serum insulin level of 228. Their body mass index is 33.9, and their diabetes pedigree function is 0.255.###\nHence this label was No."
"This individual is 26 years old and has been pregnant 6 times. They have a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. Their plasma glucose concentration after a glucose tolerance test is 114. They have a body mass index of 0.0 and a diabetes pedigree function of 0.189.###\nHence this label was No."
"A 24-year-old woman who is pregnant for the first time has a very low diastolic blood pressure of 54. Despite having a low triceps skin fold thickness of 13, her plasma glucose concentration after a glucose tolerance test is at a normal level of 119. Her 2-hour serum insulin is also within a healthy range at 50. With a lean body mass index of 22.3 and a low diabetes pedigree function of 0.205, she appears to be at low risk for developing diabetes.###\nHence this label was No."
"The patient is a 30-year-old who has been pregnant 10 times. Despite having a normal diastolic blood pressure and triceps skin fold thickness of 0, their plasma glucose concentration after a glucose tolerance test is 115. Additionally, their 2-hour serum insulin is 0 and their body mass index is unusually low at 0.0. They have a low diabetes pedigree function score of 0.261.###\nHence this label was Yes."
"This individual is 37 years old and has been pregnant 4 times. They have a healthy diastolic blood pressure of 72 mmHg. Their triceps skin fold thickness is 29 mm. After a glucose tolerance test, their plasma glucose concentration at 2 hours is 154 mg/dL, and their 2-hour serum insulin level is 126 μU/mL. They have a body mass index (BMI) of 31.3, indicating they may be overweight. The diabetes pedigree function, which predicts the likelihood of diabetes based on family history, is 0.338, suggesting a moderate genetic risk for diabetes.###\nHence this label was No."
"This 35-year-old individual has been pregnant 6 times and shows low diastolic blood pressure of 44. They have a moderate triceps skin fold thickness of 20, and a normal plasma glucose concentration of 108 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is elevated at 130, contributing to a healthy body mass index of 24.0. The diabetes pedigree function score is 0.813, indicating a low risk for developing diabetes.###\nHence this label was No."
"This data represents a 30-year-old individual who has been pregnant once. They have a diastolic blood pressure of 64, triceps skin fold thickness of 32, plasma glucose concentration of 122 after a GTT, 2-hour serum insulin level of 156, and a body mass index of 35.1. The diabetes pedigree function value is 0.692.###\nHence this label was Yes."
"A 24-year-old female has been pregnant 3 times. Despite having a low diastolic blood pressure of 64, she has a high triceps skin fold thickness of 13. Her plasma glucose concentration at 2 hours is elevated at 158, along with a high 2-hour serum insulin level of 387. She has a body mass index of 31.2 and a relatively low diabetes pedigree function of 0.295.###\nHence this label was No."
"A 24-year-old individual who has been pregnant 5 times shows relatively normal diastolic blood pressure (68 mmHg) and moderate triceps skin fold thickness (28 mm). Their plasma glucose concentration after a 2-hour oral glucose tolerance test is on the lower side (86 mg/dL), while their 2-hour serum insulin level is slightly elevated (71 mu U/ml). Despite having a slightly high body mass index (30.2), their diabetes pedigree function is relatively low (0.364), indicating a lower genetic risk for diabetes.###\nHence this label was No."
"The patient is a 29-year-old woman who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. However, her plasma glucose concentration after a glucose tolerance test is 141, indicating a possibility of high blood sugar levels. She has a high body mass index of 42.4 and a relatively low diabetes pedigree function score of 0.205, suggesting a moderate genetic risk for diabetes.###\nHence this label was Yes."
"A 29-year-old woman, who has been pregnant 2 times, is in good health with a diastolic blood pressure of 80. She has a slightly above average triceps skin fold thickness of 45, but her plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 105. She has high insulin levels at 191, and her body mass index indicates she is overweight at 33.7. Her diabetes pedigree function score is relatively low at 0.711, suggesting a lower genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 31-year-old who has been pregnant 4 times. Their diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin levels are all at 0. However, their plasma glucose concentration after a glucose tolerance test is 90, and they have a body mass index of 28.0. The patient also has a diabetes pedigree function value of 0.61.###\nHence this label was No."
"The patient is a 62-year-old female who is pregnant for the first time. She has very low diastolic blood pressure, no triceps skin fold thickness, and a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are also normal. She has a healthy body mass index and a moderate diabetes pedigree function score.###\nHence this label was No."
"A 51-year-old individual, who has been pregnant 7 times, with a diastolic blood pressure of 74. Their triceps skin fold thickness is 26 and plasma glucose concentration after a glucose tolerance test is 136. Additionally, their 2-hour serum insulin level is 135. The individual has a body mass index of 26.0 and a diabetes pedigree function of 0.647.###\nHence this label was No."
"The patient is a 43-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 82 and triceps skin fold thickness of 25. Her plasma glucose concentration after a glucose tolerance test is 95, with a 2-hour serum insulin level of 180. She has a body mass index of 35.0 and a diabetes pedigree function of 0.233.###\nHence this label was Yes."
"The patient is a 26-year-old female who has never been pregnant. She has a diastolic blood pressure of 94 mmHg and a triceps skin fold thickness of 46 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 135 mg/dL, and her 2-hour serum insulin level is 145 mu U/mL. She has a body mass index of 40.6, indicating obesity. The diabetes pedigree function, which assesses the hereditary risk of diabetes, is 0.284. Overall, the patient exhibits some risk factors for diabetes, such as high BMI and elevated insulin levels, but does not currently have the condition.###\nHence this label was No."
"This patient is a 69-year-old female who has been pregnant 5 times. She has a normal diastolic blood pressure of 80 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a GTT is 132, and she has no serum insulin present. This patient has a healthy body mass index of 26.8 and a low diabetes pedigree function of 0.186.###\nHence this label was No."
"The patient is a 21-year-old female who has never been pregnant. She has a normal diastolic blood pressure of 60 mmHg and a moderate triceps skin fold thickness of 35 mm. Her plasma glucose concentration after a glucose tolerance test is slightly elevated at 138 mg/dL. The 2-hour serum insulin level is high at 167 μU/mL. She has a body mass index of 34.6, indicating obesity. The diabetes pedigree function value is 0.534, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"A 36-year-old woman who has been pregnant 4 times shows slightly elevated diastolic blood pressure of 90. Despite a normal 2-hour serum insulin level, she has a higher-than-normal plasma glucose concentration of 151 after an oral glucose tolerance test. With a moderate triceps skin fold thickness of 38 and a slightly elevated body mass index of 29.7, her risk of developing diabetes may be influenced by genetic factors, as indicated by her diabetes pedigree function of 0.294.###\nHence this label was No."
"The patient is a 48-year-old individual who has been pregnant 5 times. Their diastolic blood pressure is 74, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. Despite having a plasma glucose concentration of 104, their body mass index is 28.8, and their diabetes pedigree function is 0.153.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 0, triceps skin fold thickness of 0, 2-hour serum insulin of 0, and a body mass index of 0.0. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 80, and her diabetes pedigree function is 0.174.###\nHence this label was No."
"A 22-year-old individual, who is 1-time pregnant, with a below-average diastolic blood pressure of 56 and a low triceps skin fold thickness of 11. Their plasma glucose concentration after a GTT is within normal range at 93, and their 2-hour serum insulin level is at 0. With a healthy body mass index of 22.5 and a low diabetes pedigree function of 0.417, this individual shows a low risk for developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant twice. She has a diastolic blood pressure of 60 mmHg and a triceps skin fold thickness of 18 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122 mg/dL, and her 2-hour serum insulin level is 106 μU/mL. She has a body mass index of 29.8 kg/m² and a diabetes pedigree function of 0.717.###\nHence this label was No."
"A 36-year-old woman who has been pregnant 5 times shows low diastolic blood pressure (62) and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is low (44) with no serum insulin detected. Despite having a normal body mass index of 25.0, she has a slightly elevated diabetes pedigree function score of 0.587.###\nHence this label was No."
"The patient is a 26-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 56, triceps skin fold thickness of 17, and a plasma glucose concentration of 96. Her 2-hour serum insulin level is 49, and she has a body mass index of 20.8. The diabetes pedigree function for this patient is 0.34.###\nHence this label was No."
"This data describes a 21-year-old individual who has been pregnant twice. They have a low diastolic blood pressure of 64 and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 108, and their 2-hour serum insulin level is 0. The individual has a body mass index of 30.8 and a diabetes pedigree function value of 0.158.###\nHence this label was No."
"The patient is a 31-year-old female who has never been pregnant. She has a low diastolic blood pressure of 65 and a normal body mass index of 24.6. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0. However, her plasma glucose concentration after a glucose tolerance test is 111, indicating a slightly elevated but still within normal range. The patient has a diabetes pedigree function score of 0.66, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 25-year-old female who has been pregnant twice. She has a very low diastolic blood pressure of 60 and a triceps skin fold thickness of 0, indicating low body fat. Her plasma glucose concentration is within normal range at 90. The 2-hour serum insulin level is 0, suggesting normal insulin production. Despite having a healthy body mass index of 23.5, she has a low diabetes pedigree function score of 0.191, indicating a lower risk for developing diabetes.###\nHence this label was No."
"A 27-year-old individual who has been pregnant twice shows a normal diastolic blood pressure of 70. Their triceps skin fold thickness is relatively low at 16, and their plasma glucose concentration after a GTT is 99. The 2-hour serum insulin level is 44, indicating adequate insulin production. With a body mass index of 20.4 and a low diabetes pedigree function score of 0.235, this individual appears to have a relatively low risk of developing diabetes.###\nHence this label was No."
"This is a 42-year-old individual who has been pregnant 11 times and has a diastolic blood pressure of 84. Their triceps skin fold thickness is 35, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 136. They have a 2-hour serum insulin level of 130 and a body mass index of 28.3. Their diabetes pedigree function is 0.26.###\nHence this label was Yes."
"The patient is a 31-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 70 and a high triceps skin fold thickness of 39. Her glucose levels are elevated with a plasma glucose concentration of 197 and a high 2-hour serum insulin level of 744. She has a high body mass index of 36.7 and a moderately elevated diabetes pedigree function of 2.329.###\nHence this label was No."
"The individual is a 21-year-old who has never been pregnant and has a healthy diastolic blood pressure of 70. They have a moderate triceps skin fold thickness of 26, normal plasma glucose levels of 100 after a glucose tolerance test, and a moderate insulin level of 50. Their body mass index is in the overweight range at 30.8, and they have a low diabetes pedigree function score of 0.597.###\nHence this label was No."
"The patient is a 52-year-old female who has been pregnant once. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 29 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 168 mg/dL. She has no detectable insulin levels after a 2-hour serum test. With a body mass index of 35.0, she has a moderate risk of developing diabetes, as indicated by her diabetes pedigree function of 0.905.###\nHence this label was Yes."
"This individual is a 21-year-old who has never been pregnant. They have a low diastolic blood pressure of 62 and a low triceps skin fold thickness of 17. Their glucose levels after a GTT are within normal range at 139, but their insulin levels are high at 210. They have a healthy body mass index of 22.1 and a low diabetes pedigree function score of 0.207.###\nHence this label was No."
"This is a young adult female who has never been pregnant. She has a low diastolic blood pressure of 65 mmHg and a healthy body mass index of 24.6. Her triceps skin fold thickness is normal at 28mm. Although she has a low insulin level of 0, her glucose concentration after a glucose tolerance test is within the normal range at 101 mg/dL. Her diabetes pedigree function score is low at 0.237, indicating a relatively lower risk of developing diabetes.###\nHence this label was No."
"This is a 35-year-old woman who has never been pregnant and shows elevated diastolic blood pressure, high plasma glucose levels, and high body mass index. Despite having a relatively low triceps skin fold thickness, her 2-hour serum insulin level is also high. The diabetes pedigree function score suggests a modest genetic predisposition to diabetes.###\nHence this label was Yes."
"This data describes a young adult, aged 21 years old, who has never been pregnant. She has a low diastolic blood pressure of 64 mmHg and a relatively healthy triceps skin fold thickness of 22 mm. Her glucose tolerance test results show a normal plasma glucose concentration of 84 mg/dL and a moderate insulin level of 66 µU/mL. Despite having a high body mass index of 35.8, her diabetes pedigree function indicates a low genetic risk of developing diabetes.###\nHence this label was No."
"The data describes a 52-year-old individual who has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and a moderate plasma glucose concentration 2 hours after consuming glucose. The individual has no serum insulin level, but a high body mass index. Their diabetes pedigree function value is low, indicating a lower genetic risk for diabetes.###\nHence this label was Yes."
"A 58-year-old individual, who has been pregnant 12 times, with a diastolic blood pressure of 82. Their triceps skin fold thickness measures 43, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 140. The 2-hour serum insulin level is 325, and they have a body mass index of 39.2. Their diabetes pedigree function is calculated as 0.528.###\nHence this label was Yes."
"A 44-year-old individual who has been pregnant three times has a diastolic blood pressure of 80. They have no triceps skin fold thickness and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 132. The 2-hour serum insulin level is 0, and their body mass index is 34.4. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.402.###\nHence this label was Yes."
"This data belongs to a 22-year-old individual who is pregnant for the first time. They have a healthy diastolic blood pressure of 70 and slightly above-average triceps skin fold thickness of 28. Their plasma glucose concentration after a glucose tolerance test is normal at 106. However, their 2-hour serum insulin levels are high at 135. The individual has a body mass index indicating obesity at 34.2 and a low diabetes pedigree function score of 0.142.###\nHence this label was No."
"The patient is a 41-year-old female who has been pregnant 7 times. She has a low diastolic blood pressure of 78 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 62, and she has no detectable insulin levels at the 2-hour mark. Despite her low insulin levels, she has a body mass index of 32.6, indicating she is overweight. Her diabetes pedigree function score is 0.391, suggesting a moderate genetic risk of diabetes.###\nHence this label was No."
"This 40-year-old individual has been pregnant 6 times and has a low diastolic blood pressure of 60. Their triceps skin fold thickness is 39, indicating a moderate amount of subcutaneous fat. Their glucose level after a 2-hour oral glucose tolerance test is 115, which is within a normal range. However, their insulin level at 2 hours is 0, suggesting potential insulin sensitivity issues. With a high body mass index of 33.7, this person may be at risk for developing diabetes. The diabetes pedigree function score of 0.245 indicates a slight genetic predisposition to the condition.###\nHence this label was Yes."
"A 28-year-old woman, who has been pregnant three times, with a healthy diastolic blood pressure of 72. She has a normal triceps skin fold thickness of 32 and a low 2-hour serum insulin level of 0. Despite her slightly elevated body mass index of 37.2, her plasma glucose concentration at 2 hours in an oral glucose tolerance test is within a normal range at 84. Additionally, her diabetes pedigree function is low at 0.267, suggesting a lower risk of developing diabetes.###\nHence this label was No."
"The patient is a 60-year-old woman who has been pregnant 5 times. She has a healthy diastolic blood pressure of 75 and a slightly above average triceps skin fold thickness of 26. Her plasma glucose concentration after a GTT is normal at 109, while her 2-hour serum insulin level is low at 0. She has a high body mass index of 36.0, indicating overweight. The diabetes pedigree function score is moderate at 0.546.###\nHence this label was No."
"The individual is a 35-year-old woman who has been pregnant 11 times. She has a normal diastolic blood pressure of 74 and a low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85, while her 2-hour serum insulin level is 0. Despite having a body mass index of 30.1, her diabetes pedigree function is low at 0.3.###\nHence this label was No."
"This is a 25-year-old individual who has never been pregnant and has a diastolic blood pressure of 62. They have a triceps skin fold thickness of 30, a plasma glucose concentration of 107 after a GTT, and a 2-hour serum insulin level of 74. With a body mass index of 36.6 and a diabetes pedigree function of 0.757, this person's risk of developing diabetes may be influenced by these factors.###\nHence this label was Yes."
"The patient is a 36-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 82, a triceps skin fold thickness of 32, and a body mass index of 34.2. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 112, and her 2-hour serum insulin level is 175. Additionally, her diabetes pedigree function is 0.26.###\nHence this label was Yes."
"The patient is a 22-year-old female who is pregnant for the first time. She has low diastolic blood pressure, a thin triceps skin fold thickness, and normal plasma glucose concentration after a glucose tolerance test. Her insulin levels are within the normal range. She has a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was No."
"The patient is a 22-year-old female who has never been pregnant. She has a very low diastolic blood pressure of 52 and a low triceps skin fold thickness of 10. Her glucose tolerance test result is also low at 74, as well as her insulin level at 36. However, her body mass index is within a healthy range at 27.8. The diabetes pedigree function score indicates a low genetic risk for diabetes at 0.269.###\nHence this label was No."
"The patient is a 47-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 23. Her plasma glucose concentration after a glucose tolerance test is 161 and her 2-hour serum insulin level is 132. She has a body mass index of 25.5 and a diabetes pedigree function of 0.326.###\nHence this label was Yes."
"A 21-year-old individual who is pregnant for the first time has normal diastolic blood pressure and a healthy body mass index. Their triceps skin fold thickness is within a healthy range, and their plasma glucose concentration after a glucose tolerance test is slightly below the normal range. They have no insulin present in their blood and a moderately low diabetes pedigree function score.###\nHence this label was Yes."
"This individual is a 21-year-old female who is pregnant for the first time. Her diastolic blood pressure is low at 55 mmHg, and she has no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 80 mg/dL, and she has no serum insulin after 2 hours. With a body mass index of 19.1, she is considered underweight. Her diabetes pedigree function value is 0.258, indicating a low genetic risk for diabetes.###\nHence this label was No."
"A 57-year-old individual who has been pregnant 8 times shows normal diastolic blood pressure and very low triceps skin fold thickness. Their glucose levels after a 2-hour oral glucose tolerance test are in the normal range, with no insulin present. Despite a high body mass index, their diabetes pedigree function score is relatively low.###\nHence this label was No."
"The patient is a young adult woman who has never been pregnant. She has a low diastolic blood pressure of 58 and a healthy body mass index of 26.4. Her triceps skin fold thickness is 20, indicating a moderate amount of body fat. Her plasma glucose concentration after a glucose tolerance test is 134, which is within the normal range. However, her 2-hour serum insulin level is high at 291, suggesting possible insulin resistance. Despite this, her diabetes pedigree function is low at 0.352, indicating a lower risk of developing diabetes based on family history.###\nHence this label was No."
"A 37-year-old woman, who has been pregnant 7 times, with a diastolic blood pressure of 70 and a triceps skin fold thickness of 33, underwent a glucose tolerance test, which revealed a plasma glucose concentration of 124. Her 2-hour serum insulin level was measured at 215, and she has a body mass index of 25.5. Her diabetes pedigree function is calculated at 0.161.###\nHence this label was No."
"This 24-year-old individual has been pregnant 4 times and shows low diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 114, with no serum insulin present. They have a body mass index of 28.9 and a low diabetes pedigree function of 0.126.###\nHence this label was No."
"The patient is a 42-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 23. Her blood sugar levels are low at 65 after a 2-hour glucose tolerance test, and she has no insulin present in her serum. Despite having a moderately high body mass index of 32.0, her diabetes pedigree function is relatively low at 0.6, indicating a lower risk of developing diabetes.###\nHence this label was No."
"This patient is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 94, a triceps skin fold thickness of 33, and a body mass index of 36.6, indicating she may be overweight. Her plasma glucose concentration after a glucose tolerance test is 143, and she has a 2-hour serum insulin level of 146. The diabetes pedigree function score is 0.254, suggesting a low to moderate genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 45-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a GTT is 164, and her 2-hour serum insulin level is 0. Her body mass index is 32.8, and she has a low diabetes pedigree function of 0.148.###\nHence this label was Yes."
"The patient is a young woman, 21 years old, who is pregnant for the first time. She has a normal diastolic blood pressure of 64 and a healthy body mass index of 29.2. Her triceps skin fold thickness is within normal range at 24. The patient has a low plasma glucose concentration of 91 and no 2-hour serum insulin detected. Additionally, her diabetes pedigree function is low at 0.192, indicating a lower risk for developing diabetes.###\nHence this label was No."
"A 66-year-old patient, who has been pregnant twice, with a diastolic blood pressure of 90, no triceps skin fold thickness, a plasma glucose concentration of 158 after a GTT test, no 2-hour serum insulin, a body mass index of 31.6, and a diabetes pedigree function of 0.805.###\nHence this label was Yes."
"This individual is a 32-year-old who has been pregnant 8 times. Despite having a low diastolic blood pressure of 64, they have a high plasma glucose concentration of 183. Their triceps skin fold thickness and 2-hour serum insulin levels are both at 0. With a body mass index of 23.3 and a diabetes pedigree function of 0.672, this individual may have a risk of developing diabetes that needs to be monitored.###\nHence this label was Yes."
"This is a 23-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 74 and a triceps skin fold thickness of 30. Their plasma glucose concentration after a GTT is 107, and their 2-hour serum insulin level is 100. With a body mass index of 33.6 and a diabetes pedigree function of 0.404, this person's risk of developing diabetes may be elevated.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant 3 times. She has low diastolic blood pressure of 54 and her triceps skin fold thickness is 0. Her plasma glucose concentration after a glucose tolerance test is 139. She has no insulin present in her serum after 2 hours. Her body mass index is 25.6 and her diabetes pedigree function is 0.402.###\nHence this label was Yes."
"The patient is a 46-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 62, triceps skin fold thickness of 32, and a plasma glucose concentration of 92 after a glucose tolerance test. Her 2-hour serum insulin level is 126, and she has a body mass index of 32.0. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.085.###\nHence this label was No."
"The patient is a 45-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 84 and a triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 111, with a 2-hour serum insulin level of 0. She has a body mass index of 46.8 and a diabetes pedigree function score of 0.925.###\nHence this label was Yes."
"The patient is a 24-year-old female who is pregnant for the first time. She has low diastolic blood pressure, average triceps skin fold thickness, high plasma glucose concentration, very high serum insulin levels, a normal body mass index, and a moderate diabetes pedigree function score.###\nHence this label was No."
"A 24-year-old female who has never been pregnant has a diastolic blood pressure of 84 and a triceps skin fold thickness of 29. Her plasma glucose concentration is 126, with a 2-hour serum insulin level of 215. She has a body mass index of 30.7 and a diabetes pedigree function of 0.52.###\nHence this label was No."
"This 23-year-old patient, who is pregnant for the first time, has a relatively low diastolic blood pressure of 58. Despite having a slightly above-average body mass index of 33.3, their plasma glucose concentration after a glucose tolerance test is within a normal range at 118. Additionally, their 2-hour serum insulin level is 94, indicating good insulin production. The patient's triceps skin fold thickness is 36, suggesting a healthy amount of subcutaneous fat. The diabetes pedigree function value of 0.261 indicates a moderate genetic predisposition to diabetes. Overall, this individual appears to have a generally healthy metabolic profile with no immediate signs of diabetes risk.###\nHence this label was No."
"A 51-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 84. Their triceps skin fold thickness is 21, plasma glucose concentration after a GTT is 181, and 2-hour serum insulin is 192. They have a body mass index of 35.9 and a diabetes pedigree function of 0.586. These measurements provide insight into their risk of developing diabetes.###\nHence this label was Yes."
"A 38-year-old individual who has been pregnant 4 times with normal diastolic blood pressure and high triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is slightly elevated. They have low insulin levels, high body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was No."
"This 42-year-old patient has been pregnant 6 times and has a diastolic blood pressure of 78. Their triceps skin fold thickness is 0, indicating very low fat under the skin. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 85, which is within the normal range. However, their 2-hour serum insulin level is 0, suggesting a potential issue with insulin production. The patient's body mass index is 31.2, indicating they are overweight. Their diabetes pedigree function is 0.382, which may suggest a genetic predisposition to diabetes.###\nHence this label was No."
"A 24-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure and a moderately high triceps skin fold thickness. Her plasma glucose concentration after a 2-hour glucose tolerance test is elevated, along with a high level of serum insulin. Despite this, her body mass index is within a healthy range. The diabetes pedigree function indicates a relatively low genetic risk of diabetes.###\nHence this label was Yes."
"This data belongs to a 22-year-old individual who has been pregnant twice. They have a relatively low diastolic blood pressure of 60 and a healthy body mass index of 34.7. Despite having a high 2-hour serum insulin level of 120, their plasma glucose concentration after an oral glucose tolerance test is only 98, indicating a normal blood sugar level. The individual also has a moderate triceps skin fold thickness of 17 and a minimal diabetes pedigree function value of 0.198.###\nHence this label was No."
"The individual in the data is a 26-year-old with 2 pregnancies. They have a diastolic blood pressure of 68, a triceps skin fold thickness of 25, and a plasma glucose concentration of 100 after a glucose tolerance test. Their 2-hour serum insulin level is 71. They have a body mass index of 38.5 and a diabetes pedigree function of 0.324.###\nHence this label was No."
"This data belongs to a 27-year-old individual who is pregnant for the first time and has a diastolic blood pressure of 94. Their triceps skin fold thickness is 41, while their plasma glucose concentration after a two-hour oral glucose tolerance test is 147. The individual has no insulin levels after two hours. With a body mass index of 49.3 and a diabetes pedigree function of 0.358, their risk of developing diabetes may be a concern.###\nHence this label was Yes."
"A 58-year-old individual with 8 pregnancies shows normal diastolic blood pressure and no triceps skin fold thickness. Their glucose concentration after a glucose tolerance test is within normal range. They have low insulin levels and a healthy body mass index of 27.8. The individual has a low diabetes pedigree function score of 0.237, suggesting a relatively low risk of developing diabetes.###\nHence this label was No."
"This patient is a 37-year-old individual who has been pregnant 10 times. Their diastolic blood pressure is 70, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. Despite these values, their plasma glucose concentration at 2 hours in an oral glucose tolerance test is 179. Additionally, they have a body mass index of 35.1 and a low diabetes pedigree function of 0.2.###\nHence this label was No."
"This 44-year-old individual has been pregnant 5 times and shows normal diastolic blood pressure. They have no triceps skin fold thickness and very low 2-hour serum insulin levels. Despite having a relatively high plasma glucose concentration, their body mass index is within the overweight range. The diabetes pedigree function suggests a low genetic risk for developing diabetes.###\nHence this label was Yes."
"This data represents a 29-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 50 and a moderate triceps skin fold thickness of 19. Her glucose levels are within normal range at 107, while her insulin levels are found to be very low at 0. She has a healthy body mass index of 28.3 and a low diabetes pedigree function score of 0.181. Overall, her diagnostic measurements suggest a low risk of developing diabetes.###\nHence this label was No."
"The patient is a 43-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 68, a triceps skin fold thickness of 49, and a plasma glucose concentration of 129 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 125, and she has a body mass index of 38.5. The diabetes pedigree function, a measure of diabetes risk based on family history, is 0.439.###\nHence this label was Yes."
"The patient is a 37-year-old female who has been pregnant four times. She has a low diastolic blood pressure of 58 and a slightly below average triceps skin fold thickness of 28. Her plasma glucose concentration after a glucose tolerance test is elevated at 144. The 2-hour serum insulin level is high at 140, indicating possible insulin resistance. Despite this, her body mass index is in the overweight range at 29.5. The diabetes pedigree function score is low at 0.287, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"The patient is a 29-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 90 mmHg, a triceps skin fold thickness of 12 mm, and a plasma glucose concentration of 111 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 78 μU/mL and their body mass index is 28.4 kg/m^2. The diabetes pedigree function for this individual is 0.495.###\nHence this label was No."
"This patient is a 41-year-old female who has been pregnant 13 times. Her diastolic blood pressure is 60 mmHg, and she has no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 76 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 32.8, and her diabetes pedigree function is 0.18.###\nHence this label was No."
"This 24-year-old individual who has been pregnant once has a relatively normal diastolic blood pressure of 72. Their triceps skin fold thickness is 21, indicating a moderate amount of body fat. With a plasma glucose concentration of 157 after a glucose tolerance test, they may have elevated blood sugar levels. The 2-hour serum insulin level of 168 suggests a possible insulin resistance. Despite a slightly elevated BMI of 25.6, their diabetes pedigree function value of 0.123 indicates a low genetic risk for diabetes.###\nHence this label was No."
"This individual is a 25-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a low plasma glucose concentration 2 hours after a glucose test. Her insulin level is normal, with a low body mass index and a low diabetes pedigree function score.###\nHence this label was No."
"The patient is a non-pregnant 58-year-old with normal diastolic blood pressure. They have a high triceps skin fold thickness, elevated plasma glucose concentration, and very high serum insulin levels. The patient is considered obese based on their high body mass index and has a family history of diabetes according to their diabetes pedigree function score. These factors indicate a high risk for developing diabetes.###\nHence this label was No."
"This patient is a 47-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 78, a triceps skin fold thickness of 0, and a plasma glucose concentration of 143 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a high body mass index of 45.0. Her diabetes pedigree function is 0.19, indicating a low genetic risk for diabetes.###\nHence this label was No."
"This 23-year-old individual, who has been pregnant once, has a diastolic blood pressure of 74, triceps skin fold thickness of 26, and a plasma glucose concentration of 140 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin is 180, body mass index is 24.1, and their diabetes pedigree function is 0.828.###\nHence this label was No."
"The patient is a young, non-pregnant individual with normal diastolic blood pressure. They have a moderately high triceps skin fold thickness, indicating some excess body fat. Their glucose levels after a meal are within normal range, while their insulin levels are slightly elevated. The patient's body mass index suggests they are overweight. Overall, their diabetes pedigree function is low, indicating a lower risk of developing diabetes.###\nHence this label was No."
"The individual is a 52-year-old with a history of 5 pregnancies. They have normal diastolic blood pressure, moderately high triceps skin fold thickness, and a slightly low plasma glucose concentration after a glucose tolerance test. Their insulin levels are at minimal levels, and they have a high body mass index. The diabetes pedigree function score suggests a low genetic risk for diabetes.###\nHence this label was Yes."
"A 31-year-old woman who has been pregnant 4 times shows normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is elevated, but her insulin levels are low. She has a slightly high body mass index and a moderate diabetes pedigree score.###\nHence this label was Yes."
"A 36-year-old woman who has been pregnant 3 times shows a diastolic blood pressure of 58 and a triceps skin fold thickness of 22. Her plasma glucose concentration is 174 after a 2-hour oral glucose tolerance test, with a 2-hour serum insulin level of 194. She has a body mass index of 32.9 and a diabetes pedigree function of 0.593.###\nHence this label was Yes."
"This 23-year-old individual has never been pregnant and has normal diastolic blood pressure. They have a relatively low triceps skin fold thickness and a slightly elevated plasma glucose concentration after a glucose tolerance test. Their serum insulin level is high, and they have a healthy body mass index. The diabetes pedigree function score indicates a low genetic risk for diabetes.###\nHence this label was No."
"This 25-year-old individual has been pregnant twice and exhibits a diastolic blood pressure of 58. They have a triceps skin fold thickness of 24, a plasma glucose concentration of 127 after a glucose tolerance test, and a 2-hour serum insulin level of 275. With a body mass index of 27.7 and a diabetes pedigree function of 1.6, this individual's overall risk for developing diabetes may need to be monitored closely.###\nHence this label was No."
"A 38-year-old woman who is pregnant for the first time has a diastolic blood pressure of 64. She has a triceps skin fold thickness of 30, a plasma glucose concentration of 181 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 180. Her body mass index is 34.1, and her diabetes pedigree function is 0.328.###\nHence this label was Yes."
"This individual, a 32-year-old woman, has never been pregnant. Her diastolic blood pressure is 68 mmHg, and her triceps skin fold thickness is 20 mm. She has a plasma glucose concentration of 108 mg/dL after a 2-hour oral glucose tolerance test, with no detectable insulin in her serum. Her body mass index is 27.3, and her diabetes pedigree function is 0.787.###\nHence this label was No."
"This 29-year-old individual with 4 pregnancies has low diastolic blood pressure, a moderate triceps skin fold thickness, high glucose concentration after a GTT, elevated serum insulin levels, a slightly high body mass index, and a low diabetes pedigree function score.###\nHence this label was Yes."
"This individual is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 90, a triceps skin fold thickness of 24, and a high plasma glucose concentration of 142 following a glucose tolerance test. Her 2-hour serum insulin level is notably high at 480. Despite having a body mass index of 30.4, her diabetes pedigree function is relatively low at 0.128.###\nHence this label was Yes."
"The patient is a 23-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 62 and a low triceps skin fold thickness of 13. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 68, and her 2-hour serum insulin level is also low at 15. She has a low body mass index of 20.1 and a relatively low diabetes pedigree function of 0.257.###\nHence this label was No."
"This patient is a 65-year-old who has never been pregnant and has a diastolic blood pressure of 50. Their triceps skin fold thickness is 0, and they have a plasma glucose concentration of 161 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and their body mass index is 21.9. The diabetes pedigree function for this individual is 0.254.###\nHence this label was No."
"The patient is a 25-year-old who has never been pregnant. She has a low diastolic blood pressure of 66 and a moderately high triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 180. She has no insulin present in her serum after 2 hours, indicating a potential issue with insulin production. Her body mass index is 42.0, which falls into the obesity category. The diabetes pedigree function value suggests a high genetic risk of developing diabetes.###\nHence this label was Yes."
"This individual is a 23-year-old female who is moderately overweight with a BMI of 31.6. She has been pregnant twice and has a diastolic blood pressure of 76, which is within the normal range. Her triceps skin fold thickness is 18mm. Her plasma glucose concentration after a 2-hour GTT is 94mg/dL, which is also within the normal range. She has a 2-hour serum insulin level of 66uU/mL and a relatively low diabetes pedigree function of 0.649, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"This is a profile of a young, non-pregnant individual with normal blood pressure and glucose levels. They have a moderate level of insulin, low body mass index, and moderate diabetes genetic predisposition.###\nHence this label was No."
"The patient is a 35-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 41 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 136 mg/dL. Additionally, her 2-hour serum insulin level is 88 μU/mL. She has a body mass index of 35.0 and a diabetes pedigree function of 0.286.###\nHence this label was Yes."
"The individual is a 28-year-old female who is 5 times pregnant. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 40, and a plasma glucose concentration of 123 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 77, and she has a body mass index of 34.1. The diabetes pedigree function for this individual is 0.269.###\nHence this label was No."
"The individual is a 22-year-old who has been pregnant twice. They have a normal diastolic blood pressure of 62 and a low triceps skin fold thickness of 10. Their glucose levels after a test are at a normal level of 108, but their serum insulin is high at 278. The individual has a healthy body mass index of 25.3 and a slightly elevated diabetes pedigree function score of 0.881.###\nHence this label was No."
"This is a 31-year-old individual who has been pregnant 10 times. Their diastolic blood pressure is 62, triceps skin fold thickness is 0, and plasma glucose concentration is 92 after a 2-hour oral glucose tolerance test. They have no 2-hour serum insulin, a body mass index of 25.9, and a diabetes pedigree function value of 0.167.###\nHence this label was No."
"This patient is a 33-year-old female who is pregnant for the first time. She has very low diastolic blood pressure of 30 mmHg. Her triceps skin fold thickness is 38 mm, indicating a moderate amount of body fat. The patient's plasma glucose concentration at 2 hours during an oral glucose tolerance test is 103 mg/dL, which is within a normal range. Her 2-hour serum insulin level is 83 μU/mL. Despite having a high body mass index of 43.3, her diabetes pedigree function is relatively low at 0.183.###\nHence this label was No."
"This patient is a 64-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 0, indicating low body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120 mg/dL. She has no insulin present in her serum after 2 hours. Her body mass index is 25.0, which is within the normal range. The diabetes pedigree function, a measure of the hereditary risk of diabetes, is 0.409, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This data describes a 34-year-old individual who has been pregnant 8 times, with a diastolic blood pressure of 80. They have a triceps skin fold thickness of 0 and a plasma glucose concentration of 107 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and their body mass index is 24.6. The diabetes pedigree function is 0.856.###\nHence this label was No."
"A 22-year-old patient who has never been pregnant shows normal diastolic blood pressure and a moderately high triceps skin fold thickness. They have a slightly elevated plasma glucose concentration after a glucose tolerance test and a high level of serum insulin. The patient has a slightly elevated body mass index and a relatively low diabetes pedigree function score. Overall, the patient shows some potential risk factors for developing diabetes.###\nHence this label was No."
"This is a data point for a 42-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 66, triceps skin fold thickness of 29, and a plasma glucose concentration of 100 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 196, body mass index is 32.0, and their diabetes pedigree function is 0.444.###\nHence this label was No."
"The patient is a 27-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 25 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 128 mg/dL, and her 2-hour serum insulin level is 190 μU/ml. She has a body mass index of 32.4 and a diabetes pedigree function of 0.549.###\nHence this label was Yes."
"The patient is a 48-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 92 mmHg and a triceps skin fold thickness of 18 mm. Her plasma glucose concentration at 2 hours is 106 mg/dL, with a 2-hour serum insulin level of 0 µU/mL. She has a body mass index of 22.7 and a diabetes pedigree function value of 0.235.###\nHence this label was No."
"This patient is a 22-year-old who has never been pregnant. She has a normal diastolic blood pressure of 64 and a slightly higher triceps skin fold thickness of 41. Her plasma glucose concentration is within a healthy range at 105, but her 2-hour serum insulin level is elevated at 142. Despite this, her body mass index is high at 41.5. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.173. Overall, this individual has some concerning markers for diabetes risk, such as high insulin levels and BMI, but a relatively low genetic predisposition.###\nHence this label was No."
"The patient is a 22-year-old female who has never been pregnant. \nShe has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 14 mm. \nHer plasma glucose concentration after a glucose tolerance test is 188 mg/dL, and her 2-hour serum insulin level is 185 mU/mL. \nWith a body mass index of 32.0, she has a moderate risk of developing diabetes based on her diabetes pedigree function of 0.682.###\nHence this label was Yes."
"This is a medical data set of a 24-year-old female who has never been pregnant. Her diastolic blood pressure is 80 mmHg, triceps skin fold thickness is 31 mm, and plasma glucose concentration after a glucose tolerance test is 117 mg/dL. She also has a 2-hour serum insulin level of 53 mu U/ml, a high body mass index of 45.2, and a low diabetes pedigree function score of 0.089.###\nHence this label was No."
"The patient is a 30-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 84 mmHg, no triceps skin fold thickness measurement, and a plasma glucose concentration of 137 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0 μU/mL, and she has a body mass index of 31.2. The diabetes pedigree function indicates a low genetic risk of diabetes at 0.252.###\nHence this label was No."
"The patient is a 24-year-old female who has been pregnant twice. She has a diastolic blood pressure of 65 mmHg and a triceps skin fold thickness of 28 mm. Her plasma glucose concentration after a glucose tolerance test is 83 mg/dL, and she has a 2-hour serum insulin level of 66 μU/mL. Additionally, her body mass index is 36.8 kg/m², and her diabetes pedigree function is 0.629, indicating a potential risk for developing diabetes.###\nHence this label was No."
"A 21-year-old female who has never been pregnant has a slightly elevated diastolic blood pressure of 86. She has a moderately high triceps skin fold thickness of 27, indicating some excess body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range at 126. She also has a high 2-hour serum insulin level of 120, suggesting possible insulin resistance. Despite this, her body mass index is in the healthy range at 27.4, and her diabetes pedigree function score is relatively low at 0.515, indicating a lower risk of developing diabetes based on family history.###\nHence this label was No."
"The patient in this example is a 68-year-old who has been pregnant 8 times. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 0. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 91, with no insulin detected after 2 hours. She has a body mass index of 35.6 and a diabetes pedigree function score of 0.587.###\nHence this label was No."
"The patient is a 29-year-old female who is 1 time pregnant, with a diastolic blood pressure of 78 mmHg. She has a triceps skin fold thickness of 29 mm and a plasma glucose concentration of 88 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 76 μU/mL, and her body mass index is 32.0 kg/m^2. The diabetes pedigree function, which assesses the risk of diabetes based on family history, is 0.365 for this patient.###\nHence this label was No."
