"This 43-year-old individual has been pregnant 7 times and has a diastolic blood pressure of 80. Their triceps skin fold thickness is 31mm and their plasma glucose concentration after a glucose tolerance test is 109mg/dL. They have no insulin in their serum after a 2-hour period. With a body mass index of 35.9, they also have a diabetes pedigree function value of 1.127, indicating a potential familial risk for diabetes.###\nHence this label was consent."
"A 44-year-old individual who has never been pregnant and has normal diastolic blood pressure, zero triceps skin fold thickness, and zero insulin levels. Despite a slightly elevated plasma glucose concentration, the individual has a high body mass index and a family history of diabetes.###\nHence this label was avoid."
"This individual is 23 years old and has never been pregnant. Their diastolic blood pressure is 76 mmHg, and their triceps skin fold thickness is 0 mm. They have a plasma glucose concentration of 113 mg/dL after a 2-hour oral glucose tolerance test and a 2-hour serum insulin level of 0 μU/mL. The body mass index is 33.3, indicating they are overweight. Their diabetes pedigree function is 0.278, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"This 39-year-old individual has been pregnant 7 times and has a diastolic blood pressure of 90. Their triceps skin fold thickness is 41, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 137. They have a 2-hour serum insulin level of 0, a body mass index of 32.0, and a diabetes pedigree function of 0.391.###\nHence this label was avoid."
"This 39-year-old individual has been pregnant 8 times and has a diastolic blood pressure of 74. Their triceps skin fold thickness is 0, indicating a lean body composition. With a high plasma glucose concentration of 197 after a glucose tolerance test and no serum insulin present, there may be an increased risk for diabetes. Despite having a relatively healthy body mass index of 25.9, their diabetes pedigree function score of 1.191 suggests a genetic predisposition to the disease.###\nHence this label was consent."
"This is a data entry for a 29-year-old individual who has been pregnant 6 times. She has a normal diastolic blood pressure of 66 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 103, and she has no insulin present in her serum. With a body mass index of 24.3 and a low diabetes pedigree function score of 0.249, she appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This patient is 36 years old and has been pregnant 8 times. They have a diastolic blood pressure of 72, a triceps skin fold thickness of 42, and a plasma glucose concentration of 179 following a glucose tolerance test. Their 2-hour serum insulin level is 130, and their body mass index is 32.7. The diabetes pedigree function for this individual is 0.719.###\nHence this label was consent."
"A 30-year-old female who is 1 time pregnant shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. She has a moderate plasma glucose concentration and high insulin levels after a glucose tolerance test. With a high body mass index and a moderately high diabetes pedigree function, she may be at risk for developing diabetes.###\nHence this label was consent."
"The patient is a 29-year-old female who has been pregnant 9 times. She has a normal diastolic blood pressure of 80 and a slightly elevated triceps skin fold thickness of 35. Her glucose levels are within normal range at 119 after a 2-hour glucose tolerance test, and her insulin levels are low at 0. Despite this, her body mass index is at a healthy level of 29.0. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.263.###\nHence this label was consent."
"A 36-year-old woman who has been pregnant three times, with a diastolic blood pressure of 70, 22mm triceps skin fold thickness, and a plasma glucose concentration of 187 after a glucose tolerance test. Her 2-hour serum insulin level is 200, with a body mass index of 36.4 and a diabetes pedigree function of 0.408.###\nHence this label was consent."
"This individual is 29 years old and has been pregnant 7 times. They have a low diastolic blood pressure of 60 and a normal triceps skin fold thickness of 24. Their glucose level after a 2-hour oral glucose tolerance test is 106. They have no serum insulin after 2 hours. With a body mass index of 26.5, they have a low risk of developing diabetes based on their diabetes pedigree function of 0.296.###\nHence this label was consent."
"The patient is a 32-year-old female who has been pregnant 5 times. She has a normal diastolic blood pressure of 74 and a triceps skin fold thickness of 22, indicating a healthy body fat percentage. Her plasma glucose concentration after a glucose tolerance test is 85, which is within the normal range. She has a low 2-hour serum insulin level of 0, suggesting good insulin sensitivity. With a body mass index of 29.0, she is overweight but not obese. Her diabetes pedigree function score is 1.224, indicating a moderate risk of developing diabetes based on family history.###\nHence this label was consent."
"This is data from a 24-year-old individual who has been pregnant twice. \nThey have a diastolic blood pressure of 64 and a triceps skin fold thickness of 42. \nTheir plasma glucose concentration after a GTT is 128 and their 2-hour serum insulin level is 0.\nWith a body mass index of 40.0 and a diabetes pedigree function of 1.101, the individual's risk of developing diabetes may be elevated.###\nHence this label was avoid."
"A 25-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure, relatively high triceps skin fold thickness, and average plasma glucose concentration after a 2-hour oral test. She has elevated serum insulin levels, a high body mass index, but a low diabetes pedigree function score.###\nHence this label was consent."
"A 22-year-old individual who has been pregnant twice, with a diastolic blood pressure of 60 and a triceps skin fold thickness of 18. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 122, and their 2-hour serum insulin level is 106. They have a body mass index of 29.8 and a diabetes pedigree function value of 0.717.###\nHence this label was avoid."
"A 21-year-old individual who has never been pregnant, with low diastolic blood pressure and a normal BMI, but high levels of plasma glucose and serum insulin. The individual has a moderate diabetes pedigree score and moderate triceps skin fold thickness. This person may be at risk for developing diabetes in the future.###\nHence this label was avoid."
"The patient is a 31-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, low triceps skin fold thickness, normal glucose concentration after a 2-hour GTT, very low serum insulin levels, a slightly elevated body mass index, and a relatively low diabetes pedigree function.###\nHence this label was avoid."
"This is a patient who is 22 years old and has never been pregnant. She has a diastolic blood pressure of 70 mmHg, a triceps skin fold thickness of 37 mm, and a plasma glucose concentration of 106 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 148 μU/mL, and her body mass index is 39.4, indicating obesity. The diabetes pedigree function, a measure of diabetes heredity, is 0.605, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This is a dataset representing a 22-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 58, triceps skin fold thickness of 18, plasma glucose concentration of 109 after a glucose tolerance test, and 2-hour serum insulin level of 116. Her body mass index is 28.5, and her diabetes pedigree function is 0.219.###\nHence this label was avoid."
"A 46-year-old woman, who has been pregnant 14 times, has a healthy diastolic blood pressure of 78. She has a moderate triceps skin fold thickness of 25 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 100 mg/dL, but her 2-hour serum insulin levels are high at 184 μU/mL. With a body mass index of 36.6, she is considered overweight. Her diabetes pedigree function score is low at 0.412, indicating a lower genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 30-year-old individual who has been pregnant 5 times. Their diastolic blood pressure is 68 and triceps skin fold thickness is 0. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 110. The 2-hour serum insulin level is 0, and their body mass index is 26.0. The diabetes pedigree function score is 0.292.###\nHence this label was avoid."
"A 40-year-old woman who has been pregnant four times shows normal diastolic blood pressure and no triceps skin fold thickness. Her glucose level after a glucose tolerance test is within normal range, and she has no insulin in her system after two hours. She has a healthy body mass index and a low diabetes pedigree score of 0.244.###\nHence this label was avoid."
"This 46-year-old individual has been pregnant 3 times and has a healthy diastolic blood pressure of 82. Their triceps skin fold thickness is 28, indicating moderate body fat levels. With a low plasma glucose concentration of 61 and no serum insulin after a glucose tolerance test, there are no signs of diabetes. Despite having a slightly elevated body mass index of 34.4, their diabetes pedigree function value of 0.243 suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 41-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 68, triceps skin fold thickness of 41, and a plasma glucose concentration of 0 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, her body mass index is 39.0, and her diabetes pedigree function is 0.727.###\nHence this label was consent."
"This is a record of a 21-year-old individual who has never been pregnant. They have a normal diastolic blood pressure of 68, a triceps skin fold thickness of 14, and a healthy body mass index of 24.8. During a glucose tolerance test, their plasma glucose concentration at 2 hours was 137. They also have a 2-hour serum insulin level of 148 and a low diabetes pedigree function score of 0.143. Overall, this individual shows no signs of diabetes based on these measurements.###\nHence this label was avoid."
"This is a dataset of a 27-year-old individual who has been pregnant twice. They have normal diastolic blood pressure (74 mmHg) and a healthy body mass index of 32.4. Their triceps skin fold thickness is 29mm. From the oral glucose tolerance test, their plasma glucose concentration at 2 hours is 110 mg/dL, and their 2-hour serum insulin level is 125 μU/mL. Their diabetes pedigree function score is 0.698, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"The individual is a 27-year-old woman who has never been pregnant. She has a diastolic blood pressure of 80 and a triceps skin fold thickness of 34. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 114, and her 2-hour serum insulin level is 285. With a body mass index of 44.2 and a low diabetes pedigree function score of 0.167, she appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 36-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 90 and a triceps skin fold thickness of 38. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 151. She has no 2-hour serum insulin, and her body mass index is 29.7. The diabetes pedigree function is 0.294.###\nHence this label was avoid."
"This 32-year-old individual has been pregnant 6 times and has a healthy diastolic blood pressure of 60. Their triceps skin fold thickness is 19, indicating a moderate amount of subcutaneous fat. With a plasma glucose concentration of 99 and 2-hour serum insulin level of 54, their blood sugar levels seem normal. The individual's body mass index is 26.9, suggesting they are slightly overweight. Their diabetes pedigree function is 0.497, indicating a moderate genetic predisposition to diabetes. Overall, based on these measurements, the individual appears to be at low risk for developing diabetes.###\nHence this label was avoid."
"A 41-year-old female, who has been pregnant 6 times, with normal blood pressure and low insulin levels, and a healthy BMI of 26.2. Her glucose levels are within normal range post glucose tolerance test, and she has a low diabetes pedigree function score of 0.313.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 64 and a triceps skin fold thickness of 0, indicating low levels of subcutaneous fat. Her plasma glucose concentration after a glucose tolerance test is 95, which is within the normal range. She has no insulin present in her serum after 2 hours. Despite a body mass index of 32.0, she has a low risk of diabetes according to her diabetes pedigree function score of 0.161.###\nHence this label was consent."
"A 40-year-old individual, who has been pregnant 9 times, has a healthy diastolic blood pressure of 70. Their triceps skin fold thickness is 44, indicating a moderate amount of subcutaneous fat. With a plasma glucose concentration of 123 after a 2-hour oral glucose tolerance test, they show normal blood sugar levels. Their 2-hour serum insulin is at 94, suggesting good insulin sensitivity. Despite a body mass index of 33.1, which falls in the obese category, their diabetes pedigree function value of 0.374 indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 55-year-old who has been pregnant 6 times. Their diastolic blood pressure is 72, and triceps skin fold thickness is 32. They have a plasma glucose concentration of 103 after a 2-hour oral glucose tolerance test, and their 2-hour serum insulin level is 190. With a body mass index of 37.7 and a diabetes pedigree function of 0.324, this individual's risk for developing diabetes may be elevated.###\nHence this label was avoid."
"This data belongs to a 24-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 64, triceps skin fold thickness of 13, and a plasma glucose concentration of 158 following a glucose tolerance test. Their 2-hour serum insulin level is 387, with a body mass index of 31.2. The diabetes pedigree function value is 0.295.###\nHence this label was avoid."
"A 22-year-old woman who is 3 times pregnant has low diastolic blood pressure, average triceps skin fold thickness, normal glucose levels after a GTT, very low insulin levels, healthy body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 26-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure and a slightly elevated triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within a healthy range, while their insulin levels are moderately high. They have a slightly elevated body mass index and a low diabetes pedigree function score, indicating a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This individual is a young adult, 21 years old, who has never been pregnant. They have normal diastolic blood pressure and a moderately low triceps skin fold thickness. Their glucose levels after a glucose tolerance test are within normal range. They have no insulin present in their blood after 2 hours. They have a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 45-year-old individual who has been pregnant 8 times and has a diastolic blood pressure of 100. Their triceps skin fold thickness is 36, plasma glucose concentration after a 2-hour oral glucose tolerance test is 105, and their 2-hour serum insulin level is 0. They have a body mass index of 43.3 and a diabetes pedigree function of 0.239.###\nHence this label was consent."
"This individual is 23 years old and has never been pregnant. She has a healthy diastolic blood pressure of 60 and a moderate triceps skin fold thickness of 25. Her plasma glucose concentration after a GTT is normal at 107. She does not have any insulin in her bloodstream after a 2-hour serum test. She has a body mass index of 26.4, which is within the healthy range. Her diabetes pedigree function is low at 0.133, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"The individual is 32 years old and has been pregnant 6 times. They have normal diastolic blood pressure (80 mmHg) and low triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is low (87 mg/dL) and they have low insulin levels. Despite a low body mass index (23.2), their diabetes pedigree function indicates a slight genetic risk for diabetes.###\nHence this label was avoid."
"A 24-year-old female, who has been pregnant once, has a healthy diastolic blood pressure of 72. She has a moderate triceps skin fold thickness of 18. Her plasma glucose concentration is normal at 81 mg/dL after a 2-hour oral glucose tolerance test. She has a moderate insulin level of 40 μU/mL. With a body mass index of 26.6, she is considered overweight. Her diabetes pedigree function is relatively low at 0.283, indicating a lower genetic risk of developing diabetes.###\nHence this label was avoid."
"This 52-year-old individual has been pregnant 5 times and has normal diastolic blood pressure. They have a moderately low triceps skin fold thickness, indicating relatively low body fat percentage. Their glucose levels are within a normal range after a 2-hour oral glucose tolerance test. Their insulin levels are notably low. Despite having a high body mass index, their risk of developing diabetes is relatively low according to the diabetes pedigree function.###\nHence this label was consent."
"This is a profile of a 29-year-old individual with 5 pregnancies. Their diastolic blood pressure is 84, triceps skin fold thickness is 41, and plasma glucose concentration after a glucose tolerance test is 158. Additionally, their 2-hour serum insulin level is 210, body mass index is 39.4, and diabetes pedigree function is 0.395.###\nHence this label was consent."
"A 28-year-old individual who has been pregnant 5 times shows normal diastolic blood pressure and a moderate triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within a healthy range, and they have a normal level of serum insulin. Their body mass index indicates they are moderately overweight, and their diabetes pedigree function score is low, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 44-year-old female who has been pregnant three times. She has a normal diastolic blood pressure of 80, but a concerningly low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 132, and she has no insulin in her serum after 2 hours. Despite having a high body mass index of 34.4, her diabetes pedigree function is relatively low at 0.402.###\nHence this label was consent."
"This patient is a young adult female, aged 25, who is pregnant for the first time. She has a healthy diastolic blood pressure of 72, normal triceps skin fold thickness of 30, and a moderate plasma glucose concentration of 112 after a glucose tolerance test. Her 2-hour serum insulin level is elevated at 176, and she has a slightly high body mass index of 34.4. The diabetes pedigree function score is relatively low at 0.528, indicating a lower risk of developing diabetes based on her family history.###\nHence this label was avoid."
"The patient is a 38-year-old woman who is 10 times pregnant. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 75, and her 2-hour serum insulin level is 0. With a body mass index of 33.3 and a diabetes pedigree function of 0.263, she may have a low risk of developing diabetes.###\nHence this label was avoid."
"A 23-year-old individual, who has been pregnant 4 times, with a diastolic blood pressure of 86. Their triceps skin fold thickness is 20, plasma glucose concentration after a 2-hour oral glucose tolerance test is 129, and 2-hour serum insulin level is 270. They have a body mass index of 35.1 and a diabetes pedigree function of 0.231.###\nHence this label was avoid."
"The patient is a 29-year-old female who is 1 time pregnant. She has a diastolic blood pressure of 76 mmHg, triceps skin fold thickness of 36 mm, plasma glucose concentration of 196 mg/dL after a 2-hour oral glucose tolerance test, and 2-hour serum insulin level of 249 μU/mL. Her body mass index is 36.5 kg/m^2 and her diabetes pedigree function is 0.875. These measurements suggest that the patient may be at risk for developing diabetes.###\nHence this label was consent."
"The patient is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 106 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 127 mg/dL. She has a 2-hour serum insulin level of 0 uU/ml and a body mass index of 39.0, indicating obesity. The diabetes pedigree function for this patient is 0.19, suggesting a low genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 37-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 90, triceps skin fold thickness of 35, plasma glucose concentration of 186 after a GTT, and 2-hour serum insulin level of 225. Her body mass index is 34.5, and her diabetes pedigree function is 0.423.###\nHence this label was consent."
"This individual is a 50-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a GTT is 136 mg/dL and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 29.9 kg/m² and a diabetes pedigree function value of 0.21.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 17. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 114, and her 2-hour serum insulin level is 110. She has a body mass index of 23.8 and a diabetes pedigree function score of 0.466.###\nHence this label was avoid."
"The patient is a 33-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 30 and a moderately high triceps skin fold thickness of 38. The patient's glucose levels are normal at 103 after a 2-hour oral glucose tolerance test, but her insulin levels are elevated at 83. She has a high body mass index of 43.3 and a low diabetes pedigree function score of 0.183.###\nHence this label was avoid."
"This 38-year-old individual has been pregnant 9 times and shows a normal diastolic blood pressure reading of 78. They have a moderately low triceps skin fold thickness of 25, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is below the normal range at 72. They have very low 2-hour serum insulin levels at 0. Despite a slightly elevated body mass index of 31.6, their diabetes pedigree function is low at 0.28, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"This 27-year-old individual has been pregnant twice. Their diastolic blood pressure is 74, triceps skin fold thickness is 17, and body mass index is 26.6. After a 2-hour oral glucose tolerance test, their plasma glucose concentration was 155. They have a 2-hour serum insulin level of 96 and a diabetes pedigree function value of 0.433.###\nHence this label was consent."
"This data belongs to a 24-year-old individual who is pregnant for the first time. The individual has normal diastolic blood pressure, low triceps skin fold thickness, and normal plasma glucose concentration after a glucose tolerance test. Their insulin level after 2 hours is 0, indicating lower insulin production. The individual has a healthy body mass index and a low diabetes pedigree function score, suggesting a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This data describes a 35-year-old individual who has been pregnant 6 times. Despite a low diastolic blood pressure of 44, they have a high triceps skin fold thickness of 20. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 108, and they have a high 2-hour serum insulin level of 130. With a healthy body mass index of 24.0 and a moderately high diabetes pedigree function of 0.813, this individual may have an increased risk for developing diabetes.###\nHence this label was avoid."
"This individual is a 32-year-old who has never been pregnant before. They have a healthy diastolic blood pressure of 68 mmHg and a normal triceps skin fold thickness of 20 mm. Their glucose tolerance test shows a plasma glucose concentration of 108 mg/dL. They have a low insulin level of 0 μU/ml. With a body mass index of 27.3, they are considered overweight. Their diabetes pedigree function is 0.787, indicating a moderate genetic susceptibility to diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 184, with a 2-hour serum insulin level of 277. She has a body mass index of 37.0 and a diabetes pedigree function of 0.264.###\nHence this label was consent."
"The individual is a 45-year-old woman who has been pregnant 10 times. She has a healthy diastolic blood pressure of 78 and a moderately high triceps skin fold thickness of 31. Her glucose levels after a glucose tolerance test are normal at 122, and she has a low insulin level of 0. Despite her pregnancies, she maintains a relatively low body mass index of 27.6. Her diabetes pedigree function score is 0.512, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 50-year-old woman who has been pregnant 8 times. She has normal diastolic blood pressure and a low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is normal. However, her insulin levels are low. She has a high body mass index and a moderate diabetes pedigree function score.###\nHence this label was avoid."
"This individual is a 44-year-old who has been pregnant 12 times. They have a diastolic blood pressure of 80 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 106, and they have a 2-hour serum insulin level of 0. With a body mass index of 23.6 and a diabetes pedigree function of 0.137, this person's risk of developing diabetes may be low.###\nHence this label was avoid."
"This 27-year-old patient, who has been pregnant twice, shows normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 129, with no serum insulin detected. They have a healthy body mass index of 28.0 and a low diabetes pedigree function score of 0.284.###\nHence this label was avoid."
"This patient is a 22-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 62 and a normal triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 91, and her 2-hour serum insulin level is 0. Despite having a slightly elevated body mass index of 27.3, her diabetes pedigree function is low at 0.525. Overall, this data suggests that the patient may have a lower risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 45-year-old woman who has been pregnant 13 times. She has a diastolic blood pressure of 72, a triceps skin fold thickness of 54, and a plasma glucose concentration of 106 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 36.6. The diabetes pedigree function for this patient is 0.178.###\nHence this label was avoid."
"The patient is a 25-year-old female who is pregnant for the first time. She has a healthy diastolic blood pressure of 66 and a relatively low triceps skin fold thickness of 13. Her plasma glucose concentration after a glucose tolerance test is 95, and her 2-hour serum insulin level is 38. Despite her low body mass index of 19.6, her diabetes pedigree function is moderately elevated at 0.334.###\nHence this label was avoid."
"A 24-year-old woman, who has never been pregnant, has a normal diastolic blood pressure and no triceps skin fold thickness. Her glucose levels after a glucose tolerance test are within a healthy range. Despite having no insulin present after 2 hours, she has a high body mass index and a moderate diabetes pedigree function score.###\nHence this label was avoid."
"The individual in the data is a 41-year-old woman who has been pregnant 7 times. She has a healthy diastolic blood pressure of 68 and a slightly above average triceps skin fold thickness of 39. Her plasma glucose concentration after a glucose tolerance test is 187, with a high 2-hour serum insulin level of 304. Despite these high values, her body mass index is in the overweight range at 37.7. The diabetes pedigree function, which calculates likelihood of diabetes based on family history, is low at 0.254. Overall, this individual exhibits some risk factors for diabetes, particularly in terms of glucose and insulin levels, but also has some healthy indicators such as blood pressure and diabetes pedigree function.###\nHence this label was consent."
"A 29-year-old woman who is pregnant for the first time has slightly elevated diastolic blood pressure and a high BMI. Her triceps skin fold thickness indicates excess body fat, while her plasma glucose level after a glucose tolerance test is normal. However, her extremely high insulin levels suggest insulin resistance. The diabetes pedigree function value indicates a moderate genetic predisposition to diabetes. Overall, this individual may be at risk for developing diabetes due to the combination of her high insulin levels, BMI, and genetic factors.###\nHence this label was consent."
"The patient is a 62-year-old who has never been pregnant. Their diastolic blood pressure is normal at 84, and they have no triceps skin fold thickness. Their glucose levels after a two-hour oral glucose tolerance test are at 105, with no insulin detected in their serum. Their body mass index is 27.9, indicating they are overweight. A diabetes pedigree function score of 0.741 suggests a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"This 37-year-old individual has been pregnant 4 times and has a low diastolic blood pressure of 58. They have a moderate triceps skin fold thickness of 28, and their plasma glucose concentration after a glucose tolerance test is slightly elevated at 144. Their 2-hour serum insulin level is high at 140, and they have a body mass index of 29.5, indicating overweight. The diabetes pedigree function score is low at 0.287, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"The patient, a 26-year-old female, has been pregnant 2 times. She has a low diastolic blood pressure of 48 and normal triceps skin fold thickness of 32. Her plasma glucose concentration after a glucose tolerance test is 123, and her 2-hour serum insulin level is high at 165. Despite this, her body mass index is 42.1, indicating obesity. Her diabetes pedigree function score is low at 0.52, suggesting a slight family history of diabetes. Overall, the patient's data shows a concerning combination of high insulin levels, obesity, and a family history of diabetes, placing her at risk for developing the condition in the future.###\nHence this label was avoid."
"This data describes a 38-year-old individual who is pregnant for the first time and has relatively low diastolic blood pressure. They have moderate triceps skin fold thickness and high plasma glucose concentration after a glucose tolerance test. The individual also has high serum insulin levels and a moderately high body mass index. Their diabetes pedigree function value is low, indicating a lower risk of developing diabetes based on genetics.###\nHence this label was consent."
"This patient is a 21-year-old female who has never been pregnant. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 16 mm. Her plasma glucose concentration during an oral glucose tolerance test is 113 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. With a body mass index of 31.0 and a diabetes pedigree function of 0.874, this patient may be at risk for developing diabetes.###\nHence this label was avoid."
"This individual is a 69-year-old who has been pregnant 5 times. \nShe has a diastolic blood pressure of 80 and a triceps skin fold thickness of 0. \nHer plasma glucose concentration after a 2-hour GTT is 132, with a 2-hour serum insulin level of 0. \nHer body mass index is 26.8 and her diabetes pedigree function is 0.186.###\nHence this label was avoid."
"The patient is a 46-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 62, triceps skin fold thickness of 32, plasma glucose concentration of 92, 2-hour serum insulin of 126, and a body mass index of 32.0. Her diabetes pedigree function is 0.085.###\nHence this label was avoid."
"The patient is a 47-year-old female who is one-time pregnant with low diastolic blood pressure and no triceps skin fold thickness. She had a plasma glucose concentration of 126 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is zero, and her body mass index is 30.1, indicating overweight. The diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was consent."
"A 26-year-old woman who is pregnant for the first time shows normal diastolic blood pressure and low triceps skin fold thickness. Her glucose concentration after a 2-hour oral GTT is within normal range, while her insulin levels are low. She has a high body mass index and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"This individual is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 94, a triceps skin fold thickness of 33, and a plasma glucose concentration of 143 after a glucose tolerance test. Her 2-hour serum insulin level is 146, and she has a body mass index of 36.6. Her diabetes pedigree function is 0.254.###\nHence this label was consent."
"The patient is a 21-year-old female who has never been pregnant. She has a normal diastolic blood pressure of 75 and a low triceps skin fold thickness of 23. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 102, with no detectable serum insulin levels. She has a body mass index of 0.0, indicating underweight, and a moderate diabetes pedigree function score of 0.572.###\nHence this label was avoid."
"A 22-year-old woman who has been pregnant twice has a low diastolic blood pressure, moderate triceps skin fold thickness, and normal plasma glucose concentration after a glucose tolerance test. Her insulin levels are slightly elevated, and she has a healthy body mass index with a moderate diabetes pedigree function score.###\nHence this label was avoid."
"This is a data record of a 37-year-old patient who has been pregnant 3 times. The patient has normal diastolic blood pressure and zero triceps skin fold thickness. Their glucose concentration after a 2-hour oral glucose tolerance test is 150, with zero serum insulin levels. The patient has a low body mass index of 21.0 and a relatively low diabetes pedigree function of 0.207.###\nHence this label was avoid."
"A 21-year-old individual who has been pregnant twice shows normal diastolic blood pressure and a healthy body mass index. Their triceps skin fold thickness is below average, while their plasma glucose concentration is within the normal range. Additionally, they have very low 2-hour serum insulin levels and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"A 40-year-old individual who has been pregnant 5 times shows normal diastolic blood pressure and a healthy BMI. Their glucose levels after a standard oral glucose tolerance test are slightly elevated, while their insulin levels are within the normal range. Despite a moderate family history of diabetes, the overall risk of developing diabetes appears to be relatively low based on these measurements.###\nHence this label was avoid."
"This individual is a 46-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 37, and a body mass index of 46.2, indicating obesity. Her plasma glucose concentration after a glucose tolerance test is 134, which is slightly elevated. The 2-hour serum insulin level is high at 370, suggesting possible insulin resistance. The diabetes pedigree function score is 0.238, indicating a moderate genetic risk for diabetes. Overall, this individual shows signs of potential risk for developing diabetes due to high insulin levels and BMI.###\nHence this label was consent."
"The patient is a 41-year-old female who has been pregnant once. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 48, and a plasma glucose concentration of 120 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 200, and she has a body mass index of 38.9. Additionally, her diabetes pedigree function is 1.162.###\nHence this label was avoid."
"The patient is a 66-year-old female who has been pregnant twice. She has a diastolic blood pressure of 90 mmHg, no triceps skin fold thickness, and a body mass index of 31.6 indicating she is overweight. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 158 mg/dL. She has no insulin in her serum at the 2-hour mark and a diabetes pedigree function of 0.805, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"A 36-year-old individual, who is pregnant for the first time, shows a healthy diastolic blood pressure of 74. Their triceps skin fold thickness is within the normal range at 21mm. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 95 mg/dL. A moderate level of insulin is present in the serum at 73 μU/mL. The individual has a body mass index of 25.9, indicating a normal weight. The diabetes pedigree function score is 0.673, suggesting a slight genetic predisposition to diabetes. Overall, the data paints a picture of a healthy individual with no immediate risk of developing diabetes.###\nHence this label was avoid."
"A 24-year-old individual, who has been pregnant twice, with slightly elevated diastolic blood pressure of 88. They have a moderately high triceps skin fold thickness of 37, and a high plasma glucose concentration of 174 after a glucose tolerance test. Their 2-hour serum insulin level is also elevated at 120. Despite their young age, they have a high body mass index of 44.5, indicating obesity. The individual has a relatively low diabetes pedigree function score of 0.646, suggesting a moderate family history of diabetes.###\nHence this label was consent."
"The patient is a 30-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 80, triceps skin fold thickness of 11, plasma glucose concentration of 99 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 64. Her body mass index is 19.3 and her diabetes pedigree function is 0.284.###\nHence this label was avoid."
"A 27-year-old woman, who is pregnant for the first time, has a low diastolic blood pressure of 68. She has no triceps skin fold thickness and very low insulin levels. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 83, indicating good blood sugar control. With a low body mass index of 18.2 and a moderately low diabetes pedigree function of 0.624, she appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"The individual is a 21-year-old female who is one-time pregnant. She has a healthy diastolic blood pressure of 60 mmHg and a moderate triceps skin fold thickness of 23 mm. Her plasma glucose concentration after a glucose tolerance test is 130 mg/dL, and she has a higher than normal 2-hour serum insulin level of 170 µU/mL. With a body mass index of 28.6, she is considered overweight. Her diabetes pedigree function score is 0.692, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is 38 years old and has been pregnant 10 times. They have a diastolic blood pressure of 86 and a triceps skin fold thickness of 37. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 101. They have 0 serum insulin after 2 hours. The patient has a body mass index of 45.6 and a diabetes pedigree function of 1.136.###\nHence this label was consent."
"A 26-year-old woman who has been pregnant four times shows low diastolic blood pressure, moderate triceps skin fold thickness, and normal plasma glucose levels following a glucose tolerance test. Her 2-hour serum insulin levels are within a healthy range, and her body mass index is also normal. With a low diabetes pedigree function score of 0.34, she appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"This patient is a 35-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 158, and her 2-hour serum insulin level is 328. With a body mass index of 35.5 and a diabetes pedigree function of 0.344, she may have an increased risk for developing diabetes.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 46 and a moderate triceps skin fold thickness of 21. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is slightly elevated at 127. The patient has a high serum insulin level of 335, which may indicate insulin resistance. Despite this, her body mass index is in the overweight range at 34.4. The patient has a relatively low diabetes pedigree function score of 0.176, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"A 27-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness is within normal range, and her plasma glucose concentration after a glucose tolerance test is below the normal cutoff. She has low insulin levels and a relatively low diabetes pedigree score, suggesting she may have a lower risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 24-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 34. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is slightly elevated at 141, and she has a higher-than-average 2-hour serum insulin level of 128. Despite these values, her body mass index is within the normal range at 25.4, and her diabetes pedigree function score is relatively low at 0.699.###\nHence this label was avoid."
"This patient is a 31-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 39 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 173 mg/dL, and her 2-hour serum insulin level is 185 µU/mL. With a body mass index of 33.8, she has a relatively high risk of developing diabetes, as indicated by her diabetes pedigree function of 0.97.###\nHence this label was consent."
"This individual is a 33-year-old who has been pregnant once. They have a diastolic blood pressure of 74 mmHg and a triceps skinfold thickness of 17 mm. In a glucose tolerance test, their plasma glucose concentration at 2 hours is 167 mg/dL, and their 2-hour serum insulin level is 144 mu U/mL. They have a body mass index of 23.4 and a diabetes pedigree function value of 0.447.###\nHence this label was consent."
"A 31-year-old woman who has never been pregnant has normal diastolic blood pressure, no triceps skin fold thickness, and no insulin production. Her plasma glucose concentration is slightly elevated at 145, and she has a high body mass index of 44.2. With a modest diabetes pedigree function score of 0.63, she may have a low risk of developing diabetes based on these measurements.###\nHence this label was consent."
"This individual is a 58-year-old woman who has been pregnant 8 times. Her diastolic blood pressure is 76, triceps skin fold thickness is 0, and 2-hour serum insulin level is 0. Her plasma glucose concentration after a glucose tolerance test is 110. She has a body mass index of 27.8 and a low diabetes pedigree function of 0.237.###\nHence this label was avoid."
"This individual is 24 years old and has never been pregnant. They have a diastolic blood pressure of 85 and a high triceps skin fold thickness of 54. During a glucose tolerance test, their plasma glucose concentration at 2 hours was 147. Their 2-hour serum insulin level is 0. Their body mass index is 42.8, indicating obesity. The diabetes pedigree function, a measure of the diabetes history in relatives, is 0.375. These factors suggest a potential risk for developing diabetes in the future.###\nHence this label was avoid."
"The patient is a 39-year-old woman who has been pregnant 6 times. She has a healthy diastolic blood pressure of 74 mmHg. Her triceps skin fold thickness is 32 mm. After a 2-hour oral glucose tolerance test, her plasma glucose concentration was measured at 154 mg/dL. She has a 2-hour serum insulin level of 193 μU/mL. Her body mass index is 29.3, indicating she is overweight. The calculated diabetes pedigree function is 0.839, suggesting a moderate familial risk of diabetes.###\nHence this label was avoid."
"The individual is a 56-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 85 and a triceps skin fold thickness of 32. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 90, and her 2-hour serum insulin level is 0. With a body mass index of 34.9 and a diabetes pedigree function of 0.825, she may be at risk for developing diabetes.###\nHence this label was consent."
"This 29-year-old individual, who has been pregnant twice, shows normal diastolic blood pressure and moderately high triceps skin fold thickness. Their blood glucose level after a glucose tolerance test is within normal range, while their insulin level after 2 hours is relatively high. The individual has a body mass index indicating obesity and a moderate diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 24-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 74 mmHg, a triceps skin fold thickness of 15 mm, and a plasma glucose concentration of 116 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 105 μU/mL and her body mass index is 26.3 kg/m2. The diabetes pedigree function score, which indicates the likelihood of developing diabetes based on family history, is 0.107.###\nHence this label was avoid."
"This 21-year-old individual has been pregnant 4 times and has a healthy diastolic blood pressure of 76. Their triceps skin fold thickness is 15, indicating a normal amount of subcutaneous fat. With a plasma glucose concentration of 99 and 2-hour serum insulin level of 51, their blood sugar levels are within a normal range. Their body mass index is 23.2, which is considered normal. The diabetes pedigree function score of 0.223 suggests a low genetic risk of developing diabetes.###\nHence this label was avoid."
"This 22-year-old individual has been pregnant 3 times and has a diastolic blood pressure of 66. Their triceps skin fold thickness is 25, while their plasma glucose concentration after a glucose tolerance test is 148. They have no insulin in their serum after 2 hours, and their body mass index is 32.5. The diabetes pedigree function for this individual is 0.256.###\nHence this label was avoid."
"The patient, a 40-year-old female, has a low risk of developing diabetes. She has been pregnant once, with a diastolic blood pressure of 88. Her triceps skin fold thickness is 24mm, and her 2-hour plasma glucose concentration from an oral glucose tolerance test is 117mg/dL. The 2-hour serum insulin level is 145mu U/ml, and she has a body mass index of 34.5. Her diabetes pedigree function is 0.403, indicating a low likelihood of developing the disease.###\nHence this label was consent."
"The data describes a 34-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 72, triceps skin fold thickness of 45, and a plasma glucose concentration of 123 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 230, and they have a body mass index of 33.6. The diabetes pedigree function value is 0.733.###\nHence this label was avoid."
"The patient is a 42-year-old woman who has been pregnant 9 times. She has a very low diastolic blood pressure of 52 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 106, and she has no insulin in her serum after 2 hours. Despite having a body mass index of 31.2, indicating she is overweight, her diabetes pedigree function is relatively low at 0.38.###\nHence this label was avoid."
"This patient is a 22-year-old individual who is pregnant for the first time. They have a lower than normal diastolic blood pressure of 48 and a body mass index of 24.7, indicating a healthy weight. Their triceps skin fold thickness is 20, which is within a typical range. However, their plasma glucose concentration and 2-hour serum insulin levels are both at 0, suggesting a possible issue with glucose metabolism. The diabetes pedigree function value is 0.14, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"This patient is 53 years old and has been pregnant 9 times. \nThey have a diastolic blood pressure of 88 and a triceps skin fold thickness of 34. \nTheir plasma glucose concentration at 2 hours is 145 and their 2-hour serum insulin level is 165. \nWith a body mass index of 30.3 and a diabetes pedigree function of 0.771, this individual's risk of developing diabetes may be higher.###\nHence this label was consent."
"A 28-year-old woman, who is pregnant for the first time, has normal diastolic blood pressure and a below average triceps skin fold thickness. Her glucose levels are within the normal range after a 2-hour oral glucose tolerance test, and she has moderate insulin levels. She has a healthy body mass index and a low diabetes pedigree function.###\nHence this label was avoid."
"A 42-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 86. Their triceps skin fold thickness is 30 mm, plasma glucose concentration is 117 mg/dL, and 2-hour serum insulin level is 105 mu U/ml. They have a body mass index of 39.1 and a diabetes pedigree function value of 0.251.###\nHence this label was avoid."
"A 27-year-old woman, who has been pregnant 4 times, shows normal diastolic blood pressure and zero triceps skin fold thickness. Her glucose levels are within normal range after a glucose tolerance test, and she has no insulin level after 2 hours. Despite having a slightly elevated body mass index, she has a relatively low diabetes pedigree function score.###\nHence this label was consent."
"This individual is a young adult at the age of 26, who has never been pregnant. They have a diastolic blood pressure of 94, a triceps skin fold thickness of 46, and a high plasma glucose concentration of 135 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is elevated at 145. Despite having a high body mass index of 40.6, their diabetes pedigree function is relatively low at 0.284.###\nHence this label was avoid."
"A 24-year-old individual who has never been pregnant has a diastolic blood pressure of 85. Their triceps skin fold thickness is 25, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 95. They have a 2-hour serum insulin level of 36 and a body mass index of 37.4. Their diabetes pedigree function is 0.247.###\nHence this label was consent."
"This 24-year-old individual has been pregnant 2 times and has relatively low diastolic blood pressure of 65. Their triceps skin fold thickness is 28, indicating a moderate level of subcutaneous fat. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 83, which is within the normal range. Their 2-hour serum insulin level is 66. Despite having a high body mass index of 36.8, the individual has a relatively low diabetes pedigree function score of 0.629, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 47-year-old individual who has been pregnant 10 times with a healthy diastolic blood pressure of 68. They have a normal triceps skin fold thickness of 23, and a slightly elevated plasma glucose concentration of 161 after a GTT. Their 2-hour serum insulin level is within the normal range at 132. With a body mass index of 25.5, they are considered to be within a healthy weight range. The individual has a low diabetes pedigree function score of 0.326, indicating a lower genetic risk for diabetes.###\nHence this label was consent."
"A 34-year-old woman who has been pregnant 4 times has normal diastolic blood pressure and a healthy body mass index. She has low triceps skin fold thickness and a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin levels are low, and she has a low diabetes pedigree function score.###\nHence this label was avoid."
"A 25-year-old individual who has been pregnant twice with low diastolic blood pressure, moderate triceps skin fold thickness, and high plasma glucose concentration at 2 hours. They have very high 2-hour serum insulin levels and a high body mass index, but a low diabetes pedigree function score.###\nHence this label was consent."
"This is a data record of a 22-year-old individual with zero pregnancies. Their diastolic blood pressure is 52, triceps skin fold thickness is 10, and plasma glucose concentration after a glucose tolerance test is 74. The 2-hour serum insulin level is 36, body mass index is 27.8, and diabetes pedigree function is 0.269.###\nHence this label was avoid."
"This data describes a 21-year-old individual who has been pregnant twice, with normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 118, and their 2-hour serum insulin level is 0. The individual has a high body mass index of 42.9 and a moderate diabetes pedigree function of 0.693.###\nHence this label was consent."
"This patient is 38 years old and has been pregnant 13 times. They have a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 0. Their plasma glucose concentration after a GTT is 104, with a 2-hour serum insulin level of 0. The patient has a body mass index of 31.2 and a relatively low diabetes pedigree function of 0.465.###\nHence this label was consent."
"A 27-year-old female who has never been pregnant presents with normal diastolic blood pressure and a slightly below average triceps skin fold thickness. Her glucose levels are within normal limits after a 2-hour oral glucose tolerance test, and she has a moderate level of insulin in her serum. Her body mass index is in the overweight range, and she has a moderately low diabetes pedigree function score.###\nHence this label was avoid."
"A 35-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 84. They have a triceps skin fold thickness of 41, plasma glucose concentration is 136 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 88. Their body mass index is 35.0 and they have a diabetes pedigree function of 0.286.###\nHence this label was consent."
"This patient is a 51-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 84, triceps skin fold thickness of 21, and a high plasma glucose concentration of 181. Her 2-hour serum insulin level is 192, and she has a body mass index of 35.9, indicating obesity. The diabetes pedigree function value is 0.586, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 25-year-old female who is pregnant for the first time. She has low diastolic blood pressure, average triceps skin fold thickness, and normal plasma glucose concentration. Her 2-hour serum insulin level is slightly elevated. She has a high body mass index and a low diabetes pedigree function score, indicating a lower risk for developing diabetes.###\nHence this label was avoid."
"This patient is a young adult female in her early twenties, who is pregnant for the first time. She has low diastolic blood pressure, a normal triceps skin fold thickness, and a moderately low plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are very low, and she has a healthy body mass index. The diabetes pedigree function indicates a relatively low genetic risk for diabetes.###\nHence this label was avoid."
"This 22-year-old individual has been pregnant 4 times and shows normal diastolic blood pressure. They have no triceps skin fold thickness, moderate glucose levels after a GTT, and low insulin levels. Despite a high body mass index, their risk of diabetes is relatively low based on their family history.###\nHence this label was consent."
"This 23-year-old individual has been pregnant twice and has a diastolic blood pressure of 64. Their triceps skin fold thickness is 32, with a plasma glucose concentration of 93 after a glucose tolerance test. The 2-hour serum insulin level is 160, and their body mass index is 38.0. The diabetes pedigree function is calculated as 0.674.###\nHence this label was consent."
"A 33-year-old woman who has never been pregnant has a diastolic blood pressure of 66, triceps skin fold thickness of 30, and a plasma glucose concentration of 121 after a glucose tolerance test. She has a 2-hour serum insulin level of 165 and a body mass index of 34.3. Her diabetes pedigree function is 0.203.###\nHence this label was consent."
"This data belongs to a 24-year-old female who is pregnant for the first time. She has very low diastolic blood pressure (50 mmHg) and a normal triceps skin fold thickness of 16mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is very high at 193 mg/dL. Additionally, her 2-hour serum insulin level is significantly elevated at 375 uU/mL. Despite these values, her body mass index is within the normal range at 25.9, and her diabetes pedigree function score is relatively low at 0.655. Overall, the data suggests a potential risk for developing diabetes due to the high glucose and insulin levels.###\nHence this label was avoid."
"The individual in this dataset is a 27-year-old who has been pregnant 3 times. They have normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration 2 hours after an oral glucose tolerance test is 141, while their 2-hour serum insulin level is 0. They have a body mass index of 30.0 and a diabetes pedigree function of 0.761.###\nHence this label was consent."
"A 24-year-old individual, who has been pregnant once, with low diastolic blood pressure of 48. They have a relatively high triceps skin fold thickness of 45, and moderate plasma glucose concentration of 128 after a glucose tolerance test. Their 2-hour serum insulin level is elevated at 194. Despite having a high body mass index of 40.5, their diabetes pedigree function is relatively low at 0.613.###\nHence this label was consent."
"A 22-year-old woman who has been pregnant 4 times shows normal diastolic blood pressure, slightly elevated triceps skin fold thickness, and normal plasma glucose concentration after a glucose tolerance test. She has moderate insulin levels, a high body mass index, and a low diabetes pedigree function score. Overall, her measurements indicate a moderate risk for developing diabetes.###\nHence this label was avoid."
"This is a 22-year-old individual who has been pregnant 2 times. They have normal diastolic blood pressure, a slightly above average triceps skin fold thickness, and low plasma glucose concentration after a 2-hour oral glucose tolerance test. Their insulin level is very low. Despite a slightly elevated body mass index, their diabetes pedigree function is moderate. Overall, the individual has some concerning factors for diabetes risk based on these measurements.###\nHence this label was avoid."
"A 26-year-old female who has been pregnant twice shows normal diastolic blood pressure and low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within the normal range, along with a moderate level of insulin. Despite a low body mass index, she has a family history of diabetes.###\nHence this label was avoid."
"The patient is a 54-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 84 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 162, and she has no insulin present in her serum after 2 hours. With a body mass index of 27.7 and a low diabetes pedigree function score of 0.182, she may have a lower risk of developing diabetes.###\nHence this label was avoid."
"This patient is a young adult, 26 years old, who is slightly underweight with a body mass index of 21.8. They have been pregnant once. Their diastolic blood pressure and triceps skin fold thickness are low. Their plasma glucose concentration after a glucose tolerance test is also low at 71, and their 2-hour serum insulin level is at 0. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.416.###\nHence this label was avoid."
"A 45-year-old woman, who has been pregnant 9 times, shows no triceps skin fold thickness and 0 serum insulin level. However, she has a relatively high plasma glucose concentration of 164, a diastolic blood pressure of 78, and a body mass index of 32.8. Her diabetes pedigree function is low at 0.148.###\nHence this label was consent."
"This is a 21-year-old patient who has been pregnant 3 times and shows low diastolic blood pressure of 62. They have no triceps skin fold thickness and a normal 2-hour serum insulin level of 0. The patient's plasma glucose concentration from a GTT is 111, indicating normal levels. Their body mass index is 22.6, which falls within the healthy range. Additionally, the patient has a low diabetes pedigree function score of 0.142, suggesting a low genetic risk of diabetes.###\nHence this label was avoid."
"The patient is a 38-year-old woman who has been pregnant 14 times. She has a low diastolic blood pressure of 62 and a moderately thick triceps skin fold of 30. Her plasma glucose concentration after a glucose tolerance test is high at 175. She has no insulin in her serum after 2 hours. Her body mass index is 33.6, indicating she is overweight. The diabetes pedigree function is low at 0.212, suggesting a relatively low genetic risk for diabetes.###\nHence this label was consent."
"A 28-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure, average triceps skin fold thickness, low insulin levels, and a slightly elevated body mass index. Her glucose tolerance test indicates a normal plasma glucose concentration, and she has a low diabetes pedigree score.###\nHence this label was avoid."
"A 23-year-old woman, who has been pregnant twice, with a diastolic blood pressure of 76, triceps skin fold thickness of 18, plasma glucose concentration of 94, 2-hour serum insulin level of 66, a body mass index of 31.6, and a diabetes pedigree function value of 0.649.###\nHence this label was avoid."
"This is a data entry of a 23-year-old individual who has never been pregnant. Their diastolic blood pressure is 64, with a triceps skin fold thickness of 23. The plasma glucose concentration after a 2-hour GTT is 104, and their 2-hour serum insulin level is 116. Their body mass index is 27.8, and the diabetes pedigree function is 0.454.###\nHence this label was avoid."
"The patient is a 27-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 85, triceps skin fold thickness of 27, plasma glucose concentration of 146, and 2-hour serum insulin level of 100. Her body mass index is 28.9 and her diabetes pedigree function is 0.189.###\nHence this label was avoid."
"A 32-year-old woman who has been pregnant 8 times shows normal diastolic blood pressure, no triceps skin fold thickness, high plasma glucose concentration after a glucose tolerance test, no insulin levels after 2 hours, a healthy body mass index, and a low diabetes pedigree function score.###\nHence this label was consent."
"This is a data entry for a 25-year-old individual who has been pregnant twice. She has a low diastolic blood pressure of 52, average triceps skin fold thickness of 22, and a normal plasma glucose concentration of 82 after a glucose tolerance test. Her 2-hour serum insulin level is elevated at 115, and she has a body mass index of 28.5, indicating she is overweight. Additionally, her diabetes pedigree function is 1.699, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"A 23-year-old individual who is 1 time pregnant with a healthy diastolic blood pressure of 62. They have a fairly low triceps skin fold thickness of 13, normal plasma glucose concentration of 111 after a glucose tolerance test and high insulin levels at 182. Despite the high insulin levels, their body mass index is normal at 24.0. Overall, their diabetes pedigree function is low at 0.138, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"The patient is 42 years old with a history of 6 pregnancies. They have normal diastolic blood pressure and triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is low, and they have no insulin present in their serum. The patient has a slightly elevated body mass index and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 51-year-old individual who has been pregnant 7 times shows a diastolic blood pressure of 74, triceps skin fold thickness of 26, and a plasma glucose concentration of 136 after a 2-hour oral glucose tolerance test. Additionally, their 2-hour serum insulin level is 135, body mass index is 26.0, and they have a diabetes pedigree function value of 0.647.###\nHence this label was avoid."
"A 30-year-old individual with 5 pregnancies shows normal diastolic blood pressure and moderate triceps skin fold thickness. They have slightly elevated plasma glucose levels after a glucose tolerance test and average serum insulin levels. Their body mass index indicates they are slightly overweight. Family history suggests a low risk of developing diabetes.###\nHence this label was avoid."
"This is a young individual, age 22, who is pregnant for the first time. They have a low diastolic blood pressure of 60 and a healthy body mass index of 23.9. Their triceps skin fold thickness is 18, indicating a moderate level of subcutaneous fat. The plasma glucose concentration after a glucose tolerance test is 95, which is within the normal range. Additionally, their 2-hour serum insulin level is 58, suggesting a normal insulin response. The diabetes pedigree function is low at 0.26, indicating a lower genetic risk of developing diabetes.###\nHence this label was avoid."
"This 27-year-old patient has been pregnant twice and has a low diastolic blood pressure of 54. They have a triceps skin fold thickness of 0, which is quite low. Their plasma glucose concentration after a GTT is 120, while their 2-hour serum insulin level is 0. With a body mass index of 26.8, this individual has a relatively healthy weight. Their diabetes pedigree function is 0.455, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This is a 25-year-old patient who has been pregnant 2 times. Their diastolic blood pressure is 68, triceps skin fold thickness is 22, and plasma glucose concentration after a glucose tolerance test is 114. Their 2-hour serum insulin level is 0, and they have a body mass index of 28.7. The diabetes pedigree function indicates a low genetic risk for diabetes (0.092).###\nHence this label was avoid."
"The patient is a 24-year-old woman who is pregnant for the first time. She has low diastolic blood pressure (54), normal triceps skin fold thickness (13), and normal plasma glucose concentration (119) after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 50, indicating normal insulin production. She has a healthy body mass index of 22.3 and a low diabetes pedigree function score of 0.205. Overall, her current health indicators suggest a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 76 mmHg. Her triceps skin fold thickness is 28 mm. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 155 mg/dL. Her 2-hour serum insulin level is 150 μU/mL. She has a body mass index of 33.3 kg/m² and a diabetes pedigree function of 1.353.###\nHence this label was consent."
"The patient is a 21-year-old female who is pregnant for the first time. She has a healthy diastolic blood pressure of 64 and a normal triceps skin fold thickness of 35. Her plasma glucose concentration after a GTT is 113, indicating a normal blood sugar level. She has no insulin in her bloodstream after 2 hours. Her body mass index is 33.6, which falls into the obese category. The diabetes pedigree function score is 0.543, suggesting a low genetic susceptibility to diabetes.###\nHence this label was consent."
"This 21-year-old patient, who has been pregnant twice, has a diastolic blood pressure of 75 and a triceps skin fold thickness of 32. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 112, with a 2-hour serum insulin level of 0. They have a body mass index of 35.7 and a diabetes pedigree function value of 0.148.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant twice and has a relatively low diastolic blood pressure of 62. The triceps skin fold thickness is 13, indicating a moderate amount of subcutaneous fat. The plasma glucose concentration after a glucose tolerance test is low at 68, and the 2-hour serum insulin level is also on the lower side at 15. With a body mass index of 20.1, this person is within the normal weight range. The diabetes pedigree function score is 0.257, suggesting a low genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 22-year-old woman who is pregnant for the first time. She has a normal diastolic blood pressure of 80 and a below average triceps skin fold thickness of 11. Her glucose levels are within the normal range at 103 after a 2-hour oral glucose tolerance test, and her insulin levels are slightly elevated at 82. She has a low body mass index of 19.4 and a relatively low diabetes pedigree function score of 0.491.###\nHence this label was avoid."
"The patient is a young adult female who is possibly pregnant for the first time. She has slightly elevated blood pressure and a relatively high triceps skin fold thickness. Her glucose levels after the oral glucose tolerance test are within normal range, but her insulin levels are elevated. She has a high body mass index and a moderate diabetes pedigree function score, indicating a potential risk for developing diabetes.###\nHence this label was avoid."
"The data represents a 36-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 82, triceps skin fold thickness of 32, plasma glucose concentration of 112, 2-hour serum insulin level of 175, and a body mass index of 34.2. The diabetes pedigree function score is 0.26.###\nHence this label was consent."
"The patient is a 30-year-old female who has never been pregnant, with normal diastolic blood pressure, no triceps skin fold thickness, no serum insulin present, but high plasma glucose concentration at 167. Despite an overall healthy body mass index of 32.3, she has a moderately elevated diabetes pedigree function score of 0.839, indicating a potential genetic predisposition to diabetes.###\nHence this label was consent."
"A 28-year-old woman who has been pregnant 4 times. She has normal diastolic blood pressure and a healthy body mass index. Her plasma glucose concentration is within the normal range, and she has low insulin levels. She has a moderately low triceps skin fold thickness and a low diabetes pedigree function score. Overall, she appears to have a relatively low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"This is a data entry for a 26-year-old individual who is pregnant for the first time. The person has a very low diastolic blood pressure of 38 and a moderately low triceps skin fold thickness of 18. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 109, which is within the normal range. The 2-hour serum insulin level is high at 120. The individual has a healthy body mass index of 23.1 and a moderately low diabetes pedigree function score of 0.407.###\nHence this label was avoid."
"This is a 23-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 62 and a triceps skin fold thickness of 13. Their plasma glucose concentration after a glucose tolerance test is 107, with a 2-hour serum insulin level of 48. The individual has a body mass index of 22.9 and a diabetes pedigree function value of 0.678.###\nHence this label was consent."
"The patient is a 64-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 0mm, indicating low body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120 mg/dL. The patient's 2-hour serum insulin level is 0, suggesting possible insulin resistance. She has a body mass index of 25.0, within the normal range. The patient's diabetes pedigree function is 0.409, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This 28-year-old patient has experienced 6 pregnancies and shows unusual values for some diagnostic measurements: diastolic blood pressure and triceps skin fold thickness are at 0, while 2-hour serum insulin is also at 0. Despite these, the patient's plasma glucose concentration after a glucose tolerance test is 96, body mass index is 23.7, and diabetes pedigree function is 0.19.###\nHence this label was avoid."
"A 57-year-old individual, pregnant 8 times, with a diastolic blood pressure of 76, triceps skin fold thickness of 29, plasma glucose concentration of 196 after a glucose tolerance test, 2-hour serum insulin level of 280, a body mass index of 37.5, and a diabetes pedigree function of 0.605.###\nHence this label was consent."
"This is a 34-year-old individual who has been pregnant 3 times. Their diastolic blood pressure is 78, triceps skin fold thickness is 23, plasma glucose concentration after a glucose tolerance test is 130, and 2-hour serum insulin is 79. They have a body mass index of 28.4 and a diabetes pedigree function value of 0.323.###\nHence this label was consent."
"This patient is 32 years old and has been pregnant 4 times. Their diastolic blood pressure is 75, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. Their plasma glucose concentration after a glucose tolerance test is 156. They have a high body mass index of 48.3 and a low diabetes pedigree function of 0.238.###\nHence this label was consent."
"A 27-year-old woman who has been pregnant twice and has a healthy diastolic blood pressure of 70. She has a moderate triceps skin fold thickness of 16mm and a normal plasma glucose concentration of 99mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is at 44 μU/mL, indicating a healthy response to glucose intake. With a body mass index of 20.4, she is within the normal weight range. Additionally, her low diabetes pedigree function score of 0.235 suggests a lower risk of developing diabetes based on her family history.###\nHence this label was avoid."
"This 27-year-old individual has been pregnant 6 times and has a below-normal diastolic blood pressure of 60. They have a relatively low triceps skin fold thickness of 27 and a normal plasma glucose concentration of 109 after a 2-hour oral glucose tolerance test. Their insulin level after 2 hours is 0, indicating potential low insulin production. With a body mass index of 25.0 and a diabetes pedigree function of 0.206, this individual may have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This 22-year-old individual, who has been pregnant once, has a diastolic blood pressure of 76 mmHg. Their triceps skin fold thickness is 43 mm. In a glucose tolerance test, their plasma glucose concentration after 2 hours is 199 mg/dL, and their 2-hour serum insulin level is 0 uU/mL. They have a body mass index of 42.9, and a diabetes pedigree function value of 1.394. These measurements provide insight into this individual's health status and potential risk for developing diabetes.###\nHence this label was consent."
"The patient is a 24-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 72, a triceps skin fold thickness of 33, and a body mass index of 33.3. In a glucose tolerance test, her plasma glucose concentration at 2 hours was 171, and her 2-hour serum insulin level was 135. Her diabetes pedigree function is 0.199.###\nHence this label was consent."
"The patient is a 62-year-old female who has been pregnant twice. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 99 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 197 mg/dL. Her 2-hour serum insulin level is 0 uU/mL. She has a body mass index of 34.7 and a diabetes pedigree function of 0.575, indicating a moderate familial history of diabetes.###\nHence this label was consent."
"A 26-year-old individual who has never been pregnant has a diastolic blood pressure of 76. Their triceps skin fold thickness is 36, while their plasma glucose concentration after a glucose tolerance test is 162. They have no insulin present after a 2-hour serum test and have a body mass index of 49.6. Their diabetes pedigree function is 0.364.###\nHence this label was consent."
"This 28-year-old individual has been pregnant 3 times and shows normal diastolic blood pressure. Their triceps skin fold thickness, plasma glucose concentration, and body mass index are within healthy ranges. The 2-hour serum insulin level is slightly elevated, and the diabetes pedigree function score indicates a low genetic risk for diabetes.###\nHence this label was consent."
"This patient is a 37-year-old female who has been pregnant 10 times. She has low diastolic blood pressure (70 mmHg) and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is elevated at 179 mg/dL. She has no 2-hour serum insulin detected. Despite having a high body mass index of 35.1, her diabetes pedigree function is low at 0.2.###\nHence this label was avoid."
"A 21-year-old female who is 1 time pregnant with a healthy diastolic blood pressure of 74, a moderate triceps skin fold thickness of 22, and a normal plasma glucose concentration at 143 after a 2-hour oral glucose tolerance test. She has a relatively low 2-hour serum insulin level of 61, a healthy body mass index of 26.2, and a low diabetes pedigree function score of 0.256.###\nHence this label was avoid."
"A 45-year-old individual who has been pregnant 6 times with a diastolic blood pressure of 94 mmHg. They have no triceps skin fold thickness, a high plasma glucose concentration of 183 mg/dL after a 2-hour oral glucose tolerance test, and zero 2-hour serum insulin. Their body mass index is 40.8, indicating obesity. The diabetes pedigree function is 1.461, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual, aged 45, has been pregnant 4 times. They have a diastolic blood pressure of 70, triceps skin fold thickness of 18, and a plasma glucose concentration of 125 after a glucose tolerance test. Their 2-hour serum insulin level is 122, and they have a body mass index of 28.9. Their diabetes pedigree function is 1.144.###\nHence this label was consent."
"The patient is a 38-year-old female who has never been pregnant. She has a normal diastolic blood pressure of 88 and a slightly above average body mass index of 32.5. Her triceps skin fold thickness is 30, indicating some amount of subcutaneous fat. She has a relatively low plasma glucose concentration of 109 and zero insulin levels after a glucose tolerance test. Her diabetes pedigree function is 0.855, suggesting a moderate genetic risk for diabetes.###\nHence this label was consent."
"This patient is 36 years old and has never been pregnant. They have a normal diastolic blood pressure of 70 and a slightly below average triceps skin fold thickness of 20. Their glucose level after a 2-hour GTT is 124, indicating normal levels. They have no serum insulin after 2 hours. Their body mass index is in the normal range at 27.4 and their diabetes pedigree function is low at 0.254.###\nHence this label was consent."
"A 70-year-old individual who has been pregnant four times with a diastolic blood pressure of 82. Their triceps skin fold thickness is 18, plasma glucose concentration after a glucose tolerance test is 145, and 2-hour serum insulin level is 0. They have a body mass index of 32.5 and a diabetes pedigree function of 0.235.###\nHence this label was consent."
"The patient is a 39-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 76 mmHg and a triceps skin fold thickness of 28 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 129 mg/dL. Additionally, her 2-hour serum insulin level is 122 μU/mL, and her body mass index is 35.9 kg/m². The diabetes pedigree function, which indicates the likelihood of developing diabetes based on family history, is 0.28.###\nHence this label was avoid."
"This 21-year-old individual, who has been pregnant once, has a diastolic blood pressure of 66 and a triceps skin fold thickness of 36. During a glucose tolerance test, their plasma glucose concentration after 2 hours was 114 and their 2-hour serum insulin level was 200. They have a body mass index of 38.1 and a diabetes pedigree function value of 0.289.###\nHence this label was avoid."
"The patient is a 62-year-old female who has been pregnant once. She has a very low diastolic blood pressure of 54 and a triceps skin fold thickness of 0, indicating low fat levels. Her glucose concentration after a glucose tolerance test is 135 mg/dL. The patient's insulin levels after 2 hours are also low at 0. With a body mass index of 26.7, she is considered to be overweight. Her diabetes pedigree function score is 0.687, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This patient is a 25-year-old female who has been pregnant 3 times. She has low diastolic blood pressure, no triceps skin fold thickness, and a low plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are also low. Despite a low body mass index, she has a moderate risk of developing diabetes based on her diabetes pedigree function score of 0.389.###\nHence this label was avoid."
"This is a 29-year-old individual who has been pregnant twice. \nThey have a diastolic blood pressure of 76 and a triceps skin fold thickness of 37. \nTheir plasma glucose concentration after a 2-hour oral glucose tolerance test is 120, with a 2-hour serum insulin level of 105.\nThe individual has a body mass index of 39.7 and a diabetes pedigree function of 0.215.###\nHence this label was avoid."
"A 25-year-old individual who is not pregnant has normal diastolic blood pressure, a moderately high triceps skin fold thickness, and elevated glucose levels after a glucose tolerance test. Despite having no insulin in their bloodstream, they have a high body mass index and a low diabetes pedigree function score.###\nHence this label was consent."
"A 22-year-old individual who has been pregnant 3 times, with diastolic blood pressure of 84, triceps skin fold thickness of 33, plasma glucose concentration of 173, 2-hour serum insulin of 474, body mass index of 35.7, and a diabetes pedigree function of 0.258.###\nHence this label was consent."
"The patient is a 30-year-old female who is 3 times pregnant. She has a diastolic blood pressure of 64, triceps skin fold thickness of 37, plasma glucose concentration of 170 after a glucose tolerance test, and 2-hour serum insulin level of 225. Her body mass index is 34.5 and diabetes pedigree function is 0.356.###\nHence this label was consent."
"This is a 21-year-old individual who has never been pregnant and has a healthy diastolic blood pressure of 86. Their triceps skin fold thickness is 27, indicating a normal amount of subcutaneous fat. The plasma glucose concentration after a glucose tolerance test is 126, which is within the normal range. Their insulin levels are elevated at 120, suggesting possible insulin resistance. With a body mass index of 27.4, they are considered overweight. Their diabetes pedigree function score is 0.515, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 107, and her 2-hour serum insulin level is 0. The patient has a body mass index of 29.6 and a diabetes pedigree function of 0.254.###\nHence this label was consent."
"A 41-year-old individual with five pregnancies shows normal diastolic blood pressure and no triceps skin fold thickness. They have a plasma glucose concentration of 112 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is at 0, and they have a high body mass index of 37.8. The individual has a low diabetes pedigree function score of 0.261.###\nHence this label was consent."
"The patient is a 49-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 31 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125 mg/dL, with a 2-hour serum insulin level of 0 uU/mL. Her body mass index is 27.6 and her diabetes pedigree function is 0.565.###\nHence this label was consent."
"This is a 27-year-old individual who has been pregnant 3 times and has a diastolic blood pressure of 72. Their triceps skin fold thickness is 25, plasma glucose concentration after a glucose tolerance test is 128, and 2-hour serum insulin level is 190. They have a body mass index of 32.4 and a diabetes pedigree function of 0.549. This data provides insights into their health status and potential risk for developing diabetes.###\nHence this label was consent."
"This individual is a 25-year-old who has never been pregnant. Her diastolic blood pressure is low at 60, and she has no triceps skin fold thickness. She has a normal glucose level of 93 mg/dl and no insulin present in her serum after a 2-hour glucose tolerance test. She has a high body mass index of 35.3, indicating obesity. Her diabetes pedigree function score is low at 0.263, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"This is a dataset of a 22-year-old individual who has been pregnant 3 times. She has a diastolic blood pressure of 86, a triceps skin fold thickness of 16, and a plasma glucose concentration of 81 after a glucose tolerance test. Her 2-hour serum insulin level is 66, and she has a body mass index of 27.5. The diabetes pedigree function for this individual is 0.306.###\nHence this label was avoid."
"The patient is a 21-year-old female who has been pregnant 2 times. She has a normal diastolic blood pressure of 64 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 108, with a 2-hour serum insulin level of 0. Despite having a body mass index of 30.8, indicating obesity, her diabetes pedigree function score is low at 0.158, suggesting a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 39-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 74 and a slightly below average triceps skin fold thickness of 31. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 84, and her 2-hour serum insulin level is also low at 0. Despite having a high body mass index of 38.3, her diabetes pedigree function is low at 0.457.###\nHence this label was avoid."
"This individual is a 23-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 64, a triceps skin fold thickness of 13, and a plasma glucose concentration of 82 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 95, and she has a body mass index of 21.2. Additionally, her diabetes pedigree function is 0.415.###\nHence this label was avoid."
"A 24-year-old woman who has been pregnant 6 times shows normal diastolic blood pressure, slightly below average triceps skin fold thickness and glucose level, no insulin after a glucose test, a high body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"This patient is a young adult who is pregnant for the first time. She has a normal diastolic blood pressure and a healthy body mass index. Her glucose levels are within the normal range after a glucose tolerance test. However, she has low insulin levels and a moderately low triceps skin fold thickness. Overall, this individual seems to have a low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"The patient is a 40-year-old woman who has been pregnant 6 times. She has a low diastolic blood pressure of 60 and a moderately high triceps skin fold thickness of 39. Her plasma glucose concentration after a glucose tolerance test is within normal range at 115. She has no insulin present in her bloodstream after 2 hours. The patient's body mass index is 33.7, indicating that she is overweight. She has a low diabetes pedigree function score of 0.245.###\nHence this label was consent."
"This is a 42-year-old patient who has been pregnant 11 times. Their diastolic blood pressure is 84 mmHg, triceps skin fold thickness is 35 mm, plasma glucose concentration after a glucose tolerance test is 136 mg/dL, and 2-hour serum insulin level is 130 µU/ml. The patient has a body mass index of 28.3 and a diabetes pedigree function score of 0.26.###\nHence this label was consent."
"This is a dataset of a 21-year-old individual who is pregnant for the first time. They have a low diastolic blood pressure of 58 and a low triceps skin fold thickness of 10. Their plasma glucose concentration after a glucose tolerance test is normal at 99. They have no serum insulin after 2 hours, indicating a healthy pancreas function. The individual has a healthy body mass index of 25.4 and a moderately low diabetes pedigree function score of 0.551.###\nHence this label was avoid."
"This individual is a 42-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 23. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 65, and her 2-hour serum insulin is 0. She has a body mass index of 32.0 and a diabetes pedigree function of 0.6.###\nHence this label was avoid."
"The patient is a 48-year-old individual who has been pregnant seven times. Their diastolic blood pressure is 92 mmHg, and they have a triceps skin fold thickness of 18 mm. During an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 106 mg/dL. They have no detectable 2-hour serum insulin. The patient's body mass index is 22.7, and their diabetes pedigree function is 0.235.###\nHence this label was avoid."
"The patient is a 23-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 58 and a moderately high triceps skin fold thickness of 36. Her plasma glucose concentration after a glucose tolerance test is within normal range at 118. She has a relatively high 2-hour serum insulin level of 94. Her body mass index is in the overweight category at 33.3. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.261.###\nHence this label was avoid."
"This individual is a 37-year-old who has been pregnant 5 times. Their diastolic blood pressure is 82, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. Despite having a plasma glucose concentration of 130, their body mass index is 39.1. They have a diabetes pedigree function of 0.956, indicating a potential risk for developing diabetes.###\nHence this label was consent."
"This patient is a 22-year-old female who has never been pregnant. She has a diastolic blood pressure of 84, triceps skin fold thickness of 26, plasma glucose concentration of 141, and a body mass index of 32.4. Her 2-hour serum insulin level is 0, and her diabetes pedigree function is 0.433. Overall, these measurements indicate a risk for developing diabetes that should be monitored closely.###\nHence this label was avoid."
"The patient is a 24-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 21. Her plasma glucose concentration after a GTT is 157, and her 2-hour serum insulin level is 168. She has a body mass index of 25.6 and a low diabetes pedigree function of 0.123. Based on these measurements, she may be at risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 34-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 80, triceps skin fold thickness of 15, and a plasma glucose concentration of 123 after a glucose tolerance test. Her 2-hour serum insulin level is 176, and she has a body mass index of 32.0. The diabetes pedigree function, which assesses the risk of diabetes based on family history, is 0.443.###\nHence this label was avoid."
"A 26-year-old woman who has been pregnant 3 times shows low diastolic blood pressure, moderate triceps skin fold thickness, and normal levels of plasma glucose and serum insulin. Her body mass index indicates she is overweight, and her family history suggests a low risk of developing diabetes.###\nHence this label was consent."
"This patient is a 29-year-old woman who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a glucose tolerance test. Her insulin levels are low, and she has a moderately high body mass index. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This is a profile of a 28-year-old individual with 5 pregnancies, normal diastolic blood pressure, no triceps skin fold thickness, and low insulin levels. The plasma glucose concentration after a glucose tolerance test is at a healthy level. Despite a high body mass index, the individual has a low diabetes pedigree function score.###\nHence this label was consent."
"This patient is 33 years old and has been pregnant 8 times. Their diastolic blood pressure is 70, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. Their plasma glucose concentration after a glucose tolerance test is 108. They have a body mass index of 30.5 and a diabetes pedigree function of 0.955.###\nHence this label was consent."
"This data belongs to a 59-year-old individual who has been pregnant once. They have a low diastolic blood pressure of 60, a Triceps skin fold thickness of 23, and a high plasma glucose concentration of 189 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is very high at 846. They have a body mass index of 30.1 and a relatively low diabetes pedigree function score of 0.398.###\nHence this label was consent."
"This data describes a 22-year-old individual who has never been pregnant. Their diastolic blood pressure is 68, triceps skin fold thickness is 22, plasma glucose concentration after a glucose tolerance test is 105, and 2-hour serum insulin level is 0. They have a body mass index of 20.0 and a diabetes pedigree function of 0.236.###\nHence this label was avoid."
"This data represents a young adult female, aged 21, who is pregnant for the first time. She has a healthy diastolic blood pressure of 66 and a slightly below average triceps skin fold thickness of 23. Her plasma glucose concentration after a glucose tolerance test is normal at 89, but her 2-hour serum insulin level is relatively high at 94. She has a body mass index of 28.1, indicating she is overweight. The diabetes pedigree function, which assesses the likelihood of developing diabetes based on family history, is low at 0.167.###\nHence this label was avoid."
"A 33-year-old individual who has been pregnant 9 times, with low diastolic blood pressure (62) and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral GTT is 89, and their 2-hour serum insulin level is 0. They have a low body mass index of 22.5 and a relatively low diabetes pedigree function of 0.142.###\nHence this label was avoid."
"The patient is a young woman in her late twenties who is pregnant for the first time. She has normal diastolic blood pressure and zero triceps skin fold thickness. Her glucose levels are slightly elevated after a glucose tolerance test. She has no insulin present in her serum. Despite her young age, she has a high body mass index indicating possible obesity. The diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 55-year-old woman who has been pregnant 7 times. She has a low diastolic blood pressure of 70 mmHg. Her triceps skin fold thickness is 33 mm. She had a high plasma glucose concentration of 195 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is elevated at 145 μU/mL. Despite this, her body mass index is within the normal range at 25.1. The diabetes pedigree function, a measure of the genetic influence of diabetes, is relatively low at 0.163.###\nHence this label was consent."
"This patient is a 28-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 40 mm. Her plasma glucose concentration after a glucose tolerance test is 144 mg/dL. She has no insulin present in her serum after 2 hours. Her body mass index is 41.3, indicating obesity. The diabetes pedigree function value is 0.607, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The individual is a 25-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 32. Her plasma glucose concentration after a glucose tolerance test is 68. She has a 2-hour serum insulin level of 66 and a body mass index of 25.0. Her diabetes pedigree function is 0.187, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 21-year-old female who has never been pregnant. She has a diastolic blood pressure of 90 and a triceps skin fold thickness of 46. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 151. She has no serum insulin after 2 hours. With a body mass index of 42.1 and a diabetes pedigree function of 0.371, she may be at risk for developing diabetes.###\nHence this label was consent."
"The patient is a 21-year-old female who has been pregnant twice. She has a diastolic blood pressure of 62 mmHg and a triceps skin fold thickness of 32 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 108 mg/dL, and her 2-hour serum insulin level is 56 μU/mL. She has a body mass index of 25.2 and a diabetes pedigree function of 0.128. Overall, the data suggests a relatively low risk for developing diabetes.###\nHence this label was avoid."
"The individual in the dataset is a 24-year-old with 4 pregnancies. They have a diastolic blood pressure of 70 and a triceps skin fold thickness of 32. Their plasma glucose concentration after a GTT is 95, and their 2-hour serum insulin level is 0. With a body mass index of 32.1 and a diabetes pedigree function of 0.612, this individual's risk of developing diabetes may be influenced by these factors.###\nHence this label was avoid."
"The patient is a 58-year-old who has never been pregnant. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 32 mm. Her plasma glucose concentration after a glucose tolerance test is 173 mg/dL, with a 2-hour serum insulin level of 265 mU/L. She has a body mass index of 46.5 and a diabetes pedigree function value of 1.159.###\nHence this label was avoid."
"The patient is a 54-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 78, triceps skin fold thickness of 29, and plasma glucose concentration of 150 after a GTT. Her 2-hour serum insulin level is 126, and she has a body mass index of 35.2. The diabetes pedigree function for this patient is 0.692.###\nHence this label was consent."
"The patient is a 22-year-old who has been pregnant 3 times and has no history of high blood pressure or diabetes. Their body measurements indicate low levels of triceps skin fold thickness, insulin, and body mass index. The patient's blood glucose level after a 2-hour oral glucose tolerance test is 80, and their diabetes pedigree function score is 0.174. Overall, based on these factors, the patient may be at lower risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 58-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 82, a triceps skin fold thickness of 43, and a body mass index of 39.2, indicating she may be overweight. Her plasma glucose concentration after a glucose tolerance test is 140, which is within the normal range. However, her 2-hour serum insulin level is high at 325, suggesting possible insulin resistance. The diabetes pedigree function value of 0.528 indicates a modest genetic predisposition to diabetes. Overall, the patient may be at risk for developing diabetes due to her high insulin levels and BMI.###\nHence this label was consent."
"A 22-year-old individual, who is pregnant for the first time, with a low diastolic blood pressure and a moderate triceps skin fold thickness. Their glucose levels are within the normal range after a 2-hour oral glucose tolerance test. Higher than average serum insulin levels and a healthy body mass index suggest good metabolic health. The low diabetes pedigree function indicates a lower genetic risk for developing diabetes.###\nHence this label was avoid."
"This 31-year-old patient has been pregnant 4 times and shows normal diastolic blood pressure. However, their triceps skin fold thickness and 2-hour serum insulin levels are both at 0. The patient has a high plasma glucose concentration of 158, indicating a potential risk for diabetes. Their body mass index is 32.9 and their diabetes pedigree function is 0.803, further highlighting a possible predisposition to diabetes.###\nHence this label was consent."
"The patient in this example is a 39-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 38, and a plasma glucose concentration of 126 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 75, and she has a body mass index of 25.9. Additionally, her diabetes pedigree function is 0.162.###\nHence this label was avoid."
"The individual is a 47-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 86 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 161 mg/dL, and her 2-hour serum insulin level is 0 µU/mL. She has a body mass index (BMI) of 30.4 and a diabetes pedigree function of 0.165.###\nHence this label was consent."
"The patient is a 23-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 42 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 153 mg/dL, and her 2-hour serum insulin level is high at 485 μU/mL. She has a high body mass index of 40.6 and a moderate diabetes pedigree function score of 0.687.###\nHence this label was avoid."
"A 41-year-old individual, who has been pregnant 7 times, with a diastolic blood pressure of 64. They have a triceps skin fold thickness of 25, a plasma glucose concentration of 94 after a glucose tolerance test, and a 2-hour serum insulin level of 79. Their body mass index is 33.3, and their diabetes pedigree function is 0.738.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant 4 times and shows no diastolic blood pressure or triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 132, with no insulin detected in their serum. They have a body mass index of 32.9 and a diabetes pedigree function of 0.302.###\nHence this label was consent."
"This data belongs to a 23-year-old individual who is pregnant for the first time. She has low diastolic blood pressure, a moderate triceps skin fold thickness, and a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is high, indicating a possible risk for developing diabetes. She also has a healthy body mass index and a low diabetes pedigree function score, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 22-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 42mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 181 mg/dL, and her 2-hour serum insulin level is 293 mIU/L. She has a body mass index of 40.0 and a diabetes pedigree function of 1.258.###\nHence this label was consent."
"A 22-year-old individual who has never been pregnant shows normal diastolic blood pressure and low insulin levels. They have a slightly elevated body mass index and average glucose levels. Overall, their risk of developing diabetes appears relatively low based on these measurements.###\nHence this label was avoid."
"The patient is a 33-year-old female who has been pregnant 9 times. She has low diastolic blood pressure of 56 and triceps skin fold thickness of 0. Her glucose level after a GTT is 122 and she has no 2-hour serum insulin. Her body mass index is 33.3 and she has a high diabetes pedigree function score of 1.114.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant twice. She has a diastolic blood pressure of 62 mmHg and a triceps skin fold thickness of 10 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 108 mg/dL, and her 2-hour serum insulin level is high at 278 uU/ml. She has a body mass index of 25.3 and a diabetes pedigree function of 0.881, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"A 24-year-old woman who has been pregnant 3 times shows low diastolic blood pressure of 58, no triceps skin fold thickness, normal glucose levels at 125, no insulin presence, and a body mass index indicating overweight. The diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 38-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 92 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 117. She has no serum insulin present. Her body mass index is 34.1 and her diabetes pedigree function is 0.337.###\nHence this label was avoid."
"A 57-year-old individual who has been pregnant 5 times shows normal diastolic blood pressure and zero triceps skin fold thickness. Their glucose concentration after a GTT is 114, with no serum insulin detected. They have a healthy body mass index of 24.9 and a moderately low diabetes pedigree function score of 0.744.###\nHence this label was avoid."
"The patient is a 30-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 0 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115 mg/dL. She has a 2-hour serum insulin level of 0 μU/mL and a body mass index of 0.0 kg/m^2. The diabetes pedigree function score is 0.261, indicating a low genetic risk for diabetes.###\nHence this label was consent."
"A 25-year-old woman who is 1 time pregnant with normal blood pressure, moderate triceps skin fold thickness, and slightly elevated glucose levels. She has relatively high insulin levels, a healthy body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 24-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and normal 2-hour serum insulin level. However, she has a slightly elevated plasma glucose concentration, indicating a potential risk for developing diabetes. Her body mass index is in the overweight range, and her diabetes pedigree function value is low, suggesting a lower genetic predisposition to diabetes. Overall, she has some risk factors for diabetes but also some protective factors.###\nHence this label was consent."
"The patient is a 21-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, average triceps skin fold thickness, and below-average plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are slightly high, and she has a low body mass index. The diabetes pedigree function indicates a relatively low genetic risk for diabetes.###\nHence this label was avoid."
"This 22-year-old individual has been pregnant twice and shows unusually low values for diastolic blood pressure, triceps skin fold thickness, 2-hour serum insulin, and body mass index. The plasma glucose concentration at 2 hours is also low at 74. Despite these low values, the diabetes pedigree function indicates a slight genetic predisposition for diabetes.###\nHence this label was avoid."
"A 60-year-old individual, who has been pregnant 5 times, with a diastolic blood pressure of 75. They have a triceps skin fold thickness of 26, a plasma glucose concentration of 109 after a GTT, and a 2-hour serum insulin level of 0. Their body mass index is 36.0 and the diabetes pedigree function is 0.546.###\nHence this label was avoid."
"This 25-year-old individual, who has been pregnant 3 times, has a low diastolic blood pressure of 50. Their triceps skin fold thickness is 10, indicating a moderate amount of subcutaneous fat. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 113, which is within normal range. With a 2-hour serum insulin level of 85, their body mass index of 29.5 suggests they may be overweight. The diabetes pedigree function value of 0.626 indicates a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This 21-year-old individual, who has never been pregnant, has a diastolic blood pressure of 64, a triceps skin fold thickness of 46, a plasma glucose concentration of 102, and a 2-hour serum insulin of 78. With a body mass index of 40.6 and a diabetes pedigree function of 0.496, this person's risk for developing diabetes may be worth monitoring.###\nHence this label was avoid."
"A 25-year-old individual, who has been pregnant twice, with a low diastolic blood pressure of 60. They have no triceps skin fold thickness, a normal plasma glucose concentration of 90, and zero 2-hour serum insulin level. Their body mass index is 23.5, indicating a healthy weight, and they have a low diabetes pedigree function score of 0.191.###\nHence this label was avoid."
"This data belongs to a 22-year-old individual who has been pregnant twice. She has a low diastolic blood pressure of 56 mmHg and a relatively low triceps skinfold thickness of 28 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 56 mg/dL, and she has a moderate 2-hour serum insulin level of 45 μU/ml. With a body mass index of 24.2, she is within the healthy weight range. Her diabetes pedigree function score is 0.332, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"A 54-year-old individual, with 2 pregnancies, shows normal diastolic blood pressure and low triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within the healthy range, while their 2-hour serum insulin levels are low. Despite a high body mass index, their diabetes pedigree function score indicates a slightly elevated risk of developing diabetes.###\nHence this label was avoid."
"This 31-year-old individual has been pregnant 7 times and shows normal diastolic blood pressure. They have a moderately high BMI of 39.1 and a slightly elevated plasma glucose concentration after a glucose tolerance test. Their insulin levels are low, and they have a relatively low triceps skin fold thickness. The diabetes pedigree function score indicates a low genetic risk for diabetes.###\nHence this label was consent."
"This 23-year-old individual has never been pregnant and has a diastolic blood pressure of 80. Their triceps skin fold thickness is 37, plasma glucose concentration after a glucose tolerance test is 127, and 2-hour serum insulin level is 210. With a body mass index of 36.3 and a diabetes pedigree function value of 0.804, this person's risk for developing diabetes may need to be assessed.###\nHence this label was avoid."
"A 21-year-old female, who has been pregnant twice, exhibits low diastolic blood pressure of 50. She has a triceps skin fold thickness of 23, moderate glucose levels at 84, and slightly elevated serum insulin at 76. With a body mass index of 30.4, she shows a family history of diabetes with a pedigree function of 0.968.###\nHence this label was avoid."
"This individual is a 24-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 14 mm. Her plasma glucose concentration following a glucose tolerance test is 90 mg/dL, and her 2-hour serum insulin level is 55 μU/mL. She has a body mass index of 24.4 and a diabetes pedigree function value of 0.249.###\nHence this label was avoid."
"A 59-year-old individual who has never been pregnant has a diastolic blood pressure of 84. They have a triceps skin fold thickness of 27, plasma glucose concentration of 137, and no insulin after a glucose tolerance test. Their body mass index is 27.3, and their diabetes pedigree function is 0.231.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 0 mmHg, triceps skin fold thickness of 0 mm, and 2-hour serum insulin of 0 μU/ml. Her plasma glucose concentration after a glucose tolerance test is 90 mg/dL. She has a body mass index of 28.0 and a diabetes pedigree function of 0.61, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 33-year-old female who has been pregnant twice. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 24. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 75, and her 2-hour serum insulin level is 55. With a body mass index of 29.7 and a diabetes pedigree function of 0.37, she may have a moderate risk of developing diabetes.###\nHence this label was avoid."
"This 27-year-old individual has been pregnant 3 times and has a diastolic blood pressure of 72. Their triceps skin fold thickness is 30, plasma glucose concentration is 103, and 2-hour serum insulin level is 152. With a body mass index of 27.6 and a diabetes pedigree function of 0.73, this person's overall risk of developing diabetes may be relatively low.###\nHence this label was avoid."
"The patient is a 28-year-old individual who has been pregnant twice. They have normal diastolic blood pressure, no triceps skin fold thickness, and a healthy body mass index of 27.5. Their plasma glucose concentration after a 2-hour glucose tolerance test is 146, with no insulin detected in their serum. The diabetes pedigree function score is 0.24, indicating a low genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 29-year-old female who is 1 time pregnant. She has low diastolic blood pressure of 50 and low triceps skin fold thickness of 19. Her plasma glucose concentration is normal at 107, while her 2-hour serum insulin level is 0. With a body mass index of 28.3 and a low diabetes pedigree function of 0.181, she is at low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"This data belongs to a 22-year-old female who has never been pregnant and has a low diastolic blood pressure of 66. She has a moderate triceps skin fold thickness of 31 and a normal plasma glucose concentration of 117 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is high at 188, and she has a slightly elevated body mass index of 30.8. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.493.###\nHence this label was avoid."
"The individual in this data is a 35-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 29. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 116, and her 2-hour serum insulin level is 0. Her body mass index is 32.3, and her diabetes pedigree function is 0.66.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant twice. She has a very low diastolic blood pressure of 52, no triceps skin fold thickness, and a low 2-hour serum insulin level of 0. However, her plasma glucose concentration after a glucose tolerance test is within the normal range at 92. She has a high body mass index of 30.1 and a low diabetes pedigree function of 0.141. Overall, this patient may have a low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"This individual, a 46-year-old female, has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a slightly low plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are also low. She has a moderately high body mass index and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"This individual is a 45-year-old woman who has been pregnant 9 times. She has a low diastolic blood pressure of 70 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 130. She has no serum insulin after 2 hours. Her body mass index is 34.2, indicating that she is overweight. The diabetes pedigree function score is 0.652, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 52-year-old woman who is pregnant for the first time. She has slightly elevated diastolic blood pressure and a high plasma glucose concentration after a glucose tolerance test, indicating possible diabetes risk. Her triceps skin fold thickness suggests average body fat percentage, while her body mass index is in the obese range. Despite having low insulin levels, her diabetes pedigree function score indicates a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"This individual is a 21-year-old woman who is pregnant for the first time. She has low diastolic blood pressure (55 mmHg) and minimal triceps skin fold thickness. Her glucose levels after a 2-hour oral glucose tolerance test are normal (80 mg/dL) and she has low serum insulin levels. Despite being pregnant, she has a low body mass index of 19.1, indicating a lean physique. The diabetes pedigree function suggests a low genetic risk for diabetes. Overall, she appears to have a low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"A 22-year-old woman who has never been pregnant is showing normal levels regarding her diastolic blood pressure, triceps skin fold thickness, and plasma glucose concentration after a glucose tolerance test. She has a moderate insulin level, slightly elevated body mass index, and a low diabetes pedigree function score. Overall, she appears to have a low risk of developing diabetes based on these measurements.###\nHence this label was consent."
"This 24-year-old individual has been pregnant twice and shows a low diastolic blood pressure of 54 mmHg. The triceps skin fold thickness is 28mm, indicating a moderate level of subcutaneous fat. The plasma glucose concentration after a glucose tolerance test is 100 mg/dL, and the 2-hour serum insulin level is 105 μU/mL. With a body mass index of 37.8, this person is considered obese. The diabetes pedigree function score is 0.498, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"This 24-year-old individual has been pregnant 4 times and shows normal diastolic blood pressure. Interestingly, they have no triceps skin fold thickness and very low insulin levels. Their plasma glucose concentration after a glucose tolerance test is within normal range. Despite having a slightly elevated body mass index, their diabetes pedigree function is low, suggesting a lower risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 37-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 72, a triceps skin fold thickness of 29, and a body mass index of 31.3. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 154, with a 2-hour serum insulin level of 126. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.338. Overall, this data suggests that the patient may be at risk for developing diabetes due to her high glucose levels and obesity.###\nHence this label was avoid."
"This individual is a 40-year-old who has been pregnant 3 times. Their diastolic blood pressure is 78, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. They have a plasma glucose concentration of 122 after a glucose tolerance test. With a body mass index of 23.0 and a diabetes pedigree function of 0.254, this person's risk of developing diabetes may be relatively low based on the provided data.###\nHence this label was avoid."
"A 30-year-old individual who has been pregnant 5 times with low diastolic blood pressure and moderate triceps skin fold thickness. They have normal glucose levels after a 2-hour oral glucose tolerance test, slightly elevated insulin levels, and a higher body mass index. Their diabetes pedigree function is below average, indicating a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 42-year-old female who is pregnant for the first time. She has a healthy diastolic blood pressure of 66 and a moderate triceps skin fold thickness of 29. Her plasma glucose concentration after a glucose tolerance test is normal at 100. However, her 2-hour serum insulin levels are high at 196. She has a body mass index of 32.0, indicating she is overweight. The diabetes pedigree function score is 0.444, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 24-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 68, triceps skin fold thickness of 28, and a plasma glucose concentration of 86 after a glucose tolerance test. Her 2-hour serum insulin level is 71, and her body mass index is 30.2. The diabetes pedigree function value is 0.364.###\nHence this label was avoid."
"This is a 27-year-old individual who is pregnant for the first time and has a diastolic blood pressure of 94. They have a triceps skinfold thickness of 41, a plasma glucose concentration of 147 after a 2-hour oral glucose tolerance test, and no insulin in the blood after 2 hours. Their body mass index is 49.3, and they have a low diabetes pedigree score of 0.358.###\nHence this label was consent."
"This patient, a 26-year-old woman, has been pregnant 6 times and shows some abnormal health indicators, including 0 diastolic blood pressure, 0 triceps skin fold thickness, 0 2-hour serum insulin, and 0.0 body mass index. She has a plasma glucose concentration of 114 after a glucose tolerance test and a diabetes pedigree function of 0.189. The overall picture suggests potential health risks that may require further medical attention.###\nHence this label was avoid."
"A 46-year-old individual, who has been pregnant 8 times, with a diastolic blood pressure of 72 and a triceps skin fold thickness of 19. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 118, and they have a 2-hour serum insulin level of 0. With a body mass index of 23.1, and a diabetes pedigree function of 1.476, this individual's risk of developing diabetes may be influenced by these factors.###\nHence this label was avoid."
"This data belongs to a 21-year-old individual who has been pregnant 2 times. They have a low diastolic blood pressure of 60 and a moderately low triceps skin fold thickness of 17. Their plasma glucose concentration after a glucose tolerance test is normal at 99, but they have a high 2-hour serum insulin level of 160. They have a high body mass index of 36.6 and a moderate diabetes pedigree function score of 0.453.###\nHence this label was avoid."
"This is a 22-year-old individual who is pregnant for the first time. \nThey have a diastolic blood pressure of 78 and a triceps skin fold thickness of 27. \nTheir plasma glucose concentration after a glucose tolerance test is 87.\nThey have a 2-hour serum insulin level of 32 and a body mass index of 34.6.\nTheir diabetes pedigree function is 0.101, indicating a low genetic risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 29-year-old female who has been pregnant 4 times. She has a very low diastolic blood pressure of 66 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 110, with a 2-hour serum insulin level of 0. Despite having a body mass index of 31.9, indicating overweight, her diabetes pedigree function is low at 0.471.###\nHence this label was avoid."
"The patient is a 53-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 86 and a triceps skin fold thickness of 0. During a glucose tolerance test, her plasma glucose concentration at 2 hours was 156. Her 2-hour serum insulin level is 0. With a body mass index of 24.8 and a low diabetes pedigree function score of 0.23, this patient may have a low risk of developing diabetes.###\nHence this label was consent."
"This individual is a 52-year-old woman who has never been pregnant. She has a normal diastolic blood pressure of 72 and no triceps skin fold thickness. Her glucose levels after a glucose tolerance test are within a healthy range at 123. Despite having no insulin in her bloodstream after 2 hours, she has a high body mass index of 36.3 and a relatively low diabetes pedigree function of 0.258.###\nHence this label was consent."
"This patient is a 21-year-old female who is pregnant for the first time. She has low diastolic blood pressure, no triceps skin fold thickness, and normal plasma glucose concentration at 2 hours. However, her insulin levels are at zero. Despite her low diabetes pedigree function, her body mass index is within a healthy range.###\nHence this label was avoid."
"The patient is a young adult who has been pregnant three times. They have normal diastolic blood pressure and a healthy body mass index. Their glucose levels are within a normal range after a GTT, and they have low insulin levels. The patient has a moderate risk of developing diabetes based on their diabetes pedigree function score.###\nHence this label was avoid."
"This 30-year-old individual has been pregnant 4 times. Despite having a normal diastolic blood pressure of 92 and no triceps skin fold thickness, their plasma glucose concentration after a glucose tolerance test is 110. With a 2-hour serum insulin level of 0, this person has a high body mass index of 37.6 and a relatively low diabetes pedigree function of 0.191.###\nHence this label was avoid."
"A 24-year-old woman, who has never been pregnant, with a diastolic blood pressure of 84, a triceps skin fold thickness of 29, a plasma glucose concentration of 126 after a 2-hour oral glucose tolerance test, a 2-hour serum insulin level of 215, a body mass index of 30.7, and a diabetes pedigree function of 0.52.###\nHence this label was avoid."
"This patient is a 23-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 70 mmHg, triceps skin fold thickness of 31 mm, and a plasma glucose concentration of 93 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0 μU/ml, and she has a body mass index of 30.4. The diabetes pedigree function indicates a genetic predisposition to diabetes of 0.315.###\nHence this label was avoid."
"A 22-year-old female who is 1 time pregnant with normal diastolic blood pressure, low triceps skin fold thickness, low plasma glucose concentration, very low serum insulin level, slightly elevated body mass index, and a moderately low diabetes pedigree score.###\nHence this label was avoid."
"The patient is a young woman who has never been pregnant. She has normal diastolic blood pressure and low triceps skin fold thickness. Her glucose levels are on the lower side after a glucose tolerance test. She has low insulin levels and a healthy body mass index. Her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This is a dataset of a 21-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 78, no triceps skin fold thickness, and a plasma glucose concentration of 90 after a glucose tolerance test. Their 2-hour serum insulin level is 0, but they have a high body mass index of 42.7. The diabetes pedigree function indicates a moderate genetic risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 50-year-old woman who has been pregnant once. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 43 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 164 mg/dL, and her 2-hour serum insulin level is 67 μU/mL. With a body mass index of 32.8 kg/m² and a diabetes pedigree function of 0.341, she is at risk of developing diabetes.###\nHence this label was avoid."
"A 21-year-old individual who has been pregnant twice with a low diastolic blood pressure of 52, a moderate triceps skin fold thickness of 15, and a normal plasma glucose concentration of 99 after a glucose tolerance test. Their 2-hour serum insulin level is slightly elevated at 94, and they have a healthy body mass index of 24.6. The diabetes pedigree function score indicates a low genetic risk for diabetes at 0.637. Overall, this individual seems to have relatively healthy diagnostic measurements, with some slightly elevated values in insulin and skin fold thickness.###\nHence this label was avoid."
"This individual is a 22-year-old who is pregnant for the first time. She has a healthy diastolic blood pressure of 74 and a slightly below average triceps skin fold thickness of 11. Her plasma glucose concentration after a GTT is normal at 80, and she has a moderate level of insulin at 60. Additionally, she has a body mass index of 30.0, indicating she is overweight. Her diabetes pedigree function score is 0.527, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This 41-year-old individual has been pregnant 6 times and shows normal diastolic blood pressure. They have a moderate triceps skin fold thickness and a slightly elevated plasma glucose concentration after a glucose tolerance test. Their insulin levels are high at 156, and they have a slightly above average body mass index. The diabetes pedigree function indicates a moderate genetic risk for diabetes. Overall, this individual displays some risk factors for diabetes but is not definitively diagnosed.###\nHence this label was consent."
"This is a 25-year-old individual who has been pregnant 3 times. Their diastolic blood pressure is 58, triceps skin fold thickness is 31, and plasma glucose concentration after a GTT is 83. They have a 2-hour serum insulin level of 18 and a body mass index of 34.3. The diabetes pedigree function is 0.336.###\nHence this label was avoid."
"This patient is a young adult, aged 21, who has never been pregnant. They have a normal diastolic blood pressure of 70 and a healthy triceps skin fold thickness of 27. Their plasma glucose concentration after a glucose tolerance test is 94, which is within the normal range. However, their 2-hour serum insulin is high at 115. The patient has a high body mass index of 43.5, indicating obesity. Their diabetes pedigree function score is low at 0.347, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"This patient, a 25-year-old woman, has never been pregnant. She has a healthy diastolic blood pressure of 64 and a moderately low triceps skin fold thickness of 36. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 97, while her 2-hour serum insulin level is slightly elevated at 100. She has a body mass index of 36.8, indicating obesity. Despite this, her diabetes pedigree function score is low at 0.6, suggesting a lower genetic risk for diabetes. Overall, this individual shows some concerning signs such as high insulin levels and obesity, but her overall risk for developing diabetes may be lower due to her genetic predisposition.###\nHence this label was avoid."
"The patient is a 33-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 50 and a relatively low triceps skin fold thickness of 22. However, her plasma glucose concentration at 2 hours is within normal range at 119. She has a high 2-hour serum insulin level of 176 and a body mass index of 27.1, indicating possible insulin resistance. Her diabetes pedigree function is 1.318, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a young adult female who is pregnant for the first time. She has a normal diastolic blood pressure and a relatively low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is below average, while her serum insulin level is also on the lower side. Despite this, her body mass index is in the overweight range. The diabetes pedigree function indicates a slightly increased risk of developing diabetes. Overall, the patient shows some indicators of being at risk for diabetes, but further monitoring and evaluation may be needed for a conclusive diagnosis.###\nHence this label was avoid."
"The individual is a 31-year-old woman who has never been pregnant. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 47 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 118 mg/dL. Her 2-hour serum insulin level is high at 230 μU/mL. She has a body mass index of 45.8, indicating obesity. The diabetes pedigree function score is 0.551, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"This individual is a 65-year-old with a history of 5 pregnancies. They have normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration is slightly elevated at 147 after a 2-hour oral glucose tolerance test. They have no 2-hour serum insulin recorded. Their body mass index is in the overweight range at 33.7, and they have a low diabetes pedigree function score of 0.218.###\nHence this label was avoid."
"The patient is a 58-year-old individual who has been pregnant 8 times. They have a normal diastolic blood pressure of 72 and their triceps skin fold thickness is 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 112. The 2-hour serum insulin level is 0. The patient has a healthy body mass index of 23.6 and a low diabetes pedigree function score of 0.84.###\nHence this label was avoid."
"The individual in this data is a 43-year-old who has been pregnant 15 times. They have a diastolic blood pressure of 70, triceps skin fold thickness of 32, and a plasma glucose concentration of 136 after a GTT. Their 2-hour serum insulin level is 110, body mass index is 37.1, and diabetes pedigree function is 0.153.###\nHence this label was consent."
"This patient is a 21-year-old female who has never been pregnant. She has a diastolic blood pressure of 70 mmHg, a triceps skin fold thickness of 26 mm, and a body mass index of 30.8, indicating she is overweight. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 100 mg/dL. Her 2-hour serum insulin level is 50 mu U/ml. The diabetes pedigree function, a measure of the risk of diabetes based on family history, is 0.597, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant 3 times. She has a low diastolic blood pressure of 54 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 139, with a 2-hour serum insulin level of 0. She has a healthy body mass index of 25.6 and a relatively low diabetes pedigree function of 0.402.###\nHence this label was consent."
"This 24-year-old female has a relatively low risk of developing diabetes. She has been pregnant once, with normal diastolic blood pressure and a slightly elevated triceps skin fold thickness. Her plasma glucose and insulin levels are within normal range. Although her body mass index is higher than average, her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"A 46-year-old woman who has been pregnant 12 times shows a relatively normal diastolic blood pressure of 72. She has a slightly below average triceps skin fold thickness of 31, and her plasma glucose concentration after a GTT is quite low at 84. Interestingly, she has no insulin present in her serum after a 2-hour test. Her body mass index is in the overweight range at 29.7, and her diabetes pedigree function is relatively low at 0.297.###\nHence this label was consent."
"A 24-year-old individual with no history of pregnancy has a diastolic blood pressure of 80, triceps skin fold thickness of 31, and a plasma glucose concentration of 117 after a glucose tolerance test. Their 2-hour serum insulin level is 53, with a body mass index of 45.2 and a low diabetes pedigree function of 0.089. Overall, the data suggests a relatively low immediate risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 57-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 139 mg/dL, with a 2-hour serum insulin level of 0 uU/mL. She has a body mass index of 27.1 and a diabetes pedigree function of 1.441.###\nHence this label was avoid."
"A 45-year-old individual who has been pregnant 11 times with a diastolic blood pressure of 84. They have a triceps skin fold thickness of 40 mm and a fasting plasma glucose concentration of 111 mg/dL. Their 2-hour serum insulin level is 0, with a high body mass index of 46.8. The diabetes pedigree function indicates a strong familial history of diabetes with a value of 0.925.###\nHence this label was consent."
"This patient is a 42-year-old female who has been pregnant 7 times, with a diastolic blood pressure of 78. She has a triceps skin fold thickness of 40, plasma glucose concentration at 81, and 2-hour serum insulin level of 48. Her body mass index is 46.7, and her diabetes pedigree function is 0.261.###\nHence this label was avoid."
"This 22-year-old individual has never been pregnant and has normal blood pressure, with low triceps skin fold thickness and insulin levels. They have a healthy plasma glucose concentration after a glucose tolerance test. Their body mass index is within the normal range, and they have a low diabetes pedigree function score indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"This is a 31-year-old individual who has been pregnant 6 times. They have normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 107, and they have normal 2-hour serum insulin levels. They have a high body mass index of 36.8 and a low diabetes pedigree function score of 0.727.###\nHence this label was avoid."
"This is a profile of a 35-year-old individual who has never been pregnant. They have a diastolic blood pressure reading of 90, a triceps skin fold thickness of 26, and a plasma glucose concentration of 180 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 90, body mass index is 36.5, and they have a diabetes pedigree function score of 0.314. This data suggests a risk for developing diabetes and may warrant further monitoring or intervention.###\nHence this label was consent."
"A 31-year-old woman who has been pregnant six times shows indicators within normal range for diastolic blood pressure, triceps skin fold thickness, and serum insulin levels. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 91. She has a healthy body mass index of 29.8 and a moderate diabetes pedigree function score of 0.501.###\nHence this label was avoid."
"This 31-year-old individual has been pregnant 8 times and has a diastolic blood pressure of 76. Their triceps skin fold thickness is 39, and their plasma glucose concentration after a GTT is 109. They have a 2-hour serum insulin level of 114 and a body mass index of 27.9. The diabetes pedigree function is 0.64.###\nHence this label was consent."
"A 26-year-old woman who has been pregnant twice has a diastolic blood pressure of 68 mmHg, a triceps skin fold thickness of 22 mm, and a plasma glucose concentration of 112 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 94 μU/ml, and her body mass index is 34.1. She has a low diabetes pedigree function score of 0.315.###\nHence this label was avoid."
"The patient is a 36-year-old woman who has been pregnant 10 times. She has low diastolic blood pressure (68 mmHg) and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 133 mg/dL. She has no serum insulin levels, a body mass index of 27.0, and a low diabetes pedigree function of 0.245.###\nHence this label was avoid."
"A 24-year-old woman, who is pregnant for the first time, has slightly low diastolic blood pressure and a moderate triceps skin fold thickness. Her glucose levels after a 2-hour oral glucose tolerance test are normal, along with a moderate insulin level. She has a healthy body mass index and a moderate diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 63-year-old individual who has been pregnant three times. They have a diastolic blood pressure of 80, a triceps skin fold thickness of 15, and a plasma glucose concentration of 142 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and their body mass index is 32.4. The diabetes pedigree function is 0.2.###\nHence this label was avoid."
"This is a 22-year-old individual who has never been pregnant. \nTheir diastolic blood pressure is normal at 70, and their triceps skin fold thickness is 38.\nTheir glucose level after a 2-hour oral test is 137, and their insulin level is 0.\nThey have a body mass index of 33.2 and a low diabetes pedigree at 0.17.###\nHence this label was avoid."
"This data belongs to a 38-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 82, a triceps skin fold thickness of 30, and a plasma glucose concentration of 106 following a GTT. Their 2-hour serum insulin level is 0, with a body mass index of 39.5. The diabetes pedigree function value is 0.286.###\nHence this label was avoid."
"This is a dataset of a young adult female, aged 21, who has been pregnant once. She has a normal diastolic blood pressure of 74 and a slightly below-average triceps skin fold thickness of 20. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is very low at 0. She has a moderate level of 2-hour serum insulin at 23. Her body mass index is within a healthy range at 27.7. The diabetes pedigree function, which assesses the diabetes risk based on family history, is low at 0.299.###\nHence this label was avoid."
"A 22-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure, moderate triceps skin fold thickness, and slightly elevated plasma glucose concentration after a glucose tolerance test. Their insulin levels are within a normal range, and they have a slightly above-average body mass index. The individual has a relatively low diabetes pedigree function score, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 27-year-old who has never been pregnant. Their diastolic blood pressure is normal at 80. They have no triceps skin fold thickness and their 2-hour serum insulin level is also at 0. Despite having a low plasma glucose concentration of 91, their body mass index is relatively high at 32.4. The diabetes pedigree function indicates a moderate genetic risk for diabetes at 0.601.###\nHence this label was avoid."
"This data represents a 24-year-old individual who has been pregnant 3 times. They have a low diastolic blood pressure of 54, a slightly above average triceps skin fold thickness of 21, and a normal plasma glucose concentration of 106 after a glucose tolerance test. Their 2-hour serum insulin level is high at 158, indicating good pancreatic function. The individual has a body mass index of 30.9, which falls in the obese category. Their diabetes pedigree function score is low at 0.292, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 43-year-old woman who has been pregnant 9 times with a diastolic blood pressure of 74 mmHg. She has a triceps skin fold thickness of 31 mm and a high plasma glucose concentration of 170 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0 μU/mL and she has a body mass index of 44.0 kg/m². Her diabetes pedigree function is 0.403, indicating a genetic predisposition to diabetes.###\nHence this label was consent."
"This patient, a 41-year-old female, has been pregnant twice. She has a normal diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 129, which indicates a normal blood sugar level. Despite not having any insulin in her system after 2 hours, her body mass index is relatively high at 38.5. The diabetes pedigree function suggests a low genetic risk for diabetes. Overall, her health profile indicates a low immediate risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 38-year-old woman who has been pregnant 12 times. She has a healthy diastolic blood pressure of 70 and a slightly higher than normal triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 151, and her 2-hour serum insulin level is elevated at 271. With a body mass index of 41.8 and a diabetes pedigree function of 0.742, she may be at risk for developing diabetes.###\nHence this label was consent."
"A 48-year-old individual, who has been pregnant 12 times, with a diastolic blood pressure of 74, triceps skin fold thickness of 40, plasma glucose concentration of 88 after a GTT, 2-hour serum insulin level of 54, a body mass index of 35.3, and a diabetes pedigree function of 0.378.###\nHence this label was avoid."
"This individual is a 36-year-old female who has been pregnant 6 times. She has a normal diastolic blood pressure of 82 and a low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within the normal range at 102. She has no insulin present in her blood after 2 hours. Her body mass index is 30.8, indicating she is overweight. The diabetes pedigree function score is low at 0.18, suggesting a lower genetic risk for diabetes.###\nHence this label was consent."
"This patient is 37 years old and has been pregnant 7 times. They have a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin level of 0. Their plasma glucose concentration after a glucose tolerance test is 119. With a body mass index of 25.2 and a diabetes pedigree function of 0.209, this individual's risk for developing diabetes may be low.###\nHence this label was avoid."
"The patient is a 35-year-old woman who has been pregnant 4 times. She has a low diastolic blood pressure of 62 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 123, with a 2-hour serum insulin level of 0. Her body mass index is 32.0 and she has a low diabetes pedigree function of 0.226.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant twice. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 19 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 88 mg/dL, and she has a 2-hour serum insulin level of 53 uU/mL. Her body mass index is 29.0, and her diabetes pedigree function is 0.229.###\nHence this label was avoid."
"This patient is a 49-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 88, a triceps skin fold thickness of 36, and a body mass index of 38.5. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 126, and her 2-hour serum insulin level is 108. She has a diabetes pedigree function value of 0.349.###\nHence this label was avoid."
"This patient is 34 years old and has been pregnant 4 times. They have a low diastolic blood pressure of 68 and no triceps skin fold thickness. Their plasma glucose concentration is normal at 120, and they have no insulin present in their blood. Despite a slightly elevated body mass index of 29.6, their diabetes pedigree function score is relatively low at 0.709.###\nHence this label was avoid."
"This individual is a 32-year-old woman who has been pregnant three times. She has a diastolic blood pressure of 92 and a triceps skin fold thickness of 49. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 129, and her 2-hour serum insulin level is 155. She has a body mass index of 36.4 and a diabetes pedigree function of 0.968.###\nHence this label was consent."
"A 24-year-old woman who has never been pregnant shows normal diastolic blood pressure and slightly above-average triceps skin fold thickness. Her glucose levels are within the acceptable range after a glucose tolerance test, but her insulin levels are high. Despite having a relatively high body mass index, her risk of developing diabetes is low based on her diabetes pedigree function score.###\nHence this label was consent."
"This 22-year-old individual has been pregnant twice and shows low diastolic blood pressure of 58. Their triceps skin fold thickness is 35, plasma glucose concentration at 2 hours is 101, and 2-hour serum insulin level is 90. With a body mass index of 21.8 and a low diabetes pedigree function of 0.155, this person appears to have a relatively low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"A 58-year-old individual with 9 pregnancies has a diastolic blood pressure of 68 and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 91, with no insulin present. They have a body mass index of 24.2 and a diabetes pedigree function of 0.2.###\nHence this label was avoid."
"This data belongs to a 23-year-old individual who is pregnant for the first time. She has a normal diastolic blood pressure of 86 and a below-average triceps skin fold thickness of 19. Her glucose level after a 2-hour oral glucose tolerance test is within the normal range at 111. She has no insulin in her bloodstream, a body mass index indicating overweight at 30.1, and a low diabetes pedigree function score of 0.143.###\nHence this label was avoid."
"A 28-year-old individual who has been pregnant 3 times and has a diastolic blood pressure of 66. Their triceps skin fold thickness is 39, plasma glucose concentration after 2 hours of an oral glucose tolerance test is 115, and 2-hour serum insulin is 140. They have a body mass index of 38.1 and a diabetes pedigree function of 0.15. These measurements indicate various aspects of their health and potential risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 33-year-old female who has been pregnant four times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 14 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 173 mg/dL, and her 2-hour serum insulin level is 168 μU/mL. She has a body mass index of 29.7 and a diabetes pedigree function value of 0.361.###\nHence this label was consent."
"This is a data entry for a 24-year-old individual who has been pregnant 3 times. They have a low diastolic blood pressure of 52 and a moderately high triceps skin fold thickness of 38. Their plasma glucose concentration after a glucose tolerance test is elevated at 162, while their 2-hour serum insulin level is normal at 0. The individual has a high body mass index of 37.2 and a moderate diabetes pedigree score of 0.652.###\nHence this label was consent."
"This patient is a 21-year-old female who has never been pregnant. She has normal diastolic blood pressure and a healthy body mass index. Her glucose levels are within normal range, but she has low insulin levels. Despite a low triceps skin fold thickness, her overall risk of developing diabetes is low based on her diabetes pedigree function score.###\nHence this label was avoid."
"This 50-year-old individual has been pregnant 6 times and has a diastolic blood pressure of 62. They have no triceps skin fold thickness, a plasma glucose concentration of 162 after a glucose tolerance test, and zero insulin levels after 2 hours. With a body mass index of 24.3 and a low diabetes pedigree function of 0.178, this individual has certain risk factors that may indicate a potential for developing diabetes.###\nHence this label was consent."
"This data belongs to a 21-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 64 and a triceps skin fold thickness of 14. Their plasma glucose concentration after a glucose tolerance test is 131, with a high 2-hour serum insulin level of 415. Despite these values, their body mass index is within the normal range at 23.7. The individual has a low diabetes pedigree function score of 0.389.###\nHence this label was avoid."
"A 43-year-old individual, who has been pregnant 8 times, with a diastolic blood pressure of 78 and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 188, with an insulin level of 0. They have a high body mass index of 47.9 and a low diabetes pedigree function of 0.137.###\nHence this label was consent."
"This data describes a 43-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 74, a triceps skin fold thickness of 40, and a plasma glucose concentration of 100 after a glucose tolerance test. Their 2-hour serum insulin level is 215, their body mass index is 39.4, and they have a diabetes pedigree function of 0.661.###\nHence this label was consent."
"The patient is a 26-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 80, triceps skin fold thickness of 28, and a body mass index of 32.5. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 105. She has no 2-hour serum insulin. Her diabetes pedigree function is 0.878.###\nHence this label was avoid."
"This 36-year-old individual has been pregnant 7 times and has a diastolic blood pressure of 88. They have a triceps skin fold thickness of 44, with a plasma glucose concentration of 152 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 50.0. The diabetes pedigree function for this individual is 0.337.###\nHence this label was consent."
"The patient is a 57-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 95 and her 2-hour serum insulin level is 0. With a body mass index of 36.8 and a diabetes pedigree function of 0.485, she may be at risk for developing diabetes.###\nHence this label was avoid."
"This 33-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 72. Their triceps skin fold thickness is 43, and their plasma glucose concentration after a glucose tolerance test is 108. They have a 2-hour serum insulin level of 75 and a body mass index of 36.1. Their diabetes pedigree function is 0.263.###\nHence this label was avoid."
"A 41-year-old woman who has never been pregnant has high diastolic blood pressure and a high plasma glucose concentration after a glucose tolerance test. She has a moderately high body mass index and a low diabetes pedigree function. Her triceps skin fold thickness is average and she has no insulin resistance.###\nHence this label was consent."
"This patient is 30 years old, has been pregnant 4 times, with a diastolic blood pressure of 84. Triceps skin fold thickness is 0, plasma glucose concentration after a GTT is 137, and 2-hour serum insulin is 0. The patient has a body mass index of 31.2 and a diabetes pedigree function of 0.252.###\nHence this label was avoid."
"A 27-year-old female who has been pregnant four times exhibits normal diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range. She has a moderate level of serum insulin and a healthy body mass index. The diabetes pedigree function score indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 21-year-old female who is pregnant for the first time. She has a normal diastolic blood pressure of 70 and a healthy body mass index of 27.4. Her glucose levels are within the normal range at 116 after a 2-hour oral glucose tolerance test. Despite having zero insulin levels, her overall diabetes risk, calculated by the diabetes pedigree function, is low at 0.204.###\nHence this label was avoid."
"The patient is a 49-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 85 and a triceps skin fold thickness of 15. Her plasma glucose concentration after a glucose tolerance test is 184, and her 2-hour serum insulin level is 0. She has a body mass index of 30.0 and a diabetes pedigree function of 1.213.###\nHence this label was consent."
"The patient is a 51-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 48 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 148 mg/dL and her 2-hour serum insulin level is 237 uU/ml. With a body mass index of 37.6, indicating obesity, and a diabetes pedigree function of 1.001, she may be at a higher risk for developing diabetes.###\nHence this label was consent."
"A 26-year-old woman who has been pregnant twice has: \n- A diastolic blood pressure of 68\n- A triceps skin fold thickness of 25\n- Plasma glucose concentration at 100 after a 2-hour oral glucose tolerance test\n- A 2-hour serum insulin level of 71\n- A body mass index of 38.5\n- A diabetes pedigree function value of 0.324.###\nHence this label was avoid."
"The individual is a 23-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 86 and a body mass index of 30.1, indicating she may be overweight. Her triceps skin fold thickness is 30, which could be a sign of excess body fat. During a glucose tolerance test, her plasma glucose concentration after 2 hours is 143, which is slightly higher than normal. Her 2-hour serum insulin level is 330, which may indicate insulin resistance. The diabetes pedigree function value is 0.892, suggesting a moderate genetic predisposition to diabetes. Overall, these results could indicate an increased risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 67-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 80 mmHg, a triceps skin fold thickness of 0 mm, and a body mass index of 26.1. Her plasma glucose concentration after a glucose tolerance test is 194 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. The diabetes pedigree function for this patient is 0.551.###\nHence this label was avoid."
"The patient is a 30-year-old woman who is experiencing her first pregnancy. She has a normal diastolic blood pressure of 70 and a healthy triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 97, indicating normal blood sugar levels. She has no detectable serum insulin after 2 hours. Despite having a high body mass index of 38.1, her diabetes pedigree function is low at 0.218, suggesting a lower genetic risk of developing diabetes.###\nHence this label was avoid."
"This data belongs to a 27-year-old individual who has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and a healthy plasma glucose concentration after a 2-hour oral glucose tolerance test. Their serum insulin level is low, indicating normal insulin production. Additionally, they have a low body mass index and a slightly elevated diabetes pedigree function, suggesting a low risk of developing diabetes.###\nHence this label was avoid."
"A 23-year-old woman has been pregnant 3 times and has a diastolic blood pressure of 68. Her triceps skin fold thickness is 28, while her plasma glucose concentration after a 2-hour oral glucose tolerance test is 74. She has a 2-hour serum insulin level of 45 and a body mass index of 29.7. Her diabetes pedigree function is 0.293.###\nHence this label was avoid."
"This patient is a 41-year-old female who has been pregnant 5 times. She has a low diastolic blood pressure of 64 and a normal triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is elevated at 168, but she has a low 2-hour serum insulin level of 0. Her body mass index is in the overweight range at 32.9, and her diabetes pedigree function score is low at 0.135.###\nHence this label was consent."
"This patient is a 33-year-old female who is slightly overweight with a body mass index of 39.0. She has been pregnant once. Her diastolic blood pressure is in the normal range at 72. However, her triceps skin fold thickness and 2-hour serum insulin levels are both at 0, which may indicate some health concerns. Her plasma glucose concentration at 2 hours is elevated at 163, and her diabetes pedigree function is 1.222, suggesting a potential risk for developing diabetes.###\nHence this label was consent."
"A 35-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure and slightly above average triceps skin fold thickness. Her blood sugar level after a glucose tolerance test is low, as well as her insulin level. She has a slightly elevated body mass index. Overall, her risk of developing diabetes appears to be low based on these measurements.###\nHence this label was avoid."
"A 37-year-old individual who has been pregnant seven times and shows a slightly elevated diastolic blood pressure of 88. They have a moderately low triceps skin fold thickness, average plasma glucose level after a glucose tolerance test, and high insulin levels. Their body mass index is in the overweight range at 32.4, and they have a relatively low diabetes pedigree function score of 0.262.###\nHence this label was avoid."
"This data belongs to a 28-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 68, a triceps skin fold thickness of 49, and a high plasma glucose concentration of 172 after a glucose tolerance test. Their 2-hour serum insulin level is elevated at 579. Additionally, they have a body mass index of 42.4 and a diabetes pedigree function of 0.702.###\nHence this label was consent."
"This data represents a 39-year-old individual who has been pregnant 13 times. They have a diastolic blood pressure of 88 and triceps skin fold thickness of 37. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 153, and their 2-hour serum insulin level is 140. With a body mass index of 40.6 and a diabetes pedigree function of 1.174, this individual's data suggests a potential risk for developing diabetes.###\nHence this label was avoid."
"This data represents a 24-year-old individual who has been pregnant 7 times. Despite having a normal diastolic blood pressure, triceps skin fold thickness, and serum insulin level, they have a slightly elevated plasma glucose concentration of 105. Additionally, their body mass index is unusually low at 0.0, and they have a relatively low diabetes pedigree function score of 0.305.###\nHence this label was avoid."
"This 28-year-old individual has been pregnant three times and has a diastolic blood pressure of 76. They have a triceps skin fold thickness of 36, a plasma glucose concentration of 158, and a 2-hour serum insulin level of 245. With a body mass index of 31.6 and a diabetes pedigree function of 0.851, this person's risk for developing diabetes may be of concern.###\nHence this label was consent."
"A 33-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 86. Their triceps skin fold thickness is 0, while their plasma glucose concentration after a 2-hour oral glucose tolerance test is 122. They have no serum insulin after 2 hours and their body mass index is 34.7. The diabetes pedigree function for this individual is 0.29.###\nHence this label was avoid."
"This individual is a 29-year-old with a low risk of developing diabetes, as indicated by their relatively low values for plasma glucose concentration, insulin levels, and body mass index. Their blood pressure and triceps skin fold thickness are within normal ranges. Additionally, their diabetes pedigree function score suggests a low genetic predisposition for diabetes.###\nHence this label was avoid."
"A 25-year-old individual who has been pregnant twice shows normal diastolic blood pressure and a slightly above-average triceps skin fold thickness. The glucose concentration after a 2-hour oral test is within normal range, while the serum insulin level is elevated. The individual has a moderately high body mass index and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"This data belongs to a 23-year-old individual who has been pregnant twice. They have a normal diastolic blood pressure of 70 and a Triceps skin fold thickness of 0. Their plasma glucose concentration is 134 after a 2-hour oral glucose tolerance test. The 2-hour serum insulin level is 0, and their body mass index is 28.9. The diabetes pedigree function value is 0.542.###\nHence this label was consent."
"The patient is a 32-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 30, and a plasma glucose concentration of 115 after a glucose tolerance test. Her 2-hour serum insulin level is 96, and she has a body mass index of 34.6. The diabetes pedigree function value is 0.529.###\nHence this label was consent."
"This individual is a 52-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 86 and a triceps skin fold thickness of 27. Her plasma glucose concentration after a glucose tolerance test is 176 mg/dL, and her 2-hour serum insulin level is 156 μU/mL. She has a body mass index of 33.3 and a diabetes pedigree function value of 1.154.###\nHence this label was consent."
"A 21-year-old female who has been pregnant once with normal diastolic blood pressure and low triceps skin fold thickness. She exhibited a slightly low plasma glucose concentration at 2 hours, no insulin secretion, and a relatively low body mass index. The diabetes pedigree function score indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"A 22-year-old woman, who is pregnant for the first time, has a low diastolic blood pressure of 60. She has a moderate triceps skin fold thickness of 37 and a relatively low plasma glucose concentration of 87 after a glucose tolerance test. Her 2-hour serum insulin level is 75, and she has a high body mass index of 37.2. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes at 0.509.###\nHence this label was avoid."
"This 23-year-old individual, who has been pregnant twice, has a diastolic blood pressure of 70 and a triceps skin fold thickness of 32. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 121, with a 2-hour serum insulin level of 95. They have a body mass index of 39.1 and a diabetes pedigree function of 0.886.###\nHence this label was avoid."
"The individual is a 31-year-old who has been pregnant 4 times. They have a diastolic blood pressure of 70 and a triceps skin fold thickness of 39. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 197, and their 2-hour serum insulin level is 744. With a body mass index of 36.7 and a diabetes pedigree function of 2.329, this individual may be at risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant twice. She has normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness and 2-hour serum insulin levels are both low. Despite having a low plasma glucose concentration and a low diabetes pedigree function, she may still be at risk for developing diabetes in the future.###\nHence this label was avoid."
"This individual is a 63-year-old who has been pregnant 4 times. They have a diastolic blood pressure of 86 and a triceps skin fold thickness of 31. Their plasma glucose concentration after a glucose tolerance test is 132. They have no insulin present in their serum after 2 hours. With a body mass index of 28.0 and a diabetes pedigree function of 0.419, this individual's risk for developing diabetes may be assessed as low.###\nHence this label was avoid."
"This is a data entry for a 23-year-old individual who has never been pregnant. Their diastolic blood pressure is at a healthy level of 64, and they have a moderate triceps skin fold thickness of 18. The individual scored 119 in a glucose tolerance test and their insulin levels are a bit high at 92. They have a body mass index of 34.9, indicating they are overweight. The diabetes pedigree function score is 0.725, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 44-year-old who has been pregnant 13 times. They have a diastolic blood pressure of 0, a triceps skin fold thickness of 30, and a body mass index of 39.9. Their plasma glucose concentration after a GTT is 129, and their 2-hour serum insulin level is 0. Their diabetes pedigree function is 0.569.###\nHence this label was consent."
"The patient is a 26-year-old woman who has never been pregnant. Her diastolic blood pressure is normal at 76 mmHg. She has no measurable triceps skin fold thickness. Her blood glucose level after a glucose tolerance test is 101 mg/dL. She has no insulin in her serum after a 2-hour period. Her body mass index is 35.7, indicating she is in the obese category. The diabetes pedigree function value is 0.198, suggesting a low genetic risk of diabetes.###\nHence this label was avoid."
"This data belongs to a 27-year-old individual who has been pregnant 6 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 41 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 154 mg/dL, with a 2-hour serum insulin level of 140 μU/mL. She has a body mass index of 46.1 and a diabetes pedigree function value of 0.571.###\nHence this label was avoid."
"A 23-year-old woman, who has been pregnant twice, with a diastolic blood pressure of 86. She has a triceps skin fold thickness of 36mm and a plasma glucose concentration of 102mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 120mu U/ml, and she has a body mass index of 45.5. Her diabetes pedigree function is 0.127.###\nHence this label was consent."
"The individual is a 52-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 24. Her plasma glucose concentration is 124 after a 2-hour oral glucose tolerance test, and she has a high 2-hour serum insulin level of 600. With a body mass index of 28.7 and a diabetes pedigree function of 0.687, she may be at risk for developing diabetes.###\nHence this label was consent."
"This is a 28-year-old individual who has been pregnant 6 times. Their diastolic blood pressure is 62, triceps skin fold thickness is 31, and their plasma glucose concentration after a glucose tolerance test is 151. Their 2-hour serum insulin level is 120, and they have a body mass index of 35.5. The diabetes pedigree function for this individual is 0.692.###\nHence this label was avoid."
"This 28-year-old individual, who has been pregnant 4 times, has a diastolic blood pressure of 68. Their triceps skin fold thickness is 21, and a plasma glucose concentration of 131 after a 2-hour oral glucose tolerance test. Additionally, their 2-hour serum insulin level is 166, with a body mass index of 33.1 and a low diabetes pedigree function of 0.16.###\nHence this label was avoid."
"The patient is a 25-year-old female who has never been pregnant. She has a diastolic blood pressure of 68, triceps skin fold thickness of 19, and a plasma glucose concentration of 128 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 180, and her body mass index is 30.5. She has a diabetes pedigree function value of 1.391.###\nHence this label was consent."
"The patient is a 66-year-old individual who has been pregnant 6 times. They have normal diastolic blood pressure but have no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 190, while their serum insulin level is 0. They have a high body mass index of 35.5 and a relatively low diabetes pedigree function of 0.278.###\nHence this label was consent."
"This is a data entry for a 22-year-old individual who has been pregnant 2 times. They have a diastolic blood pressure of 66, triceps skin fold thickness of 23, and plasma glucose concentration of 83. Additionally, their 2-hour serum insulin level is 50, body mass index is 32.2, and their diabetes pedigree function is 0.497.###\nHence this label was avoid."
"The patient is a 28-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 75 and a body mass index of 29.9. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 147. Her diabetes pedigree function is 0.434, indicating a relatively low genetic risk for diabetes.###\nHence this label was avoid."
"A 28-year-old woman who is pregnant for the first time has a diastolic blood pressure of 78 mmHg. She has a triceps skin fold thickness of 39 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 121 mg/dL, and her 2-hour serum insulin level is 74 μU/mL. She has a body mass index of 39.0 and a diabetes pedigree function of 0.261.###\nHence this label was avoid."
"This individual is a 29-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 88 and a triceps skin fold thickness of 47. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 90, with a 2-hour serum insulin level of 54. She has a body mass index of 37.7 and a diabetes pedigree function score of 0.362.###\nHence this label was avoid."
"This is a 42-year-old individual who has been pregnant 8 times. They have normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 100, with no serum insulin recorded. They have a high body mass index of 38.7 and a low diabetes pedigree function score of 0.19.###\nHence this label was avoid."
"This patient is a young adult female, aged 25, who has never been pregnant. She has a normal diastolic blood pressure of 68 and a slightly low triceps skin fold thickness of 32. Her plasma glucose concentration is on the lower side at 86, and she has no insulin present in her serum after a 2-hour oral glucose tolerance test. Despite having a high body mass index of 35.8, her diabetes pedigree function score is low at 0.238.###\nHence this label was avoid."
"The patient is a 30-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 35. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 157, and her 2-hour serum insulin level is high at 440. Additionally, she has a high body mass index of 39.4 and a low diabetes pedigree function of 0.134.###\nHence this label was avoid."
"This is a data record of a 21-year-old individual who has never been pregnant, with a low diastolic blood pressure of 60. The person has a moderate triceps skin fold thickness of 35, and a slightly elevated plasma glucose concentration of 138 after a glucose tolerance test. The 2-hour serum insulin level is high at 167, and the individual has a body mass index of 34.6, indicating obesity. The diabetes pedigree function value is 0.534, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 22-year-old female who is 3 times pregnant. She has a low diastolic blood pressure of 58 mmHg and a triceps skin fold thickness of 11 mm. Her plasma glucose concentration is 88 mg/dL after a 2-hour oral glucose tolerance test, with a 2-hour serum insulin level of 54 mU/L. She has a healthy body mass index of 24.8 and a low diabetes pedigree function value of 0.267.###\nHence this label was avoid."
"A 28-year-old woman who has been pregnant 6 times shows normal diastolic blood pressure and very low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test and 2-hour serum insulin levels are also low. Despite a low body mass index, her diabetes pedigree function indicates a slight genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 42-year-old female who has been pregnant once. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 102 mg/dL, and her 2-hour serum insulin level is 0 μU/ml. She has a body mass index of 39.5 kg/m^2 and a diabetes pedigree function of 0.293.###\nHence this label was consent."
"This individual is 38 years old and has been pregnant 4 times. They have a healthy diastolic blood pressure of 78 and a slightly above average triceps skin fold thickness of 40. Their glucose level after a 2-hour GTT is 112, with a low insulin level of 0. Despite a high body mass index of 39.4, their diabetes pedigree function is low at 0.236.###\nHence this label was avoid."
"This is a data record of a 21-year-old individual who has been pregnant twice. Their diastolic blood pressure is 68 mmHg, triceps skin fold thickness is 18mm, and plasma glucose concentration after a glucose tolerance test is 94 mg/dL. They have a 2-hour serum insulin level of 76 mu U/ml, a body mass index of 26.0, and a diabetes pedigree function value of 0.561.###\nHence this label was avoid."
"The patient is a 32-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 74 mmHg. Her triceps skin fold thickness is 41 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 81 mg/dL. The 2-hour serum insulin level is 57 μU/mL. She has a body mass index of 46.3, indicating obesity. Her diabetes pedigree function is 1.096, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 22-year-old female who is 1-time pregnant. She has a relatively low diastolic blood pressure of 46 and a moderate triceps skin fold thickness of 19. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 139, and her 2-hour serum insulin level is 83. With a body mass index of 28.7, she is considered overweight. Her diabetes pedigree function value is 0.654, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"A 27-year-old individual who has been pregnant three times shows normal diastolic blood pressure and slightly low triceps skin fold thickness. Their glucose concentration and insulin levels are within normal range, while their body mass index is higher than average. The individual has a moderate diabetes pedigree function score, indicating a moderate risk of developing diabetes.###\nHence this label was consent."
"This is a record of a 38-year-old individual who has been pregnant 10 times. They have a low diastolic blood pressure of 62, a triceps skin fold thickness of 36, and a slightly elevated plasma glucose concentration of 129 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, indicating potential issues with insulin production. With a high body mass index of 41.2 and a diabetes pedigree function value of 0.441, this individual may be at risk for developing diabetes.###\nHence this label was consent."
"This 21-year-old individual, who has been pregnant twice, shows normal diastolic blood pressure but a very low triceps skin fold thickness. They have a moderate plasma glucose level of 130 and no serum insulin after a 2-hour oral glucose tolerance test. With a healthy body mass index of 22.6 and a low diabetes pedigree function of 0.268, this data reflects a generally healthy profile with no immediate risk of diabetes.###\nHence this label was avoid."
"A 26-year-old female who has been pregnant 3 times shows normal diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration is high at 180 after a 2-hour oral glucose tolerance test. She has moderate insulin levels and a slightly elevated body mass index of 34.0. The diabetes pedigree function score indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 29-year-old woman who has been pregnant 4 times. She has normal diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122, indicating normal blood sugar levels. However, she has a high body mass index of 35.0, which may increase her risk for developing diabetes. Additionally, her diabetes pedigree function score is 0.394, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This data represents a 22-year-old individual who has been pregnant twice. She has a low diastolic blood pressure of 52 and a moderate triceps skin fold thickness of 26. Her plasma glucose concentration after a glucose tolerance test is normal at 108, with a relatively low 2-hour serum insulin level of 63. Despite having a high body mass index of 32.5, her diabetes pedigree function is low at 0.318, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"The data belongs to a 24-year-old individual who has been pregnant 4 times. They have normal diastolic blood pressure, no triceps skin fold thickness, and a healthy plasma glucose concentration of 128 mg/dL after a 2-hour oral glucose tolerance test. There is no detectable serum insulin level. The individual has a relatively high body mass index of 34.3 and a low diabetes pedigree function of 0.303.###\nHence this label was avoid."
"This individual is a 23-year-old who has never been pregnant. They have a diastolic blood pressure of 90 and a triceps skin fold thickness of 33. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 165, with 2-hour serum insulin levels at 680. They have a high body mass index of 52.3 and a low diabetes pedigree function of 0.427.###\nHence this label was avoid."
"This is a record of a 21-year-old individual who has never been pregnant and shows normal diastolic blood pressure, low triceps skin fold thickness, and normal plasma glucose concentration after a 2-hour oral glucose tolerance test. They have slightly elevated serum insulin levels, a BMI of 0.0, and a relatively high diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 25-year-old female who has never been pregnant. She has a low diastolic blood pressure of 62 and no triceps skin fold thickness. Her glucose levels after a 2-hour oral glucose tolerance test are normal at 101. She has low levels of serum insulin at 0. With a body mass index of 21.9, she is within the normal weight range. Her diabetes pedigree function, which assesses the likelihood of developing diabetes based on family history, is moderately low at 0.336. Overall, this patient appears to have a low risk of developing diabetes based on the given measurements.###\nHence this label was avoid."
"This 26-year-old individual has been pregnant 3 times and has a relatively low diastolic blood pressure of 62. Their triceps skin fold thickness is 19, indicating a moderate amount of subcutaneous fat. With a plasma glucose concentration of 99 and 2-hour serum insulin level of 74, their blood sugar levels appear normal. Additionally, their body mass index is 21.8, within the healthy range. The diabetes pedigree function value of 0.279 suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"The individual in the data is a 31-year-old woman who has never been pregnant. She has a diastolic blood pressure of 65 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 111. She has no detectable 2-hour serum insulin. Her body mass index is 24.6, and her diabetes pedigree function value is 0.66.###\nHence this label was avoid."
"The patient is a 34-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration, measured 2 hours after an oral glucose tolerance test, is 107 mg/dL. The patient has a 2-hour serum insulin level of 0 uU/mL and a body mass index of 24.6 kg/m². Her diabetes pedigree function is 0.856, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a young adult, aged 21, who has never been pregnant. She has a low diastolic blood pressure of 62 and a relatively low triceps skin fold thickness of 17. Her plasma glucose concentration after a glucose tolerance test is 139, and her 2-hour serum insulin level is elevated at 210. Despite this, her body mass index is within the normal range at 22.1, and she has a low diabetes pedigree function score of 0.207.###\nHence this label was avoid."
"A 28-year-old individual who has been pregnant twice shows normal diastolic blood pressure. They have a slightly above average triceps skin fold thickness and a relatively low glucose level after a GTT. Their insulin level after 2 hours is high. Despite being in the overweight range for their body mass index, they have a low diabetes pedigree function score, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 74, triceps skin fold thickness of 19, and a plasma glucose concentration of 169 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 125, body mass index is 29.9, and diabetes pedigree function is 0.268.###\nHence this label was consent."
"The patient is a 34-year-old female who has been pregnant 7 times. She has a low diastolic blood pressure of 50 and a slightly elevated triceps skin fold thickness of 33. Her plasma glucose concentration after a glucose tolerance test is high at 187, accompanied by a very high 2-hour serum insulin level of 392. Despite this, her body mass index is within the overweight range at 33.9. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes at 0.826. Overall, this data suggests that the patient may be at high risk for developing diabetes.###\nHence this label was consent."
"This is a data entry of a 25-year-old individual who has been pregnant twice. They have a low diastolic blood pressure of 60, with a healthy triceps skin fold thickness of 22. Their plasma glucose concentration is normal at 81 after a 2-hour oral glucose tolerance test, and they have no serum insulin after 2 hours. The individual has a body mass index of 27.7, indicating they are slightly overweight. The diabetes pedigree function score is low at 0.29, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 47-year-old female who has been pregnant 17 times. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 41. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 163, and her 2-hour serum insulin level is 114. She has a body mass index of 40.9 and a diabetes pedigree function of 0.817.###\nHence this label was consent."
"A 28-year-old individual, who has been pregnant 6 times, with normal diastolic blood pressure, moderately high triceps skin fold thickness, low 2-hour serum insulin levels, high body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 24-year-old individual, who has been pregnant once, with low diastolic blood pressure, moderate triceps skin fold thickness, normal plasma glucose concentration after a GTT, normal serum insulin level, slightly elevated body mass index, and a slightly higher than average diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 24-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 27. Her plasma glucose concentration is 117 after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 120. She has a body mass index of 33.2 and a diabetes pedigree function of 0.23.###\nHence this label was avoid."
"A 44-year-old woman who has never been pregnant is being assessed for diabetes risk. She has a normal diastolic blood pressure of 82 and zero triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 146, with very low 2-hour serum insulin levels. She has a high body mass index of 40.5 and a relatively high diabetes pedigree function score of 1.781.###\nHence this label was avoid."
"A 36-year-old individual who has been pregnant 3 times with a lower than normal diastolic blood pressure of 58. They have a Triceps skin fold thickness of 22, elevated plasma glucose concentration at 174, and a high 2-hour serum insulin level of 194. Despite a Body mass index of 32.9, their Diabetes pedigree function is relatively low at 0.593.###\nHence this label was consent."
"The patient is a 51-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 86 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125. She has no serum insulin after 2 hours. Her body mass index is 37.6 and her diabetes pedigree function is 0.304.###\nHence this label was avoid."
"The individual is a 29-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 90 and a triceps skin fold thickness of 12. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 111, and her 2-hour serum insulin level is 78. She has a body mass index of 28.4 and a diabetes pedigree function of 0.495.###\nHence this label was avoid."
"The patient is a 42-year-old who has been pregnant 9 times. They have a diastolic blood pressure of 86, a triceps skin fold thickness of 28, and a plasma glucose concentration of 156 after a glucose tolerance test. Their 2-hour serum insulin level is 155, and their body mass index is 34.3. Additionally, they have a diabetes pedigree function value of 1.189.###\nHence this label was consent."
"This individual is a 36-year-old who has been pregnant 5 times. They have a low diastolic blood pressure of 62 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 44, with a 2-hour serum insulin level of 0. Their body mass index is 25.0 and they have a diabetes pedigree function score of 0.587.###\nHence this label was avoid."
"The patient is a 29-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 23 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 134 mg/dL, and her 2-hour serum insulin level is 130 mu U/ml. She has a body mass index of 35.4 and a diabetes pedigree function of 0.542. These measurements suggest a risk of developing diabetes.###\nHence this label was consent."
"The patient is a 21-year-old female who has been pregnant twice. She has a diastolic blood pressure reading of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. Her plasma glucose concentration after a glucose tolerance test is 84 mg/dL. She has a body mass index of 0.0 and a diabetes pedigree function value of 0.304.###\nHence this label was avoid."
"The patient is a 25-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 48 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 173 mg/dL. Additionally, she has a 2-hour serum insulin level of 465 μU/mL and a body mass index of 38.4. The diabetes pedigree function for this patient is 2.137, indicating a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 25-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 23 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 84 mg/dL, and her 2-hour serum insulin level is 56 μU/mL. With a body mass index of 39.5 and a low diabetes pedigree function score of 0.159, she appears to have relatively low risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 46-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 33 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 100 mg/dL, and her 2-hour serum insulin level is 105 μU/mL. She has a body mass index of 30.0 kg/m^2 and a diabetes pedigree function score of 0.488.###\nHence this label was avoid."
"The patient is a 60-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 95, a triceps skin fold thickness of 31, and a body mass index of 34.2, indicating she may be overweight. Her plasma glucose concentration after a glucose tolerance test is 179, which is on the higher side. However, her 2-hour serum insulin level is 0, suggesting a possible issue with insulin production or utilization in her body. The diabetes pedigree function score is 0.164, indicating a low genetic risk for diabetes. Overall, this data suggests a potential risk for developing diabetes due to elevated glucose levels and lack of insulin production.###\nHence this label was avoid."
"This patient is a 41-year-old woman who has been pregnant 10 times. She has a low diastolic blood pressure of 68 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122, with a 2-hour serum insulin level of 0. Her body mass index is 31.2, and her diabetes pedigree function is 0.258.###\nHence this label was avoid."
"A 23-year-old individual who has never been pregnant has a diastolic blood pressure of 90 mmHg. Their triceps skin fold thickness is 27 mm. After a 2-hour oral glucose tolerance test, their plasma glucose concentration is 179 mg/dL. They have a 2-hour serum insulin level of 0 uU/mL and a body mass index of 44.1 kg/m^2. Their diabetes pedigree function is 0.686, indicating a potential genetic risk for developing diabetes.###\nHence this label was consent."
"This is a dataset of a 26-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 15. Her plasma glucose concentration is 100 after a glucose tolerance test, and her 2-hour serum insulin level is 56. With a body mass index of 23.6 and a diabetes pedigree function of 0.666, this data provides valuable insights into the individual's health status regarding the risk of developing diabetes.###\nHence this label was avoid."
"A 23-year-old individual, who has been pregnant twice, with low diastolic blood pressure of 58 and a relatively low triceps skin fold thickness of 17. Their plasma glucose concentration after a GTT is 101, 2-hour serum insulin level is high at 265. This person has a healthy body mass index of 24.2 and a moderate diabetes pedigree function of 0.614. Overall, this individual shows some signs of insulin resistance and may be at risk for developing diabetes in the future.###\nHence this label was avoid."
"The patient is a 44-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 62, triceps skin fold thickness of 7, and a plasma glucose concentration of 92 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 258, and her body mass index is 27.6. Her diabetes pedigree function is 0.926, indicating a family history of diabetes.###\nHence this label was consent."
"This is a data record of a 21-year-old individual who has never been pregnant. They have a low diastolic blood pressure of 64 and a relatively low triceps skin fold thickness of 22. Their glucose concentration after a GTT is 84, and they have a moderate level of insulin at 66. Their body mass index is 35.8, indicating they may be overweight. The diabetes pedigree function value is 0.545, suggesting a moderate genetic predisposition to diabetes. Overall, this individual shows some risk factors for diabetes, such as high BMI and glucose levels, but also some lower-risk factors like blood pressure and insulin levels.###\nHence this label was avoid."
"This individual is a 43-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 147. She has no serum insulin levels after 2 hours. Her body mass index is 39.4 and her diabetes pedigree function is 0.257.###\nHence this label was consent."
"A 25-year-old individual who has been pregnant twice, with a diastolic blood pressure of 0 and a triceps skin fold thickness of 23. Their plasma glucose concentration after a glucose tolerance test is 87, and their 2-hour serum insulin is 0. They have a body mass index of 28.9 and a diabetes pedigree function of 0.773.###\nHence this label was avoid."
"A 42-year-old individual who has been pregnant 7 times is being monitored for diabetes risk. They have a low diastolic blood pressure of 66 and a high triceps skin fold thickness of 42. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 150, with a very high 2-hour serum insulin level of 342. Despite having a body mass index of 34.7, indicating obesity, their diabetes pedigree function is relatively low at 0.718. These factors combined suggest a complex health profile with potential risk for developing diabetes.###\nHence this label was avoid."
"This data belongs to a 28-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 90 and a triceps skin fold thickness of 39. Their plasma glucose concentration after a glucose tolerance test is 102, with a 2-hour serum insulin level of 0. They have a body mass index of 35.7 and a diabetes pedigree function of 0.674.###\nHence this label was avoid."
"This data belongs to a 22-year-old individual who has never been pregnant and has measurements indicating normal blood pressure, slightly elevated glucose levels, high insulin levels, and a high BMI. The individual has a moderate triceps skin fold thickness and a low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 31-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 90 mmHg and a high triceps skin fold thickness of 51 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122 mg/dL, and she has a high 2-hour serum insulin level of 220 mu U/ml. She also has a very high body mass index of 49.7 and a relatively low diabetes pedigree function score of 0.325.###\nHence this label was consent."
"The patient is a 46-year-old female who is moderately overweight with a body mass index of 46.1. Despite only being pregnant once, she shows signs of insulin resistance with high plasma glucose concentration (144 mg/dL) and elevated serum insulin levels (180 mu U/mL). Her blood pressure and triceps skin fold thickness are within normal range. The diabetes pedigree function score suggests a low to moderate genetic risk for diabetes.###\nHence this label was consent."
"This patient is a 47-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 78 mmHg, a triceps skin fold thickness of 0 mm, and a BMI of 45.0 kg/m². Her plasma glucose concentration after a GTT is 143 mg/dL and she has a 2-hour serum insulin level of 0 mU/L. Her diabetes pedigree function is 0.19, suggesting a low genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual, a 21-year-old female, has been pregnant twice. She has a healthy diastolic blood pressure of 64 and a triceps skin fold thickness of 22. Her plasma glucose level after a 2-hour oral glucose tolerance test is 115, and her 2-hour serum insulin is 0. With a body mass index of 30.8, she has a low risk of developing diabetes based on her diabetes pedigree function score of 0.421.###\nHence this label was avoid."
"This individual is 39 years old and has been pregnant 7 times. They have a low diastolic blood pressure of 54 and a moderate triceps skin fold thickness of 32. Their plasma glucose concentration after a glucose tolerance test is elevated at 160, and their 2-hour serum insulin level is also high at 175. They have a body mass index of 30.5, indicating overweight. The diabetes pedigree function score is 0.588, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"This data describes a 28-year-old individual who has been pregnant 3 times. They have a normal diastolic blood pressure of 68 and a slightly below average triceps skin fold thickness of 23. Their plasma glucose concentration after a GTT is normal at 100, and they have a moderate level of serum insulin at 81. The individual is slightly overweight with a body mass index of 31.6 and has a family history of diabetes with a diabetes pedigree function score of 0.949.###\nHence this label was avoid."
"The patient is a 21-year-old who is pregnant for the first time. Despite having a low diastolic blood pressure of 24, their triceps skin fold thickness is 19, indicating a moderate level of fat. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 89, suggesting a normal blood sugar level. The 2-hour serum insulin level is 25, which is within the healthy range. The patient's body mass index is 27.8, classifying them as overweight. The diabetes pedigree function score is 0.559, indicating a mild genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 28-year-old woman who is pregnant for the first time. She has a normal diastolic blood pressure of 64 and her triceps skin fold thickness is within the healthy range. Her plasma glucose concentration after a glucose tolerance test is 84, which is normal. However, her 2-hour serum insulin level is high at 115. She has a body mass index of 36.9, indicating she is overweight. The diabetes pedigree function score is low at 0.471, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"A 25-year-old woman who has never been pregnant shows normal diastolic blood pressure and triceps skin fold thickness. She has high plasma glucose concentration after a glucose tolerance test, but no insulin was detected after 2 hours. Her body mass index is elevated, and she has a relatively high diabetes pedigree function score, indicating a potential risk for developing diabetes.###\nHence this label was consent."
"The patient is a 37-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 84, no triceps skin fold thickness, and a plasma glucose concentration of 133 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 40.2. Her diabetes pedigree function is 0.696.###\nHence this label was avoid."
"This patient is a 46-year-old female who has never been pregnant. She has a diastolic blood pressure of 76 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 67 mg/dL, with a 2-hour serum insulin level of 0 uU/ml. She has a high body mass index of 45.3 and a low diabetes pedigree function score of 0.194.###\nHence this label was avoid."
"This is a 24-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 66, triceps skin fold thickness of 22, and a plasma glucose concentration of 112 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and their body mass index is 25.0. The diabetes pedigree function for this individual is 0.307.###\nHence this label was avoid."
"The patient is a 40-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 27. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 144, with a 2-hour serum insulin level of 228. She has a body mass index of 33.9 and a diabetes pedigree function of 0.255.###\nHence this label was avoid."
"This patient is a 29-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and no serum insulin. However, her plasma glucose concentration after a 2-hour oral glucose tolerance test is 141, indicating a possibility of diabetes. With a body mass index of 42.4, she has a high risk of developing diabetes according to the diabetes pedigree function of 0.205.###\nHence this label was consent."
"The patient is a young adult, 21 years old, who is pregnant for the first time. She has low diastolic blood pressure, a thin triceps skin fold, and low plasma glucose concentration after a glucose tolerance test. Her insulin levels are minimal, and she has a healthy body mass index. The diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"A 24-year-old individual who has been pregnant 2 times, with a diastolic blood pressure of 62, a Triceps skin fold thickness of 28, a plasma glucose concentration of 92 after a glucose tolerance test, no insulin after 2 hours, a body mass index of 31.6, and a diabetes pedigree function of 0.13.###\nHence this label was avoid."
"The patient is a 60-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 36. Her plasma glucose concentration is 181 mg/dL after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 495 µU/ml. She has a body mass index of 30.1 and a diabetes pedigree function of 0.615. Overall, these measurements indicate a potential risk for developing diabetes.###\nHence this label was consent."
"This is a data point of a 27-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 122, no triceps skin fold thickness, and a plasma glucose concentration of 96 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 22.4. The diabetes pedigree function value is 0.207, indicating a low genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 37-year-old woman who has been pregnant 4 times. She has normal diastolic blood pressure, low triceps skin fold thickness, and normal 2-hour serum insulin levels. Her plasma glucose concentration is slightly elevated. She has a low body mass index and a relatively low diabetes pedigree function score. Overall, she appears to have a low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"The patient is a 45-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 94 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 140, and her 2-hour serum insulin level is 0. She has a body mass index of 32.7 and a diabetes pedigree function value of 0.734.###\nHence this label was consent."
"The patient is a 56-year-old who has been pregnant 4 times. Their diastolic blood pressure is 72, triceps skin fold thickness is 47, plasma glucose concentration is 111, 2-hour serum insulin is 207, body mass index is 37.1, and diabetes pedigree function is 1.39.###\nHence this label was consent."
"The patient is a 37-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 88, a triceps skin fold thickness of 39, and a plasma glucose concentration of 128 after a glucose tolerance test. Her 2-hour serum insulin level is 110, and her body mass index is 36.5. She also has a diabetes pedigree function value of 1.057.###\nHence this label was consent."
"The patient is a 25-year-old woman who is pregnant for the first time. She has a healthy diastolic blood pressure of 62 and a slightly below average triceps skin fold thickness of 18. Her glucose levels are normal at 90, but her insulin levels are a bit elevated at 59. Despite this, her body mass index is within the healthy range at 25.1. She has a moderately high diabetes pedigree function score of 1.268, indicating a potential risk of developing diabetes in the future.###\nHence this label was avoid."
"The patient is a 66-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 114 mg/dL, and their 2-hour serum insulin level is 0 µU/ml. The patient's body mass index is 27.8, and their diabetes pedigree function value is 0.247.###\nHence this label was avoid."
"The patient is a 57-year-old woman who has been pregnant 13 times. She has a healthy diastolic blood pressure of 82 and a triceps skin fold thickness of 19. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 145, with a 2-hour serum insulin level of 110. She maintains a low body mass index of 22.2 and has a diabetes pedigree function value of 0.245.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant 4 times and shows relatively low diastolic blood pressure of 62. They have a triceps skin fold thickness of 31 and a high plasma glucose concentration of 154 after a GTT. Their 2-hour serum insulin level is elevated at 284, and they have a body mass index of 32.8. Despite these indicators, their diabetes pedigree function is relatively low at 0.237. Overall, this individual may have some risk factors for diabetes, given their high glucose and insulin levels.###\nHence this label was avoid."
"This patient is a 41-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 84 and a body mass index of 39.9, indicating obesity. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0, which may be concerning. However, her plasma glucose concentration after a glucose tolerance test is high at 178, suggesting a risk for diabetes. The diabetes pedigree function value is low at 0.331. Overall, this patient may be at high risk for developing diabetes due to her age, high blood pressure, obesity, and glucose levels.###\nHence this label was consent."
"The individual in this dataset is a 22-year-old female who has never been pregnant. She has normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness is within a healthy range. The results from her oral glucose tolerance test show a normal plasma glucose concentration at 101, with no serum insulin detected. Her diabetes pedigree function indicates a low genetic risk for developing diabetes.###\nHence this label was avoid."
"This 22-year-old individual has never been pregnant and has a diastolic blood pressure of 82. Their triceps skin fold thickness is 14, plasma glucose concentration after a glucose tolerance test is 188, and 2-hour serum insulin level is 185. With a body mass index of 32.0 and a diabetes pedigree function of 0.682, this person's risk for developing diabetes may need to be monitored closely.###\nHence this label was consent."
"A 53-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 76. They have a triceps skin fold thickness of 27, a plasma glucose concentration of 187 after a glucose tolerance test, and a 2-hour serum insulin level of 207. Their body mass index is 43.6 and their diabetes pedigree function is 1.034.###\nHence this label was consent."
"This 28-year-old individual has been pregnant twice and shows a significantly low diastolic blood pressure of 52. Despite having a high triceps skin fold thickness and body mass index, their plasma glucose concentration after a GTT is within a normal range. The 2-hour serum insulin level is elevated at 158, indicating potential insulin resistance. The diabetes pedigree function value of 0.816 suggests a moderate genetic predisposition to diabetes. Overall, this individual may have some risk factors for developing diabetes, such as insulin resistance and obesity, but further monitoring and evaluation are needed to determine their actual risk.###\nHence this label was avoid."
"This data describes a 26-year-old individual who has been pregnant twice. Their diastolic blood pressure is 76, triceps skin fold thickness is 27, plasma glucose concentration after a glucose tolerance test is 122, 2-hour serum insulin level is 200, body mass index is 35.9, and diabetes pedigree function is 0.483.###\nHence this label was avoid."
"The patient is a 23-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 50, triceps skin fold thickness of 30, plasma glucose concentration of 93, 2-hour serum insulin level of 64, body mass index of 28.7, and a diabetes pedigree function value of 0.356.###\nHence this label was avoid."
"This data belongs to a 29-year-old female who has been pregnant twice. She has a diastolic blood pressure of 76, triceps skin fold thickness of 35, and a high plasma glucose concentration of 146 after a glucose tolerance test. Her 2-hour serum insulin level is 194, and she has a body mass index of 38.2. The diabetes pedigree function, a measure of hereditary risk, is 0.329.###\nHence this label was avoid."
"This 46-year-old patient has been pregnant 9 times and has a diastolic blood pressure of 76. Their triceps skin fold thickness is 37 mm. They have a plasma glucose concentration of 102 mg/dL after a glucose tolerance test and a 2-hour serum insulin level of 0 µU/mL. With a body mass index of 32.9 and a diabetes pedigree function of 0.665, this patient's risk for developing diabetes may be assessed.###\nHence this label was consent."
"A 42-year-old individual, who has been pregnant 8 times, with a surprisingly low diastolic blood pressure of 55. They have a relatively low triceps skin fold thickness of 20, and a normal plasma glucose concentration of 85 after a 2-hour oral glucose tolerance test. The 2-hour serum insulin level is notably 0. Despite the pregnancies, their body mass index is within a healthy range at 24.4. The diabetes pedigree function value is low at 0.136, indicating a lower risk of developing diabetes based on genetic factors.###\nHence this label was avoid."
"This person is 23 years old and has been pregnant twice. They have a diastolic blood pressure of 74 and a triceps skin fold thickness of 30. Their plasma glucose concentration after a glucose tolerance test is 107, with a 2-hour serum insulin level of 100. Their body mass index is 33.6 and their diabetes pedigree function is 0.404.###\nHence this label was avoid."
"The patient is a 45-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 30mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 154 mg/dL, and her 2-hour serum insulin level is 100 μU/ml. She has a body mass index of 30.9 kg/m² and a diabetes pedigree function score of 0.164. These measurements indicate a moderate risk for developing diabetes.###\nHence this label was avoid."
"This is a 32-year-old individual who has been pregnant 3 times. Their diastolic blood pressure is 74 mmHg, triceps skin fold thickness is 0 mm, and 2-hour serum insulin is 0. Their plasma glucose concentration after a glucose tolerance test is 102 mg/dL. They have a body mass index of 29.5 and a diabetes pedigree function value of 0.121.###\nHence this label was avoid."
"A 31-year-old individual, who has been pregnant 2 times, with a diastolic blood pressure of 78, triceps skin fold thickness of 37, plasma glucose concentration at 128, 2-hour serum insulin level of 182, body mass index of 43.3, and a diabetes pedigree function of 1.224. The data suggests potential risk factors for developing diabetes.###\nHence this label was consent."
"This 40-year-old individual has been pregnant 7 times and shows normal diastolic blood pressure. They have no triceps skin fold thickness and a slightly elevated plasma glucose concentration after a glucose tolerance test. Their insulin levels are low, but their body mass index is within a healthy range. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The individual in the dataset is a 24-year-old woman who is pregnant for the first time. She has normal diastolic blood pressure, moderate triceps skin fold thickness, and average plasma glucose concentration after a glucose tolerance test. Her insulin levels are low, and her body mass index is within a healthy range. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"A 28-year-old woman who has been pregnant 5 times has a normal diastolic blood pressure, moderately thick triceps skin fold, and a slightly elevated glucose level after a glucose tolerance test. She has high insulin levels, indicating possible insulin resistance. Her body mass index is in the obese range, and her diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 28. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 194. Her 2-hour serum insulin level is 0, and she has a body mass index of 35.9. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes at 0.745.###\nHence this label was consent."
"The patient is 33 years old and has been pregnant 4 times. She has a low diastolic blood pressure of 60 and a moderate triceps skin fold thickness of 33. Her glucose level after a GTT is normal at 103, but she has high insulin levels at 192. Despite this, her body mass index is in the normal range at 24.0, and she has a slightly elevated diabetes pedigree function of 0.966.###\nHence this label was avoid."
"The patient is a 21-year-old female who has been pregnant 3 times. She has normal diastolic blood pressure and a low triceps skin fold thickness. Her glucose levels are within normal range after a glucose tolerance test, and she has no insulin resistance. With a healthy body mass index and a low diabetes pedigree function score, she is at low risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 22-year-old who is pregnant for the first time. She has a diastolic blood pressure of 70, triceps skin fold thickness of 13, and a plasma glucose concentration of 130 after a glucose tolerance test. Her 2-hour serum insulin level is 105, and her body mass index is 25.9. The diabetes pedigree function score is 0.472. This data indicates a relatively healthy individual with no significant red flags for diabetes at the moment.###\nHence this label was avoid."
"This data belongs to a 60-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 90, a triceps skin fold thickness of 7, and a plasma glucose concentration of 129. Additionally, their 2-hour serum insulin level is 326, and their body mass index is 19.6. The diabetes pedigree function for this individual is 0.582.###\nHence this label was avoid."
"This 32-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 74. Additionally, their triceps skin fold thickness is 27, plasma glucose concentration after a glucose tolerance test is 99, and 2-hour serum insulin level is 0. They have a body mass index of 29.0 and a diabetes pedigree function of 0.203.###\nHence this label was avoid."
"The individual is a 25-year-old who has never been pregnant and has a healthy diastolic blood pressure of 62. They have a moderate triceps skin fold thickness of 30, normal blood glucose levels at 107, and a slightly elevated 2-hour serum insulin level of 74. Their body mass index is in the overweight range at 36.6, and they have a low diabetes pedigree function score of 0.757.###\nHence this label was consent."
"A 25-year-old woman who has been pregnant twice shows normal diastolic blood pressure and a slightly low triceps skin fold thickness. Her plasma glucose concentration is within the normal range after a 2-hour oral glucose tolerance test. However, she has a high level of 2-hour serum insulin and a slightly elevated body mass index. Her diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 21-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 60 and a triceps skin fold thickness of 8. Her plasma glucose concentration after a glucose tolerance test is 109, and her 2-hour serum insulin level is 182. She has a body mass index of 25.4 and a diabetes pedigree function of 0.947.###\nHence this label was avoid."
"A 25-year-old individual, who is pregnant for the first time, has a normal diastolic blood pressure of 62. Their triceps skin fold thickness is within normal range at 25mm. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 92 mg/dL, indicating normal blood sugar levels. The 2-hour serum insulin level is 41 μU/mL, suggesting adequate insulin production. With a body mass index of 19.5, this person is considered underweight. Their diabetes pedigree function score is 0.482, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This data describes a 42-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 90, triceps skin fold thickness of 30, and a plasma glucose concentration of 89 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 33.5. The diabetes pedigree function for this individual is 0.292.###\nHence this label was avoid."
"The patient is a 29-year-old female who has been pregnant 4 times. She has normal diastolic blood pressure, no triceps skin fold thickness, and a normal 2-hour serum insulin level. Despite having a low plasma glucose concentration after a glucose tolerance test, she has a high body mass index. The patient has a low risk of developing diabetes, supported by a low diabetes pedigree function score.###\nHence this label was avoid."
"This person is a 36-year-old female who has been pregnant once. She has a diastolic blood pressure of 68, a triceps skin fold thickness of 8, and a plasma glucose concentration of 90 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 24.5. Additionally, her diabetes pedigree function is 1.138.###\nHence this label was avoid."
"The individual is a 30-year-old who has been pregnant 4 times. They have a diastolic blood pressure of 62 and a triceps skin fold thickness of 12. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 117. They have no serum insulin after 2 hours. Their body mass index is 29.7 and their diabetes pedigree function is 0.38.###\nHence this label was consent."
"A 81-year-old individual who has been pregnant 9 times with a diastolic blood pressure of 74. They have a triceps skin fold thickness of 33, plasma glucose concentration of 134, and 2-hour serum insulin of 60. With a body mass index of 25.9 and a diabetes pedigree function of 0.46.###\nHence this label was avoid."
"This data represents a 43-year-old individual who has been pregnant 13 times and has a diastolic blood pressure of 90. Their triceps skin fold thickness is 33, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 152. The 2-hour serum insulin level is 29, and their body mass index is 26.8. The diabetes pedigree function value is 0.731.###\nHence this label was consent."
"This individual is 43 years old and has been pregnant once. They have a diastolic blood pressure of 82, a triceps skin fold thickness of 25, and a plasma glucose concentration of 95 after a glucose tolerance test. Their 2-hour serum insulin level is 180, and their body mass index is 35.0. Their diabetes pedigree function is 0.233.###\nHence this label was consent."
"A 38-year-old woman who has been pregnant 5 times has a diastolic blood pressure of 74. She has no triceps skin fold thickness and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 124. Her 2-hour serum insulin level is 0 and she has a body mass index of 34.0. Her diabetes pedigree function is 0.22.###\nHence this label was consent."
"The patient is a 54-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 110 and a triceps skin fold thickness of 24. Her plasma glucose concentration after a GTT is 171 mg/dL and her 2-hour serum insulin level is 240 uU/mL. With a body mass index of 45.4 and a diabetes pedigree function score of 0.721, this patient may have an increased risk of developing diabetes.###\nHence this label was consent."
"A 26-year-old individual who has been pregnant three times shows unusually low diastolic blood pressure, normal triceps skin fold thickness, and moderate plasma glucose concentration after a glucose tolerance test. Additionally, she has high insulin levels, a slightly elevated body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"This data belongs to a 42-year-old individual who has been pregnant 11 times. They have a diastolic blood pressure of 68, triceps skin fold thickness of 40, and a plasma glucose concentration of 103 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 46.2. The diabetes pedigree function value is 0.126.###\nHence this label was avoid."
"The individual is a 25-year-old who has never been pregnant, with a normal diastolic blood pressure of 78. They have a high triceps skin fold thickness of 63, indicating excess body fat. The plasma glucose concentration after a glucose tolerance test is elevated at 180, while insulin levels are relatively low at 14. With a high body mass index of 59.4 and a moderate diabetes pedigree function of 2.42, this person may be at risk for developing diabetes.###\nHence this label was consent."
"This is a data point of a 22-year-old individual who is pregnant for the first time. She has normal diastolic blood pressure, a moderate triceps skin fold thickness, and average plasma glucose concentration after a 2-hour glucose tolerance test. She has low insulin levels, a healthy body mass index, and a slightly elevated diabetes pedigree function.###\nHence this label was avoid."
"This data belongs to a 37-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 70 and a triceps skin fold thickness of 32. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 105, and their 2-hour serum insulin level is 68. They have a body mass index of 30.8 and a diabetes pedigree function value of 0.122.###\nHence this label was avoid."
"The patient is a 32-year-old woman who has never been pregnant. She has a diastolic blood pressure of 88, a triceps skin fold thickness of 0, and a plasma glucose concentration of 131 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 31.6. Her diabetes pedigree function is 0.743, suggesting a potential genetic predisposition to diabetes.###\nHence this label was consent."
"A 23-year-old individual who is 2 times pregnant with low diastolic blood pressure and zero triceps skin fold thickness. They have a normal plasma glucose concentration of 111 after a 2-hour oral glucose tolerance test, zero 2-hour serum insulin levels, and a healthy body mass index of 26.2. Their diabetes pedigree function is low at 0.343.###\nHence this label was avoid."
"The individual is a 40-year-old female who has been pregnant 3 times. She has a low diastolic blood pressure of 78 mmHg. Her triceps skin fold thickness is 39mm, indicating a moderate amount of subcutaneous fat. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 96 mg/dL, within the normal range. She has no insulin in her bloodstream after 2 hours. Her body mass index is 37.3, indicating obesity. The diabetes pedigree function value is 0.238, suggesting a low genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 31-year-old with 2 pregnancies, normal diastolic blood pressure, and a healthy triceps skin fold thickness. Their glucose level after a meal is within normal range, but their insulin level is elevated. They have a slightly elevated body mass index and a low diabetes pedigree function, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"A 27-year-old woman who has been pregnant 5 times with a normal diastolic blood pressure, relatively low triceps skin fold thickness, and a healthy plasma glucose concentration after a 2-hour oral glucose tolerance test. She has no serum insulin present, a high body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 22-year-old woman who has never been pregnant has a healthy diastolic blood pressure of 64. Her triceps skin fold thickness is 39 mm, indicating a normal amount of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 95 mg/dL, which is within the healthy range. She has a 2-hour serum insulin level of 105 mu U/ml, suggesting normal insulin production. With a body mass index of 44.6, she is classified as obese. Her low diabetes pedigree function score of 0.366 indicates a relatively low genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 44-year-old female who has been pregnant 5 times. She has a normal diastolic blood pressure of 76 and a low triceps skin fold thickness. Her glucose level during an oral glucose tolerance test is 115, with no insulin present in her serum. She has a body mass index of 31.2 and a relatively low diabetes pedigree function of 0.343.###\nHence this label was consent."
"A 24-year-old individual who has never been pregnant shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Their blood glucose level after a glucose tolerance test is within normal range, but they have high insulin levels. Despite a slightly high body mass index, their risk of developing diabetes is relatively low based on their family history of the disease.###\nHence this label was consent."
"The patient is a 26-year-old female who is 1 time pregnant and has a very low diastolic blood pressure of 30. She has a high level of triceps skin fold thickness at 42, suggesting excess body fat. Her plasma glucose concentration after a glucose tolerance test is 88, which is within the normal range. However, she has a high level of 2-hour serum insulin at 99, indicating possible insulin resistance. The patient has a very high body mass index of 55.0, putting her in the obese category. Despite these risk factors, her diabetes pedigree function score is relatively low at 0.496, suggesting a moderate genetic predisposition to diabetes. Overall, this patient may have an increased risk of developing diabetes due to her high BMI, insulin levels, and triceps skin fold thickness.###\nHence this label was consent."
"This data belongs to a 23-year-old patient who is pregnant for the first time. She has a normal diastolic blood pressure of 74 and a slightly above average triceps skin fold thickness of 26. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 140. She has a high level of 2-hour serum insulin at 180 and a healthy body mass index of 24.1. The diabetes pedigree function score, which indicates the likelihood of developing diabetes based on family history, is 0.828, suggesting a moderate genetic predisposition to the disease.###\nHence this label was avoid."
"The patient is a 54-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 96, no triceps skin fold thickness, and a plasma glucose concentration of 125 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin is 0, body mass index is 0.0, and she has a diabetes pedigree function value of 0.232.###\nHence this label was consent."
"The patient is a young adult female who has never been pregnant. She has normal blood pressure, no significant triceps skin fold thickness, and a low plasma glucose concentration after a glucose tolerance test. Her insulin levels are normal, and she has a very low body mass index. The diabetes pedigree function score suggests a slight genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 29-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 60 and a moderately high triceps skin fold thickness of 27. Her plasma glucose concentration after a glucose tolerance test is elevated at 148, and she has a high 2-hour serum insulin level of 318. Despite having a body mass index of 30.9, which indicates obesity, her diabetes pedigree function is relatively low at 0.15.###\nHence this label was consent."
"This individual, a 42-year-old, has been pregnant once. Their diastolic blood pressure is 68, triceps skin fold thickness is 29, and plasma glucose concentration after a glucose tolerance test is 149. Additionally, their 2-hour serum insulin level is 127, body mass index is 29.3, and diabetes pedigree function is 0.349.###\nHence this label was consent."
"A 63-year-old individual who has been pregnant 5 times shows normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration. Their 2-hour serum insulin level is at 0, and they have a moderately high body mass index. The individual has a low diabetes pedigree function score, indicating a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"A 25-year-old individual who has been pregnant 3 times, with low diastolic blood pressure (52) and no triceps skin fold thickness. They have a normal plasma glucose concentration at 121, no insulin level after a 2-hour oral glucose tolerance test, and a high body mass index of 36.0. The diabetes pedigree function is low at 0.127.###\nHence this label was consent."
"The patient is a 23-year-old female who is pregnant for the first time. She has low diastolic blood pressure (60 mmHg), average triceps skin fold thickness (42 mm), low plasma glucose concentration (79 mg/dL) and normal insulin levels (48 uU/ml). Her body mass index is indicative of obesity (43.5) and her diabetes pedigree function score is moderate (0.678). Overall, the patient shows signs of potential risk for developing diabetes due to her high BMI and family history.###\nHence this label was avoid."
"This data describes a 50-year-old individual who has been pregnant 11 times. They have a diastolic blood pressure of 74, triceps skin fold thickness of 26, and a plasma glucose concentration of 138 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 144, body mass index is 36.1, and diabetes pedigree function is 0.557.###\nHence this label was consent."
"This is a data entry for a 37-year-old individual with 4 pregnancies. The individual has a diastolic blood pressure of 110, a triceps skin fold thickness of 31, and a plasma glucose concentration of 189 after a 2-hour oral glucose tolerance test. The 2-hour serum insulin is 0, and the body mass index is 28.5. The diabetes pedigree function is 0.68.###\nHence this label was avoid."
"The patient is a 66-year-old female who has been pregnant 6 times. She has a normal diastolic blood pressure of 74 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is elevated at 166. She has no insulin present after a 2-hour serum test. Her body mass index is 26.6, indicating she is overweight. The diabetes pedigree function score is 0.304, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"This data represents a 43-year-old individual who has been pregnant 7 times. They have a diastolic blood pressure of 68, a triceps skin fold thickness of 49, and a plasma glucose concentration at 129 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 125. Their body mass index is 38.5, and they have a diabetes pedigree function value of 0.439.###\nHence this label was consent."
"A 27-year-old woman with 5 pregnancies shows normal diastolic blood pressure levels. She has very low triceps skin fold thickness and no insulin in her blood. Her glucose levels are elevated after a 2-hour oral glucose tolerance test. Despite her high body mass index, her diabetes pedigree function is relatively low.###\nHence this label was consent."
"This patient is a 65-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 108 mmHg and a triceps skin fold thickness of 37 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 103 mg/dL. She has no detectable insulin levels after a 2-hour serum test. Her body mass index is 39.2, indicating obesity. The diabetes pedigree function score is 0.305, suggesting a mild genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 48-year-old woman who has been pregnant 5 times. She has a normal diastolic blood pressure of 74 and a low triceps skin fold thickness of 0. Her glucose levels are within normal range at 104, and she has no insulin present after a 2-hour oral glucose tolerance test. Despite having a slightly elevated body mass index of 28.8, her diabetes pedigree function is low at 0.153.###\nHence this label was avoid."
"A 41-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 78. Their triceps skin fold thickness and 2-hour serum insulin levels are both 0. They have a low plasma glucose concentration at 62 and a body mass index of 32.6. Their diabetes pedigree function is 0.391.###\nHence this label was avoid."
"The individual is a 65-year-old who has never been pregnant and has very low diastolic blood pressure. They have no triceps skin fold thickness and extremely low insulin levels. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is elevated. With a low body mass index and a relatively low diabetes pedigree function, this individual may have a moderate risk of developing diabetes.###\nHence this label was avoid."
"A 23-year-old woman who is pregnant for the first time has below average diastolic blood pressure, moderate triceps skin fold thickness, normal glucose levels after a glucose tolerance test, high insulin levels, healthy body mass index, and a moderately low diabetes pedigree function score.###\nHence this label was avoid."
"A 39-year-old individual who has been pregnant 8 times shows normal diastolic blood pressure, moderate triceps skin fold thickness, low plasma glucose concentration after a glucose tolerance test, moderately low serum insulin levels, and a high body mass index. The individual has a relatively low diabetes pedigree function score, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"The individual is a young, 21-year-old female who is pregnant for the first time. She has a normal diastolic blood pressure of 72 and a moderately low triceps skin fold thickness of 30. Her glucose levels after a GTT are within normal range at 99, and her insulin levels are also on the lower side at 18. She has a relatively high body mass index of 38.6 and a low diabetes pedigree function of 0.412. Overall, this data suggests a low risk for developing diabetes in this individual.###\nHence this label was avoid."
"The patient is a 24-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 30 mm. Her plasma glucose concentration after a glucose tolerance test is 107 mg/dL, and her 2-hour serum insulin level is 82 mu U/ml. She has a body mass index of 30.8 and a diabetes pedigree function of 0.821.###\nHence this label was avoid."
"This individual is a 29-year-old female who has never been pregnant. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 37 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 123 mg/dL, and her 2-hour serum insulin level is 0 µU/ml. She has a body mass index (BMI) of 35.2, and her diabetes pedigree function is 0.197.###\nHence this label was avoid."
"This individual is a 28-year-old female who has never been pregnant. She has a low diastolic blood pressure of 70 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 146, and her 2-hour serum insulin level is 0. With a high body mass index of 37.9, she has a relatively low diabetes pedigree function score of 0.334.###\nHence this label was consent."
"A 28-year-old woman who has been pregnant twice has a healthy diastolic blood pressure of 76. She has a moderate triceps skin fold thickness of 20, normal plasma glucose concentration of 92, and low insulin levels. With a good body mass index of 24.2 and a slightly elevated diabetes pedigree function of 1.698, she is at moderate risk of developing diabetes.###\nHence this label was avoid."
"This 46-year-old individual has been pregnant 4 times and has a low diastolic blood pressure of 72. They have a triceps skin fold thickness of 0, indicating a lean body composition. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 115, and they have no insulin present. With a body mass index of 28.9 and a low diabetes pedigree function of 0.376, this person shows relatively low risk factors for developing diabetes.###\nHence this label was consent."
"This individual is a 29-year-old who has been pregnant 2 times. They have a diastolic blood pressure of 70, a triceps skin fold thickness of 38, and a plasma glucose concentration of 146 after a glucose tolerance test. Their 2-hour serum insulin level is 360, and they have a body mass index of 28.0. Their diabetes pedigree function is 0.337.###\nHence this label was consent."
"This 50-year-old individual has been pregnant 9 times and shows normal diastolic blood pressure. They have a moderately thick triceps skin fold, and their plasma glucose concentration after a GTT is within normal range. Their 2-hour serum insulin level is low. Despite having a slightly elevated body mass index, their diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 52-year-old female who has been pregnant twice. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration is 108 mg/dL after a 2-hour oral glucose tolerance test, with a 2-hour serum insulin level of 0 μU/ml. She has a body mass index of 27.0 kg/m^2 and a diabetes pedigree function value of 0.259.###\nHence this label was consent."
"The patient is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 90, a triceps skin fold thickness of 24, and a plasma glucose concentration of 142 after a glucose tolerance test. Her 2-hour serum insulin level is 480, and she has a body mass index of 30.4. The diabetes pedigree function for this patient is 0.128.###\nHence this label was consent."
"This individual is a 62-year-old woman who has been pregnant 12 times. \nShe has a normal diastolic blood pressure of 78 mmHg. \nHer triceps skin fold thickness is 17 mm. \nHer plasma glucose concentration after a 2-hour oral glucose tolerance test is 121 mg/dL. \nShe has no detectable insulin in her blood after a 2-hour serum test. \nWith a body mass index of 26.5, she is considered overweight. \nHer diabetes pedigree function score is 0.259, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This data belongs to a 43-year-old individual who has been pregnant 6 times. Their diastolic blood pressure is 58, triceps skin fold thickness is 33, and plasma glucose concentration after a glucose tolerance test is 98. Their 2-hour serum insulin level is 190, body mass index is 34.0, and diabetes pedigree function is 0.43.###\nHence this label was avoid."
"This is data from a 24-year-old individual who has been pregnant 3 times. She has a low diastolic blood pressure of 54 and a healthy triceps skin fold thickness of 19. Her glucose levels are normal at 99, with a moderate insulin level of 86. She has a good body mass index of 25.6 and a low diabetes pedigree function of 0.154.###\nHence this label was avoid."
"The patient is a 50-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 80, no triceps skin fold thickness, and a plasma glucose concentration of 147 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 29.5. Her diabetes pedigree function is 0.178.###\nHence this label was consent."
"This individual is a 21-year-old who has been pregnant twice. They have a slightly below average diastolic blood pressure of 82, a healthy triceps skin fold thickness of 18, and a normal plasma glucose concentration of 142 after a glucose tolerance test. Their insulin level after the test is within the normal range at 64, and they have a healthy body mass index of 24.7. Additionally, their diabetes pedigree function score is 0.761, indicating a moderate genetic risk for diabetes. Overall, this individual's health markers suggest a low risk for developing diabetes.###\nHence this label was avoid."
"This patient is a 45-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 102 mmHg and a triceps skin fold thickness of 28 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 133 mg/dL, and her 2-hour serum insulin level is 140 μU/mL. She has a body mass index of 32.8 and a diabetes pedigree function of 0.234.###\nHence this label was consent."
"This is a dataset for a 26-year-old individual who has never been pregnant. Their diastolic blood pressure is 76, triceps skin fold thickness is 43, and body mass index is 47.9, indicating a higher risk of developing diabetes. Their plasma glucose concentration after a glucose tolerance test is 165, and their 2-hour serum insulin level is 255. The diabetes pedigree function is 0.259, suggesting a genetic predisposition to diabetes.###\nHence this label was avoid."
"This 21-year-old individual has never been pregnant and has a low diastolic blood pressure of 60. Their triceps skin fold thickness is 29, indicating a moderate amount of subcutaneous fat. With a high plasma glucose concentration of 177, high insulin level of 478, and a body mass index of 34.6, this person shows signs of potential diabetes. The diabetes pedigree function value of 1.072 further suggests a genetic predisposition to the disease.###\nHence this label was consent."
"The individual in the dataset is a 26-year-old who has never been pregnant. They have elevated diastolic blood pressure of 88 mmHg and a high triceps skin fold thickness of 44 mm. Their plasma glucose concentration is significantly elevated at 181 mg/dL after a 2-hour oral glucose tolerance test. The 2-hour serum insulin level is abnormally high at 510 μU/mL. They have a high body mass index of 43.3, indicating obesity. The diabetes pedigree function score is low at 0.222, suggesting a lower genetic risk for diabetes.###\nHence this label was consent."
"This 24-year-old individual, who has been pregnant once, has a healthy diastolic blood pressure of 74. With a triceps skin fold thickness of 50, they have a slightly elevated plasma glucose concentration following a glucose tolerance test at 136. Their 2-hour serum insulin level is high at 204, indicating potential insulin resistance. Additionally, they have a body mass index of 37.4, which falls into the obese category. Despite these risk factors, their diabetes pedigree function is relatively low at 0.399.###\nHence this label was avoid."
"The patient is a 25-year-old woman who has been pregnant twice. She has a low diastolic blood pressure of 58 and a relatively low triceps skin fold thickness of 16. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 87, and her 2-hour serum insulin level is 52. She has a body mass index of 32.7, indicating overweight. The diabetes pedigree function score is low at 0.166, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 34-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 33, and a plasma glucose concentration of 124 after a glucose tolerance test. Her 2-hour serum insulin level is 402, and she has a body mass index of 35.4. Her diabetes pedigree function is 0.282.###\nHence this label was avoid."
"The patient is a 37-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 33 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 124 mg/dL, and her 2-hour serum insulin level is 215 uU/mL. She has a body mass index of 25.5 and a diabetes pedigree function of 0.161.###\nHence this label was avoid."
"The patient is a 41-year-old woman who has been pregnant 13 times. She has a low diastolic blood pressure of 60 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 76, with no insulin detected after 2 hours. She has a body mass index of 32.8 and a low diabetes pedigree function of 0.18.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant 2 times. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 175 mg/dL, with a 2-hour serum insulin level of 0 μU/ml. She has a body mass index of 22.9 and a diabetes pedigree function value of 0.326.###\nHence this label was avoid."
"A 22-year-old woman who is 1 time pregnant has a diastolic blood pressure of 82, triceps skin fold thickness of 17, plasma glucose concentration of 128 after a glucose tolerance test, 2-hour serum insulin level of 183, body mass index of 27.5, and a low diabetes pedigree function of 0.115.###\nHence this label was avoid."
"A 29-year-old woman, who has been pregnant 5 times, has a diastolic blood pressure of 64. Her triceps skin fold thickness measures 33, and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 189. She has a 2-hour serum insulin level of 325 and a body mass index of 31.2. Her diabetes pedigree function is 0.583.###\nHence this label was consent."
"This data describes a 22-year-old individual who has been pregnant 4 times. \nShe has a diastolic blood pressure of 70 mmHg and no triceps skin fold thickness. \nHer plasma glucose concentration after a 2-hour oral glucose tolerance test is 136 mg/dL. \nHer 2-hour serum insulin level is 0 uU/mL. \nShe has a body mass index of 31.2, indicating she is overweight. \nHer diabetes pedigree function value is 1.182, suggesting a moderate genetic risk of developing diabetes.###\nHence this label was consent."
"A 35-year-old woman who has been pregnant 11 times shows no skinfold thickness, low blood pressure, low insulin levels, and a healthy body mass index of 30.1. Her glucose levels are normal, and her diabetes pedigree function is low.###\nHence this label was avoid."
"This individual is a 29-year-old woman who is pregnant for the first time. She has a low diastolic blood pressure of 56 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 146, with a 2-hour serum insulin level of 0. Her body mass index is 29.7, and her diabetes pedigree function score is 0.564.###\nHence this label was avoid."
"This individual is a 22-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 60 and a relatively low triceps skin fold thickness of 23. Her glucose concentration after a glucose tolerance test is 97. She has very low 2-hour serum insulin levels of 0. Despite having a body mass index of 28.2, which is considered overweight, her diabetes pedigree function is low at 0.443, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"This individual, aged 21, has never been pregnant and has very low diastolic blood pressure, triceps skin fold thickness, and serum insulin levels. Their plasma glucose concentration after a GTT is within normal range. They have a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 22-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 28mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106 mg/dL, and she has a 2-hour serum insulin level of 135 μU/mL. With a body mass index of 34.2, she has a relatively high likelihood of developing diabetes, as indicated by her diabetes pedigree function of 0.142.###\nHence this label was avoid."
"This 23-year-old patient has never been pregnant and has a diastolic blood pressure of 82. Their triceps skin fold thickness is 31, plasma glucose concentration is 84, and 2-hour serum insulin level is 125. With a body mass index of 38.2 and a low diabetes pedigree function of 0.233, this patient may have a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old woman who has been pregnant 10 times. She has a low diastolic blood pressure of 62 and no triceps skin fold thickness. Her plasma glucose concentration taken 2 hours after an oral glucose tolerance test is 92, and her 2-hour serum insulin level is 0. She has a healthy body mass index of 25.9 and a low diabetes pedigree function score of 0.167.###\nHence this label was avoid."
"This data represents a 22-year-old individual who has never been pregnant and has a low diastolic blood pressure of 50. They have a moderate triceps skin fold thickness of 36, high plasma glucose concentration of 179 after a glucose tolerance test, and elevated 2-hour serum insulin levels of 159. The individual has a high body mass index of 37.8 and a relatively low diabetes pedigree function score of 0.455.###\nHence this label was consent."
"The patient is a 68-year-old who has been pregnant 8 times. They have a diastolic blood pressure of 82 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 91, with no insulin detected after 2 hours. They have a body mass index of 35.6 and a diabetes pedigree function value of 0.587.###\nHence this label was avoid."
"The patient is a 52-year-old woman who has been pregnant 5 times. She has normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 162, with no insulin detected. She has a high body mass index of 37.7 and a low diabetes pedigree function of 0.151. Overall, the data suggests a potential risk for developing diabetes due to the high glucose level and BMI.###\nHence this label was consent."
"This individual is 35 years old and has been pregnant 11 times. They have a diastolic blood pressure of 76 and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 138, with a 2-hour serum insulin level of 0. Their body mass index is 33.2, and they have a diabetes pedigree function of 0.42.###\nHence this label was avoid."
"This individual is a 22-year-old who has never been pregnant and has a low diastolic blood pressure of 60. Despite having a relatively low triceps skin fold thickness of 25, their plasma glucose concentration after a glucose tolerance test is within the normal range at 93. However, they have a high 2-hour serum insulin level of 92. Their body mass index is 28.7, indicating they are overweight. The diabetes pedigree function value suggests a moderate genetic risk for developing diabetes.###\nHence this label was avoid."
"A 22-year-old woman, who has been pregnant twice, with a diastolic blood pressure of 60, triceps skin fold thickness of 17, plasma glucose concentration of 98 after a glucose tolerance test, 2-hour serum insulin level of 120, and a body mass index of 34.7. She has a low diabetes pedigree function score of 0.198.###\nHence this label was avoid."
"A 38-year-old woman, who is pregnant for the first time, has normal diastolic blood pressure and no triceps skin fold thickness. Her glucose levels after a GTT are elevated at 173, with no insulin detected after 2 hours. She has a high body mass index of 36.8 and a low diabetes pedigree function score of 0.088.###\nHence this label was consent."
"A 41-year-old individual who has been pregnant 7 times shows normal diastolic blood pressure and moderately high triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is elevated. They have low insulin levels, a high body mass index, and a moderately low diabetes pedigree function score. This profile suggests a potential risk for developing diabetes.###\nHence this label was consent."
"A 31-year-old individual who has never been pregnant has slightly elevated diastolic blood pressure. They have a higher than average triceps skin fold thickness and 2-hour serum insulin level. Despite having a normal plasma glucose concentration, they have a high body mass index. The individual also has a family history of diabetes, indicated by a relatively high diabetes pedigree function score.###\nHence this label was avoid."
"This patient is a 29-year-old woman who has been pregnant 3 times. She has normal diastolic blood pressure and triceps skin fold thickness. However, her plasma glucose concentration after a glucose tolerance test is high at 182. Despite no insulin present in her bloodstream after 2 hours, her body mass index is elevated at 30.5, indicating possible obesity. Her diabetes pedigree function score is 0.345, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 41-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 85 and a triceps skin fold thickness of 33. Her plasma glucose concentration after a glucose tolerance test is 140, and her 2-hour serum insulin level is 0. She has a body mass index of 37.4 and a diabetes pedigree function of 0.244.###\nHence this label was avoid."
"This 29-year-old individual, who has been pregnant 6 times, shows normal diastolic blood pressure and low triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within healthy ranges, with no insulin recorded after 2 hours. Despite a slightly elevated body mass index, their diabetes pedigree function is low, indicating a lower risk of developing diabetes.###\nHence this label was consent."
"The patient is a 30-year-old woman who has been pregnant 6 times. She has normal diastolic blood pressure, no triceps skin fold thickness, and normal glucose levels after a 2-hour oral glucose tolerance test. Additionally, she has low insulin levels, a healthy body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
