"The patient is a 64-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 78 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the healthy range at 120. She has no detectable 2-hour serum insulin. Her body mass index is 25.0, indicating that she is at a healthy weight. The diabetes pedigree function score is 0.409, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 22-year-old female, who has been pregnant twice, with a diastolic blood pressure of 56. She has a triceps skin fold thickness of 27mm and a plasma glucose concentration of 106 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 165 mu U/ml and her body mass index is 29.0. Additionally, her diabetes pedigree function is 0.426.###\nHence this label was No."
"The patient is a 23-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 68 mmHg, a triceps skin fold thickness of 28 mm, and a plasma glucose concentration of 74 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 45 μU/mL and her body mass index is 29.7. The diabetes pedigree function, which assesses the genetic risk of diabetes, is 0.293.###\nHence this label was No."
"The patient is a 34-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 168, with a 2-hour serum insulin level of 0. She has a body mass index of 38.0 and a diabetes pedigree function of 0.537.###\nHence this label was Yes."
"This patient is a 30-year-old female who has been pregnant twice. She has a diastolic blood pressure of 68, a triceps skin fold thickness of 28, and a plasma glucose concentration of 124 after a glucose tolerance test. Her 2-hour serum insulin level is 205, and she has a body mass index of 32.9. Her diabetes pedigree function is 0.875, indicating a moderate genetic risk for diabetes. Overall, this data suggests a potential risk for developing diabetes, warranting further monitoring and possibly intervention.###\nHence this label was Yes."
"The patient is a 58-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 26 mm, indicating a moderate amount of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 144 mg/dL. She has a high level of 2-hour serum insulin at 285 μU/mL, suggesting insulin resistance. With a body mass index of 32.0, she is considered obese. Her diabetes pedigree function is relatively low at 0.452, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 49-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 68, a triceps skin fold thickness of 26, and a body mass index of 33.6, indicating she is overweight. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 165, which is higher than normal. Additionally, she has a 2-hour serum insulin level of 168 and a diabetes pedigree function of 0.631, suggesting a moderate risk of developing diabetes.###\nHence this label was No."
"A 32-year-old female who has been pregnant 6 times displays a diastolic blood pressure of 68 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125, with a 2-hour serum insulin level of 120. She has a body mass index of 30.0 and a diabetes pedigree function of 0.464.###\nHence this label was No."
"The individual in the dataset is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 106 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 127 mg/dL, and her 2-hour serum insulin level is 0 μU/ml. She has a body mass index of 39.0 and a diabetes pedigree function value of 0.19.###\nHence this label was No."
"This individual is a 21-year-old with a low risk of diabetes. She has been pregnant once. Her diastolic blood pressure is 60, and her triceps skin fold thickness is 32. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 124. She has no 2-hour serum insulin. Her body mass index is 35.8, and her diabetes pedigree function is 0.514.###\nHence this label was No."
"The patient is a 41-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 90 and a body mass index of 39.8, indicating obesity. Her triceps skin fold thickness and 2-hour serum insulin levels are both 0. However, she has a high plasma glucose concentration of 196, suggesting she may be at risk for developing diabetes. The diabetes pedigree function value is relatively low at 0.451.###\nHence this label was Yes."
"This patient is 44 years old and has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and average glucose levels after a glucose tolerance test. Their insulin levels are normal, but they have a slightly high body mass index. The patient has a family history of diabetes, indicated by a moderately high diabetes pedigree function score.###\nHence this label was No."
"A 28-year-old woman, who is pregnant for the first time, has a normal diastolic blood pressure of 82. She has a slightly above-average triceps skin fold thickness and a high plasma glucose concentration of 144 after a 2-hour oral glucose tolerance test. Her insulin levels are low, and she has a high body mass index of 41.3. Additionally, her diabetes pedigree function score is moderate at 0.607.###\nHence this label was No."
"This individual, a 23-year-old, has been pregnant twice and has a diastolic blood pressure of 86. Their triceps skin fold thickness is 36 mm. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 102 mg/dL and their 2-hour serum insulin level is 120 mu U/ml. They have a body mass index of 45.5 and a diabetes pedigree function of 0.127.###\nHence this label was Yes."
"A 51-year-old woman who has been pregnant 7 times has a diastolic blood pressure of 74, triceps skin fold thickness of 26, plasma glucose concentration of 136 after a glucose tolerance test, 2-hour serum insulin level of 135, BMI of 26.0, and a diabetes pedigree function of 0.647.###\nHence this label was No."
"This is a data entry for a 24-year-old individual who is pregnant for the first time. Their diastolic blood pressure is 68 mmHg, triceps skin fold thickness is 34 mm, and plasma glucose concentration after a glucose tolerance test is 87 mg/dL. Their 2-hour serum insulin level is 77 μU/mL, body mass index is 37.6, and diabetes pedigree function is 0.401.###\nHence this label was No."
"A 22-year-old woman who has never been pregnant has a diastolic blood pressure of 70. She has a triceps skin fold thickness of 38, a plasma glucose concentration of 137 after a 2-hour oral glucose tolerance test, and a body mass index of 33.2. She has no insulin in her serum and a low diabetes pedigree function score of 0.17.###\nHence this label was No."
"A 22-year-old individual with 2 pregnancies shows normal diastolic blood pressure and no triceps skin fold thickness. Their glucose levels are lower than normal after a 2-hour oral glucose tolerance test. The insulin level is also zero, indicating low insulin production. Despite a body mass index of 0.0, there is a slight indication of diabetes in their family history based on a low diabetes pedigree function score of 0.102.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant twice. She has a healthy diastolic blood pressure of 70 mmHg and a moderate triceps skin fold thickness of 27 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 71 mg/dL, and she has no detectable serum insulin levels. Despite this, her body mass index is within the normal range at 28.0, and her diabetes pedigree function is moderately elevated at 0.586. Overall, based on these measurements, the patient appears to have a relatively low risk of developing diabetes.###\nHence this label was No."
"This is a dataset of a 22-year-old individual who is pregnant for the first time. She has a normal diastolic blood pressure of 66 and a slightly below-average triceps skin fold thickness of 15. Her plasma glucose concentration after a GTT is within the normal range at 97. She has a relatively high 2-hour serum insulin level of 140, a healthy body mass index of 23.2, and a low diabetes pedigree function of 0.487.###\nHence this label was No."
"A 33-year-old woman who has been pregnant 8 times shows normal diastolic blood pressure and no triceps skin fold thickness. She has a moderate plasma glucose concentration after a glucose tolerance test, while her serum insulin levels are low. Her body mass index is slightly higher than normal, and she has a moderate diabetes pedigree function indicating a potential risk for developing diabetes.###\nHence this label was Yes."
"This 33-year-old patient, who is pregnant for the first time, has a very low diastolic blood pressure of 30. Despite having a relatively high triceps skin fold thickness of 38, their plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 103. The 2-hour serum insulin level is also within the normal range at 83. Despite having a high body mass index of 43.3, the patient has a low diabetes pedigree function of 0.183, indicating a potentially low risk of developing diabetes.###\nHence this label was No."
"This is a data entry for a 34-year-old individual who has been pregnant 4 times. They have a normal diastolic blood pressure of 68 and a low triceps skin fold thickness of 0. Their glucose level after a 2-hour oral glucose tolerance test is 120, with a serum insulin level of 0. The individual has a body mass index of 29.6 and a moderate diabetes pedigree function of 0.709.###\nHence this label was No."
"The patient is a 34-year-old woman who has been pregnant 8 times. She has normal diastolic blood pressure and triceps skin fold thickness. Her plasma glucose level after a 2-hour oral glucose tolerance test is 107, with no insulin detected in her serum. She has a healthy body mass index of 24.6 and a low diabetes pedigree function score of 0.856.###\nHence this label was No."
"A 24-year-old individual who has been pregnant 5 times shows normal diastolic blood pressure, moderate triceps skin fold thickness, and slightly low plasma glucose concentration after a glucose tolerance test. They have a normal insulin level but a slightly elevated body mass index. Their diabetes pedigree function is low, indicating a lower risk of developing diabetes.###\nHence this label was No."
"This 38-year-old individual has been pregnant 10 times and shows normal diastolic blood pressure. Their triceps skin fold thickness and 2-hour serum insulin levels are both at 0, indicating lower body fat and insulin production. Despite having a relatively low plasma glucose concentration after a glucose tolerance test, their body mass index is indicative of being overweight. The diabetes pedigree function value suggests a low genetic predisposition to diabetes.###\nHence this label was No."
"This data belongs to a 26-year-old individual who has been pregnant 4 times. They have a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is high at 171. The 2-hour serum insulin level is low at 0. Despite having a high body mass index of 43.6, their diabetes pedigree function score is low at 0.479.###\nHence this label was Yes."
"This individual is 52 years old and has never been pregnant. They have a normal diastolic blood pressure of 72 and a low triceps skin fold thickness. Their glucose levels after a 2-hour oral glucose tolerance test is 123. They have no insulin in their serum. Their body mass index is 36.3, indicating obesity. The diabetes pedigree function value is low at 0.258.###\nHence this label was Yes."
"This patient is a 21-year-old female who is pregnant for the first time. She has normal diastolic blood pressure (70), slightly above-average triceps skin fold thickness (28), and a normal plasma glucose concentration at 2 hours (116). Her 2-hour serum insulin is low (0), indicating potential insulin sensitivity. With a body mass index of 27.4, she is classified as overweight. Her diabetes pedigree function score is low (0.204), suggesting a lower genetic risk for diabetes. Overall, she appears to have a relatively low risk of developing diabetes based on these measurements.###\nHence this label was No."
"This individual is a 38-year-old woman who has been pregnant five times. She has a diastolic blood pressure of 92 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 117 mg/dL. She has no insulin in her blood after 2 hours. With a body mass index of 34.1, she has a relatively high risk of developing diabetes, as indicated by her diabetes pedigree function of 0.337.###\nHence this label was No."
"The data describes a 49-year-old individual who has been pregnant 6 times. Their diastolic blood pressure is 78, triceps skin fold thickness is 31, and plasma glucose concentration (after a glucose tolerance test) is 125. They have no insulin after 2 hours, and their body mass index is 27.6. The diabetes pedigree function value is 0.565.###\nHence this label was Yes."
"The patient is a 24-year-old female who has been pregnant 3 times. She has low diastolic blood pressure, moderate triceps skin fold thickness, and high plasma glucose concentration after a 2-hour GTT. Her 2-hour serum insulin levels are low, but her body mass index is in the obese range. The diabetes pedigree function score indicates a moderate genetic risk for developing diabetes.###\nHence this label was Yes."
