"This data belongs to a 26-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 80, triceps skin fold thickness of 33, plasma glucose concentration of 124, 2-hour serum insulin level of 130, and a body mass index of 33.2. The diabetes pedigree function is 0.305.###\nHence this label was No."
"This 34-year-old individual has been pregnant four times and has normal diastolic blood pressure. Despite having a low triceps skin fold thickness and a low 2-hour serum insulin level, their plasma glucose concentration after a glucose tolerance test is also normal. With a moderately high body mass index and a relatively low diabetes pedigree function score, this person may have a lower risk of developing diabetes.###\nHence this label was No."
"A 25-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure, a moderately low triceps skin fold thickness, and normal plasma glucose concentration after a glucose tolerance test. Their insulin levels after 2 hours are on the lower side, and they have a slightly elevated body mass index. The diabetes pedigree function suggests a low genetic risk of developing diabetes.###\nHence this label was No."
"The patient is a young adult, 21 years old, who has been pregnant once. Their diastolic blood pressure is low at 56, and they have a moderate triceps skin fold thickness of 29. The patient's plasma glucose concentration after a GTT is within a normal range at 126, but their 2-hour serum insulin level is higher at 152. They have a healthy body mass index of 28.7 and a low diabetes pedigree function of 0.801.###\nHence this label was No."
"The individual in this dataset is a 30-year-old who has been pregnant 3 times. They have a healthy diastolic blood pressure of 80 and a low triceps skin fold thickness of 11. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 99, and they have a moderate level of 2-hour serum insulin at 64. With a low body mass index of 19.3 and a relatively low diabetes pedigree function score of 0.284, this individual shows signs of being at low risk for developing diabetes.###\nHence this label was No."
"A 33-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure and no triceps skin fold thickness. Her blood sugar levels after a glucose test are at a healthy level. She has low insulin levels and a slightly elevated body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"This 31-year-old patient has never been pregnant and shows normal diastolic blood pressure, zero triceps skin fold thickness, and zero 2-hour serum insulin level. However, their plasma glucose concentration after a GTT is 145, and they have a high body mass index of 44.2. The patient has a diabetes pedigree function of 0.63, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 50-year-old who has been pregnant 6 times, with a diastolic blood pressure of 62. They have no triceps skin fold thickness and 0 insulin level after a glucose tolerance test. Their plasma glucose concentration after 2 hours is 162, and they have a body mass index of 24.3. The diabetes pedigree function for this individual is 0.178.###\nHence this label was Yes."
"This data represents a 26-year-old individual who has been pregnant four times. They have a diastolic blood pressure of 72, a triceps skin fold thickness of 0, and a high plasma glucose concentration of 171 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 43.6. The individual also has a low diabetes pedigree function score of 0.479.###\nHence this label was Yes."
"The patient is a 41-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 112. She has no 2-hour serum insulin detected. Her body mass index is 37.8 and her diabetes pedigree function is 0.261.###\nHence this label was Yes."
"A 21-year-old woman, who is pregnant for the first time, had a low diastolic blood pressure of 58. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0. Despite her young age, she has a slightly elevated plasma glucose concentration of 105 after a glucose tolerance test. She has a healthy body mass index of 24.3 and a relatively low diabetes pedigree function score of 0.187.###\nHence this label was No."
"This 23-year-old individual has been pregnant twice and has a diastolic blood pressure of 76. Their triceps skin fold thickness is 18, plasma glucose concentration after a GTT is 94, and 2-hour serum insulin level is 66. With a body mass index of 31.6 and a diabetes pedigree function of 0.649, this person's health indicators suggest a risk for developing diabetes.###\nHence this label was No."
"This individual, aged 36, has been pregnant 7 times and has a diastolic blood pressure of 66. Their triceps skin fold thickness is 0, indicating low body fat. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 159. They have no serum insulin after 2 hours. With a body mass index of 30.4 and a diabetes pedigree function value of 0.383, this person shows potential risk factors for developing diabetes.###\nHence this label was Yes."
"A 23-year-old woman who is pregnant for the first time has a healthy diastolic blood pressure, low triceps skin fold thickness, and normal plasma glucose concentration. However, her 2-hour serum insulin is relatively high, indicating a possible risk for developing diabetes. Her body mass index is within the normal range, and her diabetes pedigree function is low.###\nHence this label was No."
"This is a 26-year-old individual who has been pregnant 2 times. They have a diastolic blood pressure of 68 and a triceps skin fold thickness of 25. Their plasma glucose concentration after a glucose tolerance test is 100, and their 2-hour serum insulin level is 71. They have a body mass index of 38.5 and a diabetes pedigree function of 0.324.###\nHence this label was No."
"This individual is a 41-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 37 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 57 mg/dL, and she has a very low 2-hour serum insulin level of 0 µU/mL. She has a body mass index (BMI) of 32.8, which indicates she is overweight. The diabetes pedigree function value is low at 0.096, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 196 mg/dL, with a 2-hour serum insulin level of 0. Her body mass index is 39.8, indicating obesity. The diabetes pedigree function value is 0.451, suggesting a genetic predisposition to diabetes.###\nHence this label was Yes."
"This individual is 30 years old and has been pregnant 3 times. They have a healthy diastolic blood pressure of 70 and a moderately high triceps skin fold thickness of 30. Their glucose levels are within the normal range at 120, but their serum insulin levels are elevated at 135. With a body mass index of 42.9, they are considered obese. The diabetes pedigree function score of 0.452 indicates a moderate genetic risk for diabetes.###\nHence this label was No."
"This 26-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 64. Their triceps skin fold thickness is 44, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 109. Additionally, their 2-hour serum insulin level is 99, and they have a body mass index of 34.8. The diabetes pedigree function value is 0.905.###\nHence this label was Yes."
"The patient is a 34-year-old female who has been pregnant 8 times. She has normal diastolic blood pressure and a low triceps skin fold thickness. Her glucose level after a 2-hour oral glucose tolerance test is 107, and her insulin level is zero. She has a healthy body mass index of 24.6 and a moderately low diabetes pedigree function score of 0.856.###\nHence this label was No."
"The patient is 33 years old and has been pregnant 9 times. They have low diastolic blood pressure, no triceps skin fold thickness, and normal plasma glucose concentration. Their insulin levels are low, and they have a slightly elevated body mass index. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was Yes."
"This is data from a 39-year-old individual who has been pregnant 3 times. Their diastolic blood pressure is 70, triceps skin fold thickness is 0, plasma glucose concentration after a glucose tolerance test is 78, and 2-hour serum insulin level is 0. Their body mass index is 32.5 and they have a low diabetes pedigree function of 0.27.###\nHence this label was No."
"The patient is a 43-year-old woman who has been pregnant 8 times. She has a healthy diastolic blood pressure of 74 and a slightly elevated triceps skin fold thickness of 40. Her plasma glucose concentration after a GTT is normal at 100, but her 2-hour serum insulin level is high at 215. She has a body mass index of 39.4, indicating obesity. The diabetes pedigree function score is 0.661, suggesting a moderate genetic risk for diabetes.###\nHence this label was Yes."
"This individual is a 58-year-old who has never been pregnant. They have a low diastolic blood pressure of 78 and a high triceps skin fold thickness of 32. Their plasma glucose concentration after a glucose tolerance test is 173, and their 2-hour serum insulin level is elevated at 265. The person has a high body mass index of 46.5 and a diabetes pedigree function score of 1.159. Overall, these values suggest a potential higher risk for developing diabetes.###\nHence this label was No."
"The individual in the dataset is a 23-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 68 and triceps skin fold thickness of 28. Her plasma glucose concentration after a GTT is 74, with a 2-hour serum insulin level of 45. She has a body mass index of 29.7 and a diabetes pedigree function of 0.293.###\nHence this label was No."
"This patient is a 34-year-old female who has been pregnant four times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 0, indicating low levels of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120, which is within the normal range. She has no detectable 2-hour serum insulin. Her body mass index is 29.6, which is considered overweight. The diabetes pedigree function score is 0.709, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 42-year-old woman who is pregnant for the first time. \nShe has a diastolic blood pressure of 66 and a triceps skin fold thickness of 29. \nHer plasma glucose concentration is 100 after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 196.\nWith a body mass index of 32.0 and a diabetes pedigree function of 0.444, this patient's risk for developing diabetes may be worth monitoring closely.###\nHence this label was No."
"This patient is a 38-year-old woman who has been pregnant 10 times. She has a normal diastolic blood pressure of 82 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 75. She also has low 2-hour serum insulin at 0. Despite having a body mass index of 33.3, indicating possible overweight, her diabetes pedigree function is low at 0.263, suggesting a lower risk of developing diabetes.###\nHence this label was No."
"This individual is a 31-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin level of 0. However, her plasma glucose concentration after a glucose tolerance test is 90 mg/dL. She has a body mass index of 28.0 and a diabetes pedigree function score of 0.61.###\nHence this label was No."
"This patient is 33 years old and has been pregnant once. They have a diastolic blood pressure of 72 and a triceps skin fold thickness of 0. In a glucose tolerance test, their plasma glucose concentration at 2 hours is 163. Their 2-hour serum insulin level is 0. With a body mass index of 39.0 and a diabetes pedigree function of 1.222, this individual's risk of developing diabetes may be a concern.###\nHence this label was Yes."
"This patient is a 41-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 64, a triceps skin fold thickness of 25, and a body mass index of 33.3. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 94, and her 2-hour serum insulin level is 79. Additionally, her diabetes pedigree function score is 0.738.###\nHence this label was No."
"The patient is a 31-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 70 and a normal triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is high at 195. She has no detectable insulin levels after a 2-hour serum test and has a body mass index indicating the presence of overweight. The diabetes pedigree function score is relatively low at 0.328.###\nHence this label was Yes."
"This patient is a 30-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 54 and a triceps skin fold thickness of 28. Her plasma glucose concentration after a glucose tolerance test is 99, and her 2-hour serum insulin level is 83. With a body mass index of 34.0 and a diabetes pedigree function of 0.499, she may be at risk for developing diabetes.###\nHence this label was No."
"The patient is a 22-year-old individual who is pregnant for the first time. They have a low diastolic blood pressure of 46 and a slightly below average triceps skin fold thickness of 19. Their plasma glucose concentration after a glucose tolerance test is normal at 139, and their insulin level at 2 hours is 83. The patient has a healthy body mass index of 28.7 and a low diabetes pedigree function score of 0.654.###\nHence this label was No."
"A 21-year-old patient who is 1 time pregnant with normal diastolic blood pressure, low triceps skin fold thickness, and normal plasma glucose concentration as per oral glucose tolerance test. The patient has low insulin levels, low body mass index, and a very low diabetes pedigree function score.###\nHence this label was No."
"This is a 32-year-old patient who is 1 time pregnant, with a diastolic blood pressure of 70. Their triceps skin fold thickness is 30, plasma glucose concentration after a GTT is 115, and 2-hour serum insulin is 96. The patient's body mass index is 34.6 and has a diabetes pedigree function of 0.529.###\nHence this label was Yes."
"This data describes a 35-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 62 and triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 123. The individual has a 2-hour serum insulin level of 0 and a body mass index of 32.0. Their diabetes pedigree function is 0.226.###\nHence this label was Yes."
"A 27-year-old woman who has been pregnant twice shows normal diastolic blood pressure and triceps skin fold thickness. Her glucose levels after a 2-hour oral test are elevated, along with slightly high insulin levels. Despite a moderate BMI, her diabetes pedigree suggests a low genetic risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 28-year-old woman who has never been pregnant. She has a low diastolic blood pressure of 66 and a relatively high triceps skin fold thickness of 32. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 198, and her serum insulin level is also elevated at 274. She has a high body mass index of 41.3 and a relatively low diabetes pedigree function score of 0.502. Overall, these values suggest a potential risk for developing diabetes due to high glucose and insulin levels, as well as a high BMI.###\nHence this label was Yes."
"The individual in this dataset is 25 years old and has never been pregnant. They have a normal diastolic blood pressure of 64 and a healthy triceps skin fold thickness of 36. Their glucose levels after a glucose tolerance test are 97, and their insulin levels are slightly elevated at 100. With a body mass index of 36.8, they are considered obese. Their diabetes pedigree function is low at 0.6, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"This individual is a young adult, 21 years old, who has never been pregnant. She has normal diastolic blood pressure and a moderately healthy body mass index. She has a slightly elevated plasma glucose level after a glucose tolerance test and a relatively high level of serum insulin. Her triceps skin fold thickness is average and she has a low diabetes pedigree function score, indicating a lower risk of developing diabetes.###\nHence this label was No."
"The patient is a 43-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 106 mmHg, triceps skin fold thickness of 46 mm, and a plasma glucose concentration of 167 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 231 μU/mL, and her body mass index is 37.6 kg/m². The diabetes pedigree function, which indicates the likelihood of developing diabetes based on family history, is 0.165.###\nHence this label was Yes."
"The patient is a 70-year-old woman who has been pregnant 4 times. She has a normal diastolic blood pressure of 82 and a healthy triceps skin fold thickness of 18. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 145, indicating normal glucose levels. She has no insulin present in her serum after 2 hours. Her body mass index is 32.5, classifying her as obese. The diabetes pedigree function score is low at 0.235, suggesting a lower risk of developing diabetes based on family history.###\nHence this label was Yes."
"This data belongs to a 24-year-old individual who has been pregnant four times. They have a normal diastolic blood pressure of 64 and a low triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 114, and their 2-hour serum insulin level is 0. Despite having a body mass index of 28.9, which is considered overweight, their diabetes pedigree function is low at 0.126.###\nHence this label was No."
"This patient is a 33-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 68 and a moderately high triceps skin fold thickness of 38. Her blood glucose level after a 2-hour oral glucose tolerance test is 99, and she has no serum insulin detected. With a body mass index of 32.8, she is considered overweight. Her diabetes pedigree function is low at 0.145, indicating a low genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 21-year-old female who has been pregnant 2 times. She has normal diastolic blood pressure, triceps skin fold thickness, and serum insulin levels. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 84, which is within the normal range. She has a low body mass index of 0.0 and a low diabetes pedigree function of 0.304, indicating a lower risk of developing diabetes.###\nHence this label was No."
"This 22-year-old individual, who has been pregnant twice, has a diastolic blood pressure of 70 and a triceps skin fold thickness of 27. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 71, with a 2-hour serum insulin level of 0. They have a body mass index of 28.0 and a diabetes pedigree function of 0.586.###\nHence this label was No."
"This patient is a 37-year-old female who has been pregnant 5 times. She has normal diastolic blood pressure and a high body mass index of 39.1, indicating obesity. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0, which may suggest underlying health issues. Despite a relatively normal plasma glucose concentration at 130, her high diabetes pedigree function score of 0.956 indicates a strong family history of diabetes. Overall, this patient may be at risk for developing diabetes due to her high BMI and genetic predisposition.###\nHence this label was Yes."
"A 27-year-old individual who has been pregnant twice, with a diastolic blood pressure of 70, triceps skin fold thickness of 16, plasma glucose concentration of 99 after a glucose tolerance test, 2-hour serum insulin level of 44, a body mass index of 20.4, and a diabetes pedigree function of 0.235.###\nHence this label was No."
"This 22-year-old individual has been pregnant twice and has a low diastolic blood pressure of 58. They have a healthy triceps skin fold thickness of 35 and a normal glucose concentration of 101 after a 2-hour GTT. Their insulin level is at 90, which is within the normal range. With a body mass index of 21.8 and a low diabetes pedigree function of 0.155, this person shows no signs of high risk for developing diabetes.###\nHence this label was No."
"The data describes a 25-year-old individual who has been pregnant twice. They have a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 40. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is at a normal level of 105, while their 2-hour serum insulin level is slightly elevated at 94. The individual has a high body mass index of 34.9 and a low diabetes pedigree function score of 0.225.###\nHence this label was No."
"A 42-year-old woman who has been pregnant 7 times shows a healthy diastolic blood pressure of 78. She has a triceps skin fold thickness of 40, indicating a moderate amount of body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 81, which falls within the normal range. With a 2-hour serum insulin level of 48, she appears to have good insulin sensitivity. Despite having a body mass index of 46.7, which is considered obese, her diabetes pedigree function is low at 0.261, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"This person is a 72-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 0, no triceps skin fold thickness, and 0 serum insulin. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 119 mg/dL. They have a low body mass index of 19.6 and a moderately high diabetes pedigree function of 0.832.###\nHence this label was No."
"A 27-year-old woman with 4 pregnancies shows normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is at a standard level, while her insulin level is at zero. She has a slightly elevated body mass index of 32.3 and a moderate diabetes pedigree function of 0.536.###\nHence this label was Yes."
"This 27-year-old individual has been pregnant 3 times and has a diastolic blood pressure of 72. Their triceps skin fold thickness is 25mm, plasma glucose concentration at 2 hours is 128mg/dL, and 2-hour serum insulin level is 190mu U/ml. With a body mass index of 32.4 and a diabetes pedigree function of 0.549, this person's overall risk of developing diabetes may be worth monitoring.###\nHence this label was Yes."
"This is a dataset of a 24-year-old individual who is pregnant for the first time. She has normal diastolic blood pressure, moderate triceps skin fold thickness, and low plasma glucose concentration after a glucose tolerance test. Her insulin level is within a normal range, and she has a healthy body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"A 22-year-old female who has never been pregnant has a diastolic blood pressure of 64. She has a triceps skin fold thickness of 37, a plasma glucose concentration of 104 after a glucose tolerance test, and a 2-hour serum insulin level of 64. With a body mass index of 33.6 and a diabetes pedigree function of 0.51, she may be at risk for developing diabetes.###\nHence this label was Yes."
"This data belongs to a 28-year-old individual who is pregnant for the first time. \nShe has a normal diastolic blood pressure of 82. \nHer triceps skin fold thickness is measured at 0. \nPlasma glucose concentration after a 2-hour oral glucose tolerance test is at 138, indicating a healthy level. \nHer 2-hour serum insulin level is 0. \nThe individual has a high body mass index of 40.1, which may suggest overweight or obesity. \nHer diabetes pedigree function score is 0.236, which indicates a low genetic risk for diabetes.###\nHence this label was No."
"The individual is a 28-year-old who has been pregnant once. They have relatively low diastolic blood pressure at 50, but a high Triceps skin fold thickness of 40. Their glucose level after a 2-hour oral glucose tolerance test is normal at 125, but their serum insulin level is elevated at 167. They have a body mass index indicating overweight at 33.3 and a relatively high diabetes pedigree function score of 0.962.###\nHence this label was Yes."
"The patient is a 60-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 72, no triceps skin fold thickness, and a plasma glucose concentration of 134 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 23.8. Her diabetes pedigree function is 0.277.###\nHence this label was Yes."
"A 28-year-old woman who is 1 time pregnant with a normal diastolic blood pressure and a slightly elevated triceps skin fold thickness. She had a moderate plasma glucose concentration after a 2-hour oral glucose tolerance test, normal 2-hour serum insulin level, and a high body mass index. Her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"This individual is a 52-year-old female who has been pregnant 13 times. She has a low diastolic blood pressure of 70 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106. She has no 2-hour serum insulin present. Her body mass index is 34.2, indicating she is overweight. Her diabetes pedigree function is 0.251, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 31-year-old who has never been pregnant. They have a diastolic blood pressure of 84, a triceps skin fold thickness of 47, and a plasma glucose concentration of 118 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 230, and their body mass index is 45.8. The diabetes pedigree function for this patient is 0.551.###\nHence this label was Yes."
"The patient is a 31-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 39, plasma glucose concentration of 109, and 2-hour serum insulin level of 114. Her body mass index is 27.9 and her diabetes pedigree function is 0.64.###\nHence this label was Yes."
"A 33-year-old woman who has been pregnant 9 times shows typical signs of a low-risk profile for developing diabetes. She has a low diastolic blood pressure of 62 and a healthy body mass index of 22.5. Her glucose and insulin levels are within normal range, and her diabetes pedigree score is low at 0.142. Interestingly, her triceps skin fold thickness is 0, indicating a slim build. Overall, her test results suggest a low risk for diabetes.###\nHence this label was No."
"The patient is a 54-year-old woman who has been pregnant 6 times. She has normal diastolic blood pressure of 76, but has a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125. Despite having no serum insulin present, she has a body mass index of 33.8. Her diabetes pedigree function is low at 0.121.###\nHence this label was Yes."
"The patient is a 62-year-old female who has been pregnant twice. She has a diastolic blood pressure of 70 mmHg. Her triceps skin fold thickness is 99 mm. During a glucose tolerance test, her plasma glucose concentration at 2 hours is 197 mg/dL. The patient has a 2-hour serum insulin level of 0 μU/ml. Her body mass index is 34.7, indicating obesity. The diabetes pedigree function, a measure of diabetes heredity, is 0.575. These measurements suggest an increased risk for developing diabetes.###\nHence this label was Yes."
"This patient is a 36-year-old female who has never been pregnant. She has a low diastolic blood pressure of 70 and a low triceps skin fold thickness of 20. Her glucose level after a GTT is 124, and she has no insulin present in her serum. Despite having a slightly elevated BMI of 27.4, her diabetes pedigree function is low at 0.254. Overall, this data suggests that the patient has a relatively low risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 39-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 90, a triceps skin fold thickness of 41, and a plasma glucose concentration of 137 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, her body mass index is 32.0, and her diabetes pedigree function is 0.391.###\nHence this label was No."
"The patient is a 41-year-old female who has been pregnant 8 times. She has a low diastolic blood pressure of 66 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 143, with a 2-hour serum insulin level of 0. Her body mass index is 34.9, and her diabetes pedigree function is 0.129. Based on these measurements, she may be at risk for developing diabetes.###\nHence this label was Yes."
"The individual is a 21-year-old who has never been pregnant. They have a low diastolic blood pressure of 60 and a triceps skin fold thickness of 35. During a glucose tolerance test, their plasma glucose concentration after 2 hours was 138. Their 2-hour serum insulin level is high at 167. They have a body mass index of 34.6 and a relatively low diabetes pedigree function score of 0.534. Overall, this individual's data indicates a mixed profile of potential diabetes risk factors.###\nHence this label was Yes."
"This 23-year-old individual has been pregnant twice and shows normal diastolic blood pressure. They have a low triceps skin fold thickness and a low plasma glucose concentration after a GTT. Their 2-hour serum insulin level is also low. With a low body mass index and a relatively low diabetes pedigree function, this person appears to have a low risk of developing diabetes.###\nHence this label was No."
"The data belongs to a 21-year-old individual who is experiencing their first pregnancy. They have normal diastolic blood pressure, average triceps skin fold thickness, and a slightly low plasma glucose concentration after a 2-hour oral glucose tolerance test. The individual has moderately high serum insulin levels and a low body mass index. The diabetes pedigree function value suggests a low genetic risk for diabetes.###\nHence this label was No."
"A 46-year-old woman who has been pregnant 3 times has a normal diastolic blood pressure and a slightly below average triceps skin fold thickness. Her glucose level after a glucose tolerance test is low, with no insulin present. She has a high body mass index and a relatively low diabetes pedigree function score.###\nHence this label was No."
"A 38-year-old individual who has been pregnant 10 times with a diastolic blood pressure of 86. They have a triceps skin fold thickness of 37, a plasma glucose concentration of 101 after a glucose tolerance test, and no serum insulin after 2 hours. Their body mass index is 45.6 and they have a diabetes pedigree function of 1.136.###\nHence this label was Yes."
"This is a 24-year-old individual who has never been pregnant and has a diastolic blood pressure of 84. Their triceps skin fold thickness is 29, plasma glucose concentration at 126, and 2-hour serum insulin at 215. They have a body mass index of 30.7 and a diabetes pedigree function of 0.52.###\nHence this label was No."
"The patient is 38 years old and has been pregnant 5 times. Their diastolic blood pressure is 92. Triceps skin fold thickness and 2-hour serum insulin are both at 0. They have a plasma glucose concentration of 117 after a glucose tolerance test. The patient has a body mass index of 34.1 and a diabetes pedigree function of 0.337.###\nHence this label was No."
"A 67-year-old individual who has been pregnant 8 times shows a normal diastolic blood pressure of 80. However, they have a very low triceps skin fold thickness of 0, indicating low body fat. Their plasma glucose concentration is high at 194, and they have no insulin present in their system. Despite this, their body mass index falls within the normal range at 26.1. The diabetes pedigree function, a predictor of diabetes risk, is low at 0.551.###\nHence this label was No."
"This individual is 38 years old, has been pregnant 10 times, and has a low diastolic blood pressure of 62. Their triceps skin fold thickness is 36, plasma glucose concentration after a 2-hour GTT test is 129, and 2-hour serum insulin is 0. They have a high body mass index of 41.2 and a relatively low diabetes pedigree function of 0.441.###\nHence this label was Yes."
"The patient is a 45-year-old woman who has been pregnant 9 times. She has a low diastolic blood pressure of 70 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 130. She has no 2-hour serum insulin. Despite having a high body mass index of 34.2, her diabetes pedigree function is relatively low at 0.652.###\nHence this label was Yes."
"The individual is a 22-year-old who has been pregnant 3 times. They have a diastolic blood pressure of 84, a triceps skin fold thickness of 33, and a body mass index of 35.7. In a plasma glucose tolerance test, their glucose concentration at 2 hours is 173, and their 2-hour serum insulin level is 474. They have a diabetes pedigree function value of 0.258.###\nHence this label was Yes."
"This data belongs to a 24-year-old individual who is pregnant for the first time. She has a healthy diastolic blood pressure of 62 and a triceps skin fold thickness of 12. Her plasma glucose concentration after a glucose tolerance test is 90, and her 2-hour serum insulin level is 43. With a body mass index of 27.2, she has a moderate genetic predisposition to diabetes indicated by a diabetes pedigree function value of 0.58.###\nHence this label was No."
"This 29-year-old woman, who has been pregnant 9 times, has a diastolic blood pressure of 80 and a triceps skin fold thickness of 35. Her plasma glucose concentration after a glucose tolerance test is 119, with a 2-hour serum insulin level of 0. She has a body mass index of 29.0 and a low diabetes pedigree function score of 0.263.###\nHence this label was Yes."
"The patient is a 23-year-old woman who has never been pregnant. She has a diastolic blood pressure of 80, triceps skin fold thickness of 37, and a body mass index of 36.3, indicating she may be overweight. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 127, which is within normal range. However, her 2-hour serum insulin level is high at 210, suggesting possible insulin resistance. The diabetes pedigree function score is 0.804, indicating a moderate genetic risk for diabetes. Overall, the patient shows some signs of potential risk for developing diabetes and may benefit from further monitoring and lifestyle interventions.###\nHence this label was No."
"This patient is a 22-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 11, and a plasma glucose concentration of 80 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 60, and she has a body mass index of 30.0. Her diabetes pedigree function is 0.527.###\nHence this label was No."
"This is a 24-year-old individual who has never been pregnant and shows normal values for diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin. Their plasma glucose concentration after a glucose tolerance test is within a healthy range. They have a slightly elevated body mass index and a low diabetes pedigree function score, indicating a lower risk for developing diabetes.###\nHence this label was Yes."
"The individual is a young adult female who has never been pregnant. She has a normal diastolic blood pressure and a low triceps skin fold thickness. Her glucose level after a 2-hour oral glucose tolerance test is within normal range. She has no detectable insulin levels. Despite having a high body mass index, her risk of developing diabetes, as predicted by the diabetes pedigree function, is relatively low.###\nHence this label was No."
"This patient is a 30-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 32. Her plasma glucose concentration after a glucose tolerance test is 122, and her 2-hour serum insulin level is 156. With a body mass index of 35.1 and a diabetes pedigree function of 0.692, she may have an increased risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 28-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 60 mmHg and a triceps skin fold thickness of 32 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 95 mg/dL. She has no detectable insulin levels after a 2-hour serum test. Her body mass index is 35.4 kg/m², and her diabetes pedigree function is 0.284.###\nHence this label was No."
"This individual is a 55-year-old who has been pregnant 6 times. They have a low diastolic blood pressure of 61 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 137. They have no 2-hour serum insulin. With a body mass index of 24.2 and a low diabetes pedigree function of 0.151, this individual appears to have a relatively low risk of developing diabetes.###\nHence this label was No."
"The patient is a 45-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 100 mmHg, a triceps skin fold thickness of 36 mm, and a body mass index of 43.3. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 105 mg/dL, and her 2-hour serum insulin level is 0. Her diabetes pedigree function is 0.239.###\nHence this label was Yes."
"The patient is a 49-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 88, triceps skin fold thickness of 0, and a body mass index of 30.4. Her plasma glucose concentration at 2 hours is 165, while her 2-hour serum insulin level is 0. Additionally, her diabetes pedigree function is 0.302.###\nHence this label was Yes."
"A 27-year-old woman, who has been pregnant twice, shows normal diastolic blood pressure and a moderate triceps skin fold thickness. Her glucose levels after a GTT are within a healthy range, while her insulin levels are slightly elevated. She has a BMI indicating overweight, and a low genetic predisposition to diabetes.###\nHence this label was No."
"This data represents a 26-year-old individual who is pregnant for the first time. They have low diastolic blood pressure of 38 and a normal triceps skin fold thickness of 18. Their blood glucose level after a 2-hour oral glucose tolerance test is 109, with a relatively high insulin level of 120. Despite being pregnant, their body mass index is within the healthy range at 23.1. The individual has a low diabetes pedigree function score of 0.407, indicating a lower risk of developing diabetes.###\nHence this label was No."
"The individual is 28 years old and has been pregnant 6 times. They have a diastolic blood pressure of 80 and a triceps skin fold thickness of 36. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 80. The 2-hour serum insulin level is 0. They have a body mass index of 39.8 and a diabetes pedigree function of 0.177.###\nHence this label was No."
"The patient is a 36-year-old female who has been pregnant 10 times. She has a low diastolic blood pressure of 68 and no triceps skin fold thickness. Her plasma glucose concentration after a GTT is 133. The patient has no insulin levels in her blood after a 2-hour period. She has a body mass index of 27.0 and a diabetes pedigree function of 0.245.###\nHence this label was No."
"This patient is a 44-year-old female who has been pregnant 13 times. She has a diastolic blood pressure of 0, triceps skin fold thickness of 30, and a high plasma glucose concentration of 129 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 39.9. The diabetes pedigree function score is 0.569.###\nHence this label was Yes."
"A 57-year-old individual, who has been pregnant 8 times, with a diastolic blood pressure of 76, triceps skin fold thickness of 29, plasma glucose concentration of 196 after a glucose tolerance test, 2-hour serum insulin level of 280, and a body mass index of 37.5. They have a diabetes pedigree function of 0.605.###\nHence this label was Yes."
"This patient is 34 years old, has been pregnant 10 times, and has a diastolic blood pressure of 74. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 168 after a GTT, and 2-hour serum insulin of 0. Their body mass index is 38.0 and their diabetes pedigree function is 0.537.###\nHence this label was Yes."
"This patient is a 32-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 75 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 156, with a 2-hour serum insulin level of 0. Despite having a high body mass index of 48.3, her diabetes pedigree function is relatively low at 0.238.###\nHence this label was Yes."
"The patient is a 32-year-old adult who has been pregnant 5 times. She has a healthy diastolic blood pressure of 74 and a moderate triceps skin fold thickness of 22. Her plasma glucose concentration after a glucose tolerance test is normal at 85, and she has low insulin levels. Despite her slightly elevated body mass index of 29.0, her risk of developing diabetes is low based on her diabetes pedigree function score of 1.224.###\nHence this label was Yes."
"The individual is a 21-year-old who has never been pregnant. \nTheir diastolic blood pressure is 68, triceps skin fold thickness is 14, and body mass index is 24.8, indicating a healthy weight.\nTheir plasma glucose concentration after a 2-hour oral glucose tolerance test is 137, which is within normal range.\nHaving a 2-hour serum insulin level of 148 suggests good insulin production.\nTheir diabetes pedigree function is 0.143, indicating a low genetic risk for diabetes.###\nHence this label was No."
"This 29-year-old individual has been pregnant 4 times and shows normal diastolic blood pressure. Despite having a low triceps skin fold thickness and no serum insulin, their glucose levels remain within the healthy range at 110. With a slightly elevated body mass index of 31.9 and a relatively low diabetes pedigree function score of 0.471, this person may have a lower risk of developing diabetes.###\nHence this label was No."
"This data belongs to a 21-year-old individual who has been pregnant once. Their diastolic blood pressure is 74, triceps skin fold thickness is 22, plasma glucose concentration after a glucose tolerance test is 143, 2-hour serum insulin level is 61, body mass index is 26.2, and diabetes pedigree function is 0.256.###\nHence this label was No."
"The patient is a 54-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 29 mm. Her plasma glucose concentration after a glucose tolerance test is 150 mg/dL, and her 2-hour serum insulin level is 126 μU/mL. She has a body mass index of 35.2 and a diabetes pedigree function value of 0.692.###\nHence this label was Yes."
"This patient is 38 years old and has been pregnant 12 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 151, and her 2-hour serum insulin level is 271. With a body mass index of 41.8 and a diabetes pedigree function of 0.742, this patient may be at risk for developing diabetes.###\nHence this label was Yes."
"A 42-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 86 mmHg. Their triceps skin fold thickness is 30mm and their plasma glucose concentration after a glucose tolerance test is 117 mg/dL. They have a 2-hour serum insulin level of 105 μU/mL and a body mass index of 39.1 kg/m². Their diabetes pedigree function is 0.251, indicating a potential risk for developing diabetes.###\nHence this label was No."
"The patient is a 63-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 86, triceps skin fold thickness of 31, and a body mass index of 28.0. In a 2-hour oral glucose tolerance test, her plasma glucose concentration was 132. Her 2-hour serum insulin level is 0, and her diabetes pedigree function is 0.419.###\nHence this label was No."
"This is a data entry for a 21-year-old individual who has been pregnant 2 times. The individual has a healthy diastolic blood pressure of 64 and a normal plasma glucose concentration of 100 after a glucose tolerance test. Additionally, the individual has a moderate body mass index of 29.7 and a low diabetes pedigree function score of 0.368. Overall, the data suggests a relatively healthy profile with no signs of high risk for developing diabetes.###\nHence this label was No."
"This 25-year-old individual has been pregnant twice and has a low diastolic blood pressure of 60. Their triceps skin fold thickness is 22mm, and their plasma glucose concentration after a glucose tolerance test is relatively low at 81. They have no insulin in their serum after 2 hours. Their body mass index is 27.7, indicating they are slightly overweight. The diabetes pedigree function value is 0.29, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"This is a dataset for a 24-year-old individual who has been pregnant 4 times. She has a diastolic blood pressure of 70 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 128, with a 2-hour serum insulin level of 0. She has a body mass index of 34.3 and a diabetes pedigree function of 0.303.###\nHence this label was No."
"The patient is a 69-year-old who has been pregnant 5 times. They have normal diastolic blood pressure, no triceps skin fold thickness, and zero insulin levels. Their plasma glucose concentration after a glucose tolerance test is 136, and their body mass index is very low at 0.0. The diabetes pedigree function suggests a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This is a dataset of a 27-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 72, triceps skin fold thickness of 28, and a plasma glucose concentration of 111 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and their body mass index is 23.9. The diabetes pedigree function is calculated as 0.407.###\nHence this label was No."
"This individual is a 27-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 72 mmHg. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0. Her plasma glucose concentration after a glucose tolerance test is 106 mg/dL. She has a healthy body mass index of 25.8 and a low diabetes pedigree function value of 0.207.###\nHence this label was No."
"This data represents a 46-year-old individual who has been pregnant 6 times. They have a relatively low diastolic blood pressure of 62 and a moderate triceps skin fold thickness of 32. Their glucose levels are within normal range at 92, but their insulin levels are slightly high at 126. The individual has a healthy body mass index of 32.0 and a low diabetes pedigree function score of 0.085.###\nHence this label was No."
"The data belongs to a 28-year-old individual who has been pregnant 6 times. They have normal diastolic blood pressure and triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 92, with no insulin detected after 2 hours. Despite a low body mass index of 19.9, they have a low diabetes pedigree function score of 0.188.###\nHence this label was No."
"This is a 27-year-old individual who has never been pregnant. They have normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is on the lower side at 91. They have no insulin present after a 2-hour serum test. Their body mass index is elevated at 32.4, and their diabetes pedigree function score is 0.601.###\nHence this label was No."
"A 54-year-old woman who has been pregnant twice shows normal diastolic blood pressure and no triceps skin fold thickness. Her glucose levels are within a healthy range after a 2-hour oral glucose tolerance test, and she has low insulin levels. Despite having a high body mass index, her risk of developing diabetes is relatively low according to her family history.###\nHence this label was No."
"A 21-year-old individual, who is pregnant for the first time, has a diastolic blood pressure of 64. Their triceps skin fold thickness is 27, plasma glucose concentration after a glucose tolerance test is 96, and 2-hour serum insulin level is 87. With a body mass index of 33.2 and a low diabetes pedigree function score of 0.289, this person's risk of developing diabetes appears to be relatively low.###\nHence this label was No."
"The patient is a 38-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106. She has no serum insulin present. Her body mass index is 39.5 and her diabetes pedigree function is 0.286. Overall, this data suggests a potential risk for developing diabetes due to elevated body mass index and glucose levels, despite the absence of serum insulin.###\nHence this label was No."
"The patient is a 63-year-old who has been pregnant 10 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 48, and a plasma glucose concentration of 101 after a glucose tolerance test. Her 2-hour serum insulin level is 180, and she has a body mass index of 32.9. The diabetes pedigree function score is 0.171.###\nHence this label was No."
"This patient is a 22-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and her 2-hour serum insulin level is 0. Despite having a low insulin level, her plasma glucose concentration after a glucose tolerance test is 99, indicating a healthy blood sugar level. She has a healthy body mass index of 25.0 and a low diabetes pedigree function of 0.253, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"A 38-year-old individual who has been pregnant three times has a diastolic blood pressure of 74. They have a triceps skin fold thickness of 16 and a plasma glucose concentration of 89 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 85, and they have a body mass index of 30.4. The diabetes pedigree function for this individual is 0.551.###\nHence this label was No."
"The patient is a 22-year-old woman who is pregnant for the first time. She has a low diastolic blood pressure of 48 and a relatively low triceps skin fold thickness of 18. Her plasma glucose concentration after a GTT is 71, and her 2-hour serum insulin level is 76. With a body mass index of 20.4 and a low diabetes pedigree function score of 0.323, she appears to have a low risk of developing diabetes.###\nHence this label was No."
"A 41-year-old individual with 2 previous pregnancies shows normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. The individual has no 2-hour serum insulin level, a high body mass index, and a moderately low diabetes pedigree function score.###\nHence this label was No."
"The patient is a 28-year-old female who is 1-time pregnant with a healthy diastolic blood pressure reading of 74. She has a low triceps skin fold thickness of 12, normal glucose concentration at 100, and moderate insulin level at 46. Her body mass index is low at 19.5, and her diabetes pedigree function indicates a low genetic risk at 0.149. Overall, this patient appears to have a relatively low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"The patient is a 31-year-old woman who has been pregnant 4 times. She has a normal diastolic blood pressure of 78 and a slightly elevated body mass index of 32.9, indicating potential overweight. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0, which may indicate low muscle mass and potential insulin sensitivity issues. The patient's plasma glucose concentration at 2 hours is 158, which is slightly high. Additionally, her diabetes pedigree function score is 0.803, suggesting a moderate genetic predisposition to diabetes. Overall, this data indicates that the patient may be at risk for developing diabetes and should be monitored closely.###\nHence this label was Yes."
"This patient is a 51-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 48 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 148 mg/dL, and her 2-hour serum insulin level is 237 μU/mL. She has a body mass index of 37.6 kg/m² and a diabetes pedigree function of 1.001, indicating a potential genetic predisposition to diabetes.###\nHence this label was Yes."
"This patient is a 39-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 74, triceps skin fold thickness of 32, plasma glucose concentration of 154 after a glucose tolerance test, and 2-hour serum insulin level of 193. The patient has a body mass index of 29.3 and a diabetes pedigree function value of 0.839. These measurements provide insight into the individual's health status and potential risk for developing diabetes.###\nHence this label was No."
"A 22-year-old individual who has never been pregnant shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Their glucose levels after a 2-hour oral glucose tolerance test are within the normal range. However, they have high insulin levels and a relatively high body mass index. Their diabetes pedigree function value suggests a moderate genetic risk of developing diabetes.###\nHence this label was No."
"This individual is a 39-year-old who has been pregnant 3 times. They have a low diastolic blood pressure of 56 and a relatively low triceps skin fold thickness of 34. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 96, and their 2-hour serum insulin level is 115. With a body mass index of 24.7 and a diabetes pedigree function of 0.944, this person's risk of developing diabetes may be relatively low.###\nHence this label was No."
"The patient is a 32-year-old woman who has been pregnant three times. She has a diastolic blood pressure of 92 mmHg and a triceps skin fold thickness of 49 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 129 mg/dL, and her 2-hour serum insulin level is 155 uU/mL. She has a body mass index of 36.4 and a diabetes pedigree function score of 0.968.###\nHence this label was Yes."
"A 52-year-old woman who has been pregnant once, with a diastolic blood pressure of 88 and a triceps skin fold thickness of 29. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 168, while her 2-hour serum insulin level is 0. She has a body mass index of 35.0 and a diabetes pedigree function of 0.905.###\nHence this label was Yes."
"This is a dataset for a 36-year-old individual who has been pregnant 3 times. The individual has a diastolic blood pressure of 70, a triceps skin fold thickness of 22, and a body mass index of 36.4. Their plasma glucose concentration after a glucose tolerance test is 187, and they have a 2-hour serum insulin level of 200. The diabetes pedigree function value for this individual is 0.408.###\nHence this label was Yes."
"This patient is a 22-year-old female who has been pregnant 2 times. She has a low diastolic blood pressure of 56 and a moderate triceps skin fold thickness of 28. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 56, and her 2-hour serum insulin level is also low at 45. She has a healthy body mass index of 24.2 and a low diabetes pedigree function score of 0.332, indicating a low risk of developing diabetes.###\nHence this label was No."
"This data describes a 22-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 43, and a high plasma glucose concentration of 199 after a glucose tolerance test. Her 2-hour serum insulin level is 0, indicating a potential issue. With a high body mass index of 42.9 and a diabetes pedigree function of 1.394, she may have an increased risk of developing diabetes.###\nHence this label was Yes."
"The individual is a 55-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 33 mm. Her plasma glucose concentration after a GTT is 195 mg/dL, and her 2-hour serum insulin level is 145 uU/mL. With a body mass index of 25.1, she has a low risk of developing diabetes as indicated by a diabetes pedigree function score of 0.163.###\nHence this label was Yes."
"This 24-year-old individual has been pregnant 4 times. Their diastolic blood pressure is 70, while their triceps skin fold thickness is 32. In a glucose tolerance test, their plasma glucose concentration at 2 hours is 95. They have no insulin present in their serum after 2 hours. Their body mass index is 32.1 and they have a diabetes pedigree function of 0.612.###\nHence this label was No."
"The patient is a 25-year-old female who has never been pregnant. She has a diastolic blood pressure of 68, triceps skin fold thickness of 32, and a plasma glucose concentration of 91 after a glucose tolerance test. Additionally, she has a high 2-hour serum insulin level of 210 and a body mass index of 39.9. Her diabetes pedigree function is low at 0.381.###\nHence this label was No."
"This is a data point of a 24-year-old individual who has never been pregnant. Their diastolic blood pressure is 85 mmHg, triceps skin fold thickness is 54 mm, and plasma glucose concentration after a glucose tolerance test is 147 mg/dL. They have no insulin level after a 2-hour period, a body mass index of 42.8, and a diabetes pedigree function value of 0.375.###\nHence this label was No."
"This 41-year-old individual has been pregnant 6 times and has a diastolic blood pressure of 74. Their triceps skin fold thickness measures 18, while their plasma glucose concentration after a glucose tolerance test is 104. The 2-hour serum insulin level is 156, and they have a body mass index of 29.9. Their diabetes pedigree function is calculated to be 0.722.###\nHence this label was Yes."
"This individual is 21 years old and has never been pregnant. They have a healthy diastolic blood pressure of 78. Their triceps skin fold thickness and 2-hour serum insulin levels are both at 0. However, their plasma glucose concentration after a glucose tolerance test is 132, indicating a normal level. Despite having a body mass index of 32.4, which is considered overweight, their diabetes pedigree function is relatively low at 0.393.###\nHence this label was No."
"The patient is a 32-year-old woman who has been pregnant 8 times. She has a low diastolic blood pressure of 64 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is high at 183, but she has no insulin in her system after 2 hours. Despite her low body mass index of 23.3, her diabetes pedigree function is relatively low at 0.672.###\nHence this label was Yes."
"A 48-year-old woman who has been pregnant 7 times shows normal diastolic blood pressure and low triceps skin fold thickness. Her blood sugar level after a glucose tolerance test is within the normal range. She has no insulin in her bloodstream, low body mass index, and a relatively low diabetes genetic predisposition.###\nHence this label was No."
"A 67-year-old individual who has never been pregnant has low diastolic blood pressure, no triceps skin fold thickness, and low plasma glucose concentration after a glucose tolerance test. Their insulin level is also low, with a healthy body mass index. Despite a relatively low diabetes pedigree function score of 0.735, this individual may have a low risk of developing diabetes based on these measurements.###\nHence this label was No."
"This is a data record of a 25-year-old individual who has been pregnant 3 times. Their diastolic blood pressure is 70, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. The individual's plasma glucose concentration after a glucose tolerance test is 82. They have a body mass index of 21.1 and a diabetes pedigree function of 0.389.###\nHence this label was No."
"A 49-year-old woman who has been pregnant 6 times with normal diastolic blood pressure and a slightly elevated body mass index. She has a moderate triceps skin fold thickness and a normal plasma glucose concentration. Her 2-hour serum insulin level is low, and she has a moderately low diabetes pedigree function score.###\nHence this label was Yes."
"This patient is a 21-year-old female who has been pregnant twice. She has a diastolic blood pressure of 50 and a triceps skin fold thickness of 23. Her plasma glucose concentration after a glucose tolerance test is 84, and her 2-hour serum insulin level is 76. With a body mass index of 30.4, she has a relatively high risk of developing diabetes, as indicated by her diabetes pedigree function of 0.968.###\nHence this label was No."
"The patient is a 22-year-old female who is 1 time pregnant. She has a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 18. Her plasma glucose concentration is normal at 109, but her 2-hour serum insulin is high at 116. She has a healthy body mass index of 28.5 and a low diabetes pedigree function of 0.219.###\nHence this label was No."
"The individual in the dataset is a 28-year-old female who has been pregnant 3 times. She has normal diastolic blood pressure (72 mmHg) and a moderately high body mass index of 37.2. Her triceps skin fold thickness is within the normal range at 32 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is slightly below the normal range at 84 mg/dL. Her 2-hour serum insulin level is low at 0 uU/mL, indicating potential insulin sensitivity. The diabetes pedigree function value is 0.267, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This individual is 39 years old and has been pregnant 13 times. They have a diastolic blood pressure of 88, triceps skin fold thickness of 37, and a plasma glucose concentration of 153 after a glucose tolerance test. Their 2-hour serum insulin level is 140, and they have a body mass index of 40.6. Additionally, their diabetes pedigree function is 1.174.###\nHence this label was No."
"This 27-year-old individual has never been pregnant and has a diastolic blood pressure of 82. Their triceps skinfold thickness is 39, plasma glucose concentration after a glucose tolerance test is 152, and 2-hour serum insulin level is 272. With a body mass index of 41.5 and a diabetes pedigree function of 0.27, there may be a risk of developing diabetes.###\nHence this label was No."
"The patient is a 25-year-old female who has been pregnant 5 times. She has a low diastolic blood pressure of 62 and a moderately high triceps skin fold thickness of 41. Her plasma glucose concentration after a glucose tolerance test is normal at 109. The 2-hour serum insulin level is elevated at 129. She has a high body mass index of 35.8 and a moderate diabetes pedigree function of 0.514.###\nHence this label was Yes."
"This 26-year-old individual has been pregnant 3 times and has relatively low diastolic blood pressure readings. Their triceps skin fold thickness is 19, indicating a moderate amount of subcutaneous fat. Their glucose concentration after a 2-hour oral glucose tolerance test is within normal range at 99. The serum insulin level at 2 hours is 74. They have a healthy body mass index of 21.8. The diabetes pedigree function score is low at 0.279, suggesting a lower genetic predisposition to diabetes.###\nHence this label was No."
"This individual is 22 years old, has been pregnant 3 times, and has a diastolic blood pressure of 66. Their triceps skin fold thickness is 25, plasma glucose concentration is 148 after a glucose tolerance test, and insulin level is 0. They have a body mass index of 32.5 and a diabetes pedigree function of 0.256.###\nHence this label was No."
"The patient is a 33-year-old woman who is pregnant for the first time with low diastolic blood pressure, moderate triceps skin fold thickness, normal glucose levels after a 2-hour oral glucose tolerance test, higher insulin levels, elevated body mass index, and a low risk of developing diabetes based on the diabetes pedigree function.###\nHence this label was No."
"A 22-year-old woman, who has been pregnant once, has a relatively low diastolic blood pressure of 60. She has a moderate triceps skin fold thickness of 37, and her plasma glucose concentration 2 hours after a glucose tolerance test is on the lower side at 87. Her 2-hour serum insulin level is elevated at 75, and she has a slightly high body mass index of 37.2. With a diabetes pedigree function score of 0.509, she may have a moderate genetic predisposition to diabetes.###\nHence this label was No."
"The individual is a 23-year-old who has never been pregnant. She has a normal diastolic blood pressure of 60 mmHg. Her triceps skin fold thickness is within normal range at 25mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 107 mg/dL. She has no detectable 2-hour serum insulin. Her body mass index is 26.4, indicating she is in the overweight category. Her diabetes pedigree function value is low at 0.133, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"The patient is a 37-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 108 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 137 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 48.8 kg/m² and a diabetes pedigree function of 0.227.###\nHence this label was Yes."
"The patient is a young adult female, 23 years old, who is pregnant for the first time. She has a normal diastolic blood pressure of 64 and a low triceps skin fold thickness of 13. Her plasma glucose concentration after a glucose tolerance test is below the normal range at 82. She has a high serum insulin level of 95. Despite being pregnant, she has a low body mass index of 21.2 and a relatively low diabetes pedigree function score of 0.415.###\nHence this label was No."
"This 22-year-old patient has been pregnant once and has a low diastolic blood pressure of 80. Their triceps skin fold thickness is 11, indicating a lean body composition. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 103, suggesting normal blood sugar levels. With a 2-hour serum insulin level of 82 and a low body mass index of 19.4, this individual appears to have a healthy metabolic profile. Their diabetes pedigree function score is 0.491, indicating a moderate genetic risk for diabetes. Overall, this patient shows no immediate signs of developing diabetes based on the provided diagnostic measurements.###\nHence this label was No."
"A 25-year-old woman who has never been pregnant has a diastolic blood pressure of 68, a triceps skin fold thickness of 19, and a body mass index of 30.5. Her plasma glucose concentration after a glucose tolerance test is 128, with a 2-hour serum insulin level of 180. She has a diabetes pedigree function score of 1.391, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"This is a dataset of a 23-year-old individual who is 1 time pregnant. Their diastolic blood pressure is 86, triceps skin fold thickness is 30, plasma glucose concentration at 2 hours is 143, 2-hour serum insulin is 330, body mass index is 30.1, and diabetes pedigree function is 0.892.###\nHence this label was No."
"This is a data entry of a 23-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 86, triceps skin fold thickness of 19, and a plasma glucose concentration of 111 after a glucose tolerance test. Their 2-hour serum insulin level is 0, body mass index is 30.1, and diabetes pedigree function is 0.143.###\nHence this label was No."
"A 23-year-old individual who has never been pregnant shows normal diastolic blood pressure and a slightly below average triceps skin fold thickness. Their blood glucose level is within the healthy range after a glucose tolerance test, and they have a moderate level of insulin in their system. Despite having a high body mass index, their risk of developing diabetes is relatively low based on their family history.###\nHence this label was No."
"The data describes a 22-year-old individual who has been pregnant 3 times, with low diastolic blood pressure of 58. They have a triceps skin fold thickness of 31, and a plasma glucose concentration of 111 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 44, and they have a body mass index of 29.5. The diabetes pedigree function, a measure of diabetes heredity, is 0.43.###\nHence this label was No."
"In this dataset, we have a 30-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 84, no triceps skin fold thickness, and a plasma glucose concentration of 137 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 31.2. The diabetes pedigree function for this individual is 0.252.###\nHence this label was No."
"This 36-year-old individual has been pregnant 8 times and has a diastolic blood pressure of 72. They have a triceps skin fold thickness of 42, a plasma glucose concentration of 179 after a glucose tolerance test, and a 2-hour serum insulin level of 130. With a body mass index of 32.7 and a diabetes pedigree function of 0.719, this individual's data suggests a moderate risk for developing diabetes.###\nHence this label was Yes."
"A 45-year-old individual who has been pregnant 11 times, with a diastolic blood pressure of 84. They have a triceps skin fold thickness of 40mm, a plasma glucose concentration of 111 after a glucose tolerance test, and a body mass index of 46.8, indicating obesity. Despite having a 2-hour serum insulin level of 0, their diabetes pedigree function is 0.925, suggesting a genetic predisposition to diabetes.###\nHence this label was Yes."
"A 29-year-old patient, who has been pregnant twice, with a diastolic blood pressure of 76, triceps skin fold thickness of 37, plasma glucose concentration of 120, 2-hour serum insulin level of 105, a body mass index of 39.7, and a diabetes pedigree function of 0.215.###\nHence this label was No."
"This 23-year-old individual has been pregnant 3 times and shows no diastolic blood pressure, triceps skin fold thickness, or serum insulin level. Their plasma glucose concentration after a glucose tolerance test is 116, with a healthy body mass index of 23.5. The diabetes pedigree function score is low at 0.187, indicating a relatively low risk of developing diabetes.###\nHence this label was No."
"This 23-year-old individual has been pregnant twice and shows normal diastolic blood pressure and insulin levels. They have a healthy triceps skin fold thickness and BMI, and their plasma glucose concentration is within the normal range. Overall, their risk of developing diabetes appears to be low based on these measurements.###\nHence this label was No."
"A 28-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 88, a triceps skin fold thickness of 11, a plasma glucose concentration of 127 after a glucose tolerance test, a 2-hour serum insulin level of 155, a body mass index of 34.5, and a diabetes pedigree function of 0.598.###\nHence this label was No."
"The individual in this data is a 38-year-old woman who is not pregnant. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 30 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 109 mg/dL. She has no insulin in her blood after a 2-hour serum test. Her body mass index is 32.5, and her diabetes pedigree function score is 0.855.###\nHence this label was Yes."
"The data represents a 22-year-old individual who is moderately active with 2 pregnancies. They have a normal diastolic blood pressure, low triceps skin fold thickness, and slightly elevated blood glucose levels after a glucose tolerance test. Their insulin level is higher than average, and they have a healthy body mass index. The individual has a low risk for diabetes based on their family history.###\nHence this label was No."
"This individual is a 25-year-old who has never been pregnant. They have a diastolic blood pressure of 76 and a triceps skin fold thickness of 56. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 162, with a 2-hour serum insulin level of 100. They have a high body mass index of 53.2 and a diabetes pedigree function of 0.759.###\nHence this label was Yes."
"The patient is a 21-year-old who is pregnant for the first time. They have normal diastolic blood pressure, slightly higher than normal triceps skin fold thickness, and elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is significantly high. The patient has a higher-than-average body mass index and a moderate diabetes pedigree function score. Overall, these factors indicate a potential risk for developing diabetes.###\nHence this label was No."
"A 24-year-old woman, who is pregnant for the first time, with low diastolic blood pressure, average triceps skin fold thickness, normal plasma glucose concentration, moderate serum insulin levels, slightly high body mass index, and a slightly elevated diabetes pedigree function score.###\nHence this label was No."
"A 46-year-old individual who has been pregnant 12 times, with slightly elevated diastolic blood pressure and a moderately high triceps skin fold thickness. Their plasma glucose concentration after a GTT is within normal range, while their 2-hour serum insulin level is elevated. They have a body mass index indicating overweight, and a relatively low diabetes pedigree function score.###\nHence this label was No."
"The individual in the dataset is a 22-year-old who has never been pregnant. They have a low diastolic blood pressure of 52. Their triceps skin fold thickness is 10, indicating a relatively lean body composition. The plasma glucose concentration at 2 hours is 74, which is within the normal range. The 2-hour serum insulin level is 36. Their body mass index is 27.8, suggesting they are slightly overweight. The diabetes pedigree function value is 0.269, indicating a low genetic risk for diabetes.###\nHence this label was No."
"This 28-year-old individual has been pregnant twice and has a diastolic blood pressure of 86. They have a triceps skin fold thickness of 42, a plasma glucose concentration of 112 following a glucose tolerance test, and a 2-hour serum insulin level of 160. Their body mass index is 38.4 and they have a diabetes pedigree function value of 0.246.###\nHence this label was No."
"This is a 22-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 58, triceps skin fold thickness of 11, and a plasma glucose concentration of 88 after a glucose tolerance test. Their 2-hour serum insulin level is 54, and their body mass index is 24.8. The diabetes pedigree function is 0.267.###\nHence this label was No."
"This individual is 28 years old and has been pregnant 6 times. They have a diastolic blood pressure of 0 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 96, with a 2-hour serum insulin level of 0. This person has a body mass index of 23.7 and a diabetes pedigree function of 0.19.###\nHence this label was No."
"The individual is a 41-year-old woman who has been pregnant 6 times. She has a low diastolic blood pressure of 68, average triceps skin fold thickness of 41, no plasma glucose concentration after a glucose tolerance test, and no serum insulin after 2 hours. Despite having a high body mass index of 39.0, her diabetes pedigree function is moderately low at 0.727.###\nHence this label was Yes."
"A 21-year-old woman who has never been pregnant shows normal diastolic blood pressure. She has a slightly above average triceps skin fold thickness, and her blood glucose levels after a glucose tolerance test are higher than average. She has no insulin in her bloodstream after a 2-hour serum test. However, she has a higher than normal body mass index. Overall, she has a low diabetes pedigree function score, indicating a lower likelihood of developing diabetes.###\nHence this label was Yes."
"A 52-year-old individual, who has been pregnant 8 times, with a diastolic blood pressure of 76. They have a triceps skin fold thickness of 24, a plasma glucose concentration of 124, and a high 2-hour serum insulin level of 600. Their body mass index is 28.7, and they have a moderate diabetes pedigree function of 0.687.###\nHence this label was Yes."
"This data represents a 22-year-old individual who is pregnant for the first time. She has a very low diastolic blood pressure of 48 and a relatively low triceps skin fold thickness of 20. Her plasma glucose concentration was 0 after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level was also 0. Despite these low values, her body mass index is within the healthy range at 24.7. The diabetes pedigree function, which assesses the likelihood of developing diabetes based on family history, is very low at 0.14.###\nHence this label was No."
"A 28-year-old woman who is 2 times pregnant with no history of high blood pressure or excess body fat. Her blood sugar level is normal at 146 mg/dL, and her body mass index is within the healthy range at 27.5. She has a low diabetes pedigree function score of 0.24.###\nHence this label was Yes."
"The patient is a 46-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 72, triceps skin fold thickness of 19, and a plasma glucose concentration of 118 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 23.1. The diabetes pedigree function is 1.476.###\nHence this label was No."
"This is a dataset of a 22-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 60 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 151, and she has no serum insulin levels. Despite this, her body mass index is 26.1, indicating she is overweight. The diabetes pedigree function score is low at 0.179, suggesting a lower risk of developing diabetes.###\nHence this label was No."
"This 25-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 80. Their triceps skin fold thickness is 35, plasma glucose concentration after a glucose tolerance test is 139, and 2-hour serum insulin level is 160. With a body mass index of 31.6 and a low diabetes pedigree function of 0.361, this individual shows a mix of normal and elevated values that may indicate some risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 30-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 74 and a triceps skin fold thickness of 25. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 147 and their 2-hour serum insulin level is 293. Their body mass index is 34.9 and they have a diabetes pedigree function value of 0.385.###\nHence this label was No."
"A 27-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 70, triceps skin fold thickness of 27, and a plasma glucose concentration of 122 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 36.8. The diabetes pedigree function value is 0.34.###\nHence this label was No."
"The patient is a 67-year-old who has been pregnant 4 times. She has a low diastolic blood pressure of 78 and no triceps skin fold thickness. Her plasma glucose concentration after a GTT is 146 and her 2-hour serum insulin is 0. With a body mass index of 38.5 and a diabetes pedigree function of 0.52, she has some risk factors for developing diabetes.###\nHence this label was Yes."
"A 45-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 70, triceps skin fold thickness of 18, plasma glucose concentration of 125, 2-hour serum insulin level of 122, body mass index of 28.9, and a diabetes pedigree function of 1.144.###\nHence this label was Yes."
"The individual is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 106 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 127 mg/dL, while her 2-hour serum insulin level is 0 mU/L. She has a body mass index (BMI) of 39.0 and a diabetes pedigree function of 0.19.###\nHence this label was No."
"This 43-year-old individual has been pregnant 7 times and has a diastolic blood pressure of 80. Their triceps skin fold thickness is 31, plasma glucose concentration after a glucose tolerance test is 109, and 2-hour serum insulin is 0. With a body mass index of 35.9 and a diabetes pedigree function of 1.127, this data suggests a comprehensive overview of the individual's health profile.###\nHence this label was Yes."
"This patient is a 22-year-old female who has been pregnant twice. She has a normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range. She has no serum insulin detected at the 2-hour mark. Her body mass index is 27.3, indicating she is overweight. The diabetes pedigree function value is 0.525, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 39-year-old individual who has been pregnant 8 times with normal diastolic blood pressure and very low triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 133 mg/dL, and they have no insulin level after 2 hours. They have a body mass index of 32.9, indicating they are overweight, and a low diabetes pedigree function of 0.27.###\nHence this label was Yes."
"The patient is a 21-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 20. Her plasma glucose concentration at 2 hours after an oral glucose tolerance test is 0, and her 2-hour serum insulin level is 23. She has a body mass index of 27.7 and a diabetes pedigree function of 0.299.###\nHence this label was No."
"A 21-year-old woman, who is pregnant for the first time, has normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness and plasma glucose concentration are within normal range. However, her 2-hour serum insulin level is very low. The diabetes pedigree function suggests a low genetic risk of developing diabetes.###\nHence this label was No."
"The patient is a 40-year-old woman who has been pregnant 10 times. She has a healthy diastolic blood pressure of 70 and a moderate triceps skin fold thickness of 27. Her glucose tolerance test results show a normal plasma glucose concentration of 111. She has no insulin in her system after a 2-hour serum test. Her body mass index is 27.5, indicating she is slightly overweight. The diabetes pedigree function value is low at 0.141, suggesting a lower risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 40-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 46, and a plasma glucose concentration of 145 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130, and she has a body mass index of 37.9. The diabetes pedigree function for this patient is 0.637.###\nHence this label was Yes."
"This 31-year-old individual has been pregnant four times and has a low diastolic blood pressure of 64. Their triceps skin fold thickness and 2-hour serum insulin levels are both at 0. However, their plasma glucose concentration after a glucose tolerance test is 95, and they have a body mass index of 32.0. Their diabetes pedigree function is low at 0.161. Overall, this individual shows signs of low insulin production and moderate obesity, with a moderate risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 52-year-old woman who has been pregnant three times. She has a diastolic blood pressure of 86, triceps skin fold thickness of 27, plasma glucose concentration of 176, and 2-hour serum insulin level of 156. Her body mass index is 33.3, and her diabetes pedigree function is 1.154.###\nHence this label was Yes."
"The patient is a 26-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 56 and a relatively thin triceps skin fold thickness of 17. Her plasma glucose concentration after a glucose tolerance test is at a normal level of 96. The 2-hour serum insulin level is 49, indicating adequate insulin production. The patient has a low body mass index of 20.8 and a relatively low diabetes pedigree function score of 0.34, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"This data describes a 21-year-old individual who has been pregnant 2 times. They have a diastolic blood pressure of 75, a triceps skin fold thickness of 32, and a plasma glucose concentration of 112 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 35.7. The diabetes pedigree function for this individual is 0.148.###\nHence this label was No."
"The person in the data is a 43-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 74, triceps skin fold thickness of 31, and a plasma glucose concentration of 170 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 44.0. The diabetes pedigree function for this individual is 0.403.###\nHence this label was Yes."
"A 27-year-old woman who has never been pregnant has normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Her glucose levels are within the normal range after a two-hour oral glucose tolerance test, but her insulin levels are high. She has a high body mass index and a low diabetes pedigree function score, indicating a potential risk for developing diabetes in the future.###\nHence this label was No."
"The patient is a 28-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 98 and a triceps skin fold thickness of 0. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 115. Her 2-hour serum insulin level is 0. With a body mass index of 52.9 and a low diabetes pedigree function of 0.209, she may be at risk for developing diabetes.###\nHence this label was Yes."
"This is a profile of a 23-year-old individual who has never been pregnant. They have normal diastolic blood pressure, moderate triceps skin fold thickness, and slightly low plasma glucose concentration after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is elevated, and they have a healthy body mass index. Additionally, their diabetes pedigree function indicates a low genetic risk of developing diabetes.###\nHence this label was No."
"The patient is a 50-year-old female who has been pregnant once. She has a diastolic blood pressure of 82, triceps skin fold thickness of 43, and a plasma glucose concentration of 164 after a glucose tolerance test. Her 2-hour serum insulin level is 67, and she has a body mass index of 32.8. The diabetes pedigree function for this patient is 0.341. The overall data suggests that the patient may be at risk for developing diabetes.###\nHence this label was No."
"This is a data sample of a 69-year-old individual who has been pregnant 5 times. They have normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration at 132. The 2-hour serum insulin level is 0, indicating potential issues with insulin production. Despite having a healthy body mass index of 26.8, the individual has a low diabetes pedigree function of 0.186.###\nHence this label was No."
"This patient is a 22-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 86 and triceps skin fold thickness of 0. Her plasma glucose concentration is 120 after a 2-hour oral glucose tolerance test, with a 2-hour serum insulin level of 0. Her body mass index is 28.4 and her diabetes pedigree function is 0.259.###\nHence this label was Yes."
"This 31-year-old patient, who has been pregnant 4 times, shows a low diastolic blood pressure reading of 60. Their triceps skin fold thickness is 12, plasma glucose concentration is within normal range at 129, and they have a relatively high 2-hour serum insulin level of 231. Despite a slightly elevated body mass index of 27.5, their diabetes pedigree function is low at 0.527.###\nHence this label was No."
"The patient is 36 years old and has been pregnant 8 times. She has a diastolic blood pressure of 78, triceps skin fold thickness of 32, glucose concentration after 2 hours of GTT is 151, and serum insulin level of 210. Her body mass index is 42.9 and her diabetes pedigree function is 0.516. These measurements suggest that the patient may have an increased risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 49-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 88 and a triceps skin fold thickness of 36. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 126, and her 2-hour serum insulin level is 108. She has a body mass index of 38.5 and a diabetes pedigree function of 0.349.###\nHence this label was No."
"This is a 25-year-old individual who has been pregnant twice and has a diastolic blood pressure of 74 mmHg. Their triceps skin fold thickness is 26 mm. During a glucose tolerance test, their plasma glucose concentration at 2 hours was 129 mg/dL. They have a 2-hour serum insulin level of 205 μU/mL. Their body mass index is 33.2, and their diabetes pedigree function, a measure of diabetes heredity risk, is 0.591.###\nHence this label was No."
"This 22-year-old individual has been pregnant twice and shows low diastolic blood pressure. They have a moderate triceps skin fold thickness and a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is slightly elevated and they have a high body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"The data belongs to a 26-year-old female who has been pregnant 6 times. She has normal diastolic blood pressure, average triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin level is very low and she has a high body mass index. The diabetes pedigree function score indicates a moderate genetic risk for developing diabetes.###\nHence this label was No."
"This data describes a 33-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 98, a triceps skin fold thickness of 41, and a plasma glucose concentration of 128 after a glucose tolerance test. Their 2-hour serum insulin level is 58, and they have a body mass index of 32.0. The diabetes pedigree function indicates a possible genetic predisposition to diabetes.###\nHence this label was Yes."
"This patient is a 31-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, moderate triceps skin fold thickness, and average body mass index. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range. The patient has no insulin level at the 2-hour mark and a low diabetes pedigree function score, indicating a relatively low risk for developing diabetes.###\nHence this label was No."
"This data belongs to a 25-year-old individual who has been pregnant twice. The individual has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 52 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 100 mg/dL, and they have a 2-hour serum insulin level of 57 μU/mL. The individual has a body mass index of 40.5 kg/m² and a diabetes pedigree function value of 0.677.###\nHence this label was No."
"The individual in the dataset is 37 years old and has been pregnant 5 times. They have a diastolic blood pressure of 78 mmHg and a Triceps skin fold thickness of 30 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 88 mg/dL. The 2-hour serum insulin level is 0 μU/mL. Their body mass index is 27.6, and the diabetes pedigree function value is 0.258.###\nHence this label was No."
"This data is from a 25-year-old individual who has never been pregnant. She has a low diastolic blood pressure of 60 and no triceps skin fold thickness. Her glucose levels after a glucose tolerance test are normal at 93, and she has no insulin present in her serum. Despite having a high body mass index of 35.3, her diabetes pedigree function is low at 0.263.###\nHence this label was No."
"This individual is a 40-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 44. Her plasma glucose concentration after a glucose tolerance test is 123, with a 2-hour serum insulin level of 94. She has a body mass index of 33.1 and a diabetes pedigree function value of 0.374.###\nHence this label was No."
"A 24-year-old woman, who has been pregnant once, has a diastolic blood pressure of 72 and a triceps skin fold thickness of 21. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 157, with a 2-hour serum insulin level of 168. She has a body mass index of 25.6 and a diabetes pedigree function of 0.123.###\nHence this label was No."
"This is a 23-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 86, triceps skin fold thickness of 36, plasma glucose concentration of 102 after a glucose tolerance test, and a 2-hour serum insulin level of 120. With a body mass index of 45.5 and a low diabetes pedigree function score of 0.127, this individual may have a moderate risk of developing diabetes.###\nHence this label was Yes."
"This is a data entry for a 29-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 78, triceps skin fold thickness of 29, and a plasma glucose concentration of 88 after a glucose tolerance test. Their 2-hour serum insulin level is 76, body mass index is 32.0, and they have a low diabetes pedigree function score of 0.365.###\nHence this label was No."
"This individual is a 23-year-old female who is pregnant for the first time. She has a slightly elevated diastolic blood pressure of 82 mmHg. Her triceps skin fold thickness is 42mm, indicating a moderate level of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 153 mg/dL. She has a high insulin level of 485 μU/mL. With a body mass index of 40.6, she is considered obese. Her diabetes pedigree function score is 0.687, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 27-year-old individual who is moderately overweight and has a family history of diabetes, had high plasma glucose levels after a glucose tolerance test. Additionally, the individual has high insulin levels, high blood pressure, and a moderate amount of triceps skin fold thickness.###\nHence this label was No."
"This 21-year-old individual who has never been pregnant has a low diastolic blood pressure of 64. Their triceps skin fold thickness is 23, and their plasma glucose concentration after a glucose tolerance test is 118. They have a 2-hour serum insulin level of 89. Interestingly, their body mass index is 0.0, and their diabetes pedigree function is 1.731.###\nHence this label was No."
"A 22-year-old woman who is pregnant for the first time shows slightly elevated diastolic blood pressure and a high level of serum insulin after a glucose tolerance test. She has a moderate triceps skin fold thickness and a high BMI, indicating potential risk for developing diabetes. The diabetes pedigree function value suggests a genetic predisposition to the disease.###\nHence this label was No."
"The patient is 38 years old and has been pregnant 14 times. Their diastolic blood pressure is 62 mmHg, triceps skin fold thickness is 30 mm, and their plasma glucose concentration after a glucose tolerance test is 175 mg/dL. They have no serum insulin after 2 hours. The patient's body mass index is 33.6, and their diabetes pedigree function is 0.212.###\nHence this label was Yes."
"This patient is a 26-year-old female who has never been pregnant. She has a normal diastolic blood pressure of 76 and a high triceps skin fold thickness of 36, indicating excess body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 162. Despite having normal insulin levels, her body mass index is very high at 49.6, placing her in the obese category. Her diabetes pedigree function score is low at 0.364, suggesting a lower genetic risk for diabetes.###\nHence this label was Yes."
"A 44-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 80. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 132 after a glucose tolerance test, and 0 insulin level after 2 hours. Their body mass index is 34.4 and their diabetes pedigree function is 0.402.###\nHence this label was Yes."
"The individual is a 22-year-old who has been pregnant once. They have a healthy diastolic blood pressure of 66 and a moderately thick triceps skin fold of 15. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 97, while their 2-hour serum insulin level is elevated at 140. Despite this, their body mass index is within a normal range at 23.2. The individual has a relatively low diabetes pedigree function score of 0.487.###\nHence this label was No."
"A 30-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 92. This person has a triceps skin fold thickness of 0, a plasma glucose concentration of 110 after a glucose tolerance test, and a 2-hour serum insulin level of 0. With a body mass index of 37.6 and a diabetes pedigree function of 0.191, the individual's risk of developing diabetes may be low.###\nHence this label was No."
"A 29-year-old woman, who has been pregnant 5 times, with a diastolic blood pressure of 84, triceps skinfold thickness of 41, plasma glucose concentration of 158 after a glucose tolerance test, 2-hour serum insulin level of 210, and a body mass index of 39.4. Her diabetes pedigree function is 0.395.###\nHence this label was Yes."
"The patient is 44 years old and has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and low insulin levels. However, their plasma glucose concentration after a GTT is slightly elevated. Despite having a high body mass index, their diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was No."
"A 58-year-old individual, who has been pregnant 5 times, with diastolic blood pressure of 82, triceps skin fold thickness of 26, plasma glucose concentration after a glucose tolerance test of 144, 2-hour serum insulin level of 285, a body mass index of 32.0, and a diabetes pedigree function of 0.452.###\nHence this label was Yes."
"The patient is a 34-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 44 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 155 mg/dL, and her 2-hour serum insulin level is 545 μU/mL. She has a body mass index of 38.7 kg/m² and a diabetes pedigree function value of 0.619. Based on these measurements, the patient may be at risk for developing diabetes.###\nHence this label was No."
"This data describes a 28-year-old individual who is 3 times pregnant and has a diastolic blood pressure of 64. Their triceps skin fold thickness is 29, plasma glucose concentration after a glucose tolerance test is 129, and 2-hour serum insulin level is 115. In addition, their body mass index is 26.4 and they have a diabetes pedigree function score of 0.219.###\nHence this label was Yes."
"This is data from a 22-year-old individual who is 4 times pregnant. They have a normal diastolic blood pressure of 70, a triceps skin fold thickness of 32, and a plasma glucose concentration of 91 after a glucose tolerance test. Their 2-hour serum insulin level is 88, and they have a body mass index of 33.1. The diabetes pedigree function value is 0.446, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is a 50-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 84 and a body mass index of 35.4. Despite having a triceps skin fold thickness of 0 and 2-hour serum insulin level of 0, her plasma glucose concentration at 2 hours is 99. Additionally, her diabetes pedigree function is 0.388.###\nHence this label was No."
"This patient, a 34-year-old female, has been pregnant twice. She has a normal diastolic blood pressure of 64 and slightly elevated triceps skin fold thickness of 35. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range at 106. The patient has a relatively high 2-hour serum insulin level of 119. Her body mass index is 30.5, indicating she is overweight. The diabetes pedigree function score of 1.4 suggests a moderate genetic predisposition to diabetes. Overall, this patient may be at risk for developing diabetes due to her insulin levels, BMI, and family history.###\nHence this label was No."
"A 33-year-old woman who has never been pregnant is showing signs of potential diabetes, with extremely low diastolic blood pressure and high triceps skin fold thickness. Her glucose levels after a GTT are elevated, as well as her insulin levels. Additionally, she has a high body mass index and a family history of diabetes, indicating an increased risk for developing the disease.###\nHence this label was Yes."
"A 25-year-old woman who has never been pregnant has a healthy diastolic blood pressure of 68. Her triceps skin fold thickness is 32, indicating a moderate amount of body fat. She has normal plasma glucose concentration of 86 and no insulin resistance. However, her body mass index is high at 35.8, putting her at risk for obesity-related health issues. The low diabetes pedigree function score of 0.238 suggests a relatively low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 56-year-old woman who has been pregnant 10 times. She has a healthy diastolic blood pressure of 72 and a below-average triceps skin fold thickness of 18. Her glucose tolerance test indicates a normal plasma glucose concentration of 94, while her insulin levels are low at 0. Despite having a low body mass index of 23.1, she has a moderate diabetes pedigree function score of 0.595.###\nHence this label was No."
"This individual is a 27-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 65 and her triceps skin fold thickness measures at 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85, and she has no detectable serum insulin levels. Despite having a high body mass index of 39.6, her diabetes pedigree function is low at 0.93.###\nHence this label was No."
"This patient is a 23-year-old female who has been pregnant twice. She has a normal diastolic blood pressure of 70 and a low triceps skin fold thickness of 0. Her plasma glucose concentration is slightly elevated at 134, while her 2-hour serum insulin level is normal at 0. The patient has a body mass index of 28.9, which is in the overweight range. Her diabetes pedigree function is 0.542, indicating a moderate genetic risk for diabetes.###\nHence this label was Yes."
"This data describes a 22-year-old individual who has been pregnant twice, with a low diastolic blood pressure of 58. They have a moderate triceps skin fold thickness of 26, a normal plasma glucose concentration of 88, and a low 2-hour serum insulin level of 16. Their body mass index is within the healthy range at 28.4, and they have a low diabetes pedigree function score of 0.766.###\nHence this label was No."
"This patient is a 21-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, slightly above average triceps skin fold thickness, and normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is very low. She has a high body mass index and a moderately low diabetes pedigree function score. Overall, she may have a low risk of developing diabetes based on these initial diagnostic measurements.###\nHence this label was No."
"The individual is a 27-year-old female who has been pregnant twice. She has a relatively low diastolic blood pressure of 68 mmHg. Her triceps skin fold thickness is 42 mm, indicating a moderate amount of subcutaneous fat. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 90 mg/dL, which is within the normal range. She has low levels of insulin at 0 μU/ml. With a body mass index of 38.2, she is considered obese. The diabetes pedigree function score is 0.503, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"A 36-year-old woman who has been pregnant 9 times shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Her glucose levels after a 2-hour oral glucose tolerance test are within normal range, but her insulin levels are higher. She has a moderately high body mass index and a low diabetes pedigree function score, indicating a lower genetic risk for diabetes.###\nHence this label was Yes."
"This is a dataset of a 21-year-old female who has been pregnant 2 times. She has a diastolic blood pressure of 62 mmHg and triceps skin fold thickness of 32 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 108 mg/dL, and 2-hour serum insulin level is 56 μU/mL. With a body mass index of 25.2, she has a low diabetes pedigree function of 0.128.###\nHence this label was No."
