"This is a record of a 59-year-old individual who has been pregnant six times. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 0. In an oral glucose tolerance test, their plasma glucose concentration after 2 hours is 194, and their 2-hour serum insulin level is 0. Their body mass index is 23.5 and their diabetes pedigree function is 0.129.###\nHence this label was Yes."
"This individual is a 30-year-old who has been pregnant once. They have a diastolic blood pressure of 70 and a triceps skin fold thickness of 40. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 97, and their 2-hour serum insulin level is 0. With a body mass index of 38.1 and a diabetes pedigree function value of 0.218, this person's risk of developing diabetes appears to be relatively low.###\nHence this label was No."
"This individual is a 26-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 64 mmHg, triceps skin fold thickness of 25 mm, and a plasma glucose concentration of 180 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 70 uU/mL. She has a body mass index of 34.0 and a low diabetes pedigree function score of 0.271.###\nHence this label was No."
"This individual is a 24-year-old woman who has never been pregnant. She has normal diastolic blood pressure, zero triceps skin fold thickness, and no insulin in her blood. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 119, which is within the normal range. She has a body mass index of 32.4, indicating that she is overweight. The diabetes pedigree function score is low, suggesting a lower risk of developing diabetes.###\nHence this label was Yes."
"The individual is a 30-year-old who has been pregnant once. They have a normal diastolic blood pressure of 74 and a slightly above average triceps skin fold thickness of 36. Their glucose levels are within a healthy range at 124 after a GTT. The insulin level after 2 hours is 0. The individual has a moderately healthy body mass index of 27.8 and a low diabetes pedigree function score of 0.1.###\nHence this label was No."
"This patient is 30 years old and has been pregnant 5 times. Their diastolic blood pressure is 72, triceps skin fold thickness is 23, and plasma glucose concentration after a glucose tolerance test is 121. Their 2-hour serum insulin level is 112, body mass index is 26.2, and diabetes pedigree function value is 0.245.###\nHence this label was No."
"This individual is a 27-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 72, no triceps skin fold thickness, and a healthy plasma glucose concentration of 106 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, indicating normal insulin production. She has a body mass index of 25.8, which falls within the healthy weight range. The diabetes pedigree function score, which assesses the risk of developing diabetes based on family history, is low at 0.207. Overall, this individual appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"A 25-year-old woman who has been pregnant twice has a low diastolic blood pressure of 52. She has a moderate triceps skin fold thickness of 22mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 82mg/dL and her 2-hour serum insulin level is 115muU/mL. With a body mass index of 28.5, she falls into the overweight category. Her diabetes pedigree function is 1.699, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"A 23-year-old individual, who has been pregnant 4 times, with a diastolic blood pressure of 86. They have a triceps skin fold thickness of 20mm and a plasma glucose concentration of 129mg/dL after a GTT. Their 2-hour serum insulin level is 270 units, and they have a body mass index of 35.1. The diabetes pedigree function is 0.231.###\nHence this label was No."
"This is a data entry of a 30-year-old individual with 5 pregnancies, showing a normal diastolic blood pressure of 66. The individual has a healthy triceps skin fold thickness of 21 and a normal plasma glucose concentration of 88 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is within the expected range at 23. With a body mass index of 24.4, they are considered to have a healthy weight. The diabetes pedigree function value of 0.342 indicates a low genetic risk of developing diabetes.###\nHence this label was No."
"A 34-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 80, triceps skin fold thickness of 15, plasma glucose concentration after 2 hours at 123, 2-hour serum insulin level at 176, and a body mass index of 32.0. The diabetes pedigree function is calculated at 0.443.###\nHence this label was No."
"The patient is a 24-year-old female who has been pregnant twice. She has a diastolic blood pressure of 65 and a triceps skinfold thickness of 28. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 83, with a 2-hour serum insulin level of 66. She has a body mass index of 36.8 and a diabetes pedigree function value of 0.629.###\nHence this label was No."
"This individual is a 27-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 94 mmHg and a triceps skin fold thickness of 41 mm. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 147 mg/dL. She has no detectable insulin levels after a 2-hour serum test. Her body mass index is 49.3, indicating obesity. The diabetes pedigree function score is 0.358, suggesting a low genetic risk of diabetes.###\nHence this label was Yes."
"A 31-year-old woman who has been pregnant four times shows signs of potential diabetes, with high glucose concentration and insulin levels, along with elevated blood pressure and body mass index. Other measurements such as triceps skin fold thickness and diabetes pedigree function also indicate a risk for developing diabetes.###\nHence this label was No."
"This patient is a 36-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 42 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 179 mg/dL, with a corresponding 2-hour serum insulin level of 130 uU/mL. Her body mass index is 32.7 kg/m² and her diabetes pedigree function score is 0.719. These measurements suggest a potential risk for developing diabetes.###\nHence this label was Yes."
"This is a 31-year-old patient who has been pregnant 6 times and has a diastolic blood pressure of 70. Their triceps skin fold thickness is 0, and their plasma glucose concentration after a glucose tolerance test is 195. The 2-hour serum insulin level is 0, with a body mass index of 30.9 and a diabetes pedigree function of 0.328.###\nHence this label was Yes."
"A 26-year-old woman who is pregnant for the first time is showing normal values for most diagnostic measurements related to diabetes. She has a low diastolic blood pressure, minimal triceps skin fold thickness, and low plasma glucose concentration after a glucose tolerance test. Additionally, her insulin levels and body mass index are within normal range. The diabetes pedigree function indicates a low genetic risk for developing diabetes.###\nHence this label was No."
"The patient is a 29-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 76 mmHg and a triceps skin fold thickness of 36 mm. \nHer plasma glucose concentration is 196 mg/dL after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 249 μU/mL. \nShe has a body mass index of 36.5 and a diabetes pedigree function of 0.875. These measurements indicate a potential risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 50-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 90, no triceps skin fold thickness, and a plasma glucose concentration of 136 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, her body mass index is 29.9, and her diabetes pedigree function is 0.21.###\nHence this label was No."
"A 22-year-old individual who is pregnant for the first time has below average diastolic blood pressure, moderate triceps skin fold thickness, and a normal plasma glucose concentration after a glucose tolerance test. Their 2-hour serum insulin levels are slightly elevated, while their body mass index falls within the overweight range. The individual has a relatively low diabetes pedigree function, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"This data describes a 27-year-old individual who has been pregnant 4 times. Their diastolic blood pressure is 85, triceps skin fold thickness is 27, plasma glucose concentration after a glucose tolerance test is 146, 2-hour serum insulin level is 100, body mass index is 28.9, and diabetes pedigree function is 0.189.###\nHence this label was No."
"This individual is a 21-year-old female who has never been pregnant. She has a healthy diastolic blood pressure of 62 and a normal triceps skin fold thickness of 17. Her plasma glucose concentration after a glucose tolerance test is 139, and she has a high 2-hour serum insulin level of 210. Despite these factors, her body mass index is within a healthy range at 22.1, and her diabetes pedigree function is relatively low at 0.207.###\nHence this label was No."
"The individual in the dataset is a 27-year-old who has been pregnant 3 times. They have a diastolic blood pressure of 72, triceps skin fold thickness of 25, and a plasma glucose concentration of 128 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 190, and they have a body mass index of 32.4. Additionally, their diabetes pedigree function is 0.549.###\nHence this label was Yes."
"This is a 28-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, and a relatively low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is at a healthy level. She has moderate serum insulin levels and a normal body mass index. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was No."
"A 33-year-old individual who has never been pregnant, with normal diastolic blood pressure, moderately thick triceps skin fold, slightly elevated glucose levels after a glucose tolerance test, high insulin levels, elevated body mass index, and a low diabetes pedigree function score.###\nHence this label was Yes."
"This 31-year-old individual has been pregnant 8 times and shows normal diastolic blood pressure. They have a moderate triceps skin fold thickness of 39, normal plasma glucose concentration after a 2-hour oral glucose tolerance test, and slightly elevated serum insulin levels. Their body mass index is within the healthy range, and the diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 37-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 72, triceps skin fold thickness of 29, plasma glucose concentration of 154, and 2-hour serum insulin level of 126. Her body mass index is 31.3 and her diabetes pedigree function is 0.338. Based on these measurements, the patient may be at risk for developing diabetes.###\nHence this label was No."
"This 23-year-old individual has been pregnant once and has a moderate diastolic blood pressure of 86. Their triceps skin fold thickness is within normal range at 19. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 111, indicating normal blood sugar levels. They have no detectable insulin after 2 hours, which may suggest good insulin sensitivity. With a body mass index of 30.1, they fall into the obese category. Their diabetes pedigree function score is low at 0.143, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"The patient is a 43-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 31. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 170. Her 2-hour serum insulin level is 0. She has a body mass index of 44.0 and a diabetes pedigree function of 0.403.###\nHence this label was Yes."
"A 23-year-old individual who has been pregnant once shows relatively low diastolic blood pressure of 54. Their triceps skin fold thickness is 25, body mass index is 25.2, and plasma glucose concentration after a 2-hour oral glucose tolerance test is 91. Despite having a relatively high 2-hour serum insulin level of 100, their diabetes pedigree function is low at 0.234.###\nHence this label was No."
"The patient is a 37-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 28. Her plasma glucose concentration after a GTT is 144, and she has a relatively high 2-hour serum insulin level of 140. With a body mass index of 29.5, she is considered overweight. Her diabetes pedigree function is low at 0.287, indicating a relatively lower risk of developing diabetes.###\nHence this label was No."
"A 42-year-old individual, who has been pregnant 7 times, with a low diastolic blood pressure of 66. They have no triceps skin fold thickness and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 114. Their 2-hour serum insulin level is 0. The individual has a body mass index of 32.8 and a low diabetes pedigree function of 0.258.###\nHence this label was Yes."
"This patient is a 42-year-old female who has been pregnant 11 times. She has a diastolic blood pressure of 84, triceps skin fold thickness of 35, plasma glucose concentration of 136, and 2-hour serum insulin level of 130. Her body mass index is 28.3, and she has a diabetes pedigree function of 0.26. The data suggests that she may be at risk for developing diabetes based on these measurements.###\nHence this label was Yes."
"This data belongs to a 26-year-old individual who has never been pregnant. They have a diastolic blood pressure of 74, a triceps skin fold thickness of 18, a plasma glucose concentration of 120 after a glucose tolerance test, and a 2-hour serum insulin level of 63. Their body mass index is 30.5 and they have a diabetes pedigree function value of 0.285.###\nHence this label was No."
"A 24-year-old individual who has been pregnant twice, with a normal diastolic blood pressure, moderate triceps skin fold thickness, slightly elevated plasma glucose concentration after a glucose tolerance test, higher than average serum insulin levels, a healthy body mass index, and a low diabetes pedigree function score.###\nHence this label was No."
"This person is a 23-year-old who has never been pregnant and has a normal diastolic blood pressure. Their triceps skin fold thickness is within a healthy range. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 104, indicating normal blood sugar levels. They have a relatively high 2-hour serum insulin level. Their body mass index is 27.8, which falls into the overweight category. The diabetes pedigree function value is low, suggesting a lower genetic predisposition to diabetes.###\nHence this label was No."
"This data represents a young adult, aged 22, who is slightly underweight. They have been pregnant once and have a low diastolic blood pressure. Their triceps skin fold thickness is below average, indicating a relatively low amount of body fat. The glucose concentration in their blood after a glucose tolerance test is low, along with the serum insulin level. Their body mass index is on the lower side, and the diabetes pedigree function score suggests a low genetic risk of diabetes. Overall, this individual appears to have a relatively low risk of developing diabetes based on these measurements.###\nHence this label was No."
"This patient is a 22-year-old female who is in the early stages of pregnancy. She has a normal diastolic blood pressure and a healthy body mass index. However, her plasma glucose concentration and serum insulin levels are both lower than normal. The triceps skin fold thickness measurement indicates an average amount of subcutaneous fat. The diabetes pedigree function suggests a low genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 51-year-old female who has been pregnant 11 times. She has a diastolic blood pressure of 76 mmHg, a triceps skin fold thickness of 28 mm, and a body mass index of 33.3. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 155 mg/dL, and her 2-hour serum insulin level is 150 μU/mL. Additionally, she has a diabetes pedigree function score of 1.353.###\nHence this label was Yes."
"This 24-year-old individual has been pregnant twice and shows slightly elevated diastolic blood pressure. They have a moderate amount of triceps skin fold thickness and high plasma glucose concentration after a glucose tolerance test. Their insulin levels are also elevated. Despite their young age, they have a high body mass index and a moderate diabetes pedigree function score. Overall, this individual may be at risk for developing diabetes and should consider lifestyle changes for prevention.###\nHence this label was Yes."
"A 21-year-old female, who is 1 time pregnant, with normal diastolic blood pressure and low triceps skin fold thickness, had a slightly low plasma glucose concentration at 2 hours during an oral glucose tolerance test. She also has a moderate level of serum insulin, low body mass index, and a low diabetes pedigree function score.###\nHence this label was No."
"This patient is a 25-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 24. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 125, and her 2-hour serum insulin level is 110. Her body mass index is 24.3, and she has a low diabetes pedigree function score of 0.221.###\nHence this label was No."
"This individual is 27 years old and has never been pregnant. Their diastolic blood pressure is 76 mmHg, triceps skin fold thickness is 0 mm, and their 2-hour serum insulin level is 0 mu U/ml. They have a plasma glucose concentration of 104 mg/dL after a glucose tolerance test. With a low body mass index of 18.4 and a moderate diabetes pedigree function of 0.582, this person may be at a relatively low risk of developing diabetes.###\nHence this label was No."
"This patient is a 41-year-old individual who has been pregnant once. They have a diastolic blood pressure and triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 180, with a 2-hour serum insulin level of 0. They have a body mass index of 43.3 and a diabetes pedigree function of 0.282.###\nHence this label was Yes."
"This is a 22-year-old individual who has never been pregnant. Their diastolic blood pressure is 68, triceps skin fold thickness is 22, and 2-hour serum insulin is 0. They have a plasma glucose concentration of 105 after an oral glucose tolerance test. Their body mass index is 20.0 and their diabetes pedigree function is 0.236.###\nHence this label was No."
"The patient is a 48-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 92, a triceps skin fold thickness of 18, and a plasma glucose concentration of 106 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 22.7. Additionally, her diabetes pedigree function is 0.235.###\nHence this label was No."
"The patient is a young adult female, 22 years old, who is pregnant for the first time. She has a low diastolic blood pressure of 60 mmHg, with a normal triceps skin fold thickness of 18mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 95 mg/dL. The patient has a moderate level of insulin at 58 μU/mL and a healthy body mass index of 23.9 kg/m². Her diabetes pedigree function, which assesses the diabetes history among relatives, is low at 0.26.###\nHence this label was No."
"This individual is 31 years old and has been pregnant 6 times. Their diastolic blood pressure is 88 mmHg and their triceps skin fold thickness is 0 mm. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 107 mg/dL. They have no insulin in their serum after a 2-hour period. With a body mass index of 36.8, they have a moderate risk of developing diabetes based on their diabetes pedigree function score of 0.727.###\nHence this label was No."
"This is a 33-year-old individual who has been pregnant 5 times. They have a normal diastolic blood pressure of 72 and a higher than average triceps skin fold thickness of 43. Their glucose levels after a glucose tolerance test are within normal range at 108, and they have a moderate insulin level of 75. With a body mass index of 36.1, they are considered obese. The diabetes pedigree function value is low at 0.263, indicating a relatively lower genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 37-year-old woman who has been pregnant 10 times. She has a low diastolic blood pressure of 70 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 179, with no insulin detected after 2 hours. She has a high body mass index of 35.1 and a low diabetes pedigree function of 0.2.###\nHence this label was No."
"The individual in the dataset is a 43-year-old woman who has been pregnant 15 times. She has a healthy diastolic blood pressure of 70 and a somewhat above average triceps skin fold thickness of 32. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 136, and her 2-hour serum insulin level is 110. She has a body mass index of 37.1, which puts her in the obese category. Her diabetes pedigree function is 0.153, indicating a low genetic risk for diabetes.###\nHence this label was Yes."
"A 25-year-old woman, who has been pregnant twice, shows normal diastolic blood pressure and very low triceps skin fold thickness. Her glucose levels are within a healthy range after a 2-hour oral glucose tolerance test, and she has low insulin levels. With a healthy BMI of 23.5 and a low diabetes pedigree function score of 0.191, she appears to have a low risk of developing diabetes.###\nHence this label was No."
"A 25-year-old woman, who has been pregnant 5 times, with a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 35mm. She has a plasma glucose concentration of 139 mg/dL after a glucose tolerance test, and a 2-hour serum insulin level of 160 uU/mL. Her body mass index is 31.6, and her diabetes pedigree function is 0.361.###\nHence this label was Yes."
"This is a 34-year-old individual who has been pregnant 4 times. Their diastolic blood pressure is 68 mmHg, with a triceps skin fold thickness of 0 mm. They have a plasma glucose concentration of 120 mg/dL after a 2-hour oral glucose tolerance test and a 2-hour serum insulin level of 0 μU/mL. Their body mass index is 29.6 kg/m^2, and their diabetes pedigree function is 0.709.###\nHence this label was No."
"This 21-year-old individual has been pregnant 3 times and has a diastolic blood pressure of 62. Despite having a triceps skin fold thickness of 0 and zero insulin levels, their plasma glucose concentration after a 2-hour oral glucose tolerance test is 111. With a body mass index of 22.6 and a low diabetes pedigree function of 0.142, this person may have a lower risk of developing diabetes based on these measurements.###\nHence this label was No."
"This data belongs to a 29-year-old individual who has been pregnant twice. Her diastolic blood pressure is 76, triceps skin fold thickness is 37, and plasma glucose concentration at 2 hours is 120. She has a 2-hour serum insulin level of 105 and a body mass index of 39.7. Her Diabetes pedigree function is 0.215.###\nHence this label was No."
"This is data from a 38-year-old patient who has been pregnant 10 times. She has normal diastolic blood pressure, no triceps skin fold thickness, and low plasma glucose concentration at 2 hours. Additionally, she has no serum insulin present, a slightly elevated body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was No."
"The patient is a young adult woman who has never been pregnant. She has normal diastolic blood pressure, slightly above-average triceps skin fold thickness, high plasma glucose concentration after a glucose tolerance test, normal insulin levels, and a high body mass index. The diabetes pedigree function indicates a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 39-year-old woman who has been pregnant 3 times. She has a normal diastolic blood pressure of 70 and low triceps skin fold thickness. Her glucose levels are low at 78 after a 2-hour oral glucose tolerance test, with no serum insulin present. Despite having a slightly elevated body mass index of 32.5, her diabetes pedigree function is low at 0.27. Overall, based on these measurements, she is at a low risk of developing diabetes.###\nHence this label was No."
"The patient is a 37-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 76. However, she has a low triceps skin fold thickness and 2-hour serum insulin levels. Her plasma glucose concentration after a glucose tolerance test is at a normal level of 150. Despite her low body mass index of 21.0, she has a slightly elevated diabetes pedigree function of 0.207.###\nHence this label was No."
"A 25-year-old female who has been pregnant twice, with a diastolic blood pressure of 70 mmHg and triceps skin fold thickness of 32 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 68 mg/dL, and she has a 2-hour serum insulin level of 66 mu U/ml. With a body mass index of 25.0 and a low diabetes pedigree function score of 0.187, she shows no signs of high risk for developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"A 34-year-old patient, who has been pregnant 7 times, with low diastolic blood pressure (64), no triceps skin fold thickness, normal glucose levels (114), no insulin after a GTT, a healthy body mass index of 27.4, and a relatively low diabetes pedigree function score of 0.732. Overall, the data suggests a relatively healthy individual in terms of diabetes risk factors.###\nHence this label was Yes."
"This individual is 41 years old and has never been pregnant. They have a diastolic blood pressure of 104 mmHg, triceps skin fold thickness of 25 mm, and a plasma glucose concentration of 189 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0 μU/mL. With a body mass index of 34.3 and a diabetes pedigree function of 0.435, this individual's risk for developing diabetes may be influenced by these factors.###\nHence this label was Yes."
"A 22-year-old woman who has been pregnant twice shows normal diastolic blood pressure and a slightly low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within normal range, but she has high levels of serum insulin. She has a healthy body mass index and a moderately low diabetes pedigree function score.###\nHence this label was No."
