"The patient is a 43-year-old female who has been pregnant 7 times. She has a normal diastolic blood pressure of 80 mmHg and a moderate triceps skin fold thickness of 31mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 109 mg/dL. She has low insulin levels at 0 μU/ml. With a body mass index of 35.9, she is considered obese. The diabetes pedigree function score is 1.127, indicating a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 44-year-old who has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. Their plasma glucose concentration after a glucose tolerance test is within a healthy range. They have a higher than average body mass index and a moderately elevated diabetes pedigree function score, indicating a potential genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a young woman who has never been pregnant and shows normal blood pressure readings. She has zero triceps skin fold thickness and insulin levels. Her glucose levels are within a healthy range after a glucose tolerance test. She has a slightly elevated body mass index and a low diabetes pedigree function score, indicating a low risk of developing diabetes.###\nHence this label was consent."
"A 39-year-old individual, who has been pregnant 7 times, with a diastolic blood pressure of 90, a triceps skin fold thickness of 41, a plasma glucose concentration of 137 after a glucose tolerance test, no 2-hour serum insulin, a body mass index of 32.0, and a diabetes pedigree function of 0.391.###\nHence this label was avoid."
"This individual is 39 years old and has been pregnant 8 times. They have a diastolic blood pressure of 74 and triceps skin fold thickness of 0. Their plasma glucose concentration is high at 197, while their 2-hour serum insulin level is 0. With a body mass index of 25.9 and a diabetes pedigree function of 1.191, this person may have an increased risk of developing diabetes.###\nHence this label was consent."
"This individual is a 29-year-old who has been pregnant 6 times. They have a low diastolic blood pressure of 66 and no triceps skin fold thickness. Their glucose levels after a 2-hour oral glucose tolerance test are at a normal level of 103. They have no serum insulin after 2 hours and a healthy body mass index of 24.3. Their diabetes pedigree function score is low at 0.249.###\nHence this label was avoid."
"The patient is a 36-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 72 mmHg. Her triceps skin fold thickness is 42 mm. During a glucose tolerance test, her plasma glucose concentration at 2 hours is 179 mg/dL. She has a 2-hour serum insulin level of 130 μU/mL. Her body mass index (BMI) is 32.7, indicating she is overweight. The diabetes pedigree function score is 0.719, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"A 30-year-old individual, who has been pregnant once, with a diastolic blood pressure of 64, a triceps skin fold thickness of 32, a plasma glucose concentration of 122 after a GTT, 2-hour serum insulin level of 156, a body mass index of 35.1, and a diabetes pedigree function of 0.692.###\nHence this label was consent."
"The patient is 29 years old and has been pregnant 9 times. She has a diastolic blood pressure of 80, triceps skin fold thickness of 35, and a plasma glucose concentration of 119. Her 2-hour serum insulin level is 0. With a body mass index of 29.0 and a diabetes pedigree function of 0.263, the patient's risk of developing diabetes is uncertain based on these measurements.###\nHence this label was consent."
"This individual is a 36-year-old woman who has been pregnant three times. Her diastolic blood pressure is at a healthy level of 70. She has a triceps skin fold thickness of 22, indicating a moderate amount of subcutaneous fat. Her plasma glucose concentration after a glucose tolerance test is high at 187 mg/dL. Additionally, she has a 2-hour serum insulin level of 200, which is elevated. Her body mass index is 36.4, classifying her as obese. The diabetes pedigree function value of 0.408 suggests a moderate genetic predisposition to diabetes. Overall, these measurements indicate a high risk of developing diabetes.###\nHence this label was consent."
"The patient is a 29-year-old woman who has been pregnant 7 times. She has a low diastolic blood pressure of 60 and a moderate triceps skin fold thickness of 24. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106. She has no detectable 2-hour serum insulin. Her body mass index is 26.5, indicating she is slightly overweight. Her diabetes pedigree function is 0.296, suggesting a low genetic risk for diabetes.###\nHence this label was consent."
"This individual is a 32-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 22 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85 mg/dL, with a 2-hour serum insulin level of 0 uU/mL. Her body mass index is 29.0, and she has a diabetes pedigree function value of 1.224.###\nHence this label was consent."
"A 24-year-old woman who has been pregnant twice shows normal diastolic blood pressure and slightly high triceps skin fold thickness. Her glucose levels are within normal range, but she has no insulin production after a glucose tolerance test. She has a high body mass index and a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is 25 years old and has been pregnant 5 times. They have a healthy diastolic blood pressure of 62 and a slightly above average triceps skin fold thickness of 41. Their glucose levels after a GTT are normal at 109, but their insulin levels are elevated at 129. They have a high body mass index of 35.8 and a low diabetes pedigree function of 0.514. Overall, this individual may have a moderate risk of developing diabetes due to their insulin levels and BMI.###\nHence this label was consent."
"This data represents a 22-year-old individual who has been pregnant twice. They have a lower than average diastolic blood pressure of 60, a triceps skin fold thickness of 18, and a plasma glucose concentration of 122 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 106, and they have a body mass index of 29.8. The individual also has a relatively low diabetes pedigree function value of 0.717.###\nHence this label was avoid."
"A 21-year-old female who has never been pregnant has a low diastolic blood pressure of 58, a slightly below average triceps skin fold thickness of 20, and a normal body mass index of 26.4. Her plasma glucose concentration after a 2-hour glucose tolerance test is 134, and her 2-hour serum insulin level is high at 291. She has a relatively low diabetes pedigree function score of 0.352. Overall, she appears to have a healthy profile with some potential risk factors for diabetes.###\nHence this label was avoid."
"This patient is a 31-year-old woman who is pregnant for the first time. She has healthy diastolic blood pressure and normal plasma glucose levels after a glucose tolerance test. Her triceps skin fold thickness, insulin levels, and body mass index are all within normal range. Additionally, her diabetes pedigree function score is low, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"A 22-year-old woman who has never been pregnant has a low diastolic blood pressure of 70. She has a moderate triceps skin fold thickness of 37 and a slightly elevated plasma glucose concentration of 106 after a glucose tolerance test. Her 2-hour serum insulin level is high at 148, indicating possible insulin resistance. With a body mass index of 39.4, she is considered obese. Her diabetes pedigree function score is 0.605, suggesting a moderate genetic risk for developing diabetes.###\nHence this label was avoid."
"This 22-year-old individual, who has been pregnant once, has a relatively low diastolic blood pressure of 58. Their triceps skin fold thickness is 18, which is within a healthy range. They have a normal plasma glucose concentration of 109 after a 2-hour oral glucose tolerance test, alongside a moderate insulin level of 116. With a body mass index of 28.5, this person falls into the overweight category. Their diabetes pedigree function score is low at 0.219, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 46-year-old individual who has been pregnant 14 times, with a diastolic blood pressure of 78 and a triceps skin fold thickness of 25. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 100, and their 2-hour serum insulin level is 184. With a body mass index of 36.6 and a diabetes pedigree function of 0.412, this individual's risk of developing diabetes could be assessed.###\nHence this label was consent."
"This individual is 30 years old and has been pregnant 5 times. They have a low diastolic blood pressure of 68 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a GTT is 110, with a 2-hour serum insulin level of 0. They have a body mass index of 26.0 and a low diabetes pedigree function score of 0.292.###\nHence this label was avoid."
"This individual is a 40-year-old who has been pregnant 4 times. They have a normal diastolic blood pressure of 74 and a low triceps skin fold thickness of 0. Their glucose levels are slightly elevated at 141 after a 2-hour oral glucose tolerance test, but they have no insulin present. Despite a body mass index of 27.6, which is considered overweight, they have a low diabetes pedigree function of 0.244.###\nHence this label was avoid."
"A 46-year-old individual, who has been pregnant 3 times, with normal diastolic blood pressure, slightly below average triceps skin fold thickness, low glucose concentration after a glucose tolerance test, no serum insulin after 2 hours, elevated body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"This patient is a 41-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 68 and a high triceps skin fold thickness of 41. Her plasma glucose concentration after a glucose tolerance test is 0, and she has no insulin present in her serum after 2 hours. She has a high body mass index of 39.0 and a moderately high diabetes pedigree function of 0.727. This combination of factors may suggest a risk for developing diabetes.###\nHence this label was consent."
"This individual is a young adult, who has never been pregnant. They have normal diastolic blood pressure and a moderate triceps skin fold thickness. Their plasma glucose concentration is within a healthy range after a glucose tolerance test. They have high serum insulin levels, a normal body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 27-year-old individual with 2 pregnancies shows normal diastolic blood pressure, moderately high triceps skin fold thickness, normal plasma glucose concentration after a glucose tolerance test, elevated serum insulin levels, slightly high body mass index, and a moderately high diabetes pedigree function score. This individual may have a moderate risk of developing diabetes.###\nHence this label was avoid."
"This data belongs to a 27-year-old individual who has never been pregnant. She has normal diastolic blood pressure and a slightly high triceps skin fold thickness indicating some excess body fat. Her glucose levels are within the normal range after a 2-hour glucose tolerance test, but her insulin levels are significantly elevated. She has a high body mass index, indicating obesity. However, her diabetes pedigree function score is low, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"This is a data point of a 36-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 90, triceps skin fold thickness of 38, and a plasma glucose concentration of 151 after a glucose tolerance test. Their 2-hour serum insulin level is 0, with a body mass index of 29.7. The diabetes pedigree function value is 0.294.###\nHence this label was avoid."
"This is a dataset of a 32-year-old individual who has been pregnant 6 times. Their diastolic blood pressure is 60, triceps skin fold thickness is 19, and plasma glucose concentration after a 2-hour oral glucose tolerance test is 99. The 2-hour serum insulin level is 54, while their body mass index is 26.9. The diabetes pedigree function value is 0.497.###\nHence this label was avoid."
"The individual is a 41-year-old woman who has been pregnant 6 times. She has a healthy diastolic blood pressure of 66 and a moderate triceps skin fold thickness of 30. Her plasma glucose concentration after a glucose tolerance test is on the lower side at 80, and she has no serum insulin present after 2 hours. Her body mass index is within the normal range at 26.2, and her diabetes pedigree function indicates a low genetic predisposition to diabetes at 0.313.###\nHence this label was avoid."
"This individual is a 31-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a GTT is 95, with no detectable serum insulin levels. She has a body mass index of 32.0 and a low diabetes pedigree function of 0.161.###\nHence this label was consent."
"This 40-year-old individual has been pregnant 9 times and has a diastolic blood pressure of 70. Their triceps skin fold thickness measures 44, while their plasma glucose concentration after a glucose tolerance test is 123. The 2-hour serum insulin level is 94, and their body mass index is 33.1. The diabetes pedigree function value is 0.374.###\nHence this label was avoid."
"A 55-year-old individual who has been pregnant 6 times with diastolic blood pressure of 72, triceps skin fold thickness of 32, plasma glucose concentration of 103, 2-hour serum insulin level of 190, body mass index of 37.7, and a diabetes pedigree function of 0.324.###\nHence this label was avoid."
"The patient is a 24-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 13. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 158, and her 2-hour serum insulin level is 387. With a body mass index of 31.2 and a diabetes pedigree function of 0.295, she might be at risk for developing diabetes.###\nHence this label was avoid."
"This patient is a 22-year-old female who has been pregnant 3 times. She has a low diastolic blood pressure of 44 and a triceps skin fold thickness of 13, indicating a healthy body composition. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 113, and her 2-hour serum insulin level is 0. She has a relatively low body mass index of 22.4 and a low diabetes pedigree function score of 0.14, suggesting a low risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 26-year-old who has been pregnant 3 times. They have a diastolic blood pressure of 80 and a triceps skin fold thickness of 33. Their plasma glucose concentration after a GTT is 124 and their 2-hour serum insulin level is 130. With a body mass index of 33.2, their diabetes pedigree function is 0.305.###\nHence this label was avoid."
"The patient is a 21-year-old who has never been pregnant. They have normal diastolic blood pressure, low triceps skin fold thickness, and normal glucose levels after a 2-hour oral glucose tolerance test. Their insulin levels are low, body mass index is within the normal range, and their diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"A 45-year-old woman who has been pregnant 8 times shows normal diastolic blood pressure and low 2-hour serum insulin levels. She has a slightly above average triceps skin fold thickness, a normal plasma glucose concentration, high body mass index, and a low diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 23-year-old female who has never been pregnant. She has a diastolic blood pressure of 60, a triceps skin fold thickness of 25, and a body mass index of 26.4. Her plasma glucose concentration at 2 hours is 107, with a 2-hour serum insulin level of 0. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.133.###\nHence this label was avoid."
"A 32-year-old woman who has been pregnant 6 times shows normal diastolic blood pressure. She has no triceps skin fold thickness and a low plasma glucose concentration after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is also low, and she has a healthy body mass index of 23.2. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"A 24-year-old individual, who is pregnant for the first time, with a healthy diastolic blood pressure of 72. They have a moderate level of triceps skin fold thickness and a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is within a normal range. They have a slightly elevated body mass index and a low diabetes pedigree function score, suggesting a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This individual, aged 52, has been pregnant 5 times. They have a diastolic blood pressure of 76 and a triceps skin fold thickness of 27. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 97, with a 2-hour serum insulin level of 0. Their body mass index is 35.6, and they have a diabetes pedigree function score of 0.378.###\nHence this label was consent."
"A 29-year-old woman who has been pregnant 5 times shows a diastolic blood pressure of 84. She has a triceps skin fold thickness of 41mm and a plasma glucose concentration of 158mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 210mu U/mL, and she has a body mass index of 39.4. Her diabetes pedigree function is 0.395, indicating a moderate familial risk of developing diabetes.###\nHence this label was consent."
"This 28-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 74. They have a triceps skin fold thickness of 40, a plasma glucose concentration of 123 after a glucose tolerance test, and a 2-hour serum insulin level of 77. Their body mass index is 34.1 and their diabetes pedigree function is 0.269.###\nHence this label was avoid."
"The patient is a 44-year-old female who has been pregnant 3 times. She has normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is low, and she has a high body mass index. The patient has a relatively low diabetes pedigree function score.###\nHence this label was consent."
"This is a 25-year-old individual who is pregnant for the first time. They have a normal diastolic blood pressure of 72 and a moderate triceps skin fold thickness of 30. Their blood sugar level after a glucose tolerance test is 112, and their insulin level is high at 176. They have a Body Mass Index of 34.4, indicating obesity. The diabetes pedigree function value is 0.528, suggesting a moderate genetic predisposition to diabetes. Overall, the individual shows signs of potential risk for developing diabetes.###\nHence this label was avoid."
"This patient is a 38-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 82 which is within the normal range. Her triceps skin fold thickness is 0, indicating low body fat. Her plasma glucose concentration is 75, which is below the normal range. She has not produced insulin in the 2-hour serum test. Her body mass index is 33.3, which is considered obese. The diabetes pedigree function is 0.263, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"A 23-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 86, triceps skin fold thickness of 20, plasma glucose concentration after a GTT of 129, 2-hour serum insulin of 270, body mass index of 35.1, and a diabetes pedigree function of 0.231.###\nHence this label was avoid."
"The patient is a 29-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 76 mmHg and a triceps skin fold thickness of 36 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 196 mg/dL, and her 2-hour serum insulin level is 249 μU/mL. She has a body mass index of 36.5 and a diabetes pedigree function value of 0.875. These measurements provide insight into her current health status and risk of developing diabetes.###\nHence this label was consent."
"This 51-year-old individual has been pregnant 11 times and has a diastolic blood pressure of 106. They have a triceps skin fold thickness of 0, which may indicate low body fat. Their plasma glucose concentration after a glucose tolerance test is 127, suggesting they may be at risk for diabetes. They have a 2-hour serum insulin level of 0, which could indicate insulin sensitivity. With a body mass index of 39.0 and a low diabetes pedigree function of 0.19, this individual may need to monitor their risk for diabetes and prioritize weight management.###\nHence this label was avoid."
"This data represents a 37-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 90 and a triceps skin fold thickness of 35. Their plasma glucose concentration after a glucose tolerance test is 186, and their 2-hour serum insulin level is 225. With a body mass index of 34.5 and a diabetes pedigree function of 0.423, this individual may be at risk for developing diabetes.###\nHence this label was consent."
"A 50-year-old individual, who has been pregnant 7 times, with a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 136 mg/dL, with a 2-hour serum insulin level of 0 μU/mL. They have a body mass index of 29.9 and a diabetes pedigree function of 0.21.###\nHence this label was avoid."
"A 31-year-old woman who has been pregnant 7 times, with a diastolic blood pressure of 76, triceps skin fold thickness of 17, and a plasma glucose concentration of 114 after a 2-hour oral glucose tolerance test. She has a 2-hour serum insulin level of 110, a body mass index of 23.8, and a diabetes pedigree function of 0.466.###\nHence this label was avoid."
"The patient, who is 33 years old and has been pregnant once, has low diastolic blood pressure, normal plasma glucose concentration, and slightly elevated body mass index. Their triceps skin fold thickness and 2-hour serum insulin levels are within normal range. The diabetes pedigree function score indicates a low genetic risk for diabetes. Overall, the patient appears to have relatively low risk for developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"This individual is 38 years old and has been pregnant 9 times. Their diastolic blood pressure is 78 mmHg, triceps skin fold thickness is 25 mm, and plasma glucose concentration after a glucose tolerance test is 72 mg/dL. They have no serum insulin levels after 2 hours, a body mass index of 31.6, and a low diabetes pedigree function of 0.28.###\nHence this label was avoid."
"This is a data record of a 27-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 17 mm. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 155 mg/dL and their 2-hour serum insulin level is 96 mu U/ml. The individual has a body mass index of 26.6 and a diabetes pedigree function value of 0.433.###\nHence this label was consent."
"This data represents a 24-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 19mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 108 mg/dL, and her 2-hour serum insulin level is 0 μU/ml. With a body mass index of 27.1 and a diabetes pedigree function value of 0.4, this individual's risk of developing diabetes may be relatively low.###\nHence this label was avoid."
"This data represents a 35-year-old individual who has been pregnant 6 times. Despite having a low diastolic blood pressure of 44, the individual has a slightly higher-than-normal plasma glucose concentration of 108 and a high 2-hour serum insulin level of 130. They have a healthy body mass index of 24.0 and a relatively low triceps skin fold thickness of 20. Their diabetes pedigree function score is 0.813, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 32-year-old woman who has never been pregnant. She has a normal diastolic blood pressure of 68 and a slightly below average triceps skinfold thickness of 20. Her blood glucose level after a glucose tolerance test is 108, and she has no insulin present in her serum after 2 hours. Her body mass index is in the healthy range at 27.3, and her diabetes pedigree function score is 0.787, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is 31 years old and has been pregnant 4 times. They have a diastolic blood pressure of 78, triceps skin fold thickness of 39, and a high plasma glucose concentration of 184 after a glucose tolerance test. Additionally, their 2-hour serum insulin level is 277, and they have a body mass index of 37.0. The diabetes pedigree function score is 0.264.###\nHence this label was consent."
"This patient is a 45-year-old woman who has been pregnant 10 times. She has a healthy diastolic blood pressure of 78 and a moderate triceps skin fold thickness of 31. Her plasma glucose concentration after a glucose tolerance test is 122, and she has no insulin in her bloodstream after 2 hours. Her body mass index is 27.6, indicating she is slightly overweight. The diabetes pedigree function value is 0.512, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This 50-year-old individual has been pregnant 8 times and has a diastolic blood pressure of 84. Despite having a triceps skin fold thickness and 2-hour serum insulin levels of 0, their plasma glucose concentration after a glucose tolerance test is 99. With a body mass index of 35.4 and a low diabetes pedigree function of 0.388, this individual may be at low risk for developing diabetes.###\nHence this label was avoid."
"This individual is a 44-year-old female who has been pregnant 12 times. She has a normal diastolic blood pressure of 80 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106, and her 2-hour serum insulin level is also very low at 0. With a body mass index of 23.6, she is considered to be within the normal weight range. Her diabetes pedigree function is 0.137, indicating a low genetic predisposition to diabetes. Overall, based on these diagnostic measurements, she is at a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This is a dataset of a 27-year-old individual who has been pregnant 2 times. They have a diastolic blood pressure of 84, a triceps skin fold thickness of 0, and a 2-hour serum insulin level of 0. Their plasma glucose concentration after a glucose tolerance test is 129, with a body mass index of 28.0 and a diabetes pedigree function of 0.284.###\nHence this label was avoid."
"This is the data of a 22-year-old individual who has been pregnant twice. She has normal diastolic blood pressure and triceps skin fold thickness, low serum insulin levels, and a healthy body mass index. Her plasma glucose concentration after a glucose tolerance test is within the normal range, and her diabetes pedigree function score is moderate. Overall, based on these measurements, the individual shows a low risk of developing diabetes.###\nHence this label was avoid."
"A 45-year-old woman who has been pregnant 13 times shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Her glucose levels are within normal range after a glucose tolerance test, with low insulin levels. She has a high body mass index and a low diabetes pedigree function score, indicating a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This individual is a young adult who is mildly overweight, with low blood pressure and normal blood glucose levels. Despite being pregnant once, they have low insulin levels and a healthy body mass index. Their overall risk of developing diabetes appears to be low based on these measurements.###\nHence this label was avoid."
"The patient is a 24-year-old woman who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a glucose tolerance test. She has no insulin resistance, but a high body mass index. Her family history indicates a moderate risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 41-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 187, with a 2-hour serum insulin level of 304. Her body mass index is 37.7 and she has a diabetes pedigree function of 0.254.###\nHence this label was consent."
"This patient is a 29-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 86 mmHg and a triceps skin fold thickness of 39 mm. Her plasma glucose concentration at 2 hours in a glucose tolerance test is 119 mg/dL, and her 2-hour serum insulin level is 220 uU/ml. She has a body mass index of 45.6 kg/m² and a diabetes pedigree function value of 0.808. These measurements indicate a potential risk for developing diabetes and may require further monitoring and intervention.###\nHence this label was consent."
"This individual is a 62-year-old who has never been pregnant. They have a normal diastolic blood pressure of 84 and a healthy body mass index of 27.9. Their triceps skin fold thickness and 2-hour serum insulin levels are both at 0, indicating low fat and insulin levels. Despite having a moderate plasma glucose concentration of 105, their diabetes pedigree function score of 0.741 suggests a low genetic risk for diabetes.###\nHence this label was consent."
"This is a data record of a 37-year-old individual who has been pregnant 4 times. They have a low diastolic blood pressure of 58, a triceps skin fold thickness of 28, and a plasma glucose concentration of 144 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is high at 140, and their body mass index is 29.5. The diabetes pedigree function, indicating the likelihood of developing diabetes based on family history, is relatively low at 0.287.###\nHence this label was avoid."
"A 26-year-old woman who has been pregnant twice has a low diastolic blood pressure of 48. She has a moderate triceps skin fold thickness of 32 and a slightly elevated plasma glucose concentration at 123. Her 2-hour serum insulin level is high at 165, indicating possible insulin resistance. With a body mass index of 42.1, she is considered obese. However, her diabetes pedigree function is relatively low at 0.52, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 38-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 30mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 181 mg/dL, and her 2-hour serum insulin level is 180 uU/ml. She has a body mass index of 34.1 and a diabetes pedigree function of 0.328. Overall, these measurements suggest a potential risk for developing diabetes.###\nHence this label was consent."
"This 21-year-old individual who has never been pregnant has a diastolic blood pressure of 80. They have a triceps skin fold thickness of 16, a plasma glucose concentration of 113 after a 2-hour oral glucose tolerance test, and their 2-hour serum insulin level is 0. Their body mass index is 31.0 and they have a diabetes pedigree function score of 0.874.###\nHence this label was avoid."
"The individual in this data is a 69-year-old who has been pregnant 5 times. Their diastolic blood pressure is 80, triceps skin fold thickness is 0, and their plasma glucose concentration after a glucose tolerance test is 132. Their 2-hour serum insulin level is 0, and their body mass index is 26.8. The diabetes pedigree function, which predicts the likelihood of developing diabetes based on family history, is 0.186.###\nHence this label was avoid."
"This patient is a 46-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 62 and a moderate triceps skin fold thickness of 32. Her plasma glucose concentration after a glucose tolerance test is normal at 92, but her 2-hour serum insulin level is high at 126. She has a body mass index of 32.0, indicating she is overweight. The diabetes pedigree function score is low at 0.085, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"This patient, a 47-year-old female, is at low risk of developing diabetes. She has had one pregnancy, with a diastolic blood pressure of 60 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 126, with a 2-hour serum insulin level of 0. Her body mass index is 30.1 and her diabetes pedigree function is 0.349.###\nHence this label was consent."
"The patient is a 26-year-old female who is pregnant for the first time. She has a normal diastolic blood pressure reading of 76. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0. The patient has a plasma glucose concentration of 106 after an oral glucose tolerance test. Her body mass index is elevated at 37.5, indicating obesity. The diabetes pedigree function score is low at 0.197, suggesting a lower genetic predisposition to diabetes. Overall, this patient shows signs of potential risk for diabetes due to high BMI and glucose levels.###\nHence this label was avoid."
"This individual is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 94, a triceps skin fold thickness of 33, and a BMI of 36.6, indicating she is overweight. Her plasma glucose concentration after a glucose tolerance test is 143, which is slightly elevated. She also has a 2-hour serum insulin level of 146 and a low diabetes pedigree function of 0.254, suggesting a relatively lower genetic risk for diabetes.###\nHence this label was consent."
"This individual is a 21-year-old female who has never been pregnant. She has a healthy diastolic blood pressure of 75 mmHg and a moderately low triceps skin fold thickness of 23 mm. Her plasma glucose concentration after a glucose tolerance test is normal at 102 mg/dL, and she has no detectable insulin levels after 2 hours. Her body mass index is very low at 0.0, and her diabetes pedigree function score is 0.572, suggesting a low to moderate genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant twice. She has a very low diastolic blood pressure of 54 mmHg. Her triceps skin fold thickness is 14 mm. After a 2-hour glucose tolerance test, her plasma glucose concentration is 95 mg/dL. Her 2-hour serum insulin level is 88 μU/mL. She has a body mass index of 26.1, indicating she is overweight. The diabetes pedigree function, a measure of the hereditary risk of diabetes, is 0.748.###\nHence this label was avoid."
"The patient is a 37-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 76, but no visible triceps skin fold thickness. Her glucose levels are within a healthy range at 150, with no insulin present in her system. Despite her low body mass index of 21.0, her diabetes pedigree function score is 0.207, indicating a potential genetic predisposition to diabetes.###\nHence this label was avoid."
"This 21-year-old patient has been pregnant twice and shows normal diastolic blood pressure, low triceps skin fold thickness, and normal plasma glucose concentration after a glucose tolerance test. The patient has very low insulin levels, a slightly high body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 40-year-old woman who has been pregnant 5 times. She has a healthy diastolic blood pressure of 78 and a moderately thick triceps skin fold at 27. Her glucose level after a two-hour oral glucose tolerance test is 126, with a relatively low serum insulin level of 22. She has a body mass index of 29.6, which falls in the overweight category. The diabetes pedigree function score is 0.439, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 46-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 37 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 134 mg/dL, with a 2-hour serum insulin level of 370 μU/mL. She has a body mass index of 46.2 and a diabetes pedigree function of 0.238.###\nHence this label was consent."
"The patient is a 41-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 48, and a plasma glucose concentration of 120 after a glucose tolerance test. Her 2-hour serum insulin level is 200, and she has a body mass index of 38.9. Additionally, her diabetes pedigree function is 1.162.###\nHence this label was avoid."
"This patient is a 66-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 90, no triceps skin fold thickness, and a plasma glucose concentration of 158 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 31.6. Her diabetes pedigree function is 0.805.###\nHence this label was consent."
"The patient is a 36-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 21. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 95, and her 2-hour serum insulin level is 73. With a body mass index of 25.9 and a diabetes pedigree function of 0.673, she is at risk for developing diabetes.###\nHence this label was avoid."
"A 24-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 88. They have a triceps skin fold thickness of 37mm. After a glucose tolerance test, their plasma glucose concentration at 2 hours is 174 mg/dL, and their 2-hour serum insulin level is 120 μU/ml. Their body mass index is 44.5, and they have a diabetes pedigree function score of 0.646.###\nHence this label was consent."
"The patient is a 30-year-old female who has been pregnant 3 times. She has a healthy diastolic blood pressure of 80 and a low triceps skin fold thickness of 11. Her plasma glucose concentration after a glucose tolerance test is normal at 99, and her 2-hour serum insulin level is also within a healthy range at 64. Despite having a low body mass index of 19.3, her diabetes pedigree function is slightly elevated at 0.284. Overall, this individual appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This 27-year-old individual, who is pregnant for the first time, has a diastolic blood pressure of 68. They have no triceps skin fold thickness and very low levels of 2-hour serum insulin. Their plasma glucose concentration after a GTT is 83, and they have a low body mass index of 18.2. Their diabetes pedigree function is 0.624.###\nHence this label was avoid."
"This 21-year-old patient, who has been pregnant once, shows normal diastolic blood pressure, moderate triceps skin fold thickness, and slightly elevated plasma glucose levels after a glucose tolerance test. Their insulin levels are also elevated, and they have a slightly high body mass index. Despite a family history of diabetes, the patient's overall risk of developing diabetes is moderate.###\nHence this label was avoid."
"This individual is 38 years old and has been pregnant 10 times. They have a diastolic blood pressure of 86, triceps skin fold thickness of 37, and a high plasma glucose concentration of 101 after a glucose tolerance test. Their 2-hour serum insulin level is 0, indicating potential insulin sensitivity issues. With a body mass index of 45.6 and a high diabetes pedigree function of 1.136, this person may be at risk for developing diabetes.###\nHence this label was consent."
"This data belongs to a 26-year-old individual who has been pregnant 4 times. They have a low diastolic blood pressure of 56 and a moderate triceps skin fold thickness of 17. Their plasma glucose concentration after a glucose tolerance test is within normal range at 96. The 2-hour serum insulin level is 49, indicating a healthy insulin response. Their body mass index is relatively low at 20.8 and they have a low diabetes pedigree function score of 0.34, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 35-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 30, and a plasma glucose concentration of 158 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is high at 328. She has a body mass index of 35.5 and a relatively low diabetes pedigree function score of 0.344.###\nHence this label was consent."
"This data belongs to a 22-year-old individual who has been pregnant twice. They have a low diastolic blood pressure of 46 and average triceps skin fold thickness of 21. Their glucose levels after a GTT are 127, and their insulin levels after 2 hours are high at 335. They have a body mass index of 34.4, indicating they may be overweight. The diabetes pedigree function value is low at 0.176, suggesting a lower risk of developing diabetes based on family history.###\nHence this label was avoid."
"A 27-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness is moderate, and she has a low plasma glucose concentration after a glucose tolerance test. Despite not having any insulin in her bloodstream, her diabetes pedigree function suggests a low risk of developing diabetes.###\nHence this label was avoid."
"This 24-year-old individual has been pregnant twice and shows a low diastolic blood pressure of 58. They have a healthy triceps skin fold thickness of 34 and a normal body mass index of 25.4. Their plasma glucose concentration after a GTT is 141, and their 2-hour serum insulin levels are elevated at 128. With a low diabetes pedigree function score of 0.699, this individual shows some indications of insulin resistance.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 39 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 173 mg/dL, and her 2-hour serum insulin level is 185 mu U/ml. She has a body mass index of 33.8 and a diabetes pedigree function value of 0.97.###\nHence this label was consent."
"This 33-year-old patient, who has been pregnant once, shows relatively normal diastolic blood pressure and triceps skin fold thickness. However, their plasma glucose concentration after a glucose tolerance test is high, accompanied by elevated insulin levels. Despite having a healthy body mass index, their diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 31-year-old who has never been pregnant. They have normal diastolic blood pressure and triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 145, and they have no insulin in their serum after 2 hours. However, they have a high body mass index of 44.2 and a moderate diabetes pedigree function of 0.63.###\nHence this label was consent."
"A 58-year-old individual who has been pregnant 8 times shows normal diastolic blood pressure, no triceps skin fold thickness, and average plasma glucose concentration during an oral glucose tolerance test. They have very low serum insulin levels and a healthy body mass index. Additionally, their diabetes pedigree function score is low, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 24-year-old who has never been pregnant. She has a diastolic blood pressure of 85 and a triceps skin fold thickness of 54. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 147. Her 2-hour serum insulin is 0. With a body mass index of 42.8 and a diabetes pedigree function of 0.375, she may be at risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 39-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 32. Her plasma glucose concentration during an oral glucose tolerance test is 154 mg/dL, and her 2-hour serum insulin level is 193 mu U/ml. She has a body mass index of 29.3 and a diabetes pedigree function of 0.839.###\nHence this label was avoid."
"A 56-year-old individual with a history of 10 pregnancies shows normal diastolic blood pressure and low triceps skin fold thickness. They have a relatively low plasma glucose concentration after a 2-hour oral glucose tolerance test and zero 2-hour serum insulin level. Despite having a high body mass index, their diabetes pedigree function score is moderately low.###\nHence this label was consent."
"This patient is a 29-year-old female who has been pregnant 2 times. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 45 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 105 mg/dL. She has a 2-hour serum insulin level of 191 μU/mL and a body mass index of 33.7 kg/m². Additionally, her diabetes pedigree function is 0.711, indicating a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"This 24-year-old individual has a moderate risk of developing diabetes based on their diagnostic measurements. They have been pregnant 3 times and have a healthy diastolic blood pressure of 74. Their triceps skin fold thickness is within a normal range at 15, and their plasma glucose concentration after a glucose tolerance test is 116. The 2-hour serum insulin level is slightly elevated at 105, and their body mass index is 26.3, indicating they are slightly overweight. The diabetes pedigree function value of 0.107 suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"This is a case of a 21-year-old individual who has been pregnant 4 times. Their diastolic blood pressure is 76, triceps skin fold thickness is 15, and plasma glucose concentration is 99 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 51, body mass index is 23.2, and diabetes pedigree function is 0.223. These measurements provide insight into the individual's health status and potential risk for developing diabetes.###\nHence this label was avoid."
"This is the profile of a 22-year-old individual with 3 pregnancies, normal diastolic blood pressure, moderate triceps skin fold thickness, high glucose levels after a glucose tolerance test, very low insulin levels, elevated body mass index, and a low diabetes risk based on their pedigree.###\nHence this label was avoid."
"The patient is a 40-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 24 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 117 mg/dL, and her 2-hour serum insulin level is 145 uU/mL. She has a body mass index of 34.5 and a diabetes pedigree function of 0.403.###\nHence this label was consent."
"The patient is a 34-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 45. Her plasma glucose concentration is 123 after a 2-hour oral glucose tolerance test, and she has a 2-hour serum insulin level of 230. With a body mass index of 33.6 and a diabetes pedigree function of 0.733, she may have an increased risk of developing diabetes.###\nHence this label was avoid."
"A 42-year-old individual who has been pregnant 9 times and shows signs of low diastolic blood pressure, no triceps skin fold thickness, normal glucose levels after a GTT, no insulin present, a slightly elevated body mass index, and a slightly below average diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a young adult, age 22, who is pregnant for the first time. Their diastolic blood pressure is low at 48. They have normal triceps skin fold thickness of 20. The plasma glucose concentration at 2 hours is zero, indicating low blood sugar levels. Similarly, the 2-hour serum insulin level is zero. The patient has a healthy body mass index of 24.7 and a low diabetes pedigree function of 0.14.###\nHence this label was avoid."
"A 53-year-old individual, who has been pregnant 9 times, with a diastolic blood pressure of 88. They have a triceps skin fold thickness of 34, a plasma glucose concentration of 145, and a 2-hour serum insulin level of 165. With a body mass index of 30.3 and a diabetes pedigree function of 0.771, this individual's risk for developing diabetes may be concerning.###\nHence this label was consent."
"This 28-year-old individual, who is pregnant for the first time, has a healthy diastolic blood pressure of 72. Their triceps skin fold thickness is at a normal level of 12. Their glucose levels also appear normal, with a plasma glucose concentration of 100 and 2-hour serum insulin of 70. With a body mass index of 25.3 and a diabetes pedigree function score of 0.658, this individual shows no initial signs of developing diabetes.###\nHence this label was avoid."
"This is a 42-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 86, a triceps skin fold thickness of 30, and a plasma glucose concentration of 117 after a glucose tolerance test. Their 2-hour serum insulin level is 105, and their body mass index is 39.1. The diabetes pedigree function score is 0.251.###\nHence this label was avoid."
"This 27-year-old individual has been pregnant 4 times and shows a normal diastolic blood pressure of 80. They have a very low triceps skin fold thickness and no serum insulin levels. Despite a slightly elevated plasma glucose concentration, their body mass index is in the overweight range. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was consent."
"This patient is a 26-year-old woman who has never been pregnant. She has a diastolic blood pressure of 94, a triceps skin fold thickness of 46, a plasma glucose concentration of 135, and a 2-hour serum insulin level of 145. Her body mass index is 40.6 and her diabetes pedigree function is 0.284. Overall, this data suggests that she may be at risk for developing diabetes.###\nHence this label was avoid."
"A 24-year-old individual who has never been pregnant shows normal diastolic blood pressure, low triceps skin fold thickness, and average plasma glucose concentration after a glucose tolerance test. Their insulin levels are also within a healthy range. Despite a slightly elevated body mass index, their diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was consent."
"This 24-year-old individual has been pregnant twice and has a diastolic blood pressure of 65. Their triceps skin fold thickness is 28, and their plasma glucose concentration at 2 hours is 83. They have a 2-hour serum insulin level of 66 and a body mass index of 36.8. The diabetes pedigree function is calculated to be 0.629.###\nHence this label was avoid."
"A 47-year-old individual who has been pregnant 10 times shows normal diastolic blood pressure and a healthy body mass index. However, they have slightly high plasma glucose concentration and 2-hour serum insulin levels. Their triceps skin fold thickness indicates average fat distribution, while their diabetes pedigree function suggests a low genetic predisposition to diabetes.###\nHence this label was consent."
"In this example, we have a 34-year-old individual who has been pregnant 4 times. Their diastolic blood pressure is 86, triceps skin fold thickness is 19, and plasma glucose concentration at 2 hours is 83. Additionally, their 2-hour serum insulin level is 0, body mass index is 29.3, and diabetes pedigree function is 0.317. These measurements provide insight into the individual's health status related to diabetes risk factors.###\nHence this label was avoid."
"A 25-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 52 and a triceps skin fold thickness of 27. Their plasma glucose concentration after a 2-hour glucose tolerance test is 155, and their 2-hour serum insulin level is 540. They have a body mass index of 38.7 and a diabetes pedigree function of 0.24.###\nHence this label was consent."
"This is a data record of a 22-year-old individual who has never been pregnant. They have low diastolic blood pressure (52), a normal triceps skin fold thickness (10), and low plasma glucose concentration (74) after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is slightly elevated (36), and they have a healthy body mass index of 27.8. The diabetes pedigree function value is low at 0.269, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"This is a case of a 21-year-old woman who has been pregnant twice. She has normal diastolic blood pressure and zero triceps skin fold thickness. Her plasma glucose concentration is at a healthy level after a 2-hour oral glucose tolerance test. She has no insulin present in her blood. Despite having a high body mass index of 42.9, her diabetes pedigree function is relatively low at 0.693.###\nHence this label was consent."
"This is a profile of a 38-year-old individual who has been pregnant 13 times. Their diastolic blood pressure is 72, and they have a triceps skin fold thickness of 0. The plasma glucose concentration at 2 hours in an oral glucose tolerance test is 104, and their 2-hour serum insulin level is 0. Their body mass index is 31.2 and the diabetes pedigree function is 0.465.###\nHence this label was consent."
"This is a 27-year-old woman who has never been pregnant and has a diastolic blood pressure of 86. Her triceps skin fold thickness is 17mm. She had a plasma glucose concentration of 102mg/dL after a 2-hour oral glucose tolerance test and a 2-hour serum insulin level of 105 microU/mL. Her body mass index is 29.3 and she has a diabetes pedigree function value of 0.695.###\nHence this label was avoid."
"This individual is 35 years old and has been pregnant 5 times. They have a diastolic blood pressure of 84, triceps skin fold thickness of 41, and a plasma glucose concentration of 136 after a glucose tolerance test. Their 2-hour serum insulin level is 88. With a body mass index of 35.0 and a diabetes pedigree function of 0.286, this person's risk of developing diabetes may need to be monitored.###\nHence this label was consent."
"This patient is a 51-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 84 and a triceps skin fold thickness of 21. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours was 181 mg/dL. Her 2-hour serum insulin level is 192 μU/mL. She has a body mass index of 35.9 and a diabetes pedigree function of 0.586.###\nHence this label was consent."
"A 25-year-old woman, who has been pregnant once, shows low diastolic blood pressure of 44. She has a moderately high triceps skin fold thickness of 47, a normal plasma glucose concentration of 119, and a normal 2-hour serum insulin level of 63. Her body mass index is in the obese range at 35.5, and her diabetes pedigree function is low at 0.28.###\nHence this label was avoid."
"The patient is a young adult, 22 years old, who has been pregnant once. They have a low diastolic blood pressure of 56 and a below-average triceps skin fold thickness of 11. Their plasma glucose concentration after a glucose tolerance test is within the normal range at 93. They have very low insulin levels at 0. The patient has a healthy body mass index of 22.5 and a low diabetes pedigree function score of 0.417. Overall, based on these measurements, the patient appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"This 22-year-old individual has been pregnant 4 times. They have a diastolic blood pressure of 86 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 142. The 2-hour serum insulin level is 0. With a body mass index of 44.0 and a diabetes pedigree function of 0.645, this individual's risk of developing diabetes may be worth monitoring.###\nHence this label was consent."
"This data represents a 23-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 64, a triceps skin fold thickness of 32, and a plasma glucose concentration of 93 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 160, and they have a body mass index of 38.0. The diabetes pedigree function for this individual is 0.674.###\nHence this label was consent."
"A 33-year-old female who has never been pregnant has a diastolic blood pressure of 66. She has a triceps skin fold thickness of 30 mm and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 121 mg/dL. Her 2-hour serum insulin level is 165 μU/mL and her body mass index is 34.3. The diabetes pedigree function indicates a low genetic risk of developing diabetes.###\nHence this label was consent."
"A 24-year-old woman, who is pregnant for the first time, with unusually low diastolic blood pressure and triceps skin fold thickness. However, her plasma glucose concentration after a glucose tolerance test is very high, accompanied by a significantly elevated 2-hour serum insulin level. Despite having a relatively normal body mass index, she has a moderate diabetes pedigree score.###\nHence this label was avoid."
"The patient is a 27-year-old female who has been pregnant 3 times. She has normal diastolic blood pressure, zero triceps skin fold thickness, and a slightly elevated plasma glucose concentration (141 mg/dL) after a glucose tolerance test. Her 2-hour serum insulin level is zero, indicating possible insulin resistance. She has a body mass index (BMI) of 30.0, which falls into the obese category. The patient also has a moderately high diabetes pedigree function score of 0.761, suggesting an increased risk of developing diabetes.###\nHence this label was consent."
"This 24-year-old patient, who has been pregnant once, has a Diastolic blood pressure of 48 mmHg and a Triceps skin fold thickness of 45 mm. Their plasma glucose concentration at 2 hours is 128 mg/dL, with a 2-hour serum insulin level of 194 μU/mL. The patient's body mass index is 40.5 kg/m², and their diabetes pedigree function is 0.613.###\nHence this label was consent."
"This individual is 22 years old and has been pregnant 4 times. They have a diastolic blood pressure of 70 and a triceps skin fold thickness of 32. Their plasma glucose concentration after a glucose tolerance test is 91, and their 2-hour serum insulin level is 88. With a body mass index of 33.1 and a diabetes pedigree function of 0.446, this person's risk assessment for developing diabetes may be influenced by these factors.###\nHence this label was avoid."
"A 22-year-old individual, who has been pregnant 2 times, with a healthy diastolic blood pressure of 70. They have a moderately low triceps skin fold thickness of 27. The plasma glucose concentration at 2 hours in an oral glucose tolerance test is low at 71, and there is no detectable 2-hour serum insulin. With a body mass index of 28.0 and a moderately low diabetes pedigree function of 0.586, this individual appears to have a relatively low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"The patient is a 26-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 68, triceps skin fold thickness of 13, and a plasma glucose concentration of 96 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 49, and her body mass index is 21.1. Her diabetes pedigree function is 0.647.###\nHence this label was avoid."
"The patient is a 54-year-old who has been pregnant 10 times. They have a diastolic blood pressure of 84, triceps skin fold thickness of 0, and a plasma glucose concentration of 162 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and their body mass index is 27.7. The diabetes pedigree function for this patient is 0.182.###\nHence this label was avoid."
"A 26-year-old individual who is pregnant for the first time has low diastolic blood pressure, no triceps skin fold thickness, and low levels of plasma glucose and serum insulin. They have a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was avoid."
"This individual is a 45-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 164 mg/dL, and her 2-hour serum insulin level is 0 µU/mL. She has a body mass index (BMI) of 32.8 and a low diabetes pedigree function score of 0.148.###\nHence this label was consent."
"A 21-year-old woman, who has been pregnant 3 times, with a diastolic blood pressure of 62, no triceps skin fold thickness, a plasma glucose concentration of 111 after a 2-hour oral glucose tolerance test, no 2-hour serum insulin, a body mass index of 22.6, and a low diabetes pedigree function score of 0.142.###\nHence this label was avoid."
"The patient is a 38-year-old woman who has been pregnant 14 times. She has a low diastolic blood pressure of 62 and a moderate triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 175. She has no insulin present at the 2-hour mark. Her body mass index is 33.6, indicating she is overweight. The diabetes pedigree function value is low at 0.212, suggesting a lower risk of developing diabetes based on family history.###\nHence this label was consent."
"A 28-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 72, triceps skin fold thickness of 32, plasma glucose concentration of 84 after a glucose tolerance test, zero 2-hour serum insulin, a body mass index of 37.2, and a diabetes pedigree function of 0.267.###\nHence this label was avoid."
"This individual is a 23-year-old who has been pregnant twice. They have a diastolic blood pressure of 76 and a triceps skin fold thickness of 18. Their plasma glucose concentration after a GTT is 94, with a 2-hour serum insulin level of 66. They have a body mass index of 31.6 and a diabetes pedigree function of 0.649.###\nHence this label was avoid."
"This 23-year-old individual with no previous pregnancies has a diastolic blood pressure of 64 and a triceps skin fold thickness of 23. Their plasma glucose concentration after a glucose tolerance test is 104, and their 2-hour serum insulin level is 116. With a body mass index of 27.8 and a low diabetes pedigree function of 0.454, this individual shows some normal and some elevated values in these health parameters.###\nHence this label was avoid."
"This patient is a 27-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 85, a triceps skin fold thickness of 27, and a plasma glucose concentration of 146 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 100, and she has a body mass index of 28.9. The diabetes pedigree function for this patient is 0.189.###\nHence this label was avoid."
"The individual is 32 years old and has been pregnant 8 times. They have a low diastolic blood pressure of 64 and no triceps skin fold thickness. Their plasma glucose concentration after a GTT is high at 183, but they have low 2-hour serum insulin at 0. Their body mass index is within the normal range at 23.3. The diabetes pedigree function score is 0.672, indicating a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"A 25-year-old woman, who has been pregnant twice, with a diastolic blood pressure of 52, triceps skin fold thickness of 22, plasma glucose concentration at 82, 2-hour serum insulin level of 115, a body mass index of 28.5, and a diabetes pedigree function of 1.699.###\nHence this label was avoid."
"This individual is a 23-year-old who has been pregnant once. Their diastolic blood pressure is 62, triceps skin fold thickness is 13, and plasma glucose concentration after a glucose tolerance test is 111. They have a 2-hour serum insulin level of 182 and a body mass index of 24.0. Their diabetes pedigree function is 0.138.###\nHence this label was avoid."
"This individual is a 42-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 78 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85, and her 2-hour serum insulin level is 0. She has a body mass index of 31.2 and a relatively low diabetes pedigree function score of 0.382.###\nHence this label was avoid."
"This patient is a 51-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 26. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 136, while her 2-hour serum insulin level is 135. With a body mass index of 26.0 and a diabetes pedigree function score of 0.647, she may be at risk for developing diabetes.###\nHence this label was avoid."
"This 30-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 72. The triceps skin fold thickness is 23, with a plasma glucose concentration of 121 after a 2-hour oral glucose tolerance test. The 2-hour serum insulin level is 112, and the body mass index is 26.2. The diabetes pedigree function is calculated to be 0.245.###\nHence this label was avoid."
"A 22-year-old female who has been pregnant once, with a diastolic blood pressure of 60 mmHg, triceps skin fold thickness of 18 mm, and plasma glucose concentration of 95 mg/dL after a 2-hour GTT. Her 2-hour serum insulin level is 58 mU/L, and she has a body mass index of 23.9 kg/m^2. Her diabetes pedigree function is calculated to be 0.26.###\nHence this label was avoid."
"A 27-year-old individual who is not pregnant presented with low diastolic blood pressure, no triceps skin fold thickness, normal glucose levels after a 2-hour oral GTT, no insulin present, a healthy body mass index, and a moderate diabetes pedigree function score.###\nHence this label was avoid."
"This 25-year-old woman has been pregnant twice and has a diastolic blood pressure of 68. She has a triceps skin fold thickness of 22 and a plasma glucose concentration of 114 after a glucose tolerance test. Her 2-hour serum insulin level is 0. With a body mass index of 28.7 and a low diabetes pedigree function score of 0.092, she appears to be at low risk for developing diabetes.###\nHence this label was avoid."
"This individual is a 24-year-old with low risk of developing diabetes, as indicated by their low diastolic blood pressure, normal glucose concentration, and healthy body mass index. With only one pregnancy and low insulin levels, they appear to have good overall health.###\nHence this label was avoid."
"The patient is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 28. Her plasma glucose concentration after a glucose tolerance test is 155, and her 2-hour serum insulin level is 150. With a body mass index of 33.3 and a diabetes pedigree function value of 1.353, she may be at risk for developing diabetes.###\nHence this label was consent."
"This 21-year-old individual, who has been pregnant once, has a relatively low diastolic blood pressure of 64. Their triceps skin fold thickness is 35, indicating moderate body fat levels. With a plasma glucose concentration of 113 after a glucose tolerance test, their blood sugar levels appear to be within a normal range. Having zero insulin levels after a 2-hour serum test is slightly unusual. However, their body mass index is 33.6, suggesting they may be overweight. The diabetes pedigree function score of 0.543 indicates a moderate likelihood of diabetes based on family history. Overall, this individual's health parameters suggest a need for monitoring and potential lifestyle adjustments to prevent future health complications.###\nHence this label was consent."
"This individual is a 21-year-old female who has been pregnant twice. She has a diastolic blood pressure of 75 mmHg and a triceps skin fold thickness of 32 mm. Her plasma glucose concentration 2 hours after an oral glucose tolerance test is 112 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index (BMI) of 35.7 kg/m² and a diabetes pedigree function of 0.148.###\nHence this label was avoid."
"This individual is a 23-year-old who has been pregnant twice. They have a diastolic blood pressure of 62 and a triceps skin fold thickness of 13. Their plasma glucose concentration after a glucose tolerance test is 68, with a 2-hour serum insulin level of 15. Their body mass index is 20.1 and their diabetes pedigree function is 0.257.###\nHence this label was avoid."
"This data belongs to a 22-year-old individual who is pregnant for the first time and has a diastolic blood pressure of 80. Their triceps skin fold thickness is 11, plasma glucose concentration at 2 hours is 103, and 2-hour serum insulin is 82. The individual has a low body mass index of 19.4 and a diabetes pedigree function value of 0.491.###\nHence this label was avoid."
"The patient is a young adult female, 26 years old, who is in her first pregnancy. She has slightly elevated diastolic blood pressure, high triceps skin fold thickness, and high plasma glucose concentration after a glucose tolerance test. Additionally, she has high insulin levels, a very high body mass index, and a moderately low diabetes pedigree function score. These factors may indicate a higher risk for developing diabetes in the future.###\nHence this label was avoid."
"The patient is a 36-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 82, triceps skin fold thickness of 32, and a plasma glucose concentration of 112 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 175, and she has a body mass index of 34.2. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.26.###\nHence this label was consent."
"A 30-year-old individual who has never been pregnant, with normal diastolic blood pressure, no triceps skin fold thickness, elevated plasma glucose concentration after a glucose tolerance test, no insulin level, slightly elevated body mass index, and a moderate diabetes pedigree function score.###\nHence this label was consent."
"A 28-year-old woman who has been pregnant 4 times with normal diastolic blood pressure and a healthy BMI. She has a low triceps skin fold thickness and very low insulin levels. Her glucose tolerance test result is normal, and her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This is a young adult woman, aged 26, who is pregnant for the first time. She has very low diastolic blood pressure of 38 and a moderate triceps skin fold thickness of 18. Her glucose levels after a meal are within normal range at 109, and her insulin levels are elevated at 120. Despite being pregnant, her body mass index is healthy at 23.1, and her diabetes pedigree function, a measure of diabetes history in relatives, is relatively low at 0.407. Overall, her health indicators suggest a relatively low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 23-year-old woman who has been pregnant 3 times. She has normal diastolic blood pressure, low triceps skin fold thickness, and average plasma glucose concentration. Her insulin level after a glucose tolerance test is also within normal range. She has a healthy body mass index and a moderately low diabetes pedigree function score. Overall, the data suggests that she is at low risk for developing diabetes.###\nHence this label was consent."
"The patient is a 64-year-old individual who has been pregnant 8 times. She has a normal diastolic blood pressure of 78 mmHg. However, she has no triceps skin fold thickness, which may indicate low body fat. Her glucose level after a 2-hour oral glucose tolerance test is 120 mg/dL. Despite having no serum insulin after 2 hours, her body mass index is within the healthy range at 25.0. The diabetes pedigree function, which assesses genetic predisposition for diabetes, is 0.409.###\nHence this label was avoid."
"This individual is a 28-year-old who has been pregnant 6 times. Despite having a very low diastolic blood pressure, triceps skin fold thickness, and serum insulin level, they have a normal plasma glucose concentration. With a healthy body mass index and a low diabetes pedigree function, this person appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 57-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 29. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 196. She also has a 2-hour serum insulin level of 280 and a body mass index of 37.5. Her diabetes pedigree function is 0.605, indicating a potential risk for developing diabetes.###\nHence this label was consent."
"This 34-year-old individual, who has been pregnant 3 times, has a healthy diastolic blood pressure of 78. They have a moderate triceps skin fold thickness of 23, and a normal plasma glucose concentration of 130 after a glucose tolerance test. Their 2-hour serum insulin level is within a healthy range at 79. Additionally, they have a body mass index of 28.4, indicating they are slightly overweight. Their diabetes pedigree function score is 0.323, suggesting a low genetic risk for diabetes.###\nHence this label was consent."
"This is a 32-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 75 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 156. They have no 2-hour serum insulin. With a body mass index of 48.3 and a diabetes pedigree function of 0.238, this individual's risk for developing diabetes may be elevated.###\nHence this label was consent."
"The patient, a 27-year-old woman, has been pregnant twice. She has a low diastolic blood pressure of 70 and a healthy triceps skin fold thickness of 16. Her glucose levels are within the normal range at 99, and her insulin levels are also moderate at 44. With a low body mass index of 20.4 and a low diabetes pedigree function of 0.235, she appears to have a relatively low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"A 27-year-old woman who has been pregnant 6 times with low diastolic blood pressure and a triceps skin fold thickness of 27. Her plasma glucose concentration is normal at 109 after a 2-hour oral glucose tolerance test, with very low 2-hour serum insulin levels. She has a healthy body mass index of 25.0 and a low diabetes pedigree function score of 0.206.###\nHence this label was avoid."
"This is a dataset of a 22-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 43. Her plasma glucose concentration after a glucose tolerance test is 199, with no serum insulin detected after 2 hours. She has a body mass index of 42.9 and a high diabetes pedigree function score of 1.394. These measurements indicate a risk for developing diabetes and suggest the need for monitoring and potentially intervention.###\nHence this label was consent."
"The patient is a 24-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 72, a triceps skin fold thickness of 33, and a plasma glucose concentration of 171 after a glucose tolerance test. Her 2-hour serum insulin level is 135, and her body mass index is 33.3. The diabetes pedigree function, which indicates the likelihood of developing diabetes based on family history, is 0.199. Overall, these measurements suggest a moderate risk for developing diabetes.###\nHence this label was consent."
"A 62-year-old woman who has been pregnant twice has a diastolic blood pressure of 70 mmHg. Her triceps skin fold thickness is unusually high at 99mm. After a 2-hour oral glucose tolerance test, her plasma glucose concentration spiked to 197 mg/dL. Her 2-hour serum insulin level is at 0. Despite this, her body mass index is 34.7, indicating obesity. She has a relatively low diabetes pedigree function score of 0.575.###\nHence this label was consent."
"A young, non-pregnant individual with normal blood pressure and low insulin levels, but with elevated glucose levels and a high body mass index. The individual has a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"A 28-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure and a moderately low triceps skin fold thickness. They have normal plasma glucose levels after a glucose tolerance test, slightly elevated insulin levels, and a healthy body mass index. Their diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 37-year-old female who has been pregnant 10 times. She has a low diastolic blood pressure of 70 and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 179. She has no 2-hour serum insulin levels recorded. With a body mass index of 35.1 and a low diabetes pedigree function of 0.2, this patient may be at risk for developing diabetes.###\nHence this label was avoid."
"This 21-year-old individual, who is pregnant for the first time, has a diastolic blood pressure of 74 and a triceps skin fold thickness of 22. They have a plasma glucose concentration of 143 after a GTT, with a 2-hour serum insulin level of 61. Their body mass index is 26.2 and their diabetes pedigree function is 0.256.###\nHence this label was avoid."
"This individual, a 45-year-old female, has been pregnant 6 times. She has a slightly elevated diastolic blood pressure of 94 mmHg. Her triceps skin fold thickness is 0, indicating lower subcutaneous fat levels. Her plasma glucose concentration after a glucose tolerance test is high at 183 mg/dL, suggesting possible glucose intolerance. She has no serum insulin detected after a 2-hour period. Her body mass index is 40.8, classified as obese. The diabetes pedigree function value is 1.461, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This data represents a 45-year-old individual who has been pregnant 4 times. They have a healthy diastolic blood pressure of 70 and a moderately low triceps skin fold thickness of 18. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 125, and their 2-hour serum insulin level is 122. With a body mass index of 28.9, they are slightly overweight. Their diabetes pedigree function, a measure of diabetes heredity, is 1.144.###\nHence this label was consent."
"This individual is 38 years old and has never been pregnant. Their diastolic blood pressure is 88, triceps skin fold thickness is 30, and plasma glucose concentration after a GTT is 109. They have no 2-hour serum insulin. Their body mass index is 32.5 and their diabetes pedigree function is 0.855.###\nHence this label was consent."
"This data represents a 36-year-old individual who has never been pregnant. They have a healthy diastolic blood pressure of 70 and a moderately thick triceps skin fold of 20. Their glucose tolerance test result is 124, and they have no insulin detected in their system. With a body mass index of 27.4, they have a low risk of diabetes based on their family history with a diabetes pedigree function value of 0.254.###\nHence this label was consent."
"A 70-year-old individual, who has been pregnant 4 times, with normal diastolic blood pressure and no insulin production, shows moderately high plasma glucose concentration, with slightly above average body mass index and a low diabetes pedigree function.###\nHence this label was consent."
"A 39-year-old individual who has been pregnant 10 times shows normal diastolic blood pressure and average triceps skin fold thickness. Their glucose levels after a 2-hour oral test are within normal range, while their insulin levels are slightly elevated. They have a high body mass index and a low diabetes pedigree function score, suggesting a moderate risk of developing diabetes.###\nHence this label was avoid."
"This data is from a 21-year-old individual who is pregnant for the first time. Their diastolic blood pressure is 66, triceps skin fold thickness is 36, plasma glucose concentration after a 2-hour oral glucose tolerance test is 114, and 2-hour serum insulin level is 200. They have a body mass index of 38.1 and a diabetes pedigree function value of 0.289.###\nHence this label was avoid."
"The patient is a 62-year-old woman who has been pregnant once. She has very low diastolic blood pressure of 54, no triceps skin fold thickness, and a moderate plasma glucose concentration of 135 after a GTT. Her 2-hour serum insulin level is zero, and she has a healthy body mass index of 26.7. The diabetes pedigree function score is 0.687, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 25-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 70 mmHg. Her triceps skin fold thickness is minimal at 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 82 mg/dL. She has no detectable serum insulin level after 2 hours. With a body mass index of 21.1, she is within the normal weight range. Her diabetes pedigree function score is 0.389, indicating a low genetic predisposition to diabetes.###\nHence this label was avoid."
"A 29-year-old woman, who has been pregnant twice, with slightly elevated diastolic blood pressure. She has a moderate triceps skin fold thickness and a normal plasma glucose concentration following a glucose tolerance test. Her 2-hour serum insulin level is higher than normal, and she has a high body mass index. Her diabetes pedigree function indicates a low genetic risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 25-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 31 mm. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 193 mg/dL. Her 2-hour serum insulin level is 0 uU/ml. She has a body mass index of 34.9 and a diabetes pedigree function of 0.241.###\nHence this label was consent."
"This data represents a 22-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 84, a triceps skin fold thickness of 33, and a plasma glucose concentration of 173 after a glucose tolerance test. Additionally, their 2-hour serum insulin level is 474, their body mass index is 35.7, and their diabetes pedigree function is 0.258.###\nHence this label was consent."
"This data belongs to a 30-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 64 and a triceps skin fold thickness of 37. Their plasma glucose concentration after a glucose tolerance test is 170, and their 2-hour serum insulin level is 225. With a body mass index of 34.5 and a diabetes pedigree function of 0.356, this individual's risk of developing diabetes may be of concern.###\nHence this label was consent."
"This individual is a 21-year-old who has never been pregnant. They have a diastolic blood pressure of 86 mmHg, triceps skin fold thickness of 27 mm, plasma glucose concentration of 126 mg/dL after a glucose tolerance test, and 2-hour serum insulin level of 120 μU/mL. Their body mass index is 27.4 and they have a diabetes pedigree function value of 0.515.###\nHence this label was avoid."
"A 31-year-old woman, who has been pregnant 7 times, has a normal diastolic blood pressure of 74. Despite having a thin triceps skin fold thickness of 0, her plasma glucose concentration after a 2-hour oral glucose tolerance test is 107, indicating a healthy blood sugar level. She has low 2-hour serum insulin levels at 0 and a moderate body mass index of 29.6. Her diabetes pedigree function score is low at 0.254, suggesting a relatively low risk of developing diabetes.###\nHence this label was consent."
"This data pertains to a 41-year-old individual who has been pregnant 5 times. They have a low diastolic blood pressure of 66, no triceps skin fold thickness, and a relatively normal plasma glucose concentration of 112 after a glucose tolerance test. Their 2-hour serum insulin level is zero, indicating potential concerns. Despite their slightly high body mass index of 37.8, their diabetes pedigree function is low at 0.261.###\nHence this label was consent."
"The individual in this dataset is a 49-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 78 mmHg, a triceps skin fold thickness of 31 mm, and a plasma glucose concentration of 125 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0 µU/mL, and she has a body mass index of 27.6. Additionally, her diabetes pedigree function is 0.565.###\nHence this label was consent."
"A 27-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure. They have average triceps skin fold thickness and a slightly elevated plasma glucose concentration after a glucose tolerance test. Additionally, they have high serum insulin levels, indicating possible insulin resistance. Their body mass index suggests they are overweight, and their diabetes pedigree function score indicates a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"This individual is a 25-year-old who has never been pregnant. They have a low diastolic blood pressure of 60 and a very low triceps skin fold thickness of 0. Their glucose level after a glucose tolerance test is 93, and they have no insulin present after a 2-hour serum test. Despite having a high body mass index of 35.3, their diabetes pedigree function is relatively low at 0.263.###\nHence this label was avoid."
"This 22-year-old individual has been pregnant 3 times and shows normal diastolic blood pressure. They have a relatively low triceps skin fold thickness and a below average plasma glucose concentration after a glucose tolerance test. Their 2-hour serum insulin level is moderate and their body mass index falls within the healthy range. Additionally, their diabetes pedigree function score indicates a relatively low genetic risk for diabetes.###\nHence this label was avoid."
"A 21-year-old individual who has been pregnant twice with low diastolic blood pressure, no triceps skin fold thickness, and normal plasma glucose concentration after a 2-hour oral glucose tolerance test. They have no serum insulin present, a high body mass index of 30.8, and a low diabetes pedigree function of 0.158.###\nHence this label was avoid."
"This individual is 39 years old and has been pregnant 8 times. Their diastolic blood pressure is at a normal level of 74. They have a triceps skin fold thickness of 31, indicating a moderate amount of subcutaneous fat. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 84, which is within the normal range. Their 2-hour serum insulin level is 0, suggesting that their body is efficiently metabolizing glucose. With a body mass index of 38.3, they are considered obese. The diabetes pedigree function value of 0.457 indicates a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This is a young adult woman who is 23 years old and pregnant for the first time. She has a healthy diastolic blood pressure of 64 and a normal triceps skin fold thickness of 13. Her glucose level after a 2-hour oral glucose tolerance test is low at 82. She has high insulin levels at 95, indicating possible insulin resistance. Despite being pregnant, she has a low body mass index of 21.2. Her diabetes pedigree function is low at 0.415, suggesting a low inherited risk of diabetes.###\nHence this label was avoid."
"A 24-year-old individual, who has been pregnant 6 times, with a diastolic blood pressure of 64. They have a triceps skin fold thickness of 39, plasma glucose concentration of 111, and 0 insulin level after a glucose tolerance test. Their body mass index is 34.2 and they have a low diabetes pedigree function of 0.26.###\nHence this label was avoid."
"This is a dataset of a 21-year-old individual who is 1 time pregnant with normal blood pressure and skin fold thickness. Their glucose concentration after a meal is within a healthy range, and they have no insulin in their blood. Their body mass index indicates they are slightly overweight, and their diabetes pedigree function score is low.###\nHence this label was avoid."
"The individual in the dataset is a 40-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 60 and a triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115, with a 2-hour serum insulin level of 0. She has a body mass index of 33.7 and a diabetes pedigree function of 0.245.###\nHence this label was consent."
"The patient is a 42-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 84, a triceps skin fold thickness of 35, and a body mass index of 28.3. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 136, and her 2-hour serum insulin level is 130. Additionally, her diabetes pedigree function is 0.26.###\nHence this label was consent."
"This data describes a 21-year-old individual who is pregnant for the first time. They have a low diastolic blood pressure of 58 and a normal triceps skin fold thickness of 10. Their glucose levels after a 2-hour GTT are within a healthy range at 99. The individual has no serum insulin after 2 hours, indicating normal insulin levels. Their body mass index is 25.4, which is considered to be in the overweight range. The diabetes pedigree function, a measure of diabetes history in relatives, is low at 0.551. Overall, this individual's diagnostic measurements suggest a relatively low risk of developing diabetes.###\nHence this label was avoid."
"A 42-year-old woman with a history of 8 pregnancies shows normal diastolic blood pressure and low triceps skinfold thickness. Her glucose concentration after a 2-hour oral glucose tolerance test is low, and she has no insulin in her serum. Despite a slightly elevated body mass index, her diabetes pedigree function is low.###\nHence this label was avoid."
"The person in the data is a 48-year-old who has been pregnant 7 times. They have a normal diastolic blood pressure of 92 and a low triceps skin fold thickness of 18. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 106. They have a very low 2-hour serum insulin level of 0. Their body mass index is within the healthy range at 22.7. The diabetes pedigree function score is low at 0.235, indicating a lower risk of developing diabetes based on their family history.###\nHence this label was avoid."
"This 23-year-old individual, who has been pregnant once, has a relatively low diastolic blood pressure of 58. Their triceps skin fold thickness is 36, indicating a moderate amount of subcutaneous fat. With a plasma glucose concentration of 118, they are within a normal range after a glucose tolerance test. Their insulin levels after 2 hours are 94, which is considered healthy. Despite having a body mass index of 33.3, which is in the overweight range, their diabetes pedigree function value is low at 0.261, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 37-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is at a normal level of 130, while her insulin level after 2 hours is 0. She has a high body mass index of 39.1 and a moderately high diabetes pedigree function score of 0.956.###\nHence this label was consent."
"The patient is a 22-year-old who has never been pregnant. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 26 mm. Her glucose level after a 2-hour oral glucose tolerance test is 141 mg/dL, and she has a fasting insulin level of 0 uU/mL. Her body mass index is 32.4, and her diabetes pedigree function score is 0.433.###\nHence this label was avoid."
"This patient is a 24-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 21 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 157 mg/dL, and her 2-hour serum insulin level is 168 μU/mL. With a body mass index of 25.6, she has a low risk of developing diabetes as indicated by a diabetes pedigree function of 0.123.###\nHence this label was avoid."
"The patient is a 34-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 15, and a body mass index of 32.0. Her plasma glucose concentration 2 hours after a glucose tolerance test is 123, and her 2-hour serum insulin level is 176. The diabetes pedigree function for this patient is 0.443. Overall, these measurements indicate a moderate risk for developing diabetes.###\nHence this label was avoid."
"This 26-year-old individual, who has been pregnant 3 times, has a low diastolic blood pressure of 50. They have a triceps skin fold thickness of 32, a relatively low plasma glucose concentration of 78, and a 2-hour serum insulin level of 88. With a body mass index of 31.0 and a diabetes pedigree function of 0.248, this person appears to have a moderately low risk of developing diabetes.###\nHence this label was consent."
"A 29-year-old female who has never been pregnant is showing normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within normal range. She has no insulin levels after 2 hours, indicating good glucose utilization. Her body mass index is in the overweight range. She has a moderate diabetes pedigree function score, suggesting a possible genetic predisposition to diabetes.###\nHence this label was avoid."
"A 28-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 98. They have no triceps skin fold thickness, a plasma glucose concentration of 115 after a glucose tolerance test, and their 2-hour serum insulin level is 0. Their body mass index is high at 52.9, and they have a relatively low diabetes pedigree function score of 0.209.###\nHence this label was consent."
"A 33-year-old woman who has been pregnant 8 times has a diastolic blood pressure of 70. She has no triceps skin fold thickness and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 108. Her 2-hour serum insulin level is 0, and her body mass index is 30.5. Her diabetes pedigree function is 0.955.###\nHence this label was consent."
"This patient is a 59-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 60, a triceps skin fold thickness of 23, and a plasma glucose concentration of 189 after a 2-hour oral glucose tolerance test. Additionally, her 2-hour serum insulin level is high at 846. She has a body mass index of 30.1 and a relatively low diabetes pedigree function score of 0.398.###\nHence this label was consent."
"This is a case of a young woman, aged 22, who has never been pregnant. Her diastolic blood pressure is normal at 68, and she has a healthy body mass index of 20.0. Despite having a low triceps skin fold thickness of 22, her plasma glucose concentration during an oral glucose tolerance test is within the healthy range at 105. Additionally, her 2-hour serum insulin level is low at 0, and her diabetes pedigree function score is low at 0.236. Overall, based on these diagnostic measurements, she appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"This data belongs to a 21-year-old individual who is pregnant for the first time. Their diastolic blood pressure is 66, triceps skin fold thickness is 23, plasma glucose concentration after a glucose tolerance test is 89, 2-hour serum insulin level is 94, body mass index is 28.1, and diabetes pedigree function is 0.167.###\nHence this label was avoid."
"This data belongs to a 33-year-old individual who has been pregnant 9 times. She has a diastolic blood pressure of 62, triceps skin fold thickness of 0, fasting plasma glucose level of 89, 2-hour serum insulin level of 0, and a body mass index of 22.5. The diabetes pedigree function is 0.142.###\nHence this label was avoid."
"The patient is a 28-year-old woman who is pregnant for the first time and has a diastolic blood pressure of 82. She has no triceps skin fold thickness and a plasma glucose concentration of 138 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 40.1. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.236.###\nHence this label was avoid."
"The patient is a 55-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 33, and a plasma glucose concentration of 195 following an oral glucose tolerance test. Her 2-hour serum insulin level is 145, and she has a body mass index of 25.1. Her diabetes pedigree function is 0.163.###\nHence this label was consent."
"This 28-year-old individual, who has been pregnant once, has a diastolic blood pressure of 82. Their triceps skin fold thickness is 40, and their plasma glucose concentration after a glucose tolerance test is 144. They have no insulin in their blood after 2 hours. With a body mass index of 41.3, and a diabetes pedigree function of 0.607, this person's risk for developing diabetes may need to be monitored closely.###\nHence this label was avoid."
"A 25-year-old woman who has been pregnant twice shows normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness is slightly above average, yet she has low plasma glucose levels and a moderate level of insulin in her body. With a low diabetes pedigree function score, she appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 21-year-old who has never been pregnant. They have normal diastolic blood pressure, higher triceps skin fold thickness, and high plasma glucose concentration after a glucose tolerance test. They have no insulin level measured after 2 hours, with a high body mass index. Their diabetes pedigree function is low, suggesting a lower genetic risk for diabetes.###\nHence this label was consent."
"The data belongs to a 21-year-old individual who has been pregnant twice. She has a healthy diastolic blood pressure of 62, a moderate triceps skin fold thickness of 32, and a normal plasma glucose concentration of 108 after a GTT. Her 2-hour serum insulin level is 56, and her body mass index is within the healthy range at 25.2. The diabetes pedigree function score is low at 0.128, indicating a low genetic risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 24-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 32, and a plasma glucose concentration of 95 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 32.1. The diabetes pedigree function score for this patient is 0.612.###\nHence this label was avoid."
"The patient is a 58-year-old who has never been pregnant. She has a diastolic blood pressure of 78, triceps skin fold thickness of 32, and a high plasma glucose concentration of 173 after a glucose tolerance test. Additionally, she has a high 2-hour serum insulin level of 265, a body mass index of 46.5, and a diabetes pedigree function of 1.159. These factors indicate a high risk for developing diabetes.###\nHence this label was avoid."
"A 54-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 78, triceps skin fold thickness of 29, plasma glucose concentration of 150, 2-hour serum insulin level of 126, and a body mass index of 35.2. Their diabetes pedigree function is 0.692.###\nHence this label was consent."
"This 22-year-old individual has been pregnant 3 times and shows no diastolic blood pressure, triceps skin fold thickness, or serum insulin. Their plasma glucose concentration after a glucose tolerance test is 80, body mass index is 0.0, and diabetes pedigree function is 0.174.###\nHence this label was avoid."
"This individual is a 58-year-old female who has been pregnant 12 times. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 43 mm. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 140 mg/dL. Her 2-hour serum insulin level is high at 325 μU/mL. She has a body mass index of 39.2, indicating obesity. The diabetes pedigree function score is 0.528, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 22-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 66, triceps skin fold thickness of 15, and a plasma glucose concentration of 97 after a glucose tolerance test. Her 2-hour serum insulin level is high at 140, and her body mass index is within the normal range at 23.2. The diabetes pedigree function, which assesses the risk of diabetes based on family history, is 0.487, indicating a moderate genetic predisposition to the condition.###\nHence this label was avoid."
"This individual is a 31-year-old woman who has been pregnant four times. Her diastolic blood pressure is 78, and her triceps skin fold thickness is 0. She has a plasma glucose concentration of 158 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 32.9. The diabetes pedigree function for this individual is 0.803.###\nHence this label was consent."
"The patient is a 39-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 38, and a plasma glucose concentration of 126 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 75, and her body mass index is 25.9. Additionally, she has a low diabetes pedigree function score of 0.162.###\nHence this label was avoid."
"This 47-year-old individual has been pregnant 7 times and has a diastolic blood pressure of 86. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 161 after a GTT, and a 2-hour serum insulin level of 0. With a body mass index of 30.4 and a diabetes pedigree function of 0.165, this person's risk for developing diabetes may be influenced by these factors.###\nHence this label was consent."
"A 23-year-old woman who is pregnant for the first time, with slightly elevated diastolic blood pressure and above average triceps skin fold thickness. She had high plasma glucose concentration and very high insulin levels 2 hours after a glucose tolerance test. Her body mass index indicates obesity, while her diabetes pedigree function suggests a moderate genetic risk for developing diabetes.###\nHence this label was avoid."
"A 41-year-old woman who has been pregnant 7 times has a diastolic blood pressure of 64. Her triceps skin fold thickness is 25mm. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 94. Her 2-hour serum insulin level is 79. She has a body mass index of 33.3 and a diabetes pedigree function value of 0.738.###\nHence this label was avoid."
"This data is from a 23-year-old individual who has been pregnant 4 times and shows no signs of diastolic blood pressure, triceps skin fold thickness, or serum insulin. The individual has a plasma glucose concentration of 132, a body mass index of 32.9, and a diabetes pedigree function value of 0.302.###\nHence this label was consent."
"The data represents a 23-year-old individual with a low risk of developing diabetes. She is young and has only been pregnant once. Her blood pressure is lower than average at 54, and her triceps skin fold thickness is normal at 25. Her glucose levels after a glucose tolerance test are within a healthy range at 91, and she has a moderate level of insulin at 100. Her body mass index is normal at 25.2, indicating a healthy weight. Additionally, her diabetes pedigree function score is low at 0.234, suggesting a lower genetic risk for diabetes. Overall, based on these measurements, the individual is at a low risk for developing diabetes.###\nHence this label was avoid."
"A 22-year-old female, who is pregnant for the first time, has a diastolic blood pressure of 78. She has a triceps skin fold thickness of 42, a high plasma glucose concentration of 181 after a glucose tolerance test, and a 2-hour serum insulin level of 293. With a body mass index of 40.0 and a diabetes pedigree function of 1.258, she may have an increased risk of developing diabetes.###\nHence this label was consent."
"This is a data entry for a 22-year-old individual who has never been pregnant. Their diastolic blood pressure is 66, triceps skin fold thickness is 27, and plasma glucose concentration at 2 hours in an oral glucose tolerance test is 119. Their 2-hour serum insulin level is 0, body mass index is 38.8, and diabetes pedigree function value is 0.259.###\nHence this label was avoid."
"This individual is 33 years old and has been pregnant 9 times. They have a low diastolic blood pressure of 56 and no triceps skin fold thickness. Their plasma glucose concentration during an oral glucose tolerance test is 122. They have no 2-hour serum insulin. With a body mass index of 33.3, they have a high risk of developing diabetes, indicated by a diabetes pedigree function of 1.114.###\nHence this label was consent."
"This patient is a 22-year-old female who has been pregnant 2 times. She has a diastolic blood pressure of 62, a triceps skin fold thickness of 10, and a plasma glucose concentration of 108 after a glucose tolerance test. Her 2-hour serum insulin level is 278, and her body mass index is 25.3. She also has a diabetes pedigree function value of 0.881.###\nHence this label was avoid."
"This 24-year-old individual has been pregnant 3 times and shows low diastolic blood pressure of 58. Their triceps skin fold thickness is 0, indicating low body fat. They have a normal plasma glucose concentration of 125 after a glucose tolerance test. The 2-hour serum insulin level is 0, and their body mass index is 31.6, indicating they are overweight. The diabetes pedigree function score is low at 0.151, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"This 38-year-old patient has been pregnant 5 times and shows normal diastolic blood pressure. They have no triceps skin fold thickness, no serum insulin, and a healthy plasma glucose concentration of 117. Despite having a slightly elevated body mass index of 34.1, their risk of diabetes is relatively low based on the diabetes pedigree function of 0.337.###\nHence this label was avoid."
"This 57-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 74. They have a triceps skin fold thickness of 0, which is unusual. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 114. They have a 2-hour serum insulin level of 0, which is noteworthy. With a body mass index of 24.9 and a diabetes pedigree function of 0.744, this individual's risk of developing diabetes may be relatively low.###\nHence this label was avoid."
"This individual is 30 years old, has been pregnant 10 times, and has a diastolic blood pressure of 0. Despite having a low triceps skin fold thickness of 0, their plasma glucose concentration after a 2-hour oral glucose tolerance test is 115. They have a 2-hour serum insulin level of 0, a body mass index of 0.0, and a diabetes pedigree function value of 0.261.###\nHence this label was consent."
"A 25-year-old individual who has been pregnant once is being evaluated for diabetes risk. They have a healthy diastolic blood pressure of 70 and a normal body mass index of 24.3. Their triceps skin fold thickness is 24, indicating moderate body fat levels. During a glucose tolerance test, their plasma glucose concentration was 125, within the normal range, and their 2-hour serum insulin level was 110. The individual has a low diabetes pedigree function score of 0.221, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 24-year-old who has never been pregnant. \nShe has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0.\nHer plasma glucose concentration after a glucose tolerance test is 119 mg/dL.\nShe has a body mass index of 32.4 and a low diabetes pedigree function score of 0.141.\nOverall, the patient seems to have relatively normal values for most indicators, except for a slightly elevated body mass index.###\nHence this label was consent."
"The patient is a young adult female, aged 21. She is pregnant for the first time. Her diastolic blood pressure is normal at 64. The triceps skin fold thickness measurement indicates a healthy level of body fat. Her plasma glucose concentration after a glucose tolerance test is within the normal range at 97. The 2-hour serum insulin level is also within the normal range. Her body mass index is low at 18.2, suggesting a lean physique. The diabetes pedigree function value is relatively low at 0.299, indicating a lower genetic risk for diabetes. Overall, based on these measurements, the patient appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"This is a 22-year-old patient who has been pregnant twice. The patient has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. Their plasma glucose concentration after a glucose tolerance test is 74. The patient has a body mass index of 0.0 and a low diabetes pedigree function score of 0.102.###\nHence this label was avoid."
"A 60-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 75, a triceps skin fold thickness of 26, a plasma glucose concentration at 109 following a glucose tolerance test, no 2-hour serum insulin detected, a body mass index of 36.0, and a diabetes pedigree function value of 0.546.###\nHence this label was avoid."
"This is a 25-year-old individual who has been pregnant 3 times and shows a diastolic blood pressure of 50. Their triceps skin fold thickness is 10, plasma glucose concentration after a glucose tolerance test is 113, and 2-hour serum insulin is 85. With a body mass index of 29.5 and a diabetes pedigree function of 0.626, this individual's overall risk for developing diabetes appears to be fairly low based on these measurements.###\nHence this label was avoid."
"The patient is a 21-year-old who has never been pregnant. She has a healthy diastolic blood pressure of 64 and a moderate triceps skin fold thickness of 46. Her glucose levels are normal at 102, and her insulin levels are slightly elevated at 78. With a body mass index of 40.6, she is considered obese. Her diabetes pedigree function is low at 0.496, indicating a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"The patient is a young adult female who has been pregnant twice. She has low diastolic blood pressure and no triceps skin fold thickness. Her glucose levels are within normal range, as well as her insulin levels. She has a healthy body mass index and a low diabetes risk based on her pedigree function score.###\nHence this label was avoid."
"A 22-year-old individual, who has been pregnant 2 times, with low diastolic blood pressure of 56 mmHg, triceps skinfold thickness of 28 mm, and a plasma glucose concentration of 56 mg/dl after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 45 μU/ml, and they have a body mass index of 24.2. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.332.###\nHence this label was avoid."
"This patient is a 54-year-old female who has been pregnant twice. She has a diastolic blood pressure of 92, no triceps skin fold thickness, and a plasma glucose concentration of 109 after a glucose tolerance test. Her 2-hour serum insulin level is 0, but she has a high body mass index of 42.7. The diabetes pedigree function indicates a moderate genetic predisposition towards diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 7 times. She has a healthy diastolic blood pressure of 66 and a moderate triceps skin fold thickness of 32. Her plasma glucose concentration is 103 after a 2-hour oral glucose tolerance test, and she has no insulin present in her serum. She has a high body mass index of 39.1 and a relatively low diabetes pedigree function score of 0.344.###\nHence this label was consent."
"This individual is a 23-year-old who has never been pregnant. They have a diastolic blood pressure of 80, a triceps skin fold thickness of 37, and a body mass index of 36.3. Their plasma glucose concentration after a glucose tolerance test is 127, and their 2-hour serum insulin level is 210. The diabetes pedigree function value for this individual is 0.804. Based on these measurements, this person may be at risk for developing diabetes.###\nHence this label was avoid."
"This individual is a 21-year-old who has been pregnant twice. They have a low diastolic blood pressure of 50 and a normal triceps skin fold thickness of 23. Their plasma glucose concentration after a 2-hour glucose tolerance test is 84, and their 2-hour serum insulin level is 76. With a body mass index of 30.4, they are considered overweight. Their diabetes pedigree function is 0.968, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 24-year-old female who has been pregnant twice. She has a diastolic blood pressure of 80, triceps skin fold thickness of 14, and a plasma glucose concentration of 90 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 55, and her body mass index is 24.4. The patient has a low diabetes pedigree function score of 0.249.###\nHence this label was avoid."
"The patient is a 59-year-old woman who has never been pregnant. She has normal diastolic blood pressure, a moderate triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a glucose tolerance test. Her insulin levels are low, and her body mass index indicates that she is slightly overweight. The diabetes pedigree function score suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 4 times. She has normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within normal range at 90 mg/dL. She has no detectable insulin levels after a 2-hour serum test. Her body mass index is 28.0, indicating that she is slightly overweight. The patient has a moderate diabetes pedigree function score of 0.61, suggesting a family history of diabetes.###\nHence this label was avoid."
"A 33-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 64. Their triceps skin fold thickness is 24, and their plasma glucose concentration at 2 hours in an oral glucose tolerance test is 75. The 2-hour serum insulin level is 55, and their body mass index is 29.7. Additionally, they have a diabetes pedigree function score of 0.37.###\nHence this label was avoid."
"This is a 27-year-old individual who has been pregnant 3 times. Their diastolic blood pressure is 72, triceps skin fold thickness is 30, and plasma glucose concentration after a glucose tolerance test is 103. Their 2-hour serum insulin level is 152 and body mass index is 27.6. They have a diabetes pedigree function of 0.73.###\nHence this label was avoid."
"This patient is a 28-year-old female who has been pregnant twice. She has a diastolic blood pressure reading of 0, triceps skin fold thickness of 0, and 2-hour serum insulin level of 0. However, her plasma glucose concentration after a glucose tolerance test is 146, and her body mass index is 27.5. The diabetes pedigree function for this patient is 0.24.###\nHence this label was consent."
"This is a young adult woman, aged 29, who is pregnant for the first time. She has a low diastolic blood pressure of 50 and moderate triceps skin fold thickness of 19. Her glucose levels are within normal range at 107, and she has no insulin present in her serum. With a body mass index of 28.3, she is considered overweight. Her diabetes pedigree function is low at 0.181, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 22-year-old individual who has never been pregnant shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Their blood glucose levels after a glucose tolerance test are within normal range, but their insulin levels are higher than usual. They have a slightly elevated body mass index and a low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 35-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 74, triceps skin fold thickness of 29, and a plasma glucose concentration of 116 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 32.3. The diabetes pedigree function value is 0.66.###\nHence this label was consent."
"This patient is a 22-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 52, no triceps skin fold thickness, and a normal plasma glucose concentration of 92 after a glucose tolerance test. Her 2-hour serum insulin level is at 0, indicating no insulin production at this time. Despite having a body mass index of 30.1, she has a low-risk diabetes pedigree function of 0.141.###\nHence this label was avoid."
"The patient is a 46-year-old woman who has never been pregnant. She has normal diastolic blood pressure of 90 mmHg and no skin fold thickness. Her glucose level after a 2-hour oral glucose tolerance test is 105 mg/dL, and her insulin level is normal. She has a body mass index of 29.6, indicating she is overweight but not obese. Her diabetes pedigree function is 0.197, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 45-year-old woman who has been pregnant 9 times. She has normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 130, with no insulin detected after 2 hours. She has a high body mass index of 34.2 and a moderate diabetes pedigree function score of 0.652.###\nHence this label was consent."
"This data describes a 52-year-old individual who is pregnant for the first time, with a diastolic blood pressure of 88. They have a triceps skin fold thickness of 29mm and a plasma glucose concentration of 168mg/dL after a glucose tolerance test. Their 2-hour serum insulin level is 0, indicating potential concern. They have a body mass index of 35.0, suggesting they may be overweight. The diabetes pedigree function is 0.905, indicating a moderate genetic risk for diabetes.###\nHence this label was consent."
"The patient is a young adult female, 21 years old, who is pregnant for the first time. She has very low diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration is at a normal level after a 2-hour oral glucose tolerance test. The patient shows no insulin level after 2 hours. She has a low body mass index and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"This individual is a 22-year-old who has never been pregnant. She has a normal diastolic blood pressure of 64, with a slightly higher triceps skin fold thickness of 37. Her plasma glucose concentration after a glucose tolerance test is 104, and her 2-hour serum insulin level is also within normal range at 64. Despite having a body mass index of 33.6, indicating overweight, her diabetes pedigree function is low at 0.51, suggesting a lower genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 24-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 54 mmHg and a slightly below average triceps skin fold thickness of 28 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range at 100 mg/dL. She has a moderately elevated 2-hour serum insulin level of 105 μU/mL. Despite being overweight with a body mass index of 37.8, her diabetes pedigree function is relatively low at 0.498.###\nHence this label was avoid."
"A 24-year-old individual who has been pregnant 4 times and shows normal diastolic blood pressure, no triceps skin fold thickness, and a moderate plasma glucose concentration after a glucose test. They have low insulin levels, a healthy body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"The data describes a 37-year-old individual who has been pregnant four times. They have a diastolic blood pressure of 72, triceps skin fold thickness of 29, plasma glucose concentration of 154, 2-hour serum insulin of 126, body mass index of 31.3, and a diabetes pedigree function of 0.338.###\nHence this label was avoid."
"This patient is 40 years old and has been pregnant 3 times. They have a low diastolic blood pressure of 78 and no triceps skin fold thickness. Their plasma glucose concentration after a GTT is 122, with no serum insulin present. The patient has a healthy body mass index of 23.0 and a low diabetes pedigree function of 0.254.###\nHence this label was avoid."
"A 30-year-old individual who has been pregnant 5 times with low diastolic blood pressure (54) and average triceps skin fold thickness (28). Their glucose levels are normal (99), insulin levels are slightly elevated (83), and they have a moderate body mass index of 34.0. Their diabetes pedigree function is low at 0.499.###\nHence this label was avoid."
"A 42-year-old woman, who has been pregnant once, shows a relatively low diastolic blood pressure of 66 mmHg. She has a triceps skin fold thickness of 29 mm, a plasma glucose concentration of 100 mg/dL from a glucose tolerance test, and a high 2-hour serum insulin level of 196 μU/mL. With a body mass index of 32.0, she has a moderate diabetes pedigree function of 0.444.###\nHence this label was avoid."
"A 24-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure and slightly below average triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is lower than normal, and she has moderate insulin levels. She has a BMI indicating overweight, and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 27-year-old woman, who is pregnant for the first time, has a diastolic blood pressure of 94 mmHg. She has a triceps skin fold thickness of 41 mm and her plasma glucose concentration 2 hours after an oral glucose tolerance test is 147 mg/dL. Her 2-hour serum insulin level is 0 µU/ml. With a body mass index of 49.3, she has a relatively low diabetes pedigree function of 0.358.###\nHence this label was consent."
"This patient is a 26-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. Her plasma glucose concentration at 2 hours is 114. Additionally, her body mass index is 0.0 and she has a diabetes pedigree function value of 0.189.###\nHence this label was avoid."
"A 46-year-old individual who has been pregnant 8 times with a diastolic blood pressure of 72. They have a triceps skin fold thickness of 19 and a plasma glucose concentration of 118 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, with a body mass index of 23.1 and a diabetes pedigree function of 1.476.###\nHence this label was avoid."
"A 21-year-old individual who has been pregnant twice shows normal diastolic blood pressure and moderately high triceps skin fold thickness. Their blood glucose levels after a glucose tolerance test were within the healthy range, but they had elevated insulin levels. Despite having a high body mass index, their diabetes pedigree function indicates a relatively low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 22-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 27 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 87 mg/dL, and her 2-hour serum insulin level is 32 mU/L. With a body mass index of 34.6 and a low diabetes pedigree function of 0.101, she is at a relatively low risk of developing diabetes.###\nHence this label was avoid."
"The patient is 29 years old and has been pregnant 4 times. They have a low diastolic blood pressure of 66 and no triceps skin fold thickness. Their plasma glucose concentration is normal at 110, with no serum insulin present. Despite a slightly elevated body mass index of 31.9, the patient has a relatively low diabetes pedigree function of 0.471.###\nHence this label was avoid."
"The patient is a 53-year-old woman who has been pregnant 9 times. She has normal diastolic blood pressure (86) and a healthy body mass index (24.8). However, she has a low triceps skin fold thickness and 2-hour serum insulin level. Her plasma glucose concentration after a glucose tolerance test is 156, indicating a risk for diabetes. Additionally, her diabetes pedigree function is relatively low at 0.23. Overall, this data suggests that the patient may have a heightened risk for developing diabetes.###\nHence this label was consent."
"This individual is 52 years old and has never been pregnant. They have a normal diastolic blood pressure of 72 and a low triceps skin fold thickness. Their glucose level after a glucose tolerance test is 123, with no insulin detected at the 2-hour mark. They have a high body mass index of 36.3 and a relatively low diabetes pedigree function score of 0.258.###\nHence this label was consent."
"This 21-year-old individual, who has been pregnant once, has a below-average diastolic blood pressure of 58 and a minimal triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is within normal range at 105. Despite having no insulin present in their 2-hour serum, their body mass index is healthy at 24.3. Additionally, their diabetes pedigree function is relatively low at 0.187, indicating a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 25-year-old who has been pregnant 3 times. She has a healthy diastolic blood pressure of 62 and a moderate triceps skin fold thickness of 24. Her glucose tolerance test results are normal at 108, and she has low insulin levels. With a body mass index of 26.0 and a low diabetes pedigree function of 0.223, she is at a low risk of developing diabetes.###\nHence this label was avoid."
"A 30-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 92 and triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 110, with 2-hour serum insulin level at 0. They have a body mass index of 37.6 and a diabetes pedigree function of 0.191.###\nHence this label was avoid."
"This data belongs to a 24-year-old individual who has never been pregnant. They have a diastolic blood pressure of 84, a triceps skin fold thickness of 29, and a body mass index of 30.7, indicating they may be overweight. During a glucose tolerance test, their plasma glucose concentration at 2 hours was 126, and their 2-hour serum insulin level was high at 215. Their diabetes pedigree function score is 0.52, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 23-year-old woman, who is pregnant for the first time, has normal diastolic blood pressure and a slightly low triceps skin fold thickness. Her glucose levels after a 2-hour GTT are within the normal range. She has no insulin present in her serum. Despite a slightly elevated body mass index, her diabetes pedigree function is relatively low, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 22-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, but a low triceps skin fold thickness. Her glucose levels after a GTT are below the normal range, and she has low insulin levels. Despite this, her body mass index is elevated. The diabetes pedigree function score indicates a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a young adult (25 years old) who has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and zero insulin levels. Their glucose level after a glucose tolerance test is low (73), and they have a low body mass index (21.1). The patient has a moderately low diabetes pedigree function (0.342).###\nHence this label was avoid."
"This individual is a 21-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 78 mmHg and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 90 mg/dL, and she has no detectable 2-hour serum insulin. Her body mass index is 42.7, indicating obesity. The diabetes pedigree function, a measure of diabetes prevalence in relatives, is 0.559, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 50-year-old individual who is mildly overweight with a body mass index of 32.8. They have had one pregnancy and have a slightly elevated diastolic blood pressure of 82. Their triceps skin fold thickness is above average at 43, indicating some excess body fat. The patient's plasma glucose concentration after a glucose tolerance test is high at 164, suggesting potential issues with blood sugar regulation. Their 2-hour serum insulin level is normal at 67. Overall, the patient has a modest diabetes pedigree function score of 0.341, indicating a low to moderate genetic risk for diabetes.###\nHence this label was avoid."
"A 21-year-old woman who has been pregnant twice shows lower than normal diastolic blood pressure and slightly below average triceps skin fold thickness. Her blood glucose levels after a glucose tolerance test are within the normal range, while her insulin levels are slightly elevated. She maintains a healthy body mass index and has a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 22-year-old female who is pregnant for the first time. She has a healthy diastolic blood pressure of 74 and a low triceps skin fold thickness of 11. Her plasma glucose concentration after a glucose tolerance test is within normal range at 80, and she has a slightly elevated 2-hour serum insulin level of 60. With a body mass index of 30.0, she is considered overweight. Her diabetes pedigree function score is 0.527, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 41-year-old woman who has been pregnant 6 times shows normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness and plasma glucose concentration are within normal ranges. However, her 2-hour serum insulin levels are high, indicating a potential risk for developing diabetes.###\nHence this label was consent."
"A 25-year-old woman who is 3 times pregnant has a low diastolic blood pressure of 58 and a relatively low triceps skin fold thickness of 31. Her glucose levels after a 2-hour oral test are 83, and her insulin levels are at 18. With a body mass index of 34.3, she has a relatively low diabetes pedigree function of 0.336.###\nHence this label was avoid."
"This is a dataset of a 21-year-old individual who has never been pregnant. She has a normal diastolic blood pressure of 70 and a moderately low triceps skin fold thickness of 27. Her glucose tolerance test result is 94, indicating normal blood sugar levels. However, her insulin level at 2 hours is relatively high at 115. She has a high body mass index of 43.5 and a low diabetes pedigree function of 0.347.###\nHence this label was avoid."
"A non-pregnant, 25-year-old individual with a healthy diastolic blood pressure, high triceps skin fold thickness, moderate glucose level after a meal, elevated serum insulin level, high body mass index, and a moderately low diabetes pedigree function score. This person may have some risk factors for diabetes due to the combination of these measurements.###\nHence this label was avoid."
"The patient is a 33-year-old female who has been pregnant 6 times. She has a very low diastolic blood pressure of 50 mmHg. Her triceps skin fold thickness is 22 mm. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 119 mg/dL. She has a high 2-hour serum insulin level of 176 μU/mL. Her body mass index is 27.1, indicating she is overweight. The diabetes pedigree function score is 1.318, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"A 21-year-old woman, who is pregnant for the first time, has a healthy diastolic blood pressure of 78. She has a normal triceps skin fold thickness of 50mm and a below-average plasma glucose concentration of 71 after a glucose tolerance test. Her 2-hour serum insulin level is 45, indicating normal insulin function. With a body mass index of 33.2, she is considered overweight. Her diabetes pedigree function score is low at 0.422, suggesting a low genetic risk for diabetes. Overall, she appears to be at a relatively low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"The patient is a 31-year-old woman who has never been pregnant. She has a diastolic blood pressure of 84, triceps skin fold thickness of 47, and a plasma glucose concentration of 118 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is high at 230, and she has a body mass index of 45.8. The diabetes pedigree function indicates a low genetic risk of diabetes at 0.551.###\nHence this label was consent."
"The individual in this dataset is a 65-year-old who has been pregnant 5 times. Their diastolic blood pressure is 78 mmHg, triceps skin fold thickness is 0 mm, and plasma glucose concentration after a 2-hour oral glucose tolerance test is 147 mg/dL. They have no insulin detected in their 2-hour serum. Their body mass index is 33.7, and their diabetes pedigree function is 0.218.###\nHence this label was avoid."
"This individual, aged 58, has been pregnant 8 times. They have a low diastolic blood pressure of 72 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 112, with a 2-hour serum insulin level of 0. They have a healthy body mass index of 23.6 and a relatively low diabetes pedigree function score of 0.84.###\nHence this label was avoid."
"The patient is a 43-year-old woman who has been pregnant 15 times. She has a diastolic blood pressure of 70, triceps skin fold thickness of 32, plasma glucose concentration of 136 after a glucose tolerance test, and 2-hour serum insulin level of 110. Her body mass index is 37.1 and her diabetes pedigree function is 0.153.###\nHence this label was consent."
"This data belongs to a 21-year-old individual who has never been pregnant. \nHer diastolic blood pressure is within the normal range at 70. \nShe has a moderately healthy triceps skin fold thickness of 26. \nDuring a glucose tolerance test, her plasma glucose concentration at 2 hours was 100 mg/dL. \nHer 2-hour serum insulin level is 50 units/mL. \nShe has a body mass index (BMI) of 30.8, indicating she is overweight. \nHer diabetes pedigree function score is 0.597, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This is a dataset for a 22-year-old individual who has been pregnant 3 times. They have low diastolic blood pressure (54 mmHg) and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 139 mg/dL, with no insulin detected at the 2-hour mark. The individual has a healthy body mass index of 25.6 and a relatively low diabetes pedigree function score of 0.402.###\nHence this label was consent."
"A 24-year-old woman, who has been pregnant once, has a diastolic blood pressure of 80. She has a triceps skin fold thickness of 45, a plasma glucose concentration of 112, and a 2-hour serum insulin level of 132. With a body mass index of 34.8 and a low diabetes pedigree function score of 0.217, she is being evaluated for her risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 46-year-old woman who has been pregnant 12 times. Her diastolic blood pressure is 72 mmHg, and her triceps skin fold thickness is 31 mm. She has a plasma glucose concentration of 84 mg/dL after a 2-hour oral glucose tolerance test and a 2-hour serum insulin level of 0 uU/mL. Her body mass index is 29.7, and her diabetes pedigree function is 0.297.###\nHence this label was consent."
"This patient is a 24-year-old woman who has never been pregnant. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 31, and a plasma glucose concentration of 117 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 53, and she has a body mass index of 45.2. The diabetes pedigree function for this patient is 0.089.###\nHence this label was avoid."
"A 57-year-old individual who has been pregnant 10 times with a diastolic blood pressure of 80. The triceps skin fold thickness is 0, indicating low levels of subcutaneous fat. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 139. The 2-hour serum insulin level is 0, suggesting potential issues with insulin production or utilization. The individual's body mass index is 27.1, indicating they are overweight. The diabetes pedigree function value is 1.441, showing a moderate genetic predisposition to diabetes. Overall, this individual may be at risk for developing diabetes due to various factors such as age, BMI, and glucose levels.###\nHence this label was avoid."
"This individual is a 45-year-old female who has been pregnant 11 times. She has a diastolic blood pressure of 84 and a triceps skin fold thickness of 40. Her plasma glucose concentration after a GTT is 111, with a 2-hour serum insulin level of 0. Her body mass index is 46.8 and her diabetes pedigree function is 0.925.###\nHence this label was consent."
"A 42-year-old woman who has been pregnant 7 times shows normal diastolic blood pressure and a slightly above average body mass index. Her triceps skin fold thickness and plasma glucose concentration are within healthy ranges. Despite a moderate 2-hour serum insulin level, her diabetes pedigree function suggests a low risk of developing diabetes.###\nHence this label was avoid."
"The individual in the dataset is a 22-year-old who has never been pregnant. They have normal diastolic blood pressure, zero triceps skin fold thickness, and normal insulin levels. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is within a healthy range. The individual has a healthy body mass index and a low diabetes pedigree function, indicating a relatively low risk of developing diabetes.###\nHence this label was avoid."
"A 31-year-old woman who has been pregnant 6 times shows no triceps skin fold thickness and low insulin levels. She has a slightly elevated diastolic blood pressure, normal plasma glucose levels, and a high body mass index. Her diabetes pedigree function score indicates a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is 35 years old and has never been pregnant. They have a diastolic blood pressure of 90 mmHg. Their triceps skin fold thickness is 26 mm. After a 2-hour oral glucose tolerance test, their plasma glucose concentration is 180 mg/dL. The 2-hour serum insulin level is 90 mU/mL. They have a body mass index of 36.5, indicating obesity. Their diabetes pedigree function score is 0.314, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"A 31-year-old individual, who has been pregnant 6 times, shows normal diastolic blood pressure and triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 91, with low insulin levels. They have a healthy body mass index of 29.8 and a moderately low diabetes pedigree function of 0.501.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 109, with a 2-hour serum insulin level of 114. She has a body mass index of 27.9 and a diabetes pedigree function of 0.64.###\nHence this label was consent."
"This individual is a 26-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 22 mm. Her plasma glucose concentration after a glucose tolerance test is 112 mg/dL, and her 2-hour serum insulin level is 94 mu U/mL. She has a body mass index of 34.1, indicating she is overweight. Her diabetes pedigree function is 0.315, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 36-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour glucose tolerance test is 133, and her 2-hour serum insulin level is 0. Her body mass index is 27.0, and she has a diabetes pedigree function score of 0.245.###\nHence this label was avoid."
"This is a data record of a 24-year-old individual who is pregnant for the first time. She has a healthy diastolic blood pressure of 62, and a low triceps skin fold thickness of 12. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 90, and she has a moderate level of serum insulin at 43. With a body mass index of 27.2, she is considered overweight. Her diabetes pedigree function score is 0.58, indicating a mild genetic predisposition to diabetes.###\nHence this label was avoid."
"A 63-year-old individual who has been pregnant 3 times with an average blood pressure, moderate triceps skin fold thickness, and slightly elevated glucose levels. They have low insulin levels, elevated body mass index, and a relatively low diabetes pedigree function score. Overall, this individual may have a moderate risk of developing diabetes.###\nHence this label was avoid."
"This is a case of a 22-year-old individual who has never been pregnant and shows normal diastolic blood pressure. The person has average triceps skin fold thickness and a slightly elevated glucose concentration after a 2-hour oral glucose tolerance test. They have low insulin levels, a moderately high BMI, and a low diabetes pedigree function score.###\nHence this label was avoid."
"This data belongs to a 38-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 82, a triceps skin fold thickness of 30, and a plasma glucose concentration of 106 after a GTT. Their 2-hour serum insulin level is 0, and they have a body mass index of 39.5. The diabetes pedigree function value for this individual is 0.286.###\nHence this label was avoid."
"This data belongs to a 21-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 74, triceps skin fold thickness of 20, and a plasma glucose concentration of 0 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 23, body mass index is 27.7, and diabetes pedigree function is 0.299.###\nHence this label was avoid."
"A 22-year-old individual who has been pregnant 3 times shows relatively low diastolic blood pressure of 58. They have a moderately high triceps skin fold thickness of 31 and a plasma glucose concentration of 111 after a glucose tolerance test. Their 2-hour serum insulin level is 44, indicating moderate insulin production. With a body mass index of 29.5, they are considered overweight. Their diabetes pedigree function is low at 0.43, suggesting a relatively lower risk of developing diabetes based on family history.###\nHence this label was avoid."
"This 27-year-old patient has never been pregnant and shows normal diastolic blood pressure and low triceps skin fold thickness. Their glucose levels after a meal are within a healthy range. Despite having no insulin in their bloodstream, they have a slightly elevated body mass index. The patient has a moderate diabetes pedigree function score, indicating a potential risk.###\nHence this label was avoid."
"This 24-year-old individual has been pregnant 3 times and has a low diastolic blood pressure of 54. They have a healthy triceps skin fold thickness of 21 and a normal plasma glucose concentration of 106. Their 2-hour serum insulin level is high at 158, and they have a slightly elevated body mass index of 30.9. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.292.###\nHence this label was avoid."
"The individual in this dataset is a 43-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 31. Her glucose concentration after a 2-hour oral glucose tolerance test is 170, while her 2-hour serum insulin level is 0. With a body mass index of 44.0 and a diabetes pedigree function of 0.403, this data suggests a potential risk for developing diabetes.###\nHence this label was consent."
"This individual is 41 years old, has been pregnant twice, and has a diastolic blood pressure of 0. They have no triceps skin fold thickness and no insulin levels after a glucose tolerance test. Their plasma glucose concentration is 129, body mass index is 38.5, and diabetes pedigree function is 0.304.###\nHence this label was avoid."
"The patient is a 38-year-old woman who has been pregnant 12 times. She has a low diastolic blood pressure of 70 and a high triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 151, with a high 2-hour serum insulin level of 271. She has a high body mass index of 41.8 and a moderate diabetes pedigree function of 0.742.###\nHence this label was consent."
"This individual is a 48-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 40 mm. Her plasma glucose concentration is 88 mg/dL after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 54 mu U/ml. She has a body mass index (BMI) of 35.3 and a diabetes pedigree function value of 0.378.###\nHence this label was avoid."
"A 36-year-old individual, who has been pregnant 6 times, with a diastolic blood pressure of 82. They have no triceps skin fold thickness and a plasma glucose concentration of 102 after a glucose tolerance test. Their 2-hour serum insulin level is 0, with a body mass index of 30.8 and a diabetes pedigree function of 0.18.###\nHence this label was consent."
"This 37-year-old individual has been pregnant 7 times. They have normal diastolic blood pressure and triceps skin fold thickness. Their plasma glucose concentration after a GTT is 119, while their 2-hour serum insulin level is 0. They have a healthy body mass index of 25.2 and a low diabetes pedigree function of 0.209.###\nHence this label was avoid."
"The patient is a 35-year-old female who has been pregnant 4 times. Her diastolic blood pressure is 62, triceps skin fold thickness is 0, and she has a plasma glucose concentration of 123 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 32.0. The diabetes pedigree function is 0.226.###\nHence this label was consent."
"This data describes a 22-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 74, triceps skin fold thickness of 19, plasma glucose concentration of 88 after a glucose tolerance test, 2-hour serum insulin level of 53, and a body mass index of 29.0. Their diabetes pedigree function is 0.229.###\nHence this label was avoid."
"This individual is 49 years old and has been pregnant 8 times. They have a diastolic blood pressure of 88 and a triceps skin fold thickness of 36. Their plasma glucose concentration after a glucose tolerance test is 126, and their 2-hour serum insulin level is 108. With a body mass index of 38.5 and a low diabetes pedigree function of 0.349, this person shows some indicators of potential diabetes risk.###\nHence this label was avoid."
"The patient is a 34-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 0. Her plasma glucose concentration is 120 after a 2-hour oral glucose tolerance test, with a 2-hour serum insulin level of 0. She has a body mass index of 29.6 and a diabetes pedigree function of 0.709.###\nHence this label was avoid."
"The patient is a 32-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 92 mmHg and a triceps skin fold thickness of 49 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 129 mg/dL, and she has a 2-hour serum insulin level of 155 μU/mL. With a body mass index of 36.4, she has a high risk of developing diabetes, as indicated by her diabetes pedigree function score of 0.968.###\nHence this label was consent."
"A 24-year-old woman who has never been pregnant has a slightly below average diastolic blood pressure of 68. She has a relatively high triceps skin fold thickness of 42, indicating excess body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 135, which is within a normal range. However, her 2-hour serum insulin level is elevated at 250, suggesting possible insulin resistance. With a body mass index of 42.3, she is classified as obese. Her diabetes pedigree function score is low at 0.365, indicating a slightly increased risk for diabetes based on family history.###\nHence this label was consent."
"A 22-year-old woman who has been pregnant twice has a healthy diastolic blood pressure of 58. Her triceps skin fold thickness is normal at 35, and her plasma glucose concentration after a glucose tolerance test is 101. She has a moderate level of serum insulin at 90, a low body mass index of 21.8, and a low diabetes pedigree function score of 0.155.###\nHence this label was avoid."
"The patient is a 58-year-old female who has been pregnant 9 times. She has a low diastolic blood pressure of 68 and triceps skin fold thickness is 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 91. She has no insulin present in her 2-hour serum. With a body mass index of 24.2 and a low diabetes pedigree function of 0.2, this patient has relatively low risk of developing diabetes.###\nHence this label was avoid."
"A young woman aged 23, who is pregnant for the first time, has a normal diastolic blood pressure. Her triceps skin fold thickness and body mass index indicate a healthy weight. However, her plasma glucose concentration after a glucose tolerance test is slightly elevated. She has normal insulin levels and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 28-year-old female who has been pregnant 3 times with a diastolic blood pressure of 66, a triceps skin fold thickness of 39, a plasma glucose concentration of 115 after a 2-hour oral glucose tolerance test, 2-hour serum insulin level of 140, a body mass index of 38.1, and a diabetes pedigree function of 0.15.###\nHence this label was avoid."
"This data belongs to a 33-year-old individual who has been pregnant 4 times. They have a healthy diastolic blood pressure of 70 and a slightly below average triceps skin fold thickness of 14. Their plasma glucose concentration after a meal is high at 173, and they have elevated 2-hour serum insulin levels of 168. With a body mass index of 29.7, they are classified as overweight. Their diabetes pedigree function score is relatively low at 0.361, indicating a lower genetic risk for diabetes.###\nHence this label was consent."
"This is a 24-year-old individual who has been pregnant 3 times. They have a low diastolic blood pressure of 52 and a moderate triceps skin fold thickness of 38. Their plasma glucose concentration after a glucose tolerance test is elevated at 162, while their 2-hour serum insulin level is low at 0. The individual has a high body mass index of 37.2 and a moderate diabetes pedigree function score of 0.652.###\nHence this label was consent."
"This individual is a young woman who has never been pregnant. She has a normal diastolic blood pressure of 68 and a healthy body mass index of 24.7. Her plasma glucose concentration is within the normal range at 125. Despite having no triceps skin fold thickness, her diabetes pedigree function is low at 0.206.###\nHence this label was avoid."
"The patient is a 50-year-old who has been pregnant 6 times. They have a low diastolic blood pressure of 62, with no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 162. There is no serum insulin present, and they have a healthy body mass index of 24.3. The patient has a low diabetes pedigree function of 0.178.###\nHence this label was consent."
"This 21-year-old individual, who has been pregnant once, has a healthy diastolic blood pressure of 64. They have a slightly below average triceps skin fold thickness of 14, indicating a relatively low level of subcutaneous fat. Their plasma glucose concentration 2 hours after an oral glucose tolerance test is 131, which is within the normal range. However, their 2-hour serum insulin level is high at 415, suggesting possible insulin resistance. With a body mass index of 23.7, this person is within the normal weight range. Their diabetes pedigree function value of 0.389 indicates a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is 43 years old and has been pregnant 8 times. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 188, with a 2-hour serum insulin level of 0. They have a high body mass index of 47.9 and a low diabetes pedigree function of 0.137.###\nHence this label was consent."
"The patient is a 43-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 40, and a body mass index of 39.4. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 100, and her 2-hour serum insulin level is 215. The diabetes pedigree function, which predicts the likelihood of developing diabetes based on family history, is 0.661.###\nHence this label was consent."
"The individual is a 26-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 80 and a triceps skin fold thickness of 28. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 105. She has a 2-hour serum insulin level of 0 and a body mass index of 32.5. Her diabetes pedigree function is 0.878.###\nHence this label was avoid."
"The patient is a 36-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 88, a triceps skin fold thickness of 44, and a plasma glucose concentration of 152 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 50.0. Her diabetes pedigree function is 0.337.###\nHence this label was consent."
"The patient is a 57-year-old female who has been pregnant 8 times. She has a normal diastolic blood pressure of 72 and a very low triceps skin fold thickness of 0. Her glucose levels appear to be normal at 95 after a 2-hour oral glucose tolerance test, and her insulin levels are also low at 0. Despite this, she has a high body mass index of 36.8 and a moderate diabetes pedigree function of 0.485.###\nHence this label was avoid."
"This 33-year-old individual has been pregnant 5 times and has measurements indicating a relatively healthy condition. Their diastolic blood pressure is normal at 72, and their triceps skin fold thickness suggests a moderate body fat level. With a plasma glucose concentration of 108, 2-hour serum insulin of 75, and BMI of 36.1, there are no signs of diabetes. The diabetes pedigree function value of 0.263 also indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 41-year-old woman who has never been pregnant. She has a diastolic blood pressure of 104 mmHg. Her triceps skin fold thickness is 25mm. After a 2-hour oral glucose tolerance test, her plasma glucose concentration is 189 mg/dL. She has no insulin present in her serum after the test. Her body mass index is 34.3, indicating she is in the obese range. The diabetes pedigree function value is 0.435, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"A 30-year-old individual who has been pregnant 4 times shows normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration of 137 mg/dL. Their 2-hour serum insulin level is 0, indicating possible insulin resistance. They have a body mass index of 31.2, which falls in the obese category, and a low diabetes pedigree function score of 0.252, suggesting a relatively lower genetic risk for diabetes.###\nHence this label was avoid."
"This data belongs to a 27-year-old individual who has been pregnant 4 times. Their diastolic blood pressure is 76, triceps skin fold thickness is 20, plasma glucose concentration after a glucose tolerance test is 110, 2-hour serum insulin level is 100, body mass index is 28.4, and diabetes pedigree function is 0.118.###\nHence this label was avoid."
"The patient is a 21-year-old female who is pregnant for the first time. She has a normal diastolic blood pressure of 70 and a slightly below-average skin fold thickness of 28. Her glucose level after a 2-hour oral glucose tolerance test is 116, and her insulin level is low at 0. She has a healthy body mass index of 27.4 and a low diabetes pedigree function of 0.204.###\nHence this label was avoid."
"A 49-year-old individual who has been pregnant 9 times, with a diastolic blood pressure of 85. They have a triceps skin fold thickness of 15, a plasma glucose concentration of 184 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 0. Their body mass index is 30.0 and they have a diabetes pedigree function of 1.213.###\nHence this label was consent."
"The 51-year-old patient has been pregnant 10 times and shows signs of elevated risk for diabetes with high blood pressure, thick skin fold, and high glucose and insulin levels. The patient also has a high body mass index and a family history of diabetes.###\nHence this label was consent."
"This 26-year-old individual has been pregnant 2 times and has a diastolic blood pressure of 68. Their triceps skin fold thickness is 25, plasma glucose concentration is 100, and 2-hour serum insulin level is 71. With a body mass index of 38.5 and a diabetes pedigree function of 0.324, this person's health metrics suggest a risk for developing diabetes.###\nHence this label was avoid."
"The patient is a young adult, age 23, who is slightly overweight with a body mass index of 30.1. They have a moderately high plasma glucose concentration of 143 after a GTT, along with high insulin levels of 330. Their diastolic blood pressure is within normal range at 86. Despite being only pregnant once, the patient has a relatively high triceps skin fold thickness of 30, indicating some excess body fat. The patient also has a low diabetes pedigree function of 0.892, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 67-year-old woman who has been pregnant 8 times. She has normal diastolic blood pressure, no triceps skinfold thickness, and a high plasma glucose concentration after a glucose tolerance test. Her insulin levels are normal, and her body mass index is within a healthy range. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This data describes a 30-year-old individual who is pregnant for the first time. She has a normal diastolic blood pressure of 70 and a moderate triceps skin fold thickness of 40. Her glucose level after a 2-hour oral glucose tolerance test is 97, and her insulin level is very low at 0. She has a high body mass index of 38.1 and a low diabetes pedigree function of 0.218.###\nHence this label was avoid."
"This 27-year-old individual has never been pregnant and has normal diastolic blood pressure and triceps skin fold thickness. Their glucose levels after a glucose tolerance test are within a healthy range. However, their insulin levels are low. Despite having a low body mass index, their diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant 3 times and has a diastolic blood pressure of 68. Their triceps skin fold thickness is 28, while their plasma glucose concentration at 2 hours is 74. They have a 2-hour serum insulin level of 45 and a body mass index of 29.7. Their diabetes pedigree function is calculated to be 0.293.###\nHence this label was avoid."
"A 41-year-old individual, who has been pregnant 5 times, with a diastolic blood pressure of 64 and triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 168, with no insulin detected after 2 hours. They have a body mass index of 32.9 and a low diabetes pedigree function of 0.135.###\nHence this label was consent."
"This 33-year-old individual, who has been pregnant once, shows normal diastolic blood pressure and no triceps skin fold thickness. However, their plasma glucose concentration after a glucose tolerance test is elevated at 163. Despite having no insulin present after 2 hours, they have a high body mass index of 39.0. Additionally, their diabetes pedigree function value is 1.222, indicating a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"This individual is 35 years old and has been pregnant five times. They have a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 41 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 77 mg/dL, and their 2-hour serum insulin level is 42 uU/mL. They have a body mass index of 35.8 kg/m² and a diabetes pedigree function of 0.156.###\nHence this label was avoid."
"The data represents a 37-year-old individual who has been pregnant seven times. They have a diastolic blood pressure of 88, a triceps skin fold thickness of 15, and a plasma glucose concentration of 133 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 155, and they have a body mass index of 32.4. The diabetes pedigree function for this individual is 0.262.###\nHence this label was avoid."
"This data belongs to a 28-year-old individual who is pregnant for the first time. She has slightly below normal diastolic blood pressure and an above-average triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is elevated, along with a high level of serum insulin. She has a high body mass index and a moderately elevated diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 39-year-old woman who has been pregnant 13 times. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 37 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 153 mg/dL, and her 2-hour serum insulin level is 140 μU/mL. She has a body mass index of 40.6 kg/m² and a diabetes pedigree function of 1.174.###\nHence this label was avoid."
"A 24-year-old individual who has been pregnant 7 times shows normal diastolic blood pressure, zero triceps skin fold thickness, and zero insulin levels. Their plasma glucose concentration after a glucose tolerance test is 105, with a body mass index of 0.0. The diabetes pedigree function score is 0.305.###\nHence this label was avoid."
"A 28-year-old woman has been pregnant three times and shows signs of elevated risk for diabetes. Her diastolic blood pressure is within normal range, but she has a high plasma glucose concentration after a glucose tolerance test. Additionally, her triceps skin fold thickness, serum insulin levels, and body mass index are all elevated, indicating a potential concern for developing diabetes.###\nHence this label was consent."
"This 33-year-old patient has been pregnant 5 times and has a diastolic blood pressure of 86. They have a triceps skin fold thickness of 0, indicating low fat under the skin. Their glucose concentration after a glucose tolerance test is 122, with no insulin detected after 2 hours. With a body mass index of 34.7, this patient has a low diabetes pedigree function of 0.29.###\nHence this label was avoid."
"A 29-year-old individual, who is pregnant for the first time, has normal diastolic blood pressure and a healthy body mass index. Their triceps skin fold thickness is within normal range, and their plasma glucose concentration after a glucose tolerance test is slightly lower than average. They have a moderate level of serum insulin and a low diabetes pedigree function score, indicating a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"This is a data entry of a 25-year-old individual who has been pregnant 2 times. They have a diastolic blood pressure of 74 and a triceps skin fold thickness of 26. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 129, with a 2-hour serum insulin level of 205. The individual has a body mass index of 33.2 and a diabetes pedigree function of 0.591.###\nHence this label was avoid."
"The patient is a 23-year-old female who has been pregnant 2 times. She has a diastolic blood pressure of 70, no triceps skin fold thickness, and a plasma glucose concentration of 134 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 28.9. Her diabetes pedigree function is 0.542.###\nHence this label was consent."
"This individual, a 32-year-old female, has been pregnant once. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a glucose tolerance test is 115, and her 2-hour serum insulin level is 96. With a body mass index of 34.6 and a diabetes pedigree function of 0.529, she may have some risk factors for developing diabetes.###\nHence this label was consent."
"A 52-year-old individual who has been pregnant three times has a diastolic blood pressure of 86. Their triceps skin fold thickness is 27, and their plasma glucose concentration at 2 hours in an oral glucose tolerance test is 176. They have a 2-hour serum insulin level of 156 and a body mass index of 33.3. Their diabetes pedigree function is 1.154.###\nHence this label was consent."
"The patient is a 21-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 70, a triceps skin fold thickness of 15, and a normal plasma glucose concentration of 97 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is at 0, indicating low insulin production. She has a low body mass index of 18.2 and a relatively low diabetes pedigree function score of 0.147, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 22-year-old who is pregnant for the first time and has a low diastolic blood pressure of 60. They have a healthy triceps skin fold thickness of 37 and a normal plasma glucose concentration of 87 following a glucose tolerance test. Their 2-hour serum insulin level is 75, indicating good insulin sensitivity. Despite a slightly elevated body mass index of 37.2, their diabetes pedigree function is low at 0.509, suggesting a lower risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 23-year-old female who has been pregnant twice. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 32. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 121, with a 2-hour serum insulin level of 95. She has a body mass index of 39.1 and a diabetes pedigree function of 0.886. These measurements suggest a risk of developing diabetes and indicate the importance of monitoring her health closely.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 70 and triceps skin fold thickness of 39. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 197, with a 2-hour serum insulin level of 744. She has a body mass index of 36.7 and a diabetes pedigree function of 2.329.###\nHence this label was avoid."
"This data belongs to a 22-year-old individual who has been pregnant twice. Their diastolic blood pressure is 70, triceps skin fold thickness is 17, and plasma glucose concentration after a glucose tolerance test is 90. They have no insulin in their serum after 2 hours, with a body mass index of 27.3 and a low diabetes pedigree function of 0.085.###\nHence this label was avoid."
"The patient is a 63-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 86, a triceps skin fold thickness of 31, and a plasma glucose concentration of 132 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 28.0. The diabetes pedigree function for this individual is 0.419.###\nHence this label was avoid."
"A 23-year-old individual who has never been pregnant has a normal diastolic blood pressure of 64. They have a slightly below average triceps skin fold thickness of 18. Their glucose levels after a GTT are within the normal range at 119. They have a moderate insulin level of 92 after a 2-hour test. Despite having a high body mass index of 34.9, their diabetes pedigree function is relatively low at 0.725.###\nHence this label was avoid."
"This individual is 44 years old and has been pregnant 13 times. \nThey have a diastolic blood pressure of 0 mmHg, triceps skin fold thickness of 30 mm,\nplasma glucose concentration of 129 mg/dL after a glucose tolerance test,\n2-hour serum insulin level of 0 mu U/ml,\nand a body mass index of 39.9 kg/m².\nTheir diabetes pedigree function score is 0.569.###\nHence this label was consent."
"A non-pregnant, young adult female with normal blood pressure, no triceps skin fold thickness, average glucose levels, no insulin resistance, but higher body mass index, and a low diabetes genetic likelihood.###\nHence this label was avoid."
"The patient is a 27-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 78 mmHg, triceps skin fold thickness of 41 mm, plasma glucose concentration of 154 mg/dL after a 2-hour oral glucose tolerance test, and 2-hour serum insulin level of 140 μU/mL. Her body mass index is 46.1, and her diabetes pedigree function is 0.571. The data suggests that she may be at risk for developing diabetes due to high glucose levels and obesity.###\nHence this label was avoid."
"This individual, a 23-year-old, has been pregnant twice and has a diastolic blood pressure of 86. Their triceps skin fold thickness is 36mm, and their plasma glucose concentration after a glucose tolerance test is 102mg/dL. Additionally, their 2-hour serum insulin level is 120mu U/ml. They have a body mass index of 45.5 and a diabetes pedigree function of 0.127.###\nHence this label was consent."
"This individual is 52 years old, has been pregnant 8 times, and has a diastolic blood pressure of 76. Their triceps skin fold thickness is 24, with a plasma glucose concentration of 124 after a glucose tolerance test. They have a high serum insulin level of 600 at 2 hours. Their body mass index is 28.7 and their diabetes pedigree function is 0.687.###\nHence this label was consent."
"This is a 28-year-old individual who has been pregnant 6 times. Their diastolic blood pressure is 62, triceps skin fold thickness is 31, and plasma glucose concentration after a glucose tolerance test is 151. The individual has a 2-hour serum insulin level of 120 and a body mass index of 35.5. Their diabetes pedigree function is 0.692.###\nHence this label was avoid."
"The individual is a 28-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 68 mmHg, a triceps skin fold thickness of 21 mm, and a plasma glucose concentration of 131 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 166 mu U/ml, her body mass index is 33.1, and her diabetes pedigree function is 0.16. These factors indicate a moderate risk for developing diabetes.###\nHence this label was avoid."
"A 25-year-old woman who has never been pregnant is showing signs of potential risk for diabetes. Her diastolic blood pressure is at a healthy level of 68, but her triceps skin fold thickness is above average at 19. Additionally, her plasma glucose concentration after a glucose tolerance test is 128, and her 2-hour serum insulin is high at 180. Her body mass index is in the overweight range at 30.5, and her diabetes pedigree function indicates a moderate genetic predisposition to the disease.###\nHence this label was consent."
"This patient is a 66-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 92, no triceps skin fold thickness, and a plasma glucose concentration of 190 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 35.5. Her diabetes pedigree function is 0.278.###\nHence this label was consent."
"A 22-year-old woman who has been pregnant twice has a healthy diastolic blood pressure of 66 and a slightly below average triceps skin fold thickness of 23. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 83, with a moderate 2-hour serum insulin level of 50. She has a body mass index of 32.2, indicating she is overweight, and a low diabetes pedigree function score of 0.497, suggesting a relatively low genetic risk for diabetes.###\nHence this label was avoid."
"A 28-year-old individual who has been pregnant 5 times with normal diastolic blood pressure and no triceps skin fold thickness. Their glucose level after a 2-hour oral glucose tolerance test is 147, and they have no insulin present. They have a body mass index of 29.9 and a relatively low diabetes pedigree function score of 0.434.###\nHence this label was avoid."
"This data belongs to a 28-year-old individual who is pregnant for the first time and has a diastolic blood pressure of 78. Their triceps skin fold thickness is 39, plasma glucose concentration is 121, and 2-hour serum insulin level is 74. They have a body mass index of 39.0 and a diabetes pedigree function value of 0.261.###\nHence this label was avoid."
"This individual is a 29-year-old who has been pregnant 4 times. They have a diastolic blood pressure of 88 and a triceps skin fold thickness of 47. During an oral glucose tolerance test, their plasma glucose concentration at 2 hours was 90. Their 2-hour serum insulin level is 54. They have a body mass index of 37.7 and a diabetes pedigree function of 0.362.###\nHence this label was avoid."
"The patient is a 42-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 100, with a 2-hour serum insulin level of 0. She has a body mass index of 38.7 and a diabetes pedigree function of 0.19.###\nHence this label was avoid."
"This individual is a 25-year-old who has never been pregnant. Their diastolic blood pressure is 68, triceps skin fold thickness is 32, and plasma glucose concentration after a glucose tolerance test is 86. They have no insulin in their serum after a 2-hour test. With a body mass index of 35.8 and a low diabetes pedigree function of 0.238, this individual appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 30-year-old female who has been pregnant twice. She has a diastolic blood pressure of 74, triceps skin fold thickness of 35, plasma glucose concentration of 157, and 2-hour serum insulin level of 440. Her body mass index is 39.4 and her diabetes pedigree function is 0.134. Overall, the patient's diagnostic measurements indicate potential risk for developing diabetes.###\nHence this label was avoid."
"This person is young, at 21 years old, and has never been pregnant. Their diastolic blood pressure is low at 60, and their triceps skin fold thickness is within a normal range. They have a moderate glucose level of 138 after a GTT, and a high insulin level of 167. Their body mass index indicates they are overweight at 34.6, and their diabetes pedigree function score is moderate at 0.534.###\nHence this label was consent."
"A 22-year-old individual, who has been pregnant 3 times, with a diastolic blood pressure of 58 mmHg, a triceps skin fold thickness of 11 mm, a plasma glucose concentration of 88 mg/dL after a glucose tolerance test, a 2-hour serum insulin level of 54 μU/mL, a body mass index of 24.8, and a diabetes pedigree function value of 0.267.###\nHence this label was avoid."
"A 28-year-old woman, who has been pregnant 6 times, has a low diastolic blood pressure of 92. She has minimal triceps skin fold thickness and a low plasma glucose concentration of 92 after a glucose tolerance test. Her 2-hour serum insulin level is also low, and she has a low body mass index of 19.9. Additionally, her diabetes pedigree function is low at 0.188.###\nHence this label was avoid."
"The patient is a 42-year-old female who is pregnant for the first time. \nShe has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 0 mm.\nHer plasma glucose concentration after a 2-hour oral glucose tolerance test is 102 mg/dL, with a 2-hour serum insulin level of 0 μU/mL.\nShe has a body mass index of 39.5 kg/m^2 and a diabetes pedigree function value of 0.293.\nOverall, the patient's diagnostic measurements suggest a low risk of developing diabetes.###\nHence this label was consent."
"This individual is 38 years old and has been pregnant 4 times. They have normal diastolic blood pressure and a healthy BMI. Their triceps skin fold thickness is within normal range. However, their 2-hour serum insulin levels are unusually low. The plasma glucose concentration after a glucose tolerance test is also on the lower side. Overall, their diabetes pedigree function is low, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"A 21-year-old individual, who has been pregnant twice, with a healthy diastolic blood pressure of 68. Despite having a slightly below average triceps skin fold thickness of 18, their plasma glucose concentration after a GTT is normal at 94. They have a moderate 2-hour serum insulin level of 76 and a body mass index indicating they are in the healthy weight range at 26.0. Their diabetes pedigree function score is 0.561, suggesting a moderate genetic risk of developing diabetes.###\nHence this label was avoid."
"This is the data of a 32-year-old individual who is 1 time pregnant. She has a diastolic blood pressure of 74 mmHg. Her triceps skin fold thickness is 41 mm. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 81 mg/dL. Her 2-hour serum insulin level is 57 μU/mL. She has a body mass index of 46.3, indicating obesity. The diabetes pedigree function value is 1.096, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient, a 22-year-old female, has been pregnant once. She has a lower than normal diastolic blood pressure of 46 mmHg. Her triceps skin fold thickness is 19 mm, indicating a moderate amount of subcutaneous fat. The patient's plasma glucose concentration after a glucose tolerance test is 139 mg/dL. She has a relatively high 2-hour serum insulin level of 83 μU/mL. With a body mass index of 28.7, she is categorized as overweight. The diabetes pedigree function value of 0.654 suggests a moderate genetic predisposition to diabetes. Overall, these measurements indicate a potential risk for developing diabetes and highlight the importance of monitoring her health closely.###\nHence this label was avoid."
"This 27-year-old individual, who has been pregnant 3 times, shows normal diastolic blood pressure and low triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is low, while their 2-hour serum insulin level is normal. Despite having a slightly elevated body mass index, their diabetes pedigree function indicates a low genetic risk for developing diabetes.###\nHence this label was consent."
"The patient is a 38-year-old woman who has been pregnant 10 times. She has a low diastolic blood pressure of 62 and a relatively high triceps skin fold thickness of 36. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 129, with no insulin detected in her serum. She has a high body mass index of 41.2 and a low diabetes pedigree function score of 0.441. Overall, based on these measurements, she may be at risk for developing diabetes.###\nHence this label was consent."
"This patient is a 21-year-old female who has been pregnant twice. She has a diastolic blood pressure of 96, no triceps skin fold thickness, and a plasma glucose concentration of 130 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, indicating low insulin production. She has a body mass index of 22.6, which falls within the normal range, and a diabetes pedigree function score of 0.268. Overall, this individual appears to have relatively low risk factors for developing diabetes.###\nHence this label was avoid."
"A 26-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure and moderately high triceps skin fold thickness. Her plasma glucose concentration is elevated after a 2-hour oral glucose tolerance test, while her insulin levels are within normal range. She has a high body mass index and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 29-year-old woman who has been pregnant 4 times shows no triceps skin fold thickness, low insulin levels, and a slightly elevated diastolic blood pressure. She has a moderate plasma glucose concentration after a 2-hour oral glucose tolerance test, and a high body mass index. Overall, her diabetes pedigree function score indicates a low risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 22-year-old female who has been pregnant twice. She has a lower than normal diastolic blood pressure of 52 mmHg. Her triceps skin fold thickness is at a healthy level of 26mm. In a glucose tolerance test, her plasma glucose concentration at 2 hours is 108 mg/dL. Her 2-hour serum insulin level is 63 μU/ml. With a body mass index of 32.5, she is classified as overweight. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.318.###\nHence this label was avoid."
"This 24-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 70. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 128 after a glucose tolerance test, and a 2-hour serum insulin level of 0. With a body mass index of 34.3 and a diabetes pedigree function of 0.303, this individual's risk of developing diabetes may be influenced by these factors.###\nHence this label was avoid."
"This is a 23-year-old woman who has never been pregnant. Her diastolic blood pressure is 90, triceps skin fold thickness is 33, and body mass index is 52.3, indicating she is overweight. Her plasma glucose concentration after a glucose tolerance test is 165, which is above the normal range. Additionally, her 2-hour serum insulin level is very high at 680. Despite these indicators, her diabetes pedigree function is low at 0.427. The combination of these factors suggests a concerning risk for developing diabetes.###\nHence this label was avoid."
"This data describes a 21-year-old individual who has never been pregnant. They have a diastolic blood pressure of 64, a triceps skin fold thickness of 23, and a plasma glucose concentration of 118 after a glucose tolerance test. Their 2-hour serum insulin level is 89, their body mass index is 0.0, and they have a diabetes pedigree function of 1.731.###\nHence this label was avoid."
"This individual is a 25-year-old who has never been pregnant. Their diastolic blood pressure is normal at 62 mmHg. They have no triceps skin fold thickness, indicating low fat levels. Their glucose level after a 2-hour oral glucose tolerance test is 101 mg/dL. They have no insulin present in their serum after 2 hours. Their body mass index is 21.9, which falls within the healthy range. The diabetes pedigree function value is 0.336, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"A 26-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure, low triceps skin fold thickness, and average plasma glucose concentration after a glucose tolerance test. Their insulin levels after the test are relatively high. Despite having a healthy body mass index, their diabetes pedigree function is low.###\nHence this label was avoid."
"This is a patient who is 31 years old and has never been pregnant. She has a low diastolic blood pressure of 65, no triceps skin fold thickness, and a normal plasma glucose concentration of 111. Her 2-hour serum insulin level is zero, indicating low insulin production. Despite this, her body mass index is within the normal range at 24.6. The diabetes pedigree function, a genetic risk factor score, is moderately elevated at 0.66. Overall, this data suggests a low immediate risk of diabetes, but the genetic predisposition is a concern.###\nHence this label was avoid."
"The patient is a 34-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 80 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 107, and her 2-hour serum insulin level is 0. With a healthy body mass index of 24.6 and a diabetes pedigree function of 0.856, she is at a relatively low risk of developing diabetes.###\nHence this label was avoid."
"A 21-year-old woman who has never been pregnant has a healthy diastolic blood pressure of 62. She has a slightly below average triceps skin fold thickness of 17. Her plasma glucose concentration after a glucose tolerance test is within normal range at 139. She has elevated 2-hour serum insulin levels at 210. With a body mass index of 22.1, she is considered to be in the normal weight range. Her diabetes pedigree function, a measure of hereditary risk for diabetes, is low at 0.207.###\nHence this label was avoid."
"This data describes a 28-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 86 and a 2-hour serum insulin level of 160. Their triceps skin fold thickness is 42, plasma glucose concentration is 112, and body mass index is 38.4. The diabetes pedigree function is 0.246.###\nHence this label was avoid."
"A 31-year-old woman, who has been pregnant 3 times, with a diastolic blood pressure of 74, triceps skin fold thickness of 19, plasma glucose concentration of 169 after a glucose tolerance test, 2-hour serum insulin level of 125, and a body mass index of 29.9. She has a low diabetes pedigree function of 0.268.###\nHence this label was consent."
"The patient is a 34-year-old female who has been pregnant 7 times. She has a low diastolic blood pressure of 50 and a high triceps skin fold thickness of 33. Her plasma glucose concentration after a glucose tolerance test is elevated at 187, and her 2-hour serum insulin level is very high at 392. Despite having a high body mass index of 33.9, her diabetes pedigree function is moderate at 0.826.###\nHence this label was consent."
"A 25-year-old woman who has been pregnant twice has a low diastolic blood pressure of 60. She has a moderately low triceps skin fold thickness of 22 and a normal plasma glucose concentration at 81. Her 2-hour serum insulin levels are at 0, indicating good insulin sensitivity. With a body mass index of 27.7, she is within the overweight range. Her diabetes pedigree function is low at 0.29, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"This data is from a 47-year-old individual who has been pregnant 17 times. Their diastolic blood pressure is 72, triceps skin fold thickness is 41, and plasma glucose concentration after a glucose tolerance test is 163. Their 2-hour serum insulin level is 114, and their body mass index is 40.9. The diabetes pedigree function value is 0.817.###\nHence this label was consent."
"The patient is a 28-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 80 and a triceps skin fold thickness of 36. Her plasma glucose concentration after a GTT is 80, with a 2-hour serum insulin level of 0. She has a body mass index of 39.8 and a low diabetes pedigree function of 0.177.###\nHence this label was avoid."
"This 24-year-old individual has been pregnant once and has a low diastolic blood pressure of 56. Their triceps skin fold thickness is 30, plasma glucose concentration after a glucose tolerance test is 77, and 2-hour serum insulin level is 56. With a body mass index of 33.3, they have a diabetes pedigree function of 1.251.###\nHence this label was avoid."
"The patient is a 24-year-old woman who has been pregnant 4 times. She has a normal diastolic blood pressure of 64 and a healthy triceps skin fold thickness of 27. Her plasma glucose concentration after a glucose tolerance test is 117, and her 2-hour serum insulin level is 120. With a body mass index of 33.2, she is overweight. Her diabetes pedigree function is low at 0.23, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"This individual is 44 years old and has never been pregnant. They have a diastolic blood pressure of 82, a triceps skin fold thickness of 0, and a high plasma glucose concentration of 146 after a glucose tolerance test. Their 2-hour serum insulin level is 0, indicating low insulin production. With a body mass index of 40.5 and a high diabetes pedigree function score of 1.781, this person may have a higher risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 36-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 58 mmHg and a triceps skin fold thickness of 22mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 174 mg/dL and her 2-hour serum insulin level is 194 mu U/ml. She has a body mass index of 32.9 and a diabetes pedigree function of 0.593.###\nHence this label was consent."
"A 51-year-old individual who has been pregnant 7 times, with a diastolic blood pressure of 86. Their triceps skin fold thickness and 2-hour serum insulin levels are both 0. They have a plasma glucose concentration of 125 after a glucose tolerance test. Their body mass index is 37.6 and their diabetes pedigree function is 0.304.###\nHence this label was avoid."
"This 29-year-old individual has been pregnant 3 times and has a diastolic blood pressure of 90. Their triceps skin fold thickness is 12, with a plasma glucose concentration of 111 after a 2-hour oral glucose tolerance test. They have a 2-hour serum insulin level of 78 and a body mass index of 28.4. Their diabetes pedigree function is 0.495.###\nHence this label was avoid."
"This data describes a 42-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 86, triceps skin fold thickness of 28, plasma glucose concentration of 156, 2-hour serum insulin of 155, and a body mass index of 34.3. Additionally, their diabetes pedigree function is 1.189.###\nHence this label was consent."
"The patient is 36 years old and has been pregnant 5 times. They have low diastolic blood pressure (62) and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is low (44), as well as their 2-hour serum insulin level (0). The patient has a healthy body mass index of 25.0 and a moderate diabetes pedigree function of 0.587.###\nHence this label was avoid."
"This 29-year-old individual has a moderate risk of developing diabetes, with 6 past pregnancies. Their diastolic blood pressure is within normal range at 70, but their triceps skin fold thickness is slightly above average at 23. The plasma glucose concentration after a glucose tolerance test is 134, indicating elevated blood sugar levels. Additionally, their insulin level is higher than normal at 130. The individual has a body mass index of 35.4, which is classified as obese. The diabetes pedigree function score is 0.542, suggesting a genetic predisposition to diabetes.###\nHence this label was consent."
"This 21-year-old individual has been pregnant twice and shows normal diastolic blood pressure, zero triceps skin fold thickness, and zero 2-hour serum insulin. Their plasma glucose concentration after a glucose tolerance test is 84, with a body mass index of 0.0 and a low diabetes pedigree function of 0.304.###\nHence this label was avoid."
"A 25-year-old individual who has been pregnant 3 times shows slightly elevated diastolic blood pressure, moderate triceps skin fold thickness, high glucose concentration after a glucose tolerance test, very high serum insulin levels, and a high body mass index. The individual also has a moderately high diabetes pedigree function score. These measurements indicate a potential risk for developing diabetes.###\nHence this label was consent."
"This 25-year-old individual has been pregnant 4 times and has a Diastolic blood pressure of 90. Their Triceps skin fold thickness is 23, Plasma glucose concentration is 84, and 2-hour serum insulin level is 56. With a body mass index of 39.5 and a low Diabetes pedigree function of 0.159, this person may have a lower risk of developing diabetes.###\nHence this label was avoid."
"A 46-year-old individual with 12 pregnancies shows diastolic blood pressure of 84, triceps skin fold thickness of 33, plasma glucose concentration of 100 after a glucose tolerance test, 2-hour serum insulin level of 105, body mass index of 30.0, and a diabetes pedigree function of 0.488.###\nHence this label was avoid."
"The patient is a 60-year-old woman who has been pregnant 7 times and has a diastolic blood pressure of 95. She has a triceps skin fold thickness of 31, a plasma glucose concentration of 179 after a glucose tolerance test, and a body mass index of 34.2. Her 2-hour serum insulin level is 0, and her diabetes pedigree function is 0.164.###\nHence this label was avoid."
"This is a data point for a 24-year-old individual who is pregnant for the first time. They have a low diastolic blood pressure of 60, but a high triceps skin fold thickness of 46. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 108, but their 2-hour serum insulin level is elevated at 178. The individual has a high body mass index of 35.5 and a relatively low diabetes pedigree function score of 0.415.###\nHence this label was avoid."
"The patient is a 43-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 18. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 96, with a 2-hour serum insulin level of 67. She has a body mass index of 33.6 and a diabetes pedigree function of 0.997. These measurements suggest a moderate risk for developing diabetes.###\nHence this label was avoid."
"This individual is a 32-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 0, a triceps skin fold thickness of 0, and a 2-hour serum insulin level of 0. Her plasma glucose concentration after a glucose tolerance test is 100. She has a body mass index of 30.0 and a diabetes pedigree function of 0.484.###\nHence this label was consent."
"This individual is 39 years old and has been pregnant 8 times. They have a normal diastolic blood pressure of 72 and no triceps skin fold thickness. Their plasma glucose concentration is 133 after a 2-hour oral glucose tolerance test, with no serum insulin detected. They have a body mass index of 32.9 and a low diabetes pedigree function of 0.27.###\nHence this label was consent."
"The patient is a 29-year-old female who has been pregnant twice. She has a diastolic blood pressure of 75 mmHg and a body mass index of 25.6, indicating she is within a healthy weight range. Her triceps skin fold thickness and 2-hour serum insulin levels are both 0, which may suggest lower body fat and insulin production. However, her plasma glucose concentration after a glucose tolerance test is 139 mg/dL, which is slightly elevated. Her diabetes pedigree function is 0.167, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 72-year-old who has been pregnant 2 times. They have a diastolic blood pressure reading of 0 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 119 mg/dL, and their 2-hour serum insulin level is 0 μU/mL. The patient has a body mass index of 19.6 and a diabetes pedigree function value of 0.832.###\nHence this label was avoid."
"A 22-year-old woman, who is pregnant for the first time, has normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness indicates a moderate amount of subcutaneous fat. She has a lower than average plasma glucose concentration and a slightly below normal 2-hour serum insulin level. The diabetes pedigree function score is relatively low, suggesting a lower risk of developing diabetes based on family history.###\nHence this label was avoid."
"The individual is a 34-year-old who has been pregnant 10 times. They have a diastolic blood pressure of 74 and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 168, with no 2-hour serum insulin. The individual has a body mass index of 38.0 and a diabetes pedigree function value of 0.537.###\nHence this label was consent."
"A 25-year-old woman, who has been pregnant twice, shows normal diastolic blood pressure and a moderate triceps skin fold thickness. Her plasma glucose concentration after a GTT is within the normal range, along with a slightly elevated 2-hour serum insulin level. She has a high body mass index and a low diabetes pedigree function score, indicating a moderate risk of developing diabetes in the future.###\nHence this label was avoid."
"The patient is a 33-year-old female who has never been pregnant. She has low diastolic blood pressure (40 mmHg) and above average triceps skin fold thickness (35 mm). Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range at 137 mg/dL. However, her 2-hour serum insulin level is elevated at 168 μU/mL. She has a high body mass index of 43.1 and a relatively high diabetes pedigree function score of 2.288, indicating a potential risk for developing diabetes.###\nHence this label was consent."
"A 23-year-old female who is 1 time pregnant with a healthy diastolic blood pressure of 62. She has a triceps skin fold thickness of 24, a normal plasma glucose concentration of 88 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 44. Her body mass index is 29.9, indicating she is overweight, and her diabetes pedigree function is low at 0.422. Overall, she appears to have fairly good health with low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"A 25-year-old woman who has never been pregnant is being evaluated for diabetes risk. She has a diastolic blood pressure of 76, triceps skin fold thickness of 56, and a high plasma glucose concentration of 162 after a glucose tolerance test. Her 2-hour serum insulin level is 100, and she has a high body mass index of 53.2. Additionally, her diabetes pedigree function is 0.759, indicating a potential genetic predisposition to the disease.###\nHence this label was consent."
"This 24-year-old patient, who has been pregnant once, has a healthy diastolic blood pressure of 68. Their triceps skin fold thickness is normal at 34, and their plasma glucose concentration after a GTT is 87. The 2-hour serum insulin level is at 77, and the patient has a slightly elevated body mass index of 37.6. Their diabetes pedigree function is low at 0.401, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 28-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 74 mmHg and a low triceps skin fold thickness of 12 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 100 mg/dL, and her 2-hour serum insulin level is 46 uU/mL. She has a low body mass index of 19.5 kg/m^2, and her diabetes pedigree function is 0.149.###\nHence this label was avoid."
"This 25-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 80. Their triceps skin fold thickness is 35, plasma glucose concentration is 139, and 2-hour serum insulin level is 160. With a body mass index of 31.6 and a low diabetes pedigree function of 0.361, this individual's risk of developing diabetes may be relatively low.###\nHence this label was consent."
"This patient is a 51-year-old female who has been pregnant five times. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 19. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 166, and her 2-hour serum insulin level is 175. The patient has a body mass index of 25.8 and a diabetes pedigree function of 0.587. Overall, these measurements suggest a moderate risk for developing diabetes.###\nHence this label was consent."
"This is a patient, aged 44, who has been pregnant 13 times, with a diastolic blood pressure of 114. The triceps skin fold thickness and 2-hour serum insulin levels are both 0. They have a plasma glucose concentration of 158 after a glucose tolerance test. The patient's body mass index is 42.3, and their diabetes pedigree function is 0.257.###\nHence this label was consent."
"This individual, aged 33, has been pregnant once. They have a diastolic blood pressure of 98, a triceps skin fold thickness of 41, and a plasma glucose concentration of 128 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 58. With a body mass index of 32.0 and a diabetes pedigree function of 1.321, this person's risk of developing diabetes may be worth monitoring.###\nHence this label was consent."
"This is a 49-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 88 and a triceps skin fold thickness of 0. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 165. Their 2-hour serum insulin level is 0 and they have a body mass index of 30.4. Their diabetes pedigree function is 0.302.###\nHence this label was consent."
"The patient is a 26-year-old woman who has never been pregnant. She has a diastolic blood pressure of 110, triceps skin fold thickness of 46, and a 2-hour serum insulin level of 130. Her plasma glucose concentration after a glucose tolerance test is 129. She has a high body mass index of 67.1 and a relatively low diabetes pedigree function score of 0.319.###\nHence this label was consent."
"This individual is 30 years old and has been pregnant twice. They have a diastolic blood pressure of 68, triceps skin fold thickness of 28, plasma glucose concentration of 124, and 2-hour serum insulin level of 205. Their body mass index is 32.9 and their diabetes pedigree function is 0.875. This information provides insights into their current health status and risk of developing diabetes.###\nHence this label was consent."
"A 27-year-old individual who is 1 time pregnant with a diastolic blood pressure of 60mmHg, triceps skin fold thickness of 23mm, and a plasma glucose concentration of 117mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 106mu U/ml, body mass index is 33.8, and diabetes pedigree function is 0.466.###\nHence this label was avoid."
"The patient is a 39-year-old woman who has been pregnant 3 times. She has a low diastolic blood pressure of 56, a moderate triceps skin fold thickness of 34, and a normal plasma glucose concentration of 96 after a glucose tolerance test. Her 2-hour serum insulin level is elevated at 115. Despite this, her body mass index is within a healthy range at 24.7, and her diabetes pedigree function is relatively low at 0.944.###\nHence this label was avoid."
"The patient is a 26-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and zero serum insulin. Her glucose level after a glucose tolerance test is 131, which is within normal range. Despite having a high body mass index of 43.2, her diabetes pedigree function is low at 0.27, indicating a lower risk of developing diabetes.###\nHence this label was consent."
"This individual is a 42-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 66, no triceps skin fold thickness, and a plasma glucose concentration of 108 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 32.4. The diabetes pedigree function for this individual is 0.272.###\nHence this label was consent."
"The individual is a 37-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 108, no triceps skin fold thickness, and a plasma glucose concentration of 137 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 48.8. Additionally, her diabetes pedigree function is 0.227.###\nHence this label was consent."
"The patient is a 41-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 37 mm. Her plasma glucose concentration after a GTT is 57 mg/dL and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 32.8 and a low diabetes pedigree function value of 0.096, indicating a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"This is a 33-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 34. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 152, with a 2-hour serum insulin level of 171. Their body mass index is 34.2 and they have a diabetes pedigree function score of 0.893.###\nHence this label was consent."
"The patient is a 67-year-old individual who has never been pregnant and has a diastolic blood pressure of 60. They have a triceps skin fold thickness of 0, a low plasma glucose concentration of 57, and no 2-hour serum insulin. Their body mass index is 21.7, and they have a diabetes pedigree function value of 0.735.###\nHence this label was avoid."
"A 21-year-old individual who has been pregnant twice shows normal diastolic blood pressure and a moderate triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within a healthy range, and they have a moderate insulin level. Their body mass index indicates a healthy weight, and their diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 56-year-old woman who has been pregnant 10 times. She has a normal diastolic blood pressure of 72, a relatively low triceps skin fold thickness of 18, and a moderate plasma glucose concentration of 94 after a glucose tolerance test. Her 2-hour serum insulin levels are unusually low at 0. She has a healthy body mass index of 23.1 and a fairly low diabetes pedigree function score of 0.595. Overall, her risk of developing diabetes based on these diagnostic measurements appears to be relatively low.###\nHence this label was avoid."
"This individual is 37 years old and has been pregnant 4 times. Their diastolic blood pressure is 65, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. They have a plasma glucose concentration of 114 after a glucose tolerance test. Their body mass index is 21.9 and their diabetes pedigree function is 0.432.###\nHence this label was avoid."
"The patient is a 26-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a GTT is 171, and she has no 2-hour serum insulin. She has a body mass index of 43.6 and a low diabetes pedigree function of 0.479.###\nHence this label was consent."
"The patient is a 45-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 78 mmHg, a triceps skin fold thickness of 32mm, and a body mass index of 32.4. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 154 mg/dL. She has no 2-hour serum insulin present, and her diabetes pedigree function is 0.443.###\nHence this label was consent."
"The patient is a 22-year-old female who is not pregnant. She has elevated diastolic blood pressure, moderately high triceps skin fold thickness, and high plasma glucose concentration two hours after consuming glucose. Additionally, she has very high levels of serum insulin, indicating possible insulin resistance. Her body mass index is in the obese range, and there is a family history of diabetes as indicated by the diabetes pedigree function score. Overall, this data suggests a high risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 40-year-old female who has been pregnant 10 times. She has a low diastolic blood pressure of 70 mmHg and a healthy triceps skin fold thickness of 27 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 111 mg/dL, with a very low 2-hour serum insulin level of 0 μU/ml. She has a body mass index of 27.5, indicating she is slightly overweight. The patient has a low diabetes pedigree function score of 0.141, suggesting a relatively lower genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 35-year-old woman who has never been pregnant. She has a diastolic blood pressure of 100, triceps skin fold thickness of 39, and a plasma glucose concentration of 93 after a GTT. Her 2-hour serum insulin level is 72, and her body mass index is 43.4. She also has a diabetes pedigree function value of 1.021.###\nHence this label was avoid."
"This is data from a 31-year-old individual who has been pregnant 4 times. They have a low diastolic blood pressure of 60 and a relatively low triceps skin fold thickness of 12. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 129, and their 2-hour serum insulin level is high at 231. Despite this, their body mass index is in the healthy range at 27.5. Their diabetes pedigree function, a measure of the diabetes history in relatives, is 0.527, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a young adult who has never been pregnant and has low diastolic blood pressure. Despite having a below average triceps skin fold thickness, their plasma glucose concentration after a glucose tolerance test is within a normal range. The 2-hour serum insulin level is elevated, indicating possible insulin resistance. With a healthy body mass index and a low diabetes pedigree function, this person may have a low risk of developing diabetes.###\nHence this label was avoid."
"A 24-year-old individual who has been pregnant twice, with a diastolic blood pressure of 78, a triceps skin fold thickness of 50, a plasma glucose concentration of 112 after a glucose tolerance test, 2-hour serum insulin level of 140, and a body mass index of 39.4. The diabetes pedigree function is 0.175.###\nHence this label was avoid."
"This is a 22-year-old individual who is pregnant for the first time. They have a normal diastolic blood pressure of 68 and a triceps skin fold thickness of 35. Their glucose tolerance test result is 0, indicating normal glucose levels after 2 hours. Additionally, their insulin level after 2 hours is 0. Despite a body mass index of 32.0, which is slightly higher than average, their diabetes pedigree function is relatively low at 0.389, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 25-year-old who has never been pregnant. Their diastolic blood pressure is normal at 68, and their triceps skin fold thickness is within a healthy range at 32. Their plasma glucose concentration after a GTT is also normal at 91. However, their 2-hour serum insulin level is high at 210. Despite having a high body mass index of 39.9, their diabetes pedigree function is on the lower side at 0.381.###\nHence this label was avoid."
"A 25-year-old woman, who is pregnant for the first time, has a diastolic blood pressure of 78. She has a triceps skin fold thickness of 29, a plasma glucose concentration of 116 after a glucose tolerance test, and a 2-hour serum insulin level of 180. With a body mass index of 36.1 and a diabetes pedigree function of 0.496, the woman's risk of developing diabetes may warrant further consideration.###\nHence this label was avoid."
"This data belongs to a 30-year-old individual who has been pregnant 3 times. The individual has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 30 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 120 mg/dL, and they have a 2-hour serum insulin level of 135 μU/mL. The individual has a body mass index (BMI) of 42.9 and a diabetes pedigree function value of 0.452.###\nHence this label was avoid."
"This 25-year-old individual has been pregnant 3 times and shows normal diastolic blood pressure. They have a moderate triceps skin fold thickness and a relatively low plasma glucose concentration after a glucose tolerance test. Their insulin levels are normal after 2 hours, and they have a slightly elevated body mass index. The diabetes pedigree function value suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"A 50-year-old individual who has been pregnant 6 times shows normal diastolic blood pressure and a slightly higher than average triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is elevated, while their insulin levels are low. With a body mass index of 33.6, they have a moderate risk of developing diabetes based on their diabetes pedigree function score of 0.627.###\nHence this label was consent."
"A 26-year-old woman who has been pregnant four times shows normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. She has no serum insulin present, a high body mass index, and a moderate diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 49-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 68, triceps skin fold thickness of 26, and a body mass index of 33.6, indicating she is overweight. Her plasma glucose concentration at 2 hours during an oral glucose tolerance test is 165, which is above the normal range, and her 2-hour serum insulin level is 168. The diabetes pedigree function score is 0.631, suggesting a moderate genetic predisposition to diabetes. Overall, these measurements indicate a potential risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 36-year-old female who has been pregnant 7 times. She has normal diastolic blood pressure, a moderate thickness of triceps skinfold, and a slightly low plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are within the normal range, and she has a slightly elevated body mass index. The diabetes pedigree function indicates a moderate genetic risk for diabetes. Overall, the patient shows some risk factors for diabetes, but does not currently have a high risk based on these measurements.###\nHence this label was avoid."
"The individual is a 55-year-old who has been pregnant 3 times. Their diastolic blood pressure is 78, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. Their plasma glucose concentration after a glucose tolerance test is 128. They have a body mass index of 21.1 and a diabetes pedigree function of 0.268.###\nHence this label was avoid."
"The individual is a 67-year-old with 4 pregnancies. They have normal diastolic blood pressure and no triceps skin fold thickness. Their glucose level is slightly elevated at 146, while their insulin level is 0. The person has a high body mass index of 38.5 and a moderate diabetes pedigree function of 0.52.###\nHence this label was consent."
"A 48-year-old individual who has been pregnant 11 times with a diastolic blood pressure of 80, a triceps skin fold thickness of 37, a plasma glucose concentration of 120 after a GTT, a 2-hour serum insulin level of 150, and a body mass index of 42.3. Their diabetes pedigree function is 0.785.###\nHence this label was consent."
"The patient is a 59-year-old individual who has been pregnant 6 times and has a diastolic blood pressure of 78. They have no triceps skin fold thickness and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 194. Their 2-hour serum insulin level is 0, and they have a body mass index of 23.5. The diabetes pedigree function indicates a low genetic risk of diabetes at 0.129.###\nHence this label was consent."
"This individual is a 22-year-old who has been pregnant once. They have a slightly elevated diastolic blood pressure of 84 and a higher-than-average triceps skin fold thickness of 23. Their plasma glucose concentration after a glucose tolerance test is 143, indicating a moderate level. The 2-hour serum insulin level is considerably elevated at 310. With a body mass index of 42.4, this individual is classified as obese. The diabetes pedigree function score of 1.076 suggests a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This is a health profile of a 27-year-old individual who has been pregnant twice. They have low diastolic blood pressure (65), no triceps skin fold thickness, and low insulin levels (0). Their plasma glucose concentration after a glucose tolerance test is normal (85) and they have a high body mass index (39.6). The diabetes pedigree function indicates a low genetic risk for diabetes (0.93).###\nHence this label was avoid."
"The patient is a young, non-pregnant individual with normal diastolic blood pressure and low skin fold thickness. Their glucose level is within a healthy range, and they have normal insulin levels. The patient has a low body mass index and a relatively low risk of developing diabetes based on their family history.###\nHence this label was avoid."
"The patient is a 43-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 106 mmHg and a triceps skin fold thickness of 46 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 167 mg/dL, and her 2-hour serum insulin level is 231 μU/mL. With a body mass index of 37.6 kg/m² and a relatively low diabetes pedigree function of 0.165, she may have a moderate risk of developing diabetes.###\nHence this label was consent."
"This 28-year-old individual is in their first pregnancy and has a low diastolic blood pressure of 50. Their triceps skin fold thickness is at 40, indicating a moderate level of fat under the skin. With a plasma glucose concentration of 125, they are within a healthy range. The 2-hour serum insulin level is high at 167, suggesting possible insulin resistance. Despite having a body mass index of 33.3, which is considered obese, their diabetes pedigree function score of 0.962 indicates a strong genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 55-year-old female who has been pregnant 6 times. She has a low diastolic blood pressure of 61 and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 137, and she has no serum insulin after 2 hours. With a body mass index of 24.2 and a low diabetes pedigree function of 0.151, she shows some characteristics that may indicate a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 30-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, a moderate triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a glucose tolerance test. She has no insulin present in her serum, a healthy body mass index, and a low diabetes pedigree function score. Overall, her risk of developing diabetes appears to be relatively low based on these measurements.###\nHence this label was avoid."
"This individual is a 53-year-old who is not pregnant, with a diastolic blood pressure of 75 mmHg. They have no triceps skin fold thickness, and a normal plasma glucose concentration of 105 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0 μU/ml, indicating low insulin production. With a body mass index of 23.3, this person has a healthy weight. The diabetes pedigree function score is 0.56, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 34-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 84, triceps skin fold thickness of 44, and a plasma glucose concentration of 155 after a glucose tolerance test. Her 2-hour serum insulin level is 545, and she has a body mass index of 38.7. The diabetes pedigree function, which indicates the likelihood of developing diabetes based on family history, is 0.619.###\nHence this label was avoid."
"The data belongs to a 22-year-old individual who has never been pregnant. They have a diastolic blood pressure of 82, a triceps skin fold thickness of 15, a plasma glucose concentration of 98, and 2-hour serum insulin of 84. Their body mass index is 25.2, and their diabetes pedigree function is 0.299.###\nHence this label was avoid."
"This 38-year-old individual has been pregnant three times and has a diastolic blood pressure of 74. Their triceps skin fold thickness is 16, plasma glucose concentration after a GTT is 89, and 2-hour serum insulin level is 85. With a body mass index of 30.4 and a diabetes pedigree function of 0.551, this individual's health profile suggests the possibility of diabetes risk.###\nHence this label was avoid."
"A 25-year-old woman who has never been pregnant has normal blood pressure, no triceps skin fold thickness, and normal insulin levels. Her plasma glucose concentration after a glucose tolerance test is slightly higher than average. She has a high body mass index and a family history of diabetes.###\nHence this label was consent."
"The patient is a 21-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 60 mmHg. Her triceps skin fold thickness is 32 mm. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 124 mg/dL. She has no detectable serum insulin after 2 hours. Her body mass index is 35.8, indicating obesity. The diabetes pedigree function score is 0.514, suggesting a moderate genetic predisposition to diabetes. Overall, the patient exhibits some risk factors for developing diabetes, such as obesity and elevated glucose levels, but further monitoring and evaluation may be needed for a definitive diagnosis.###\nHence this label was avoid."
"The patient is a 69-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 82 and triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 136, with no 2-hour serum insulin detected. Her body mass index is 0.0 and she has a diabetes pedigree function value of 0.64.###\nHence this label was avoid."
"The 32-year-old patient has been pregnant 6 times and has a diastolic blood pressure of 68. Their triceps skin fold thickness is 30, plasma glucose concentration is 125, and 2-hour serum insulin is 120. With a body mass index of 30.0 and a diabetes pedigree function of 0.464, this patient's data suggests they may be at risk for developing diabetes.###\nHence this label was avoid."
"This patient is a 41-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 26. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125, and her 2-hour serum insulin level is 115. She has a body mass index of 31.1 and a diabetes pedigree function of 0.205.###\nHence this label was consent."
"A 27-year-old woman, who has been pregnant twice, with a diastolic blood pressure of 68, a triceps skin fold thickness of 42, and a plasma glucose concentration of 90 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 38.2. Her diabetes pedigree function is 0.503.###\nHence this label was consent."
"This 21-year-old patient, who has been pregnant once, shows a relatively low diastolic blood pressure of 56. Their triceps skin fold thickness is 29, indicating a moderate amount of subcutaneous fat. The plasma glucose concentration after a 2-hour GTT is 126, which is within the normal range. Despite a high 2-hour serum insulin level of 152, their body mass index is 28.7, suggesting they are overweight. The diabetes pedigree function score of 0.801 indicates a moderate genetic predisposition to diabetes. Overall, this individual may have a moderate risk of developing diabetes due to their insulin levels and BMI.###\nHence this label was avoid."
"This 36-year-old individual has been pregnant 8 times and has a diastolic blood pressure of 78. Their triceps skin fold thickness is 32, plasma glucose concentration after a glucose tolerance test is 151, and 2-hour serum insulin level is 210. With a body mass index of 42.9 and a diabetes pedigree function of 0.516, this data suggests a complex health profile that may warrant further evaluation for diabetes risk.###\nHence this label was consent."
"This 32-year-old individual, who has been pregnant 9 times, has a diastolic blood pressure of 84 and a triceps skin fold thickness of 21. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 164, while their 2-hour serum insulin level is 0. With a body mass index of 30.8 and a diabetes pedigree function value of 0.831, this person's overall risk of developing diabetes may be of concern.###\nHence this label was consent."
"The patient is a 22-year-old individual who has been pregnant 8 times. They have normal diastolic blood pressure, no triceps skin fold thickness, and normal plasma glucose concentration after a 2-hour oral glucose tolerance test. They have very low serum insulin levels and a slightly elevated body mass index. Additionally, their diabetes pedigree function score is relatively low.###\nHence this label was consent."
"This data represents a 28-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 88 and a triceps skin fold thickness of 11. After a 2-hour oral glucose tolerance test, their plasma glucose concentration was 127. Their 2-hour serum insulin level is 155. With a body mass index of 34.5 and a diabetes pedigree function of 0.598, this individual's risk of developing diabetes may be a concern.###\nHence this label was avoid."
"The patient is a 61-year-old female who has been pregnant 7 times. She has a lower than average diastolic blood pressure of 60, normal triceps skin fold thickness of 33, and slightly elevated plasma glucose concentration at 142. Her 2-hour serum insulin level is high at 190, and she has a healthy body mass index of 28.8. Additionally, her diabetes pedigree function score is moderate at 0.687. Overall, this patient shows some signs of potential insulin resistance and should be monitored closely for diabetes.###\nHence this label was avoid."
"This patient is 41 years old and has been pregnant 8 times. They have a low diastolic blood pressure of 66 and no triceps skin fold thickness. Their plasma glucose concentration after a GTT is 143, with no serum insulin present. Despite a high body mass index of 34.9, their diabetes pedigree function is low at 0.129.###\nHence this label was consent."
"This data belongs to a 24-year-old individual who has never been pregnant. Their diastolic blood pressure is 78, triceps skin fold thickness is 40, plasma glucose concentration after a GTT is 102, 2-hour serum insulin is 90, body mass index is 34.5, and their diabetes pedigree function is 0.238.###\nHence this label was avoid."
"This is a record of a 63-year-old individual who has been pregnant 10 times. Their diastolic blood pressure is 76, triceps skin fold thickness is 48, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 101. They have a 2-hour serum insulin level of 180 and a body mass index of 32.9. Their diabetes pedigree function is 0.171.###\nHence this label was avoid."
"The patient is a 54-year-old woman who has been pregnant 6 times. She has a normal diastolic blood pressure of 76. Her triceps skin fold thickness is 0, indicating a low level of subcutaneous fat. Her plasma glucose concentration is within a healthy range at 125. There is no insulin present in her bloodstream 2 hours after a glucose tolerance test. Her body mass index is 33.8, suggesting she is overweight. The diabetes pedigree function, a measure of the hereditary risk of diabetes, is low at 0.121. Overall, this patient shows some signs of potential diabetes risk due to her age and BMI, but her current measurements are generally within normal ranges.###\nHence this label was consent."
"This data belongs to a 30-year-old individual who has been pregnant 3 times. They have low diastolic blood pressure, moderate triceps skin fold thickness, normal plasma glucose concentration, no insulin after a glucose tolerance test, a slightly elevated body mass index, and a moderate diabetes pedigree function score.###\nHence this label was avoid."
"A 28-year-old individual who has been pregnant 3 times with normal diastolic blood pressure of 70. They have a moderately high Triceps skin fold thickness of 18, and a high plasma glucose concentration of 163 after a glucose tolerance test. Their insulin levels after 2 hours are elevated at 105, and they have a relatively high body mass index of 31.6. However, their diabetes pedigree function is low at 0.268.###\nHence this label was consent."
"The patient is a 41-year-old female who is in the early stages of pregnancy. She has normal diastolic blood pressure and low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is elevated, while her insulin levels are low. She has a high body mass index and a moderately low diabetes pedigree function score.###\nHence this label was consent."
"This patient is a 28-year-old female who has never been pregnant. She has a low diastolic blood pressure of 66 and a moderately high triceps skin fold thickness of 32. Her plasma glucose concentration after a glucose tolerance test is very high at 198, indicating possible diabetes risk. Additionally, her 2-hour serum insulin level is elevated at 274. She has a high body mass index of 41.3, which further suggests a risk for diabetes. The diabetes pedigree function score is relatively low at 0.502, indicating a moderate genetic predisposition to diabetes. Overall, this individual may be at high risk for developing diabetes based on these diagnostic measurements.###\nHence this label was consent."
"The person in the data is a 45-year-old individual who is 1 time pregnant and has a diastolic blood pressure of 94. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 111 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 0. Their body mass index is 32.8 and their diabetes pedigree function is 0.265.###\nHence this label was avoid."
"The patient is a 40-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 0, no triceps skin fold thickness, and 0 serum insulin. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 135. She has a high body mass index of 52.3 and a diabetes pedigree function of 0.578.###\nHence this label was consent."
"This 33-year-old individual, who has been pregnant 4 times, has a healthy diastolic blood pressure of 68. They also have a normal triceps skin fold thickness of 38mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 99mg/dL. Although their 2-hour serum insulin level is low at 0 μU/ml, their body mass index is within a healthy range at 32.8. Additionally, their diabetes pedigree function score is low at 0.145, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 61-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 92, a triceps skin fold thickness of 0, and a plasma glucose concentration of 146 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 31.2. The diabetes pedigree function for this patient is 0.539.###\nHence this label was consent."
"The patient is a 60-year-old woman who has been pregnant 4 times. She has a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 134 and she has no insulin detected in her serum after 2 hours. With a healthy body mass index of 23.8 and a low diabetes pedigree function of 0.277, she has a relatively low risk of developing diabetes.###\nHence this label was consent."
"This data represents a 22-year-old individual who is pregnant for the first time. She has low diastolic blood pressure of 48 and a normal triceps skin fold thickness of 18. Her plasma glucose concentration after a glucose tolerance test is low at 71, and her 2-hour serum insulin level is also low at 76. With a healthy body mass index of 20.4 and a diabetes pedigree function of 0.323, she appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 21-year-old who is pregnant for the first time. They have a diastolic blood pressure of 62 and a triceps skin fold thickness of 41. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 139, and their 2-hour serum insulin level is high at 480. They have a body mass index of 40.7 and a low diabetes pedigree function of 0.536. Overall, the data suggests a potential risk for developing diabetes due to high insulin levels and high body mass index.###\nHence this label was avoid."
"This data describes a 25-year-old individual who has been pregnant twice and has a low diastolic blood pressure of 58. They have a triceps skin fold thickness of 33, a plasma glucose concentration of 144 after a glucose tolerance test, and a 2-hour serum insulin level of 135. The individual has a body mass index of 31.6 and a relatively low diabetes pedigree function score of 0.422.###\nHence this label was consent."
"A 36-year-old individual who has been pregnant 7 times with low diastolic blood pressure, no triceps skin fold thickness, and normal plasma glucose concentration at 2 hours. Their 2-hour serum insulin levels are low, and they have a slightly elevated body mass index. Their diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was consent."
"This data belongs to a 32-year-old individual who has been pregnant 7 times. They have a diastolic blood pressure of 76, triceps skin fold thickness of 32, plasma glucose concentration of 97, 2-hour serum insulin level of 91, body mass index of 40.9, and a diabetes pedigree function value of 0.871.###\nHence this label was consent."
"A 26-year-old individual who has never been pregnant shows normal diastolic blood pressure and a slightly elevated BMI. Their 2-hour serum insulin level is within normal range, as is their plasma glucose concentration after an oral glucose tolerance test. They have a moderately high triceps skin fold thickness and a low diabetes pedigree function, indicating a low risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 46-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 62 and a triceps skin fold thickness of 26. Her plasma glucose concentration after a glucose tolerance test is 155, and her 2-hour serum insulin level is 495. With a body mass index of 34.0, she has a diabetes pedigree function of 0.543. This data suggests a high risk for developing diabetes.###\nHence this label was consent."
"A 28-year-old woman, who has been pregnant four times, has a diastolic blood pressure of 58 mmHg and a triceps skin fold thickness of 22 mm. Her plasma glucose concentration after a glucose tolerance test is 85 mg/dL, and her 2-hour serum insulin level is 49 uU/ml. She has a body mass index of 27.8 and a diabetes pedigree function of 0.306.###\nHence this label was avoid."
"A 27-year-old woman who has never been pregnant has a slightly elevated diastolic blood pressure of 82. She has a moderate triceps skin fold thickness of 39, a high plasma glucose concentration of 152 after a glucose tolerance test, and a high 2-hour serum insulin level of 272. Her body mass index is indicative of obesity at 41.5, but she has a relatively low diabetes pedigree function score of 0.27. Overall, this individual shows signs of potential risk for developing diabetes due to her glucose and insulin levels, as well as her high BMI.###\nHence this label was avoid."
"This individual is a 39-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 0, and a low plasma glucose concentration of 78 in a glucose tolerance test. Her 2-hour serum insulin levels are also low at 0. However, her body mass index is relatively high at 32.5, and her diabetes pedigree function is 0.27. Overall, this individual may have a lower risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"The patient is a 31-year-old woman who has been pregnant 6 times. She has a low diastolic blood pressure of 70 and no triceps skin fold thickness. Her plasma glucose concentration after a GTT is elevated at 195, while her 2-hour serum insulin level is 0. Her body mass index is 30.9, indicating overweight. The diabetes pedigree function score is 0.328, suggesting a low genetic risk for diabetes.###\nHence this label was consent."
"This individual is a young adult 21 years of age who has never been pregnant. They have normal diastolic blood pressure and a slightly below average triceps skin fold thickness. Their blood glucose levels are lower than normal after a glucose tolerance test and their insulin levels are within the expected range. Despite having a high body mass index, the individual has a relatively low risk of developing diabetes according to their diabetes pedigree function score.###\nHence this label was avoid."
"A 30-year-old individual who has been pregnant 5 times shows normal diastolic blood pressure, low triceps skin fold thickness, and slightly low plasma glucose concentration after a glucose tolerance test. They also have relatively low insulin levels, a healthy body mass index, and a moderately low diabetes pedigree function score.###\nHence this label was avoid."
"A 30-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 74. They have no triceps skin fold thickness and a plasma glucose concentration of 116 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 25.6. The diabetes pedigree function for this individual is 0.201.###\nHence this label was avoid."
"This is a 22-year-old individual who has been pregnant twice. Despite having a low diastolic blood pressure of 58, their triceps skin fold thickness is at a healthy level of 26. They have a normal plasma glucose concentration of 88 after a 2-hour oral glucose tolerance test and a moderate 2-hour serum insulin level of 16. With a body mass index of 28.4, they are slightly overweight. The diabetes pedigree function value of 0.766 indicates a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 28-year-old woman who has been pregnant twice shows normal diastolic blood pressure and a healthy glucose metabolism, with high insulin levels. She has a moderate amount of body fat, indicating a slightly increased risk for diabetes based on her family history.###\nHence this label was consent."
"The patient is a 29-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 52. Her plasma glucose concentration after a glucose tolerance test is 86, and her 2-hour serum insulin level is 65. She has a body mass index of 41.3 and a diabetes pedigree function value of 0.917.###\nHence this label was avoid."
"This individual is a 47-year-old who has been pregnant 10 times. They have a diastolic blood pressure of 106 mmHg, a triceps skin fold thickness of 23 mm, and a plasma glucose concentration of 68 mg/dL after a glucose tolerance test. Their 2-hour serum insulin level is 49 μU/mL, and they have a body mass index of 35.5. The diabetes pedigree function, which assesses the risk of diabetes based on family history, is 0.285 for this individual.###\nHence this label was avoid."
"This individual is a 45-year-old female who has been pregnant 5 times, with a diastolic blood pressure of 80. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 128 after a GTT, and a BMI of 34.6. Their 2-hour serum insulin level is 0, and their diabetes pedigree function is 0.144.###\nHence this label was avoid."
"This individual is a 30-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 74 mmHg, a triceps skin fold thickness of 25 mm, and a plasma glucose concentration of 147 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 293 μU/ml, and she has a body mass index of 34.9 kg/m². Her diabetes pedigree function is 0.385.###\nHence this label was avoid."
"A 37-year-old woman who is 5 times pregnant has a normal diastolic blood pressure, a slightly below average triceps skin fold thickness, and a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are low, and she has a healthy body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"A 25-year-old individual, who has been pregnant 4 times, with a low diastolic blood pressure of 62 and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 76, with no insulin present. They have a body mass index of 34.0 and a low diabetes pedigree function value of 0.391.###\nHence this label was avoid."
"A 27-year-old individual who has been pregnant 5 times with a low diastolic blood pressure of 60. The triceps skin fold thickness is 0, indicating a slim individual. The plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 73, and there is no serum insulin present. The body mass index is 26.8, suggesting the individual is in the overweight category. A low diabetes pedigree function of 0.268 indicates a relatively lower genetic risk for diabetes.###\nHence this label was avoid."
"The patient is 36 years old and has been pregnant 4 times. They have normal diastolic blood pressure and triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is elevated at 183, while their insulin levels are low. The patient has a healthy body mass index of 28.4 and a low diabetes pedigree function of 0.212.###\nHence this label was consent."
"The patient is a 21-year-old female who has been pregnant 4 times. She has a normal diastolic blood pressure of 65 and a slightly below average triceps skin fold thickness of 22. Her plasma glucose concentration after a GTT is within the normal range at 94. She has a very low 2-hour serum insulin level of 0. Her body mass index is in the healthy range at 24.7, and her diabetes pedigree function is low at 0.148. Overall, she appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"The data belongs to a 26-year-old individual who has never been pregnant. They have a healthy diastolic blood pressure of 74, a moderate triceps skin fold thickness of 18, and normal plasma glucose concentration of 120 after a glucose tolerance test. Their insulin level after 2 hours is 63, indicating normal functioning. The individual has a body mass index of 30.5, which falls into the obese category. Their diabetes pedigree function is low at 0.285, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 40-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 88, triceps skin fold thickness of 42, and a plasma glucose concentration of 168 after a GTT. Her 2-hour serum insulin level is 321, and her body mass index is 38.2. She has a diabetes pedigree function of 0.787. These measurements suggest a potential risk for developing diabetes.###\nHence this label was consent."
"The patient is a 34-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 68, triceps skin fold thickness of 15, and a plasma glucose concentration of 191 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130, and she has a body mass index of 30.9. The diabetes pedigree function value is 0.299.###\nHence this label was avoid."
"This patient is a 23-year-old female who has been pregnant 3 times. She has a diastolic blood pressure reading of 0 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 116 mg/dL. She has a 2-hour serum insulin level of 0 μU/mL and a body mass index of 23.5 kg/m². Her diabetes pedigree function is 0.187, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"A 27-year-old woman who has been pregnant 3 times has a slightly elevated diastolic blood pressure of 88. She also has a high triceps skin fold thickness of 41, indicating excess body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 126, which is within a normal range. However, she has a high 2-hour serum insulin level of 235, suggesting possible insulin resistance. Her body mass index is 39.3, classified as obese. The diabetes pedigree function score of 0.704 indicates a moderate genetic risk for diabetes. Overall, this individual shows signs of potential health risks associated with obesity and insulin resistance.###\nHence this label was avoid."
"The patient is a 21-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 27 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 96 mg/dL, and her 2-hour serum insulin level is 87 μU/mL. She has a body mass index of 33.2 and a low diabetes pedigree function score of 0.289.###\nHence this label was avoid."
"A 28-year-old woman, who is not pregnant, has a lower diastolic blood pressure, normal glucose tolerance, no insulin resistance, but higher body mass index. She has a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 34-year-old female who has been pregnant 7 times. She has a low diastolic blood pressure of 64 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 114. She has no 2-hour serum insulin detected. Her body mass index is 27.4, and her diabetes pedigree function is 0.732.###\nHence this label was consent."
"A 27-year-old individual who has been pregnant twice, with a diastolic blood pressure of 70 and a triceps skin fold thickness of 27. They have a plasma glucose concentration of 122 after a GTT, no serum insulin after 2 hours, a body mass index of 36.8, and a diabetes pedigree function of 0.34.###\nHence this label was avoid."
"This data belongs to a 27-year-old individual who has been pregnant 3 times. They have a normal diastolic blood pressure of 72 and a low triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 106, with no insulin detected. They have a healthy body mass index of 25.8 and a low diabetes pedigree function score of 0.207.###\nHence this label was avoid."
"A 41-year-old individual who has been pregnant 7 times shows a diastolic blood pressure of 90. They have a triceps skin fold thickness of 0, a high plasma glucose concentration of 196 after a glucose tolerance test, and no insulin level after 2 hours. With a body mass index of 39.8 and a low diabetes pedigree function of 0.451, this person may be at risk for developing diabetes.###\nHence this label was consent."
"This 26-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 64. Their triceps skin fold thickness is 44, plasma glucose concentration is 109, and 2-hour serum insulin is 99. With a body mass index of 34.8 and a diabetes pedigree function of 0.905, this person's health profile suggests a need for monitoring and potential risk of developing diabetes.###\nHence this label was consent."
"This data belongs to a 22-year-old individual who has been pregnant twice. The individual has a low diastolic blood pressure of 56 and a moderately low triceps skin fold thickness of 27. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 106, indicating relatively normal blood sugar levels. The 2-hour serum insulin level is high at 165, suggesting potential insulin resistance. The individual has a body mass index of 29.0, which falls in the overweight category. Their diabetes pedigree function is relatively low at 0.426, indicating a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 58-year-old woman who has been pregnant 5 times. Her diastolic blood pressure is 82 mmHg, triceps skin fold thickness is 26mm, and her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 144 mg/dL. She has a 2-hour serum insulin level of 285 mu U/ml and a body mass index of 32.0. The diabetes pedigree function, a measure of diabetes susceptibility based on family history, is 0.452. These measurements suggest that the patient may be at risk for developing diabetes.###\nHence this label was consent."
"This 22-year-old patient has been pregnant three times and shows normal diastolic blood pressure. They have no triceps skin fold thickness or 2-hour serum insulin levels. Their plasma glucose concentration after a glucose tolerance test is 130, which is within the normal range. With a healthy body mass index of 23.1 and a low diabetes pedigree function score of 0.314, this individual has a low risk of developing diabetes.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant twice and shows no diastolic blood pressure, triceps skin fold thickness, or serum insulin. Their plasma glucose concentration after a GTT is 99, body mass index is 22.2, and they have a low diabetes pedigree function of 0.108.###\nHence this label was avoid."
"A 37-year-old woman who has been pregnant 4 times with a diastolic blood pressure of 82, triceps skin fold thickness of 32, and a body mass index of 38.5. Her plasma glucose concentration after a GTT is 144, with no insulin detected in her serum. Additionally, her diabetes pedigree function is 0.554.###\nHence this label was consent."
"The patient is a 52-year-old woman who has been pregnant 13 times. She has normal diastolic blood pressure (70), no triceps skin fold thickness, and a normal 2-hour serum insulin level of 0. However, her plasma glucose concentration is slightly elevated at 106. Her body mass index is in the obese range at 34.2, and her diabetes pedigree function is low at 0.251. Overall, she may be at risk for developing diabetes due to her age, high BMI, and elevated glucose levels.###\nHence this label was avoid."
"A 25-year-old individual, who has been pregnant 5 times, demonstrates a low diastolic blood pressure of 48. They have no triceps skin fold thickness and very low levels of plasma glucose concentration at 78. Their 2-hour serum insulin is also very low at 0. Despite a relatively high body mass index of 33.7, their diabetes pedigree function is moderately low at 0.654.###\nHence this label was avoid."
"The patient is a 40-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 46, and a plasma glucose concentration of 145 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130, and her body mass index is 37.9. The diabetes pedigree function score is 0.637.###\nHence this label was consent."
"This individual is a 42-year-old woman who has been pregnant 13 times. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 126 mg/dL. She has a 2-hour serum insulin level of 0 μU/mL. With a body mass index of 43.4, she has a diabetes pedigree function value of 0.583.###\nHence this label was consent."
"The patient is a 45-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 102, and her 2-hour serum insulin level is 105. She has a body mass index of 37.2 and a diabetes pedigree function of 0.204.###\nHence this label was avoid."
"The patient is a 22-year-old who has never been pregnant. They have a diastolic blood pressure of 66 and a triceps skin fold thickness of 40. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 131. They have no insulin present in their serum after 2 hours. Their body mass index is 34.3 and their diabetes pedigree function is 0.196.###\nHence this label was consent."
"This individual is a young adult who has never been pregnant and has a normal diastolic blood pressure. Their triceps skin fold thickness and 2-hour serum insulin levels are both at 0, while their plasma glucose concentration at 2 hours is within a healthy range. Despite having a slightly elevated body mass index, their diabetes pedigree function indicates a low genetic risk for developing diabetes.###\nHence this label was avoid."
"This data describes a 25-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 74, triceps skin fold thickness of 30, and a plasma glucose concentration of 112 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 31.6. Additionally, their diabetes pedigree function is 0.197.###\nHence this label was consent."
"The patient is a 37-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 80 and a triceps skin fold thickness of 32. Her plasma glucose concentration is 0, as well as her 2-hour serum insulin level. She has a body mass index of 41.0 and a diabetes pedigree function of 0.346.###\nHence this label was consent."
"A 26-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 64, triceps skin fold thickness of 35, plasma glucose concentration of 139 after a GTT, 2-hour serum insulin level of 140, body mass index of 28.6, and a diabetes pedigree function of 0.411.###\nHence this label was avoid."
"A 25-year-old person, who has been pregnant 2 times, with a diastolic blood pressure of 72, triceps skin fold thickness of 15, plasma glucose concentration of 81 after a glucose tolerance test, 2-hour serum insulin level of 76, body mass index of 30.1, and a diabetes pedigree function score of 0.547. These measurements are used to assess the risk of developing diabetes in this individual.###\nHence this label was avoid."
"This individual is 38 years old and has been pregnant 8 times. They have a diastolic blood pressure of 0 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 120 mg/dL, and their 2-hour serum insulin level is 0 uU/ml. Their body mass index is 30.0, indicating they are overweight. The diabetes pedigree function score is 0.183, suggesting a low genetic risk for diabetes.###\nHence this label was consent."
"A 48-year-old individual, who has been pregnant 9 times, with a diastolic blood pressure of 72. Their triceps skin fold thickness is 22, plasma glucose concentration after a glucose tolerance test is 120, and 2-hour serum insulin level is 56. They have a body mass index of 20.8 and a diabetes pedigree function of 0.733.###\nHence this label was avoid."
"A 23-year-old woman who is pregnant for the first time with a healthy diastolic blood pressure level and average triceps skin fold thickness. She has a slightly low plasma glucose concentration after a 2-hour oral glucose tolerance test and moderate insulin levels. Her body mass index is within the overweight range, and her diabetes pedigree indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 29-year-old individual who has been pregnant 10 times. They have a diastolic blood pressure of 0, a triceps skin fold thickness of 0, and a 2-hour serum insulin level of 0. Their plasma glucose concentration after a glucose tolerance test is 115. Despite having a body mass index of 35.3, their diabetes pedigree function is low at 0.134.###\nHence this label was avoid."
"A 53-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 70 and a triceps skin fold thickness of 45. They have a high plasma glucose concentration of 197 after a two-hour oral glucose tolerance test and a high 2-hour serum insulin level of 543. Despite having a Body Mass Index of 30.5, their Diabetes Pedigree Function is relatively low at 0.158. Overall, this person shows signs of potential diabetes risk with elevated glucose and insulin levels, albeit with a moderate family history impact.###\nHence this label was consent."
"A 42-year-old individual, who has been pregnant seven times, with a diastolic blood pressure of 66, no triceps skin fold thickness, a plasma glucose concentration of 114 after a glucose tolerance test, no insulin after 2 hours, a body mass index of 32.8, and a diabetes pedigree function of 0.258.###\nHence this label was consent."
"A 58-year-old individual who has been pregnant eight times shows signs of high blood pressure, elevated glucose levels, high insulin levels, and a high body mass index. Despite a family history of diabetes, their overall risk level for developing diabetes is moderate.###\nHence this label was consent."
"A 25-year-old woman, who has been pregnant twice, with a diastolic blood pressure of 70, a triceps skin fold thickness of 52, a plasma glucose concentration of 100, a 2-hour serum insulin level of 57, a body mass index of 40.5, and a diabetes pedigree function of 0.677.###\nHence this label was avoid."
"The patient is a 22-year-old female who is pregnant for the first time. She has low diastolic blood pressure (60 mmHg) and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour GTT is 151 mg/dL. The patient has no 2-hour serum insulin detected, and her body mass index is 26.1, indicating she is overweight. The diabetes pedigree function is 0.179, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 34-year-old who has been pregnant 10 times. She has a diastolic blood pressure of 98, no triceps skin fold thickness, and a plasma glucose concentration of 115 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 24.0. Additionally, her diabetes pedigree function is 1.022.###\nHence this label was avoid."
"This data corresponds to a young individual, aged 26, who is slightly overweight with a body mass index of 24.2. They have been pregnant once. Their diastolic blood pressure is low at 50, and their triceps skin fold thickness is within normal range at 15. The individual's plasma glucose concentration after a glucose tolerance test is 101, which is considered average. Their 2-hour serum insulin level is 36, indicating normal insulin production. The diabetes pedigree function value is 0.526, suggesting a low genetic risk of diabetes.###\nHence this label was avoid."
"The patient is a 34-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 35. Her plasma glucose concentration after a glucose tolerance test is 106 and her 2-hour serum insulin level is 119. She has a body mass index of 30.5 and a diabetes pedigree function value of 1.4.###\nHence this label was avoid."
