"The individual is a 34-year-old White male who is divorced. He is classified as an Own-child in relation to the head of the household. He is a private sector employee working in the cleaning and maintenance sector. The individual is a high school graduate, working 35 hours per week with no capital gain or loss last year. He is a native of the United States.###\nHence this label was No."
"The individual is a 42-year-old Black female from the United States. She is separated and unmarried, working in a professional specialty occupation for the state government. She did not have any capital gains or losses last year. She has completed less than a year of college education and works 40 hours per week.###\nHence this label was No."
"The individual is a 57-year-old married White male from Italy, working in the private sector in the cleaning and maintenance sector. He finished 4th class education and works 40 hours per week. There was no capital gain or loss last year.###\nHence this label was No."
"The individual is a 45-year-old married White male from the United States. He works in office and administrative support in the private sector, putting in 50 hours per week. Although he finished 12th class without obtaining a diploma, he earned a capital gain of 2407 last year. He did not incur any capital loss.###\nHence this label was No."
"The individual is a 33-year-old married White male living in the United States. He works in the private sector as an employee in the transportation, communication, and other public utilities sector. He is a high school graduate working 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 33-year-old divorced white female from Germany. She is unmarried and works in a professional specialty occupation in the private sector. With a bachelor's degree, she worked 40 hours per week and had a capital gain of $914 last year, with no capital loss.###\nHence this label was No."
"The person in the dataset is a 45-year-old White female from the United States. She is divorced and classified as an Own-child in terms of household relation. She works in the craft and repair sector as a private sector employee, with a high school graduate education. Last year, she had no capital gains or losses and typically works 40 hours per week.###\nHence this label was No."
"The individual is a 72-year-old Black male who is married and works in the protective services sector as a private sector employee in the United States. He has no capital gain or loss from the previous year and has received college education for less than a year. He works 40 hours per week.###\nHence this label was No."
"The individual is a 60-year-old married White male from the United States. He works in the service sector as a private sector employee and is a high school graduate. He has 40 work hours per week, with no capital gain or loss last year.###\nHence this label was Yes."
"This individual is an 18-year-old White female from the United States who has never been married. She is considered an Own-child in the household and works in the service sector as a private sector employee. She attended college for less than one year and works 15 hours per week. Last year, she did not have any capital gain or loss.###\nHence this label was No."
"The individual is a 41-year-old Black female from the United States, who is married and works in office and administrative support for the local government. She has not experienced any capital gain or loss in the last year. She has attended college for less than one year and works 40 hours per week.###\nHence this label was No."
"The person is a 39-year-old White male who is separated and not living with family. He is from the United States and works in the sales sector as a private sector employee. With a bachelor's degree, he works 50 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 20-year-old White male from the United States who has never been married. He is categorized as an own-child in the household. He works as a private sector employee in the transportation, communication, and other public utilities sector. Despite having some capital loss last year, his income remains below $50,000 as his capital gain was 0. He has received college education for less than a year and works 40 hours per week.###\nHence this label was No."
"The individual is a 30-year-old White female from the United States. She is separated and unmarried, working in an office and administrative support role in the private sector. She has a high school education and works 40 hours per week. In the previous year, she had no capital gains or losses. The prediction is whether her annual income is over $50,000.###\nHence this label was No."
"The person is a 40-year-old married Black male from the United States. He works in the private sector as an employee in the cleaning and maintenance sector. He is a high school graduate and works 40 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"This dataset describes a 24-year-old unmarried White male from the United States. He works as a private sector employee in the cleaning and maintenance sector, holding an associate's degree. He is not living with family and worked 48 hours per week last year with no capital gain or loss. The prediction is whether his annual income exceeds $50,000.###\nHence this label was No."
"This individual is a 27-year-old Black female from the United States who has never been married. She works in the sales sector as a private sector employee, with a bachelor's degree as her highest level of education. She is not living with family and worked 40 hours per week last year. Although she did not have any capital gains, she experienced a capital loss of $1590.###\nHence this label was No."
"This is a 20-year-old White female from the United States who has never been married. She is classified as an Own-child in the household. She works as a machine operator and inspector in the private sector, with a high school education. She works 40 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This dataset describes a 46-year-old White male in the United States who is married and works in the craft and repair sector as a private sector employee. He holds a bachelor's degree, works 44 hours per week, and had no capital gains or losses last year. The prediction task is to determine whether his annual income exceeds $50,000.###\nHence this label was Yes."
"This person is a 43-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, putting in 40 hours per week. He has had no capital gains or losses in the last year and has attended college for at least one year without obtaining a degree.###\nHence this label was No."
"This individual is a 38-year-old married White male from the United States. He works in the private sector as an executive and manager, holding a bachelor's degree. Last year, he had a capital loss of $1848 and did not have any capital gains. He works 54 hours per week.###\nHence this label was Yes."
"This 27-year-old White female, who has never been married, resides in the United States and is not living with family members. She works in the private sector as an execution and management employee with an associate's degree. Despite working 40 hours per week, she did not report any capital gains or losses last year.###\nHence this label was Yes."
"This data describes a 23-year-old White male who is married and the husband in the household. He is from the United States and has a high school education. His occupation and work class are not specified. He had no capital gain but experienced a capital loss of $1,573 last year. He works 40 hours per week.###\nHence this label was No."
"This is a 23-year-old White female from the United States who has never been married. She is an unmarried private sector employee working in office and administrative support, with an education level of college for less than one year. Last year, she had no capital gains or losses, and she works 38 hours per week.###\nHence this label was No."
"This individual is a 20-year-old white male, who is separated and considered an own-child in the household. He is from the United States and works as a machine operator and inspector in the private sector. With a high school education, he works 40 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This 23-year-old Black male from Haiti is employed in the private sector as an office and administrative support worker. He has never been married and is classified as an own-child in the household. With less than one year of college education, he works 20 hours per week with no recorded capital gain or loss.###\nHence this label was No."
"The individual is a 63-year-old married White male from the United States. He works in the sales sector as the owner of a non-incorporated business, professional practice, or farm. He holds a bachelor's degree and works 30 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The individual is a 40-year-old married White male, working as a machine operator and inspector in the private sector in the United States. He has no capital gains or losses from the previous year, and he attended college for less than a year. He works 40 hours per week and is classified as the husband in the household.###\nHence this label was Yes."
"This individual is a 55-year-old Black male from the United States. He has never been married and is categorized as an Other-relative in terms of his relation to the head of the household. He works in the private sector as an employee in the cleaning and maintenance sector, working 37 hours per week. He had no capital gains or losses in the last year and completed 9th class in terms of education.###\nHence this label was No."
"The individual is a 33-year-old white female from the United States. She is divorced and currently unmarried. She works in the sales sector as a private sector employee, with a high school education. Last year, she had no capital gain or loss. She works 40 hours per week.###\nHence this label was No."
"This dataset entry is of a 17-year-old White female from the United States who is never married and listed as an Own-child in the household. She works in the sales sector as a private sector employee, having finished the 12th class without receiving a diploma. In the previous year, she had no capital gains or losses. She works 20 hours per week.###\nHence this label was No."
"The individual is a 38-year-old White female from the United States. She is divorced and not living with family. She works in the private sector as an executive and manager, with a college education of less than one year. Despite working 40 hours a week, she had no capital gains or losses last year.###\nHence this label was No."
"The individual is a 27-year-old married White female from Mexico. She works in the agriculture, forestry, and fisheries sector as a private sector employee with a high school education. She is classified as an own-child in relation to the head of the household. She had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 47-year-old married White male from the United States. He holds a master's degree and works in execution and management in the local government sector. Last year, he did not have any capital gains or losses. He works 37 hours per week and is classified as a husband in the household.###\nHence this label was Yes."
"This person is a 57-year-old White female from the United States. She is widowed and unmarried, working in the service sector for the local government. She is a high school graduate, works 30 hours per week, and had no capital gain or loss last year.###\nHence this label was No."
"The person is a 30-year-old White female from the United States. She is married and classified as the wife in the household. She has a bachelor's degree and her occupation and work class are unspecified. She had no capital gains or losses last year and worked very few hours per week (4).###\nHence this label was No."
"The individual is a 32-year-old White male from the United States who is married. He works in the sales sector as a private sector employee with a bachelor's degree. He is the husband in his household and worked 60 hours per week. Additionally, he had no capital gain or loss last year.###\nHence this label was Yes."
"This individual is a 27-year-old white male who is separated and not living with family. He is originally from the United States and works in the protective services sector for the state government. He has no capital gain or loss from the previous year. His education level is a high school graduate, and he works 45 hours per week.###\nHence this label was No."
"The individual is a 44-year-old unmarried White female from the United States. She is divorced and works in the sales sector as a private sector employee. She holds a bachelor's degree and works 75 hours per week. Last year, she had no capital gains or losses.###\nHence this label was No."
"The individual is a 67-year-old married white male from the United States. He works in the service sector as a private sector employee, with a high school education. He has no capital gains or losses from the previous year and works 10 hours per week.###\nHence this label was No."
"The individual is a 38-year-old married White male from the United States. He works in the sales sector as a private sector employee, with a college education for less than one year. He is the husband in the household and worked 50 hours per week last year. There were no capital gains or losses reported.###\nHence this label was No."
"The individual is a 27-year-old married White male from the United States. He works as a private sector employee in the sales sector and has a high school education. He is the husband in his household and worked 40 hours per week last year. He did not have any capital gain or loss.###\nHence this label was No."
"The individual is a 61-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. Despite working only 20 hours per week, he has no capital gain but experienced a loss of $2051 last year.###\nHence this label was No."
"This individual is a 56-year-old white male from the United States. He is married and works in the craft and repair sector as a private sector employee. He is classified as the husband in his household. With a high school education, he works 48 hours per week and had no capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 47-year-old White male from the United States. He is married and works in the craft and repair sector for the federal government. He is a high school graduate and works 40 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"The individual is a 44-year-old married White male from the United States. He holds a professional degree and works as a professional specialty in the private sector. With a remarkable capital gain of $99,999 and no capital loss, he puts in 60 hours per week. This person is likely to have an annual income over $50,000.###\nHence this label was Yes."
"This individual is a 35-year-old White female from the United States. She is never married and has a professional specialty occupation in the federal government. With a bachelor's degree education, she works 40 hours per week with no capital gains or losses in the last year.###\nHence this label was No."
"The individual is a 58-year-old White female from the United States. She is divorced and has never been married. She works in the private sector in an office and administrative support role, with a high school education. Her annual income last year included a capital gain of 2174 and no capital loss. She works 40 hours per week.###\nHence this label was No."
"This individual is a 27-year-old married white male from the United States. He works in the private sector as an execution and management employee, with a college education of less than one year. Last year, he had no capital gain or loss. He works 40 hours per week.###\nHence this label was No."
"The individual is a 31-year-old divorced White female, not in a family relationship with the head of the household. She is from the United States and works as an office and administrative support worker in the private sector. She had no capital gain or loss last year. Her education level is college for less than one year, and she works 50 hours per week.###\nHence this label was No."
"This individual is a 32-year-old White male from the United States. He is married and works in a professional specialty occupation in the state government. With a professional degree, he puts in 75 hours of work per week. Last year, he had no capital gain or loss. This person has a well-established career and likely earns an annual income over $50,000.###\nHence this label was Yes."
"The individual is a 65-year-old black male from the United States who has never been married. He is not living with family members and his occupation and work class are not specified. He had a capital gain of 2346, no capital loss last year, and is a high school graduate. He works 40 hours per week.###\nHence this label was No."
"The person is a 24-year-old married White female, working as a craft and repair sector employee in the private sector in the United States. She is a high school graduate, with no capital gain or loss last year, and works 36 hours per week.###\nHence this label was No."
"This 28-year-old White male is never married and lives in the United States as an own-child in the household. He works as a machine operator and inspector in the private sector, having graduated from high school. With no capital gain or loss last year, he works 40 hours per week.###\nHence this label was No."
"A 24-year-old White female, who has never been married, lives in the United States with a relationship status of Own-child. She works in a professional specialty occupation in the local government, holding a bachelor's degree. Last year, she had no capital gains or losses. She works 50 hours per week.###\nHence this label was No."
"This individual is a 49-year-old married White male from Portugal. He works in the craft and repair sector as a private sector employee, with no capital gain or loss last year. He finished 4th class education and works 40 hours per week.###\nHence this label was No."
"This individual is a 37-year-old Black male from the United States who has never been married. He is not living with family, works as a machine operator and inspector in the private sector, and has a high school education. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"The person is a 23-year-old Amer-Indian-Eskimo female who has never been married. She is not living with family and is from the United States. Her occupation and work class information are not available. She did not have any capital gains or losses last year. She has attended college for one or more years without completing a degree and works 30 hours per week.###\nHence this label was No."
"This individual is a 36-year-old married White male from the United States. He works in the private sector as a craft and repair employee, with an associate's degree education. He has no capital gains or losses from the previous year and works 50 hours per week.###\nHence this label was No."
"The person is a 23-year-old white male from the United States who has never been married. He is not living with any family members. He works as an office and administrative support employee in the private sector, holding a bachelor's degree. He had no capital gains or losses last year and works an average of 30 hours per week.###\nHence this label was No."
"The individual is a 27-year-old White male, married and working as a machine operator and inspector in the private sector. He is the husband in his household, residing in the United States. Despite being a high school graduate, he works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 19-year-old White male from the United States who has never been married. He is classified as an own-child in the household. He works in the agriculture, forestry, and fisheries sector for the state government. Despite having some college education, he works relatively few hours per week (12 hours). Last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 20-year-old White male from the United States. He is never married and lives with the head of the household as an Own-child. He works in the agriculture, forestry, and fisheries sector as an owner of a non-incorporated business, professional practice, or farm. He is a high school graduate and works 40 hours per week with no capital gains or losses last year.###\nHence this label was No."
"The individual is an 80-year-old White male from the United States. He is married and the husband in the household. He works in the agriculture, forestry, and fisheries sector as the owner of a non-incorporated business, professional practice, or farm. He has a high school education and works 30 hours per week. There were no reported capital gains or losses last year.###\nHence this label was No."
