"The person is a 42-year-old White male from the United States. He is married and the husband in the household. He works in the agriculture, forestry, and fisheries sector as an owner of a non-incorporated business, professional practice, or farm. Despite having no capital gain or loss last year, he works long hours, putting in 60 hours per week. He has attended college for less than one year.###\nHence this label was No."
"The person is a 38-year-old married White male from the United States. He works in the private sector as an employee in the craft and repair sector. He is a high school graduate and works 40 hours per week. He did not have any capital gains or losses the previous year.###\nHence this label was No."
"This individual is a 53-year-old married Black male from the United States. He works in the transportation, communication, and other public utilities sector for the local government. Despite having no capital gain or loss last year, he is a high school graduate and works 40 hours per week.###\nHence this label was Yes."
"The individual is a 37-year-old Black male with a master's degree. He is never married and not living with family. He works in the private sector as an executive manager, putting in 50 hours per week. Last year, he had no capital gains but experienced a loss of $1564. His native country is unknown.###\nHence this label was Yes."
"The individual is a 29-year-old married Asian-Pac-Islander woman, working as an office and administrative support employee in the private sector. She has a bachelor's degree and works 45 hours per week. Last year, she had no capital gain or loss. She resides in the United States.###\nHence this label was Yes."
"The individual is a 62-year-old married White male from the United States. He works as an owner of an incorporated business, professional practice, or farm in execution and management. He has a bachelor's degree and works 55 hours per week. Last year, he had a capital gain of 0 and a capital loss of 1902.###\nHence this label was Yes."
"This 21-year-old White female, who has never been married, is living with the head of the household as their own child in the United States. She works in the sales sector as a private sector employee, with no capital gain or loss last year. She has completed less than a year of college education and works 40 hours per week.###\nHence this label was No."
"The individual is a 20-year-old White male from the United States who has never been married. He is not living with family and works in the sales sector as a private sector employee. Despite attending college for less than one year, he works 45 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 65-year-old white male, married and identified as the husband in the household. He is from the United States and works in the service sector as a private sector employee. With a bachelor's degree, he worked 20 hours per week with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 29-year-old married Black male from the United States. He works in the service sector as a private sector employee, with a high school education. He is the husband and works 50 hours per week, with no capital gain or loss last year. This person's annual income is being predicted to be over $50,000.###\nHence this label was No."
"The individual is a 39-year-old married White male from Mexico, working in the service sector as a private sector employee. He finished 11th class for his education and works 70 hours per week. Last year, he had a capital gain of 2407 and no capital loss. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"The individual is a 56-year-old White male from the United States. He is married and works in the craft and repair sector as a private sector employee. He has no capital gain or loss from the previous year. His education level is college for less than one year, and he works 50 hours per week.###\nHence this label was Yes."
"This 25-year-old White male is never married and works in the cleaning and maintenance sector as a private sector employee in the United States. He has no capital gain or loss from the previous year. He finished 12th class without a diploma and works an average of 43 hours per week.###\nHence this label was No."
"The individual is a 31-year-old married white male, working in the service sector as a private sector employee in the United States. He is a high school graduate and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This individual is a 42-year-old married White male from the United States. He works in the private sector as a sales employee, with an education level of college for less than one year. Despite working 60 hours per week, he had no capital gain or loss last year.###\nHence this label was Yes."
"This person is a 60-year-old widowed White female from the United States. She works as a machine operator and inspector in the private sector, having a high school education. She is not in a family relation with the household head and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 21-year-old White female from the United States who has never been married. She is classified as an Own-child in the household. She works in the local government in an execution and management role, with an associate's degree education. She works 40 hours per week and had no capital gains or losses in the previous year.###\nHence this label was No."
"The individual is a 31-year-old White male from the United States. He is married and works in the private sector as an executive manager. He has a high school education and works 40 hours per week. Last year, he had a capital gain of $7688 and no capital loss. This information suggests that he may have an annual income over $50,000.###\nHence this label was Yes."
"This is a 31-year-old single female of White race from Portugal, working in the private sector as a cleaning and maintenance employee. She has finished 8th class education and works 30 hours per week. Last year, she had no capital gains or losses.###\nHence this label was No."
"This data describes a 25-year-old White male from the United States who has never been married. He is classified as an Own-child in the household. He works in the craft and repair sector as a private sector employee, with a high school education. In the past year, he had no capital gains or losses. He typically works 40 hours per week.###\nHence this label was No."
"The individual is a 34-year-old married White male from the United States. He works in the sales sector as a private sector employee, with a high school education. Despite having no capital gains or losses last year, he puts in 50 hours of work per week.###\nHence this label was No."
"This individual is a 34-year-old White male from the United States. He is separated and not living with family. He works in the sales sector as a private sector employee, with no capital gain or loss last year. His education level is college for less than one year, and he works 45 hours per week.###\nHence this label was No."
"This individual is a 50-year-old married White male from the United States. He is the husband in the household and works as an owner of a non-incorporated business, professional practice, or farm in the transportation, communication, and other public utilities sector. With a high school education, he works 40 hours per week with no capital gains or losses last year.###\nHence this label was Yes."
"The individual is a married 53-year-old White male from the United States. He works as an owner of an incorporated business, professional practice, or farm in the agriculture, forestry, and fisheries sector. Despite having no capital gain or loss last year, he puts in a significant 60 hours of work per week. His education level is college for less than one year.###\nHence this label was No."
"The individual is a 55-year-old white male from the United States. He is divorced and not living with family. He works in the transportation, communication, and other public utilities sector for the state government. He had no capital gain or loss last year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"This individual is a 29-year-old white male from the United States. He is married and classified as the husband in the household. He works in the craft and repair sector as an owner of a non-incorporated business, professional practice, or farm. He is a high school graduate and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 31-year-old White female from the United States, who is divorced and not living with family. She works in an office and administrative support role in the private sector, with a high school education. She worked 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This example is about an 18-year-old Caucasian female from the United States who has never been married. She is categorized as an Own-child in relation to the head of the household. She works in the service sector as a private sector employee, with no capital gain or loss last year. She finished 11th class in education and works 20 hours per week.###\nHence this label was No."
"This is a 51-year-old married White female from the United States. She works as an executive in a professional practice or business she owns. She holds a bachelor's degree and works a standard 40 hours per week. Last year, she did not experience any capital gains or losses.###\nHence this label was Yes."
"The person is a 44-year-old married White male from the United States. He works as a professional specialty in the private sector, with a bachelor's degree education. He had no capital gains or losses last year and works 45 hours per week.###\nHence this label was No."
"The individual is a 90-year-old White male who is married and identified as the husband in the household. He is from the United States and works in the agriculture, forestry, and fisheries sector as an owner of a non-incorporated business, professional practice, or farm. Last year, he had no capital gain or loss. He has received college education for less than a year and works 40 hours per week.###\nHence this label was No."
"This dataset describes a 58-year-old married White male from the United States. He holds a doctoral degree and works as a professional specialty in his own incorporated business, professional practice, or farm. Despite working 24 hours per week, he had no capital gain or loss last year. Based on the information provided, it is predicted that his annual income exceeds $50,000.###\nHence this label was Yes."
"This individual is a 54-year-old married White male from the United States. He works in the craft and repair sector as the owner of a non-incorporated business, professional practice, or farm. He is a high school graduate and works 35 hours per week. Last year, he did not have any capital gain or loss.###\nHence this label was No."
"This dataset describes a 42-year-old married White male from the United States. He works in the sales sector as the owner of a non-incorporated business, professional practice, or farm. He holds a bachelor's degree and works approximately 45 hours per week. Last year, he had no capital gains or losses. The model predicts whether his annual income exceeds $50,000.###\nHence this label was No."
"This individual is a 35-year-old married Black male from the United States. He works in the agriculture, forestry, and fisheries sector for the federal government, putting in 40 hours per week. He finished 9th class in terms of education and had no capital gains or losses last year.###\nHence this label was No."
"The person is a 43-year-old White female from the United States. She is divorced and not married. She works in a professional specialty occupation for the local government, holding a master's degree. She worked 40 hours per week last year, with a capital gain of 914 and no capital loss.###\nHence this label was No."
"This individual is a 40-year-old White male from the United States. He is married and is the husband in the household. He holds a master's degree and works an intensive 60 hours per week. His occupation and work class are not specified, and he had no capital gains or losses in the last year.###\nHence this label was Yes."
"The individual is a 60-year-old married Asian-Pac-Islander male from China. He holds a master's degree and works in a professional specialty occupation for the state government. He has no capital gain or loss from the previous year and works 38 hours per week. The dataset predicts that his annual income is over $50,000.###\nHence this label was Yes."
"This person is a 33-year-old married White male from Mexico, working in the private sector as a craft and repair worker. They have no capital gain or loss from last year and have completed 6th grade education. They work 40 hours per week and are not living with family.###\nHence this label was No."
"This individual is a 35-year-old White male from the United States who has never been married. He works in the private sector as an office and administrative support employee, holding a bachelor's degree. Despite working 40 hours per week, he did not experience any capital gain or loss last year.###\nHence this label was No."
"The individual is a 30-year-old Black female from the United States. She has never been married and is classified as an Own-child in the household. She works in the protective services sector for the local government, having achieved a high school education. With no capital gain or loss from the previous year, she works 40 hours per week.###\nHence this label was No."
"This individual is a 30-year-old unmarried white male in the United States. He works in an office and administrative support role in the private sector, with 40 hours of work per week. He finished 11th class for education and had no capital gains or losses last year. His relation to the head of the household is Own-child.###\nHence this label was No."
"The person is a 65-year-old White male from the United States. He has never been married and is not living with family. He works in a professional specialty occupation in the private sector, holding a master's degree. Despite working long hours per week (99), he did not have any capital gain or loss last year.###\nHence this label was No."
"The individual in the dataset is a 35-year-old married White male from Mexico. He works in the service sector as a private sector employee with an 8th class education. He is not living with family and worked 25 hours per week last year with no capital gain or loss. The prediction targets whether his annual income is above $50,000.###\nHence this label was No."
"The individual is a 40-year-old married white male from the United States. He is the husband of the household. His occupation is in a professional specialty, and he is the owner of an incorporated business, professional practice, or farm. He holds a professional degree and works 50 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"This individual is a 50-year-old married White male from the United States. He holds a master's degree and works in the sales sector as a private sector employee, typically putting in 60 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This individual is an 18-year-old White female from the United States who has never been married. She is classified as an own-child in the household. She has completed 10th class education and currently does not have a specified occupation or work class. Her capital gain and loss last year were both 0. She works 30 hours per week.###\nHence this label was No."
"This person is a 22-year-old White female from the United States. She has never been married and is living with her parents as an Own-child. She is a professional working in a specialty occupation and is the owner of a non-incorporated business, professional practice, or farm. Last year, she had no capital gains or losses. She has attended college for less than a year and currently works 3 hours per week.###\nHence this label was No."
"This person is a 25-year-old White female from the United States who has never been married. She is not living with any family members and works in an office and administrative support role in the private sector. She did not have any capital gains or losses last year. She has completed less than a year of college education and works 40 hours per week.###\nHence this label was No."
"The person is a 25-year-old White male from the United States who has never been married. He works in the private sector as an executive or manager, despite having less than a year of college education. He is classified as an Own-child in relation to the head of the household. Although he works long hours (75 per week), he did not have any capital gains or losses last year. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"The individual is a 71-year-old White female from the United States. She is widowed and not living with any family members. She has a high school education, with no specified occupation or work class. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was No."
"The person is a 32-year-old married White male from the United States. He works in the private sector as an executive manager, putting in 50 hours per week. Last year, he did not experience any capital gains or losses. His education level is attending college for one or more years without obtaining a degree.###\nHence this label was Yes."
"This individual is a 48-year-old White female who is divorced and not living with family. She is a private sector employee in the United States, working in office and administrative support. With a high school education, she works 30 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 42-year-old White male from the United States. He is divorced and not living with family. He works in the service sector for the local government, with a standard 40-hour work week. Despite finishing 8th class education, he shows no capital gain or loss last year.###\nHence this label was No."
"This individual is a 47-year-old White female from the United States. She is divorced and not living with any family members. She works in the service sector as a private sector employee, putting in 38 hours per week. She finished her education after 11th grade and had no capital gains or losses last year.###\nHence this label was No."
"This individual is a 46-year-old married white male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee, with an education level of college for less than one year. Last year, he had no capital gain or loss. He works 40 hours per week in his occupation.###\nHence this label was No."
"The person is a 56-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee and is classified as a high school graduate. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was No."
"The individual is a 47-year-old White male from the United States. He is married and works as a professional specialist, owning an incorporated business, professional practice, or farm. He holds a bachelor's degree and works 60 hours per week. In the past year, he had no capital gains or losses. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This 41-year-old divorced female, who is an unmarried private sector employee in the service sector, resides in the United States. She completed 11th class education and works 40 hours per week. Her capital gain and loss last year were both 0. The prediction is whether her annual income exceeds $50,000.###\nHence this label was No."
"This 31-year-old White male is never married and not living with family. He works in the craft and repair sector as a private sector employee in the United States. With 10th grade education, he works 45 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 48-year-old married White male from the United States. He is the husband in the household and works in the craft and repair sector as an owner of a non-incorporated business, professional practice, or farm. He had no capital gain or loss last year. His education level is college for one or more years without a degree, and he works 40 hours per week.###\nHence this label was Yes."
"The individual is a 29-year-old married White male from the United States. He works as an execution and management professional in the private sector, with an education level of college for less than one year. Despite working 55 hours per week, he had no capital gains or losses last year.###\nHence this label was No."
"The individual is a 32-year-old White female from the United States. She has never been married and is not living with any family members. She is employed in a professional specialty occupation in the private sector, working 40 hours per week. She holds a bachelor's degree and had no capital gain or loss last year. The prediction is whether her annual income is over $50,000.###\nHence this label was No."
"The individual is a 54-year-old married White male from the United States. He is the husband in his household and works in the craft and repair sector as an owner of a non-incorporated business, professional practice, or farm. He has a college education for less than one year. In the previous year, he had a capital loss of $1579 and did not have any capital gain. He works 48 hours per week.###\nHence this label was No."
"This individual is a 56-year-old White female from the United States. She is separated and not living with any family members. She works as a machine operator and inspector in the private sector, with a capital gain and loss of 0 last year. She has completed 11th class education and works 40 hours per week.###\nHence this label was No."
"This person is a 47-year-old married White male from the United States. He works in the craft and repair sector for the federal government, with a college education for less than one year. Last year, he had a capital gain of 3908 and no capital loss. He works 40 hours a week.###\nHence this label was No."
"This person is a 29-year-old Black male from the United States. He is separated and not living with family. He works in the private sector as an employee in the cleaning and maintenance sector. He has no capital gain or loss from the previous year. His education level is college for less than one year. He works 42 hours per week. This person's annual income is being predicted, with the threshold set at $50,000.###\nHence this label was No."
"The individual is a 32-year-old married white male from Mexico. He works in the craft and repair sector as a private sector employee, holding a bachelor's degree. Despite working long hours (70 hours per week), he did not experience any capital gain or loss last year.###\nHence this label was No."
"This individual is a 48-year-old separated White female from the United States. She is an unmarried private sector employee working in office and administrative support. With a high school graduate education, she had a capital gain of 914 last year and no capital loss. She works 40 hours per week.###\nHence this label was No."
"This individual is a 47-year-old widowed white female from the United States. She is working in the service sector as a private sector employee with an associate's degree. She has no capital gain or loss from the previous year and works 35 hours per week. Her relation to the head of the household is own-child.###\nHence this label was No."
"This individual is a 54-year-old White female in the United States. She is divorced and not living with family. She works in the sales sector as a private sector employee, with a bachelor's degree. Last year, she had a capital gain of $8614 and no capital loss. She works 40 hours per week.###\nHence this label was Yes."
"This individual is a 28-year-old white female from the United States. She is divorced and currently not living with family. She works in the sales sector as a private sector employee, with a 40-hour work week. She completed 10th grade education and had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 65-year-old White male from the United States. He is married and is the husband in the household. He has a capital gain of $2414 from last year and no capital loss. His occupation and work class are unknown. He is a high school graduate and works approximately 30 hours per week.###\nHence this label was No."
"This individual is a 27-year-old White male living in the United States. He is married and works in the private sector as an execution and management professional. He holds a bachelor's degree and works 50 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This individual is an 84-year-old Black male, married and working in a professional specialty occupation within the private sector. He is classified as a husband and resides in the United States. Despite his age, he completed 8th class education and works 10 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 64-year-old White female from the United States who has never been married. She is not living with family and works in the private sector in an office and administrative support role. She has no capital gain or loss from the previous year and has received college education for less than a year. She works 40 hours per week.###\nHence this label was No."
"This individual is a 60-year-old married White male from the United States. He works in the private sector as an employee in the cleaning and maintenance sector, putting in 40 hours per week. Despite not having a diploma, he has completed the 12th grade. Last year, he did not experience any capital gains or losses.###\nHence this label was No."
"The individual is a 45-year-old married White male from the United States working in the private sector as a technology and support sector employee. He has a college education for less than one year. Last year, he had a capital gain of $15,024 and no capital loss. He works 37 hours per week.###\nHence this label was Yes."
"The individual is a 32-year-old unmarried White male from the United States. He works in the private sector as an employee in the agriculture, forestry, and fisheries sector. He finished 11th class for education and works 50 hours per week. Both his capital gain and capital loss last year were 0.###\nHence this label was No."
"The individual is a 44-year-old married White male from the United States working in the transportation, communication, and other public utilities sector as a private sector employee. He has no capital gain or loss from the previous year, and his education level is college for less than one year. He works 50 hours per week.###\nHence this label was Yes."
"This individual is a 46-year-old married Asian-Pacific-Islander male from the Philippines. He works in a professional specialty occupation in the local government. He holds a bachelor's degree and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The person is a 47-year-old married White male from the United States with a doctoral degree. He works in the sales sector as a private sector employee, putting in 60 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This 21-year-old white female, who has never been married, is categorized as an other-relative in the household. She is a private sector employee in the United States with an occupation in execution and management. Despite attending college for less than a year, she works a standard 40 hours per week with no capital gains or losses in the previous year.###\nHence this label was No."
"The person is a 33-year-old white female from the United States, currently married. She works in the private sector as an office and administrative support employee, with a college education of less than one year. Last year, she had a capital gain of $15,024 and no capital loss. She works 40 hours per week.###\nHence this label was Yes."
"This 30-year-old White male, who has never been married, is from the United States. He is not living with family and works as an executive in the private sector. With a bachelor's degree, he works 60 hours per week and had a significant capital gain of $27,828 last year.###\nHence this label was Yes."
"The person is a 54-year-old married White male from the United States. He works in the private sector as a sales sector employee, with a college education for less than one year. He works 40 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 25-year-old married White male from the United States. He works as an owner of an incorporated business, professional practice, or farm in an executive and management role. He is the husband in the household and has a high school education. In the past year, he did not experience any capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"The individual is a 43-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was Yes."
"This individual is a 31-year-old White male from the United States who has never been married. He is an Own-child in the household and works in the private sector as an executive and manager, with a college education for less than one year. Last year, he had no capital gain or loss. He works 40 hours per week.###\nHence this label was No."
"The person is a 37-year-old married White male from the United States. He works in the private sector as a sales employee, with a high school education. Last year, he had no capital gains or losses. He works 45 hours per week.###\nHence this label was Yes."
"This individual is a 25-year-old married White male from the United States. He works in the private sector as an execution and management employee, having completed 10th grade education. He works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person in this data is a 43-year-old White female from the United States who is divorced and not living with family. She has an associate's degree education, with unknown occupation and work class. She had no capital gain or loss last year and works 35 hours per week.###\nHence this label was No."
"The person is a 45-year-old married White male from the United States. He is the husband in the household and works in the sales sector as an owner of a non-incorporated business, professional practice, or farm. He has no capital gain or loss from the previous year. His education level is college for less than one year, and he works 65 hours per week. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"The person is a 34-year-old White male from the United States who has never been married. He is not living with family and works as a professional specialist in the private sector. With a master's degree, he works 50 hours per week and had a capital loss of $2258 last year, with no capital gain.###\nHence this label was No."
"This individual is a 36-year-old White male who has never been married. He is classified as an Own-Child in relation to the head of the household. He works in the sales sector as a private sector employee and is a high school graduate. Last year, he had no capital gain or loss. He works 45 hours per week.###\nHence this label was No."
"This individual is a 47-year-old White female from the United States. She is separated and unmarried, working in the private sector as a professional specialty. She holds a bachelor's degree and works 50 hours per week. There were no capital gains or losses last year.###\nHence this label was No."
"A 51-year-old married White male, originally from Mexico, works in the service sector as a private sector employee. He has no capital gain or loss from the previous year. Despite completing only 4th class education, he works 54 hours per week to support his household.###\nHence this label was No."
"This individual is a 44-year-old White male from the United States. He is married and works as a professional specialty in his own non-incorporated business, professional practice, or farm. He holds a professional degree and worked 70 hours per week last year. Despite having no capital gain or loss, he is likely to have an annual income over $50,000.###\nHence this label was Yes."
"This is a 31-year-old Black female from Japan, currently working in an office and administrative support role in the private sector. She is divorced, unmarried, and has less than a year of college education. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was No."
"This person is a 52-year-old Black female from the United States. She is divorced and lives with her own child. She works as a machine operator and inspector in the private sector, with a high school education. Last year, she had no capital gains or losses. She works 35 hours per week.###\nHence this label was No."
"The person is a 35-year-old White female from the United States who has never been married. She works in the private sector as an office and administrative support employee, holding a bachelor's degree. Her relation to the head of the household is Own-child. She had no capital gains or losses last year and typically works 40 hours per week.###\nHence this label was No."
"The individual is a 57-year-old married white female from the United States. She is classified as the wife in the household. Her occupation, work class, and capital gains/losses are not provided. She has attended college for one or more years without receiving a degree and works only 5 hours per week.###\nHence this label was No."
"The individual is a 65-year-old married Asian-Pac-Islander male from the United States. He works in the private sector as an executive and manager, having attended college for less than one year. He worked 40 hours per week last year and had a significant capital gain of $20,051 with no reported capital loss.###\nHence this label was Yes."
"This dataset represents a 43-year-old married White male from the United States. He works in the private sector as an executive manager and has a high school education. Despite working 45 hours per week, he did not experience any capital gains or losses last year. The prediction task is to determine if his annual income exceeds $50,000.###\nHence this label was Yes."
"This is a profile of a 34-year-old White female from the United States working in the technology and support sector as a private sector employee. She is divorced, unmarried, and has a high school education. She worked 40 hours per week last year with no capital gain or loss.###\nHence this label was No."
"The person is a 26-year-old married White male from Mexico. He works as a machine operator and inspector in the private sector, with a high school education. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was No."
"The individual is a 19-year-old White male from the United States who has never been married. He is classified as an own-child in relation to the head of the household. He works in the private sector in the transportation, communication, and other public utilities sector. His income last year did not include any capital gain or loss. He has received college education for less than a year and works 40 hours per week.###\nHence this label was No."
"The individual is a 55-year-old white male from the United States. He is separated and unmarried, working in the cleaning and maintenance sector as a private sector employee. He has a high school education, works 40 hours per week, and had zero capital gain or loss last year.###\nHence this label was No."
"The individual is a 41-year-old White male from the United States. He is married, works as a machine operator and inspector in the private sector, and has a high school education. He works 40 hours per week, with no capital gains or losses in the last year.###\nHence this label was No."
"The individual is a 34-year-old married White male from the United States. He works in the private sector as a craft and repair worker, with a high school education. He has no capital gains or losses from the previous year and works 48 hours per week.###\nHence this label was Yes."
"The person in the dataset is a 27-year-old White female from the United States. She has never been married and is not living with any family members. She works in the private sector as a professional specialty employee, with a bachelor's degree education. Although she did not have any capital gain or loss last year, she works 50 hours per week.###\nHence this label was Yes."
"The person is a 37-year-old White male who is divorced. He is not living with family and works in the private sector as an employee in the cleaning and maintenance sector. He is a high school graduate and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This individual is an 18-year-old White male from Mexico. He is never married and lives with the head of the household as their own child. He works as a machine operator and inspector in the private sector, with a 40-hour workweek. He finished 9th class for education and did not have any capital gain or loss last year.###\nHence this label was No."
"This individual is a 40-year-old married White female from the United States. She works as a professional specialty in her own non-incorporated business, professional practice, or farm. With a bachelor's degree, she works 40 hours per week and had a capital gain of 2174 last year.###\nHence this label was No."
"The individual is a 42-year-old married, White male from the United States. He works in a professional specialty occupation for the local government, with a bachelor's degree education. Despite working long hours per week (60), he had no capital gain or loss last year.###\nHence this label was Yes."
"The person is a 57-year-old widowed Asian-Pac-Islander female from the United States. She is unmarried and works as an office and administrative support in the private sector, earning no capital gain or loss last year. She has received college education for less than one year and works 40 hours per week.###\nHence this label was No."
"The person is a 53-year-old White female from England who is divorced and not living with any family members. She works in the sales sector as a private sector employee, with a high school education. Despite working 60 hours per week, she did not have any capital gains or losses last year.###\nHence this label was No."
"The individual is a 57-year-old married White male from the United States. He works in the service sector as a private sector employee, with 11th class education completed. He has no capital gains or losses from last year and works 52 hours per week.###\nHence this label was No."
"This individual is a 17-year-old white male from Peru. He is never married and is living with his parents as an own-child. He works in the private sector as an employee in the cleaning and maintenance sector. He has completed 11th class education and works 20 hours per week with no reported capital gain or loss from the previous year.###\nHence this label was No."
"This person is a 38-year-old married White male from the United States. He works as a professional specialty in the private sector, with a professional degree. Despite working long hours (60 per week), he did not have any capital gain or loss last year.###\nHence this label was Yes."
"This 62-year-old White male, who is married and works as a professional specialty in the private sector, has a bachelor's degree. He is the husband in the household and worked 40 hours per week last year. Additionally, he had no capital gains or losses during that time.###\nHence this label was Yes."
"This person is a 40-year-old White female from the United States who has never been married. She works in the private sector as an office and administrative support employee. She has no capital gains or losses from the previous year. She has received some college education for less than a year and typically works 40 hours per week.###\nHence this label was No."
"This individual is a 25-year-old Black female from the United States. She has never been married and is living with her own child. She works in office and administrative support in the private sector, holding a bachelor's degree. She worked 40 hours per week last year and did not have any capital gain or loss.###\nHence this label was No."
"The individual in the dataset is a 60-year-old married White male from the United States. He is the husband in the household and has a high school education. Although his occupation and work class are not specified, he worked 42 hours per week with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 30-year-old married white male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"The individual is a 37-year-old White male who is married and works as a professional specialist in the federal government. He holds a doctoral degree and works 72 hours per week. There was no capital gain or loss reported last year.###\nHence this label was Yes."
"This individual is a 41-year-old White male from the United States, working as a craft and repair employee in the private sector. He is married, the husband in his household, with a high school education. He had no capital gain or loss last year and works a standard 40-hour work week.###\nHence this label was No."
"The person is a 40-year-old married White male from the United States. He works in the private sector as an executive and manager, with a bachelor's degree. He has a work schedule of 40 hours per week and had a capital gain of $7688 last year.###\nHence this label was Yes."
