"This dataset represents a 34-year-old married White female from the United States. She works as a professional specialty in the private sector and has a bachelor's degree. Last year, she had a capital gain of 15024 and no capital loss. She works 36 hours per week.###\nHence this label was Yes."
"This person is a 20-year-old White male from the United States. He has never been married and is considered an other relative in the household. He works in the craft and repair sector as a private sector employee, with a high school education. Last year, he had no capital gains or losses and works 40 hours per week.###\nHence this label was No."
"The individual is a 20-year-old White female from the United States. She has never been married and is categorized as an own-child in the household. Her occupation and work class are unknown. She obtained an associate's degree for education. In the last year, she had a capital gain of $594 and no capital loss. She works 20 hours per week.###\nHence this label was No."
"This individual is a 20-year-old White male from the United States. He is never married and is living with his parent(s) as an own-child. His occupation and work class are unknown. He has no capital gains or losses from the previous year. He has completed less than a year of college education and works 35 hours per week.###\nHence this label was No."
"The person is a 54-year-old married white male from the United States. He works in the private sector as an executive manager with a bachelor's degree. Despite working 40 hours per week, he had no capital gains or losses last year.###\nHence this label was No."
"This is a 45-year-old married White female from the United States. She works in a professional specialty occupation for the local government, holding a bachelor's degree. She works 55 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 52-year-old married white male from the United States. He works in the craft and repair sector as a private sector employee, with a college education for less than one year. He works 40 hours per week, with no capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 23-year-old unmarried Asian-Pac-Islander female from Vietnam. She works as a professional specialty in the private sector, with an associate's degree. She is not part of the family household, and her annual income exceeds $50,000.###\nHence this label was No."
"The individual is a 19-year-old White female from the United States who has never been married. She is living with her parents as an Own-child. She is a high school graduate with no current occupation or work class. Her capital gain and loss last year were both 0. She works 40 hours per week.###\nHence this label was No."
"This is a 61-year-old White male, married, working in the craft and repair sector as a private sector employee in the United States. He is the husband in the household and has completed 9th grade education. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"The individual is a 61-year-old White male living in the United States. He is divorced and not living with any family members. He works in the service sector as a private sector employee, with a college education of less than one year. Last year, he had no capital gains or losses. He works 25 hours per week.###\nHence this label was No."
"The individual is a 42-year-old White male from the United States who has never been married. He is not living with any family members and works in the technology and support sector as a private sector employee. Despite having some college education, he works 33 hours per week with no significant capital gains or losses last year.###\nHence this label was No."
"The individual is a 62-year-old Black female from the United States. She is widowed and is classified as an Own-child in relation to the head of the household. She works in the private sector as an office and administrative support employee, having completed 10th class education. With no capital gain or loss last year, she works 40 hours per week.###\nHence this label was No."
"The individual is a 54-year-old White male from the United States, who is married and works in execution and management for the state government. He has no capital gain or loss from last year and has less than one year of college education. He works 40 hours per week.###\nHence this label was Yes."
"The individual is a 38-year-old White male from the United States. He has never been married and is not living with family. He works in the transportation, communication, and other public utilities sector as a private sector employee. Despite having some college education for less than one year, he works 40 hours per week with no capital gains or losses last year.###\nHence this label was No."
"This individual is a 55-year-old married White male from the United States. He works in the technology and support sector for the federal government, with a high school education. Despite having no capital gains, he experienced a significant capital loss last year amounting to $1887. He works 40 hours per week to support his household.###\nHence this label was Yes."
"The individual is a 40-year-old married white male from the United States. He is the husband in his household. He owns a non-incorporated business, professional practice, or farm in the craft and repair sector. He is a high school graduate and works 40 hours per week, with a capital gain and loss of 0 last year.###\nHence this label was No."
"This person is a 56-year-old married White male from the United States. He works in the private sector as an executive manager, with a reported education level of college for less than one year. Despite working 40 hours per week, he did not have any capital gains or losses last year.###\nHence this label was Yes."
"This 23-year-old Black male is a private sector employee in the cleaning and maintenance sector. He has never been married and is classified as an own-child in the household. With less than one year of college education, he works 22 hours per week with no capital gain or loss last year. His native country is the United States.###\nHence this label was No."
"The individual is a 33-year-old married White male from the United States. He works in the private sector as a sales employee and holds a bachelor's degree. Despite working 40 hours per week, he did not receive any capital gain last year but experienced a capital loss of 1977.###\nHence this label was Yes."
"The person in this data is a 42-year-old White male from the United States. He is married and works in the private sector as an office and administrative support employee. He has some college education but does not have a degree. Last year, he had a capital gain of 2407 and did not incur any capital loss. He works 40 hours per week. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"This individual is a 34-year-old, White female from the United States. She is divorced and currently unmarried. She works in the service sector as a private sector employee, with a college education for less than one year. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was No."
"This individual is a 43-year-old married White male from the United States. He holds a master's degree and works in the private sector as an executive manager. Despite having no capital gains or losses last year, he works 35 hours a week.###\nHence this label was Yes."
"The individual is a 53-year-old Black female from the United States. She is separated and unmarried and works as an execution and management professional in the private sector. She has no capital gain or loss from the previous year. She attended college for less than a year and works 40 hours per week.###\nHence this label was No."
"This individual is a 46-year-old married White female living in the United States. She works in a professional specialty occupation in the local government sector, with a bachelor's degree education. Last year, she had no capital gain or loss. She works 21 hours per week.###\nHence this label was Yes."
"The person is a 37-year-old married White male from Cuba. He is the husband and works in the transportation, communication, and other public utilities sector as the owner of a non-incorporated business, professional practice, or farm. He is a high school graduate and works 45 hours per week. In the last year, he had no capital gain or loss.###\nHence this label was Yes."
"The individual is a 55-year-old married white male from the United States. He works in the private sector as an office and administrative support worker and is the husband in the household. He graduated high school and works 50 hours per week. Last year, he had a capital gain of 6418 and no capital loss.###\nHence this label was Yes."
"The individual is a 34-year-old White female from the United States. She is divorced and not living with family. She works as an office and administrative support in the private sector, with a college education for less than one year. She worked 40 hours per week last year and had no capital gains or losses.###\nHence this label was No."
"The person is a 19-year-old married female of White race residing in the United States. She is a wife and has received some college education for less than a year. She did not have any capital gains or losses last year. Her occupation and work class information are not available, but she works 30 hours per week.###\nHence this label was No."
"The person in the dataset is a 35-year-old White female from the United States. She is divorced, unmarried, and works as an executive in the private sector. She has a high school education and works 55 hours per week. Last year, she had no capital gains or losses. The prediction is whether her annual income is over $50,000.###\nHence this label was No."
"This 51-year-old divorced White female, with a master's degree, works as an executive in local government. She is not living with family, has no capital gains or losses, and works 40 hours per week in the United States.###\nHence this label was No."
"The individual is a 34-year-old White female from the United States, never married, and currently working as a machine operator and inspector in the private sector. She is classified as an own-child in relation to the head of the household. She has a high school education and works 40 hours per week with no capital gain or loss recorded last year.###\nHence this label was No."
