"The person is a 72-year-old married white male from the United States. He works in the private sector as a sales employee, holding a bachelor's degree. Last year, he had a capital gain of $1455 and no capital loss. He works very few hours per week, only 6.###\nHence this label was No."
"This 22-year-old White male is never married and lives in the United States as an own-child in the household. He works as a machine operator and inspector in the private sector, with no capital gain or loss last year. His education level is college for less than one year, and he works 25 hours per week.###\nHence this label was No."
"The person is a 55-year-old married white male from the United States. He holds a master's degree and works in execution and management for the federal government. Despite working long hours per week (60), he did not have any capital gains or losses last year. Based on this information, it is likely that his annual income exceeds $50,000.###\nHence this label was Yes."
"This individual is a 45-year-old Black female from the United States. She is divorced and currently unmarried, working in a professional specialty occupation in the private sector. She holds a doctoral degree and works 35 hours per week. Although she had no capital gain last year, she experienced a capital loss of $3004.###\nHence this label was Yes."
"This individual is a 43-year-old White male who is divorced and not living with family. He works in execution and management in the private sector, holding a bachelor's degree. He had no capital gain but experienced a loss of $1564 last year. He works 45 hours per week in the United States.###\nHence this label was Yes."
"The individual is a 40-year-old married white male from the United States. He works in the craft and repair sector as the owner of a non-incorporated business, professional practice, or farm. He has no capital gains or losses from the previous year. His education level is college for less than one year, and he works 50 hours per week. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"The individual is a 27-year-old married White male residing in the United States. He works in the sales sector as a private sector employee, having a high school education. Despite working long hours per week (60), there were no capital gains or losses the previous year. The data suggests that this person's annual income is likely over $50,000.###\nHence this label was No."
"The individual is a 62-year-old married White male residing in the United States. He works in the transportation, communication, and other public utilities sector for the state government. With a high school education, he works 44 hours per week and had no capital gains or losses last year.###\nHence this label was No."
"The person in the data is a 57-year-old married White male from Hungary. He is the husband in the household and works in the transportation, communication, and other public utilities sector as the owner of an incorporated business, professional practice, or farm. He is a high school graduate and worked 60 hours per week last year. His capital gain last year was $5178, and he did not incur any capital losses.###\nHence this label was Yes."
"The individual is a 43-year-old White male from the United States. He is married and works in office and administrative support for the state government. He has a bachelor's degree and works 40 hours per week. He had no capital gains or losses last year.###\nHence this label was Yes."
"This individual is a 30-year-old White male from the United States. He has never been married and is classified as an Own-child in the household. He works in the craft and repair sector as a private sector employee, putting in 40 hours per week. With a college education but no degree, he had no capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 65-year-old White female who is married and works in the sales sector. She is the wife of the head of the household and is a professional in her own non-incorporated business, professional practice, or farm. She is from the United States and has a high school education. Last year, she had no capital gains or losses and works 40 hours per week.###\nHence this label was No."
"This individual is a 31-year-old married white male from the United States. He holds a doctoral degree and works in execution and management for the state government. With a work week of 55 hours, he had a capital gain of $7298 and no capital loss last year.###\nHence this label was Yes."
"The person in this dataset is a 43-year-old married White male from the United States. He holds a master's degree and works in a professional specialty occupation in the federal government. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was Yes."
"This young 22-year-old White female, who has never been married, resides in the United States and is not living with family. She is employed in office and administrative support within the federal government. Despite having a college education of less than one year, she works 40 hours per week. Last year, she did not experience any capital gain or loss.###\nHence this label was No."
"This individual is a 22-year-old White female from the United States. She is never married and is living with her parents (Own-child relation to head of household). She works in a professional specialty occupation in the local government sector. She has a college education for less than one year. Last year, she had a capital gain of 594 and no capital loss. She works 25 hours per week.###\nHence this label was No."
"This individual is an 18-year-old White male from the United States who has never been married. He lives with his parents as an own-child. He works in the private sector as a cleaning and maintenance worker, earning no capital gains or losses last year. He has finished 11th class education and works 12 hours per week.###\nHence this label was No."
"This individual is a 32-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, having completed 11th class education. Last year, he had no capital gains but incurred a capital loss of $2042. He works 30 hours per week.###\nHence this label was No."
"The individual is a 36-year-old White male, divorced, not living with family, and originally from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. Despite working 55 hours per week, he did not have any capital gains or losses last year.###\nHence this label was No."
"This individual is a 36-year-old White male from the United States. He is divorced and currently unmarried. He works in the protective services sector for the local government, with a work schedule of 55 hours per week. He had no capital gains or losses last year and has received education for less than a year in college.###\nHence this label was No."
"The individual is a 37-year-old married White male from Mexico, working in the craft and repair sector as a private sector employee. He completed 8th grade education, works 45 hours per week, and had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 37-year-old Black female from the United States. She is never married and is considered an unmarried member of the household. She is employed in the private sector as a cleaning and maintenance worker, with a high school education. Last year, she did not experience any capital gains or losses. She works 30 hours per week.###\nHence this label was No."
"This is a 31-year-old married White female living in the United States. She works in the private sector as an office and administrative support employee, holding a bachelor's degree. Last year, she had no capital gains or losses. She typically works 40 hours per week.###\nHence this label was Yes."
"The person is a 67-year-old White female from the United States. She is divorced and not living with family. She works in the sales sector as a private sector employee. She graduated from high school and works 20 hours per week. Last year, she had no capital gains or losses.###\nHence this label was No."
"The individual is a 43-year-old married white male from the United States. He works in the private sector as a craft and repair worker, with a high school education. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was No."
"The individual is a 33-year-old Black female from the United States. She is never married and is classified as an unmarried private sector employee. Her occupation is a machine operator and inspector, and she has attended college for one or more years without completing a degree. Last year, she had no capital gains or losses. She works 40 hours per week. The prediction is whether her annual income is over $50,000.###\nHence this label was No."
"This 25-year-old White female is a never-married machine operator and inspector in the private sector, working 40 hours per week. She is classified as an Own-child in the household and is a high school graduate from the United States. With a capital gain of 2176 and no capital loss last year, she is being predicted to have an annual income over $50,000.###\nHence this label was No."
"This person is a 28-year-old White male from the United States who has never been married. He works in the private sector as an office and administrative support employee. With a high school education, he works 40 hours per week and had no capital gains or losses last year.###\nHence this label was No."
"The individual is a 46-year-old divorced White female from Ecuador, working in the private household sector as a private sector employee. She is unmarried and has a high school education. Last year, she had no capital gains or losses. She works 28 hours per week.###\nHence this label was No."
"The individual is a 25-year-old White male from Mexico, working in the craft and repair sector as a private sector employee. He is a high school graduate and works 40 hours per week. He is currently separated and is living as an own-child in the household. There were no capital gains or losses reported last year.###\nHence this label was No."
"This individual is a 37-year-old white male from the United States who is married and works in the agriculture, forestry, and fisheries sector as a private sector employee. He finished 10th class and works 40 hours per week. Additionally, he had no capital gains or losses last year.###\nHence this label was No."
"This data describes a 33-year-old white male who is divorced and not living with family. He works in the transportation, communication, and other public utilities sector as a private sector employee in the United States. He has no capital gain or loss from the previous year and is a high school graduate. He works around 45 hours per week.###\nHence this label was No."
