"This individual is a 26-year-old Black male from the United States who has never been married. He is not living with family and works in the private sector as an employee in the transportation, communication, and other public utilities sector. He finished 11th class in terms of education and works 40 hours per week, with no capital gains or losses last year.###\nHence this label was No."
"This individual is a 28-year-old married White male from Germany, working in the craft and repair sector as a private sector employee. He has no capital gain or loss from the previous year and has attended college for less than a year. He works 50 hours per week.###\nHence this label was Yes."
"The individual is a 33-year-old married Hispanic male from Mexico, working in the craft and repair sector as a private sector employee. He has finished 9th class education and works 40 hours per week. With no capital gain or loss last year, the prediction is whether his annual income exceeds $50,000.###\nHence this label was No."
"The individual is a 36-year-old White female from the United States. She is divorced and currently unmarried. She works in the private sector as an execution and management professional, with a college education of less than one year. Despite working 35 hours per week, she did not experience any capital gain or loss last year.###\nHence this label was No."
"The individual is a 47-year-old Black male from the United States. He is divorced and not living with family. He works as a machine operator and inspector in the private sector, putting in 40 hours per week. He has not experienced any capital gain or loss in the last year. His education level is college for less than one year.###\nHence this label was No."
"The person is a 36-year-old married White male from the United States. He is a private sector employee in the craft and repair sector. He is a high school graduate and works 45 hours per week. In the last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 46-year-old divorced White female from the United States. She is unmarried and works in the private sector as an office and administrative support employee. She has no capital gain or loss from the previous year. Her education level is college for less than one year, and she works 40 hours per week.###\nHence this label was No."
"This individual is a 19-year-old White male from Mexico. He is never married and has an occupation in the agriculture, forestry, and fisheries sector as a private sector employee. He finished 9th class in education and works 16 hours per week. There were no capital gains or losses last year.###\nHence this label was No."
"The individual is a 45-year-old married Asian-Pacific-Islander female. She works as an executive and manager in her own non-incorporated business, professional practice, or farm. She holds a bachelor's degree and works 48 hours per week. In the past year, she had no capital gains or losses.###\nHence this label was No."
"The individual in the dataset is a 48-year-old white male from the United States who has never been married. He is not living with any family members and works as a professional specialist in the private sector. He holds a master's degree and works 60 hours per week. Last year, he did not have any capital gains or losses.###\nHence this label was No."
"The person is a 28-year-old married White female from the United States. She works in the service sector as a private sector employee, with a college education but without a degree. She has a capital gain of $3137 and no capital loss from last year. She works 40 hours per week.###\nHence this label was No."
"The individual is a 35-year-old married White male from the United States. He works in the technology and support sector for the state government, with a college education for less than one year. He is the husband in the household and worked 40 hours per week. Last year, he had a capital gain of $5013 and no capital loss.###\nHence this label was No."
"This 25-year-old married White male, working as a professional specialty in the private sector, with a bachelor's degree, earns an annual income over $50,000. Last year, he had no capital gains or losses. He works 45 hours per week and resides in the United States.###\nHence this label was Yes."
"The person is a 46-year-old white female who is divorced and not living with family. She is a private sector employee in the United States, working in office and administrative support. She graduated from high school and works 44 hours per week with no capital gains or losses last year.###\nHence this label was No."
"The person in the dataset is a 47-year-old married White male from the United States. He works as an owner of a non-incorporated business, professional practice, or farm in an executive and management role. He is the husband in the household. Despite being a high school graduate, he works 50 hours per week with no capital gain or loss last year. Overall, he is likely to have an annual income over $50,000.###\nHence this label was Yes."
"This individual is a 34-year-old married white male from the United States. He works as a professional in the private sector, holding a bachelor's degree. Despite working 40 hours per week, he did not have any capital gains or losses last year.###\nHence this label was Yes."
"This dataset includes information about a 36-year-old married white male from the United States. He works in a professional specialty in the local government, holding a bachelor's degree. Last year, he had no capital gain but incurred a capital loss of $1887. He works 40 hours per week and is classified as the husband in the household.###\nHence this label was Yes."
"This individual is a 56-year-old married White male from the United States. He is the husband in the household and works in the sales sector as an owner of an incorporated business, professional practice, or farm. Despite being a high school graduate, he works 50 hours per week with no capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 39-year-old married Asian-Pac-Islander male from the Philippines. He works in the technology and support sector as a private sector employee, with a college education without a degree. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"This individual is a 19-year-old White male from the United States who has never been married. He is categorized as an own-child in the household. His occupation, work class, and level of education are not specified. He had no capital gain or loss last year and works 22 hours per week.###\nHence this label was No."
"This individual is a 59-year-old married white male from the United States. He works as a machine operator and inspector in the private sector, having a high school education. Last year, he had no capital gains or losses. He works 40 hours per week to support his household.###\nHence this label was No."
"The person is a 44-year-old White male who is divorced and not living with family. They work in the transportation, communication, and other public utilities sector as a private sector employee in the United States. They are a high school graduate working 40 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 34-year-old White male who is married and works in the private sector as a cleaning and maintenance employee. He has no capital gains or losses from last year, and he has less than one year of college education. He works 40 hours per week and resides in the United States.###\nHence this label was No."
"The person is a 49-year-old married white male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He has finished 11th class education and works 75 hours per week. He had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 30-year-old married white male living in the United States. He works in the craft and repair sector for the local government, with a high school education. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"The person in the dataset is a 29-year-old White female from the United States. She is separated, unmarried, and works in the private sector as an office and administrative support worker. She has no capital gains or losses from the previous year. Her education level is college for one or more years without a degree, and she works 40 hours per week.###\nHence this label was No."
"The individual is a 35-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with an education level of college for less than one year. He reported zero capital gain and zero capital loss in the last year, and works 40 hours per week.###\nHence this label was No."
"This person is a 66-year-old White male from the United States. He is married and works in the sales sector as a private sector employee. He has a bachelor's degree and works 40 hours per week. Last year, he had a capital gain of $20,051 and did not incur any capital losses.###\nHence this label was Yes."
"The individual is a 27-year-old White female from the United States who has never been married. She works in the technology and support sector as a private sector employee with a bachelor's degree. She is classified as an Own-child in relation to the head of the household. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was No."
"The individual is an 18-year-old Black male from the United States who has never been married. He is not living with family and works in the service sector as a private sector employee. He has no capital gain or loss from last year and finished 10th grade education. He works 20 hours per week.###\nHence this label was No."
"This individual is a 20-year-old White male from the United States who has never been married. He works in the cleaning and maintenance sector as a private sector employee, with a high school education. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was No."
"This individual is a 26-year-old white male from the United States. He is never married and not living with family. He works in an office and administrative support role in the private sector. With a bachelor's degree, he worked 65 hours per week last year, earning a high capital gain of 6849 with no capital loss. This person's annual income is likely over $50,000 based on these factors.###\nHence this label was No."
"The person in the dataset is a 28-year-old White female from the United States who is divorced and not living with family. She works in the private sector as an execution and management professional, with a high school education. Last year, she had no capital gains or losses. She works 39 hours per week.###\nHence this label was No."
"This is a 31-year-old married White female from the United States. She is employed in office and administrative support within the state government. She is classified as an Other-relative in relation to the head of the household. She is a high school graduate who worked 35 hours per week last year. Her capital gain and loss were both 0.###\nHence this label was No."
"The individual is a 47-year-old married White male from the United States. He works in the private sector as a sales sector employee and has a high school education. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was Yes."
"The individual is a 20-year-old White male from the United States who has never been married. He works in the private sector as a cleaning and maintenance employee, with a high school education. He is classified as an own-child in the household. Last year, he had no capital gains or losses and works 40 hours per week.###\nHence this label was No."
"This individual is a 35-year-old White male who is married and works as a professional specialty in the private sector. He holds a master's degree and works 38 hours per week. Last year, he had neither capital gain nor loss.###\nHence this label was No."
"This 27-year-old White male, who has never been married, is not living with family. He works in the private sector in the transportation, communication, and other public utilities sector in the United States. Despite working long hours per week (75), his income is not very high, as indicated by his low capital gain and relatively high capital loss from last year. His education level is a high school graduate.###\nHence this label was No."
"This individual is a 24-year-old white male from the United States, married and working in the private sector as a service sector employee. He is a high school graduate with no capital gains or losses last year, and works 45 hours per week.###\nHence this label was Yes."
"The person is a 22-year-old single White male from Poland, working in the private sector as a cleaning and maintenance employee. He has no capital gain or loss from last year and has attended college for less than a year. He works 40 hours per week and is not living with any family members.###\nHence this label was No."
"The individual is a 37-year-old unmarried White female from the United States, working as a professional specialty in the private sector. She holds a master's degree and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 38-year-old male of White race, living in the United States. He is separated and has a son/daughter who is a part of his household. He works in the service sector as a private sector employee, with a high school education. Despite working 35 hours per week, he did not experience any capital gain or loss last year.###\nHence this label was No."
"This 26-year-old White male, who is married and identified as the husband in the household, resides in the United States. He works in the private sector as an employee in the agriculture, forestry, and fisheries sector. Despite having no capital gains or losses last year, he is a high school graduate working 55 hours per week.###\nHence this label was No."
"The person in the data is a 62-year-old White male from the United States. He is married and the husband in his household. His occupation and work class are unknown. He has no capital gain or loss from last year. He is a high school graduate and works 40 hours per week.###\nHence this label was Yes."
"This individual is a 40-year-old white male from the United States who is married and works in the craft and repair sector as a self-employed professional. He has a high school education and works 40 hours per week. Last year, he had a capital gain of $3411 and a capital loss of $0. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"The individual is a 31-year-old White male from the United States. He has never been married and is not living with family. He works in office and administrative support for the state government, with a master's degree education. He did not have any capital gains or losses last year. He works 25 hours per week.###\nHence this label was No."
"This person is a 58-year-old White male from the United States. He has never been married and is not living with family. He works as an owner of an incorporated business, professional practice, or farm in a professional specialty occupation. He holds a professional degree and works 40 hours per week. Last year, he had a capital gain of $27,828 and a capital loss of $0. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This 22-year-old White female in the United States is never married and not living with family. She works as an executive in the private sector, holding a bachelor's degree. Despite working a standard 40 hours per week and having no capital gain or loss last year, the prediction is unclear whether her annual income exceeds $50,000.###\nHence this label was No."
"The individual is a 25-year-old White male from Mexico. He is never married and not living with family. He works in the private sector as an employee in the cleaning and maintenance sector. He has a 9th class education and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 58-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with an associate's degree education. Despite not having any capital gain last year, he experienced a capital loss of $1740. He works 40 hours per week and is classified as the husband in the household.###\nHence this label was No."
"The individual is a 50-year-old married White male, working in the craft and repair sector as a private sector employee. He holds a bachelor's degree and works 40 hours per week. There was no capital gain or loss reported last year. The individual is listed as the husband in relation to the head of the household.###\nHence this label was No."
"This individual is a 31-year-old White female from the United States who has never been married. She works in the sales sector as a private sector employee, holding a bachelor's degree. She is not living with family and had no capital gain or loss last year. Despite working long hours per week (65), her annual income is predicted to be below $50,000.###\nHence this label was Yes."
"The individual is a 23-year-old White female from the United States. She is never married and is currently living with her parents (Own-child). She works in the service sector as a private sector employee, holding a bachelor's degree. With no capital gains or losses last year, she puts in 25 hours of work per week.###\nHence this label was No."
"The individual is a 41-year-old White female residing in the United States. She is divorced and currently unmarried. She works in the private sector as an executive manager, holding a master's degree. In the past year, she had no capital gains or losses and typically works 40 hours per week.###\nHence this label was No."
"The individual is a 40-year-old white male from the United States. He is married and works in the private sector as an execution and management professional. He holds a bachelor's degree and works 40 hours per week. Although he did not have any capital gain last year, he experienced a capital loss of $1902.###\nHence this label was Yes."
"The person is an 18-year-old White female from the United States who is never married and unmarried. She is a high school graduate with no reported occupation or work class. She had no capital gain or loss last year and worked 20 hours per week.###\nHence this label was No."
"The individual is a 50-year-old married White male living in the United States. He works in the private sector as a professional specialty employee, holding a bachelor's degree. He reported no capital gain or loss last year and works 50 hours per week.###\nHence this label was Yes."
"This individual is a 44-year-old White male, divorced, and with a marital status of own-child. He is a private sector employee in the transportation, communication, and other public utilities sector in the United States. He has a college education for less than a year and works 40 hours per week. In the past year, he had no capital gain but incurred a capital loss of $1380.###\nHence this label was No."
"This individual is a 44-year-old White male from Hungary, who has never been married and is not living with family. He works in a professional specialty occupation within the private sector, with a master's degree education. Despite working 40 hours per week, he did not have any capital gains or losses the previous year.###\nHence this label was Yes."
"The individual is a 49-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a high school education. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"The person in the data is a 34-year-old white male from the United States. He is married and works in the sales sector as a private sector employee. With a master's degree, he works 40 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 32-year-old married Asian-Pac-Islander male from India. He is employed in the private sector as a professional specialty worker with a bachelor's degree. He works 40 hours per week and did not have any capital gain or loss last year.###\nHence this label was No."
"The individual is a 27-year-old White male from the United States who has never been married. He is not living with any family member and works as a professional in the private sector. With a bachelor's degree, he dedicates 60 hours per week to his job, experiencing neither capital gain nor loss in the last year.###\nHence this label was No."
"This female individual is 49 years old and is Black. She is separated and not married. She works in the service sector for the local government in the United States. She finished 10th class education and works 40 hours per week. There was no capital gain or loss last year for her.###\nHence this label was No."
