"This individual is a 39-year-old White male who is divorced and not currently living with family. He is a private sector employee in the craft and repair sector, working 60 hours per week. He is a high school graduate from the United States, with no capital gain or loss last year.###\nHence this label was No."
"The person is a 34-year-old never-married Asian man from China, working in the technology and support sector as a private sector employee. He is classified as an Own-child in the household. He graduated high school and works 35 hours per week. Last year, he had a capital gain of $14,084 and no capital loss.###\nHence this label was Yes."
"This individual is a 47-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a standard 40-hour work week. He has no capital gains or losses from the previous year and has completed 8th grade education.###\nHence this label was No."
"This individual is a 65-year-old divorced Asian-Pacific-Islander female working in the service sector as a private sector employee in the United States. She is not living with any family member and has not completed a full year of college education. Despite working only 15 hours per week, she had no capital gain or loss in the previous year.###\nHence this label was No."
"This individual is a 33-year-old white male from the United States who has never been married. He is classified as an own-child in the household. He has little formal education, having attended college for less than a year. His occupation and work class are unspecified. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The individual in the dataset is a 68-year-old widowed White female from the United States. She is not living with family and her occupation, as well as work class, are not specified. She has no capital gains or losses from the previous year. Her education level is a high school graduate and she works 12 hours per week.###\nHence this label was No."
"This individual is a 33-year-old Black female from the United States. She is divorced and currently unmarried. She works in office and administrative support for the local government, with no capital gain or loss last year. She has completed less than a year of college education and works 40 hours per week.###\nHence this label was No."
"The person is a 30-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He is classified as the husband in the household. His annual income is below $50,000, as indicated by his capital gain and loss both being 0 last year. He has a high school education and works 40 hours per week.###\nHence this label was No."
"This person is a 32-year-old married White male from the United States. He works in the private sector as an employee in the cleaning and maintenance sector. He is a high school graduate and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This person is a 19-year-old White female from the United States who has never been married and is living with their parent(s). She works in the sales sector as a private sector employee, with a college education of less than one year. She did not have any capital gains or losses last year and works 20 hours per week.###\nHence this label was No."
"The person is a 29-year-old White male from the United States. He is separated and not living with family. He owns a non-incorporated business, professional practice, or farm in the transportation, communication, and other public utilities sector. He finished 11th class education and works 60 hours per week. There were no capital gains or losses last year.###\nHence this label was No."
"This is a 19-year-old White male who has never been married and is classified as an Other-relative in the household. He is from the United States and works in the sales sector as a private sector employee. He had no capital gain or loss last year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"The person is a 20-year-old male of Amer-Indian-Eskimo descent, who has never been married. He is living with his parents and works as a machine operator and inspector in the private sector. He has no capital gains or losses from the previous year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"The person is a 46-year-old White male from the United States. He is divorced and not living with family. He works as a craftsman in the repair sector and owns a non-incorporated business, professional practice, or farm. He has an associate's degree and works 40 hours per week. He had no capital gains or losses last year.###\nHence this label was No."
"This individual is a 47-year-old married White male from the United States. He works in office and administrative support for the federal government, and is classified as the husband in the household. He has a high school education and worked 40 hours per week last year with no capital gains or losses.###\nHence this label was Yes."
"The person is a 22-year-old married White male from the United States. He works in the private sector as an employee in the transportation, communication, and other public utilities sector. He is a high school graduate and works 50 hours per week. He had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 38-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He is the husband in the household and has a high school education. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"This person is a 35-year-old White female, married and working as an execution and management professional in the private sector in the United States. She has finished 9th class education and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 42-year-old White male from the United States, with a master's degree in a professional specialty. He is divorced and not living with family. He works as a private sector employee, putting in 40 hours per week. Last year, he had a capital gain of 4650 and no capital loss.###\nHence this label was No."
"A 43-year-old divorced white male, not living with family, from the United States. He works in the craft and repair sector as a private sector employee, with no capital gain or loss last year. He has attended college for less than one year and works 40 hours per week.###\nHence this label was No."
"The individual is a 35-year-old White male from the United States. He is married and works in a professional specialty occupation in the state government. He has a master's degree and works 75 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 38-year-old Black male from the United States. He is divorced, not living with family, and works in the craft and repair sector as a private sector employee. He has a high school education, works 40 hours per week, and had no capital gains or losses last year.###\nHence this label was No."
"This individual is a 39-year-old married White male from the United States. He works in the private sector as an office and administrative support worker, with a bachelor's degree education. Last year, he had no capital gains or losses, and he works 40 hours per week.###\nHence this label was No."
"This 22-year-old White male is a high school graduate working in the private sector as a cleaning and maintenance employee. He has never been married and is considered an own-child in the household. With no capital gains or losses from the previous year, he works 40 hours per week in the United States.###\nHence this label was No."
"This dataset represents a 22-year-old single white female from the United States. She is not currently living with family and her occupation and work class are unknown. She holds a bachelor's degree and worked 23 hours per week last year with no capital gain or loss. The model aims to predict whether her annual income exceeds $50,000.###\nHence this label was No."
"A 30-year-old married White male, working in the craft and repair sector as a private sector employee in the United States. He finished 11th class and works 40 hours per week. Last year, he had a capital gain of 2580 and no capital loss.###\nHence this label was No."
"This 23-year-old White male is a high school graduate working as a machine operator and inspector in the private sector. He has never been married and is living with the head of the household, likely his parents, as an own-child. With no capital gain or loss in the last year, he works a standard 40 hours per week in the United States.###\nHence this label was No."
"The individual is a 41-year-old Black female from the United States who has never been married. She works in the cleaning and maintenance sector as a private sector employee, with a high school education. Last year, she had no capital gains or losses. She works 30 hours per week. The model predicts whether her annual income exceeds $50,000.###\nHence this label was No."
"This individual is a 47-year-old white male from the United States. He is divorced and not living with family. He works in the private sector in the technology and support industry, holding a master's degree. Despite working 40 hours per week, he did not have any capital gain or loss last year.###\nHence this label was No."
"The person is a 20-year-old White male from the United States who has never been married. He is an own-child and works as a private sector employee in the transportation, communication, and other public utilities sector. He has no capital gains or losses from the previous year. His education level is college for less than one year, and he works 23 hours per week.###\nHence this label was No."
"The individual is a 36-year-old married White male from the United States working in the craft and repair sector as a private sector employee. He has no capital gain or loss from last year and has attended college for less than one year. He works 40 hours per week.###\nHence this label was Yes."
"A 46-year-old married Black male, who is a private sector employee in the transportation, communication, and other public utilities sector in the United States. He is a high school graduate working 40 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 31-year-old married White female from the United States. She works in the private sector as an executive and manager, having graduated from high school. She works 40 hours per week and had no capital gains or losses last year.###\nHence this label was Yes."
"This individual is a 28-year-old white male from the United States who has never been married. He works in the cleaning and maintenance sector as a private sector employee, with a high school education. He is classified as an Own-child in relation to the head of the household. Last year, he had no capital gains or losses, and he works 40 hours per week. The prediction is whether his annual income is over $50,000.###\nHence this label was No."
"The individual is a 30-year-old married white male from the United States. He works in the private sector as a professional specialty employee, putting in 40 hours per week. He has no capital gains or losses from the previous year and has received college education for one or more years without obtaining a degree.###\nHence this label was Yes."
"This individual is a 35-year-old white female from the United States who has never been married. She is not living with any family members and works in the private sector as an execution and management professional. Her educational background includes an associate's degree. Despite working long hours per week (60 hours), she did not have any capital gain or loss last year.###\nHence this label was No."
"The individual is a 55-year-old married white male from the United States. He works as an owner of an incorporated business, professional practice, or farm in the sales sector. He holds a bachelor's degree and works 60 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The individual in the data is a 71-year-old White female from the United States. She has never been married and is not living with family. She works in execution and management in the private sector, with a bachelor's degree. Despite her age, she only works 14 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 28-year-old White male from the United States who has never been married. He is not living with family and works in the service sector as a private sector employee. Despite being a high school graduate, his annual income is most likely less than $50,000 as he had no capital gain or loss last year and works 32 hours per week.###\nHence this label was No."
"The individual is a 50-year-old White male from the United States. He is divorced and currently unmarried. His occupation and work class are not specified. He had no capital gains or losses last year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"This individual is a 28-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a high school education. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"This individual is a 46-year-old married Asian-Pac-Islander male from China. He works in the service sector as a private sector employee, with a 10th class education. Last year, he had no capital gains or losses. He works 37 hours per week and it is predicted that his annual income is over $50,000.###\nHence this label was No."
"This 19-year-old White female is never married and lives in the United States as an own-child in the household. She works in the sales sector as a private sector employee, with no capital gain or loss last year. She attended college for less than one year and currently works 20 hours per week.###\nHence this label was No."
"The individual is a 45-year-old married White male from the United States. He works in the agriculture, forestry, and fisheries sector as the owner of a non-incorporated business, professional practice, or farm. He is the husband in the household. He has a high school education, works 56 hours per week, had no capital gain, and incurred a capital loss of $1740 last year.###\nHence this label was No."
"The individual is a 30-year-old White male from the United States, who is divorced and not living with family. He works in the craft and repair sector as a private sector employee, with no capital gain or loss last year. He has completed less than a year of college education and works an intensive 65 hours per week.###\nHence this label was No."
"The individual is a 43-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, having completed less than a year of college education. With 38 hours worked per week, he had a capital gain of $4064 and no capital loss in the last year.###\nHence this label was No."
"This 25-year-old Black male, who has never been married, is categorized as an own-child in the household. He resides in the United States and works in the craft and repair sector as a private sector employee. Despite being a high school graduate, he works 50 hours per week with no reported capital gain or loss last year.###\nHence this label was No."
"The individual is a 42-year-old married White male from the United States. He works in the sales sector as a private sector employee, with a college education for less than one year. He is designated as the husband in the household. Despite working 50 hours per week, he did not have any capital gains or losses last year.###\nHence this label was No."
"This individual is a 29-year-old Black male who has never been married. He is not living with family and works in the craft and repair sector as a private sector employee. He did not have any capital gains or losses last year. He has completed 10th grade education and works 40 hours per week.###\nHence this label was No."
"The individual is a 47-year-old white female from the United States, who is divorced and not living with family. She works in the sales sector as a private sector employee, with a high school education. Last year, she had no capital gains or losses and works 40 hours per week.###\nHence this label was No."
"The person in the dataset is a 24-year-old single White female from the United States. She is an employee in the private sector, working in the sales sector with less than a year of college education. She is classified as an Own-child in the household and worked 17 hours per week last year with no capital gain or loss.###\nHence this label was No."
"The individual is a 31-year-old White male from the United States who is divorced. He is not living with family and works in the craft and repair sector as a private sector employee. Last year, he had no capital gain or loss. He has attended college for one or more years but does not have a degree. He works 40 hours per week.###\nHence this label was No."
"This individual is a 29-year-old single, White male from the United States. He works in the craft and repair sector as a private sector employee, putting in 45 hours per week. His education level is college for less than one year. Last year, he had no capital gain but incurred a capital loss of 2258.###\nHence this label was Yes."
"The individual is a 63-year-old White male from the United States who has never been married. He is not living with any family members. He is employed in the private sector as an execution and management professional, working 40 hours per week. His educational background is a high school graduate. He did not have any capital gains or losses in the previous year.###\nHence this label was No."
"This individual is a 33-year-old White female from the United States. She is never married and does not live with family. She works as a professional specialty in the private sector and has no capital gains or losses from last year. She has completed some college education but does not have a degree. She works 40 hours per week.###\nHence this label was No."
"This individual is a 62-year-old White male from the United States who is married and works in the craft and repair sector as a private sector employee. He has no capital gains or losses from the previous year and has received education equivalent to less than a year of college. He works 45 hours per week.###\nHence this label was No."
"A 28-year-old divorced white female, not living with family, from the United States, works as an executive in the private sector. She is a high school graduate and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 36-year-old married white male from the United States. He works in the private sector in the transportation, communication, and other public utilities sector. He finished 11th class education and works 43 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This person is a 40-year-old married White male from the United States. He holds a doctoral degree and works in a professional specialty occupation for the state government. Despite having no capital gain last year, he incurred a loss of $1887. He typically works 50 hours per week.###\nHence this label was Yes."
"This individual is a 32-year-old married White male from the United States. He works as a professional specialty in the private sector and has a bachelor's degree. He works 40 hours per week and had no capital gain or loss last year.###\nHence this label was Yes."
"This individual is a 30-year-old White male from the United States who has never been married. He works as a professional specialty in the private sector, with a master's degree education. Last year, he had a capital gain of $10,520 and no capital loss. He works 40 hours per week.###\nHence this label was Yes."
"The individual is a 52-year-old Black female from the United States who is widowed. She works in an office and administrative support role in the private sector, having graduated from high school. With no capital gains or losses last year, she typically works 40 hours a week and is classified as an Other-relative in the household.###\nHence this label was No."
"This person is a 56-year-old White female from the United States. She is married and works in the sales sector as the owner of a non-incorporated business, professional practice, or farm. She has attended college for less than a year. Last year, she had no capital gains or losses. Despite working long hours per week (60), her annual income is predicted to be over $50,000.###\nHence this label was Yes."
"This 20-year-old White female, who has never been married, is not living with family in the United States. She works in the private sector in the sales field, with no capital gain or loss last year. Despite having less than a year of college education, she works 20 hours per week.###\nHence this label was No."
"The individual is a 20-year-old White female from the United States who has never been married. She is classified as an Own-child in the household. She works in the sales sector as a private sector employee, with a college education of less than one year. She had no capital gains or losses last year and works 20 hours per week.###\nHence this label was No."
"The person in the dataset is a 32-year-old White female, divorced, with no family relation in the household. She is from the United States and works as an executive in the private sector. She had no capital gains or losses last year. Her education level is college for less than one year, and she works 45 hours per week.###\nHence this label was No."
"The person in the data is a 73-year-old Asian-Pac-Islander male who has never been married and is not living with family. He is from the United States, with unknown occupation and work class. He had no capital gains or losses last year. His education level is college for less than one year, and he works 38 hours per week.###\nHence this label was No."
"The person in this dataset is a 55-year-old White female from the United States. She is divorced and not living with any family members. She works in the private sector as an executive and manager, with a high school education. Last year, she had no capital gains or losses and works 40 hours per week.###\nHence this label was No."
"This individual is a 39-year-old married Black male from the United States. He works in the private sector as an execution and management employee, having graduated from high school. With a capital gain of $7688 and no capital loss last year, he puts in 45 hours of work per week.###\nHence this label was Yes."
"This individual is a 50-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a college education for less than one year. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"The person in the dataset is a 48-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. Last year, he had no capital gain or loss. He works 40 hours per week. Based on this information, the prediction is that his annual income is likely over $50,000.###\nHence this label was Yes."
"The person is a 23-year-old White male who is divorced. He is not living with family and is from the United States. He works in the cleaning and maintenance sector as a private sector employee, with a high school education. Last year, he had no capital gains or losses. He works 50 hours per week.###\nHence this label was No."
"This 23-year-old White female, who has never been married, is living with her parents in the United States. She is employed in a professional specialty role in the state government, despite having less than a year of college education. Last year, she did not experience any capital gains or losses. She works very few hours per week, only 6.###\nHence this label was No."
"This individual is a 52-year-old white male from the United States. He is married and works in the private sector as an executive or manager. He is a high school graduate and works 50 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"This is a 53-year-old divorced White female from the United States. She works in office and administrative support for the local government. She has no capital gain or loss from last year. Her education level is college for less than one year. She works 40 hours per week and is not in a family relation.###\nHence this label was No."
"The individual is a 36-year-old White male from the United States. He is married and works in the sales sector as an owner of a non-incorporated business, professional practice, or farm. Despite being a high school graduate, he works 30 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 37-year-old married White male from the United States. He is the husband in the household and works in the agriculture, forestry, and fisheries sector as the owner of a non-incorporated business, professional practice, or farm. He had no capital gain or loss last year. His education level is college for one or more years without a degree, and he works 60 hours per week.###\nHence this label was Yes."
"This is a profile of a 48-year-old white American woman who is divorced and currently unmarried. She works in the service sector as a private sector employee with a bachelor's degree. She had no capital gains or losses last year and works 56 hours per week.###\nHence this label was Yes."
"This individual is an 18-year-old White female from the United States who has never been married. She is categorized as an Own-child in relation to the head of the household. She works in the sales sector as a private sector employee, with a capital gain and loss of 0 last year. She has completed 11th class education and works 49 hours per week.###\nHence this label was No."
"This individual is a 22-year-old Black male from the United States. He has never been married and is classified as an own-child in the household. He did not obtain a diploma after finishing 12th class and currently has no occupation or specified work class. Last year, he had no capital gains or losses, and he works 40 hours per week.###\nHence this label was No."
"This 28-year-old White male is a never-married private sector employee working in the cleaning and maintenance sector. He is not living with family in the United States and has completed up to the 10th class for education. With no capital gain or loss last year, he works a standard 40 hours per week.###\nHence this label was No."
"This individual is a 37-year-old married White male from the United States. He works in the sales sector as a private sector employee with a bachelor's degree education. He had no capital gains or losses last year and works 50 hours per week.###\nHence this label was Yes."
"This individual is a 46-year-old married Black male living in the United States. He works in the agriculture, forestry, and fisheries sector as a private sector employee. He completed 8th class education and works 30 hours per week. In the past year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 31-year-old White male from the United States. He is divorced and currently unmarried, working in the craft and repair sector for the local government. With a high school education, he works 40 hours per week with no capital gain or loss recorded last year.###\nHence this label was No."
"This person is a 33-year-old White male who is divorced and not living with family. He is a private sector employee in the craft and repair sector, working 50 hours per week. He is a high school graduate from the United States with no capital gains or losses last year.###\nHence this label was No."
"This 18-year-old female, who has never been married, is working in the sales sector as a private sector employee in the United States. She is classified as an Own-child in relation to the head of the household. With a 9th-grade education, she works 32 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 45-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He has no capital gain or loss from the previous year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"This 26-year-old White male, who has never been married, is categorized as an Own-child in the household. He is a private sector employee in the craft and repair sector, with a high school education. Last year, he had no capital gains or losses. He typically works 40 hours per week in the United States.###\nHence this label was No."
"The individual is a 51-year-old married White male residing in the United States. He works in the sales sector as the owner of a non-incorporated business, professional practice, or farm. Despite having a college education for less than one year, he works 50 hours per week. There were no capital gains or losses reported last year.###\nHence this label was No."
"This individual is a 53-year-old White male, divorced, and not living with family. He is a professional specialty worker in the private sector in the United States. With a bachelor's degree, he works 55 hours per week and had a capital gain of $14,344 last year.###\nHence this label was Yes."
"This individual is an 18-year-old White male from the United States who has never been married. He is classified as an Own-child in relation to the head of the household. He works in the craft and repair sector as a private sector employee, with a capital gain and loss of 0 last year. He has completed 11th class education and works 25 hours per week.###\nHence this label was No."
"The individual is a 38-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee with a bachelor's degree. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was No."
"The person is a 39-year-old White male from the United States who has never been married. He is in the craft and repair sector, working as a private sector employee. He is classified as an Own-child in relation to the head of the household. He is a high school graduate and works 40 hours per week. Last year, he did not have any capital gains or losses.###\nHence this label was No."
"The individual is a 31-year-old Black female from the United States. She is never married and is unattached to the head of the household. She works in the private sector as an office and administrative support employee, with a college education of less than one year. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was No."
"The individual is a 34-year-old married White male living in the United States. He works in the craft and repair sector as a private sector employee, having graduated high school. Despite working long hours (72 per week), he did not have any capital gains or losses last year.###\nHence this label was No."
"The individual is an 18-year-old White male from the United States who has never been married and is classified as an own-child of the household. He has not specified an occupation or work class. Despite finishing the 10th class, he works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This 29-year-old White female, who holds a master's degree and works in a professional specialty occupation in the private sector, has never been married. She is not living with family and resides in the United States. With a stable work schedule of 40 hours per week and no capital gains or losses last year, she is likely to have an annual income exceeding $50,000.###\nHence this label was No."
"This is a 22-year-old unmarried White male from the United States. He is not living with family and works as a professional in the private sector. He holds a bachelor's degree and works 50 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 64-year-old married white male from the United States. He works in the private sector as a professional specialty, holding a professional degree. He works 40 hours per week with no capital gains or losses last year.###\nHence this label was Yes."
"This individual is a 34-year-old White male from the United States who has never been married. He works in the private sector as a professional specialty, holding a master's degree. Despite not having any capital gain, he experienced a loss of $2258 last year. He works 50 hours per week.###\nHence this label was No."
"This individual is a 39-year-old married White male from the United States. He works as an office and administrative support employee in the private sector, with a high school education. Last year, he had no capital gain or loss. He works 40 hours per week.###\nHence this label was Yes."
"This 28-year-old married male, who works in the private sector in a service sector occupation, is a high school graduate from the United States. With no capital gain or loss last year, he works 40 hours per week.###\nHence this label was No."
"This individual is a 28-year-old single white male working in the service sector as a private sector employee in the United States. He has a bachelor's degree and works 50 hours per week. He did not have any capital gain or loss last year.###\nHence this label was No."
"This individual is a 20-year-old divorced White male from the United States. He is categorized as an own-child in the household. His occupation falls under the cleaning and maintenance sector, and he is the owner of an incorporated business, professional practice, or farm. Despite being a high school graduate, he works 25 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This 27-year-old White female, who has never been married, is not living with family in the United States. She works in the private sector in the sales industry as a bachelor's degree holder. Despite working 55 hours per week, she did not have any capital gain but did incur a capital loss of $2258 last year.###\nHence this label was No."
"The person is a 30-year-old married White male from El-Salvador. He works in the technology and support sector as a private sector employee with a bachelor's degree. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"The individual is a 23-year-old White female from the United States who has never been married. She is not living with family and works in an office in the private sector. She holds a bachelor's degree and works 5 hours per week, with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 48-year-old married White male from the United States with a bachelor's degree. They are the husband in the household and worked 6 hours per week with no reported capital gains or losses. Information about their occupation and work class is not available in the dataset.###\nHence this label was No."
"The individual is a 64-year-old White female from the United States. She is divorced and not living with family. She works in office and administrative support for the state government, with zero capital gains and losses last year. She has received less than a year of college education and works 40 hours per week.###\nHence this label was No."
"The individual is a 22-year-old White male from the United States. He is married and works in the protective services sector for the local government. He has no capital gain or loss from the previous year. He has completed less than a year of college education and works 40 hours per week. The data suggests that he may have an annual income over $50,000.###\nHence this label was No."
"The individual is a 70-year-old White male from the United States. He is married and the husband in the household. His occupation is in the agriculture, forestry, and fisheries sector, and he owns a non-incorporated business, professional practice, or farm. He is a high school graduate and works 50 hours per week. There were no capital gains or losses last year.###\nHence this label was No."
"This individual is a 20-year-old White male from the United States. He has never been married and is not living with family. He works in the private sector as a service sector employee, with a high school education. Despite working 8 hours per week, he did not have any capital gain or loss last year.###\nHence this label was No."
"The individual is a 53-year-old unmarried White male from Italy. He works in the service sector as a private sector employee with a bachelor's degree. Last year, he had a capital gain of $8614 and no capital loss. He works 50 hours per week and is not living with family.###\nHence this label was Yes."
"This individual is a 46-year-old married White male from the United States. He works in the protective services sector for the local government, with a college education for less than one year. He has not experienced any capital gain or loss in the last year. He works 38 hours per week.###\nHence this label was Yes."
"This individual is a 20-year-old White female from the United States who has never been married. She works as a machine operator and inspector in the private sector, with a college education of less than one year. She is not living with any family members, has a capital gain of 2176 and no capital loss from the previous year. She works 40 hours per week.###\nHence this label was No."
"This individual is a 66-year-old white male from the United States. He is married and works in the agriculture, forestry, and fisheries sector as an owner of a non-incorporated business, professional practice, or farm. He has a high school education and works 40 hours per week. Last year, he had a capital gain of $1409 and no capital loss.###\nHence this label was No."
"The individual is a 23-year-old White male from the United States who has never been married. He is classified as an own-child in relation to the head of the household. He is employed in the service sector as a private sector employee, working 40 hours per week. He has no capital gain or loss from the previous year and has attended college for less than a year.###\nHence this label was No."
"The person is a 52-year-old White male from the United States. He is married and works as a machine operator and inspector in the private sector. He is the husband in the household and has a high school education. Last year, he had no capital gains or losses and works 40 hours per week.###\nHence this label was No."
"The person is a 58-year-old married white male from the United States. He works in the agriculture, forestry, and fisheries sector for the local government. With a high school education, he works 40 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 52-year-old married Black male from the United States. He works as a machine operator and inspector in the private sector, with a high school education. He has no capital gains or losses from the previous year and works 48 hours per week.###\nHence this label was No."
"This individual is a 51-year-old married white male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. He has no capital gains or losses from the previous year and works 45 hours per week.###\nHence this label was Yes."
"This individual is a 35-year-old White female from the United States. She is divorced, unmarried, and works as a professional specialty in the private sector. With no capital gain or loss last year, she has completed some college education without obtaining a degree. She works 40 hours per week.###\nHence this label was No."
"The person is a 41-year-old married White male from the United States. He works in the sales sector as a private sector employee, with a high school education. Last year, he had no capital gain or loss. He works 40 hours per week.###\nHence this label was No."
"This is a 44-year-old married White female, working in a professional specialty occupation for the local government in the United States. She holds a master's degree and works 40 hours per week. Last year, she had no capital gains or losses.###\nHence this label was Yes."
"The person is a 38-year-old White male from the United States, who is divorced and not living with family. He works in execution and management in the private sector, with a college education for less than a year. He had no capital gain or loss last year and works 50 hours per week.###\nHence this label was No."
"The individual is a 34-year-old White male from Germany, with a doctoral degree. He is married and works in a professional specialty occupation for the state government, with no capital gain or loss last year. He is the husband in the household and works an average of 45 hours per week.###\nHence this label was Yes."
"The individual is a 64-year-old white male, married and the husband in the household. He is from the United States and works in the sales sector as the owner of a non-incorporated business, professional practice, or farm. He had no capital gains or losses last year. His education level is college for less than one year, and he works 20 hours per week. The data indicates that he may have an annual income over $50,000.###\nHence this label was No."
"A 52-year-old white male, divorced and not living with family, from the United States. He is an owner of an incorporated business, professional practice, or farm, working in execution and management. Despite working long hours -- 65 hours per week, he did not have any capital gain or loss last year. He has some college education, having studied for less than a year.###\nHence this label was Yes."
"This 21-year-old White male from Mexico works in the craft and repair sector as a private sector employee. He is never married and not living with any family members. He is a high school graduate working 35 hours per week with no capital gains or losses last year.###\nHence this label was No."
"This individual is a 52-year-old married White male, working in the private sector in the transportation, communication, and other public utilities sector. He is a high school graduate and works 50 hours per week. His capital gain and loss last year were both 0. He is the husband in the household and is a United States native.###\nHence this label was No."
"This 20-year-old female, who has never been married, is living in the United States as an own-child in a household. She has some college education, working an unknown occupation in an unknown work class. In the past year, she had a capital gain of $594 and no capital loss. She works 35 hours per week.###\nHence this label was No."
"This individual is a 55-year-old White female from the United States who is divorced and not living with family. She works in the private sector as an office and administrative support employee, with a college education for less than one year. She has no capital gain or loss from the previous year and works 38 hours per week. The prediction is whether her annual income is over $50,000.###\nHence this label was No."
"The individual is a 32-year-old married White male from the United States. He is the husband in the household and works in the sales sector as the owner of an incorporated business, professional practice, or farm. He has a bachelor's degree and worked 60 hours per week last year. Additionally, he had a capital gain of $7688 and no capital loss.###\nHence this label was Yes."
"The individual is a 23-year-old White male from the United States who has never been married and is not living with family. His occupation and work class are not specified. He is a high school graduate working 40 hours per week and had no capital gains or losses in the last year.###\nHence this label was No."
"The individual is a 33-year-old African American male residing in the United States. He is married and works in the protective services sector for the state government. With a master's degree, he works 40 hours per week and had no capital gains or losses last year.###\nHence this label was No."
"The individual is a 31-year-old White male from the United States. He has a master's degree and works in office and administrative support for the state government. He is never married and not living with family. He had no capital gains or losses last year and works 25 hours per week.###\nHence this label was No."
"The individual is a 31-year-old unmarried White male working in the private sector as a professional specialty employee in the United States. He has a bachelor's degree and works 47 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 58-year-old White female from the United States. She is divorced and unmarried, working as a machine operator and inspector in the private sector. She finished 8th class for education and works 40 hours per week. There were no capital gains or losses last year.###\nHence this label was No."
"This 24-year-old White male is a craft and repair sector employee in the private sector. He is never married and not living with family. He is a high school graduate working 40 hours per week with no capital gain or loss last year. He is from the United States and it is predicted that his annual income is over $50,000.###\nHence this label was No."
"This individual is a 68-year-old Black female from the United States. She is widowed and not living with family. She works as a machine operator and inspector in the private sector, having completed 11th class for her education. Last year, she had no capital gains but experienced a loss of $1870. She works 35 hours per week.###\nHence this label was No."
"This individual is a 30-year-old Black female from the United States. She is separated and unmarried. She works in the sales sector as a private sector employee, with an education level of college for less than one year. Last year, she had no capital gains or losses. She works 16 hours per week.###\nHence this label was No."
"This individual is a 20-year-old white male from the United States who has never been married. He is an own-child in the household and works as a private sector employee in the cleaning and maintenance sector. With a completed 11th class education, he works 39 hours per week with no capital gain or loss last year.###\nHence this label was No."
"A 49-year-old married Caucasian woman from the United States, who has attended college for one or more years without obtaining a degree. She has not reported any capital gain or loss last year. Her occupation and work class are unspecified, and she works 40 hours per week.###\nHence this label was No."
"This 24-year-old White male is never married and living with the head of the household as an Own-child in the United States. He is a machine operator and inspector in the private sector, with no capital gain or loss last year. He has attended college for less than one year and works 40 hours per week.###\nHence this label was No."
"This individual is a 73-year-old White male from the United States. He has never been married and is not living with any family members. His occupation, work class, and level of education are not specified. He did not have any capital gain or loss last year. Despite his age, he only works 4 hours per week.###\nHence this label was No."
"This individual is a 19-year-old White male from the United States. He is never married and is categorized as an Other-relative in relation to the head of the household. He works in the craft and repair sector as a private sector employee, with a 0 capital gain and 0 capital loss last year. He has finished 11th class education and works 25 hours per week.###\nHence this label was No."
"The individual is a 36-year-old White female who is married and listed as the wife in the household. She is from the United States and has not specified her occupation or work class. She has had no capital gain or loss in the last year. Her education level is college for less than one year, and she works 25 hours per week.###\nHence this label was No."
"The person is a 31-year-old married White female from Mexico. She works in the private sector as an office and administrative support employee with a bachelor's degree. She had no capital gains or losses last year and works 25 hours per week.###\nHence this label was No."
"This 19-year-old White female, who has never been married, is living in the United States as an Own-child in the household. She works in the service sector as a private sector employee, with a college education but without a degree. Despite working 20 hours per week, she had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 37-year-old married White male from the United States. He works in the private sector as a service sector employee, with a high school education. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"A 54-year-old White male, divorced and not living with family, residing in the United States. He is the owner of an incorporated business, professional practice, or farm, working in execution and management. With a bachelor's degree, he worked 70 hours per week last year, with a significant capital gain of $99,999 and no capital loss.###\nHence this label was Yes."
"The person is a 38-year-old married White male from the United States. He works in the craft and repair sector as an owner of an incorporated business, professional practice, or farm. With a bachelor's degree, he worked 35 hours per week last year and had a capital gain of $15,024 with no capital loss. This person's annual income is predicted to be over $50,000.###\nHence this label was Yes."
"This individual is a 29-year-old white female from the United States. She has never been married and is classified as an own-child in the household. She works in the sales sector as a private sector employee with a bachelor's degree. In the past year, she had no capital gains or losses. She works 50 hours per week.###\nHence this label was No."
"The individual is a 27-year-old white male who has never been married. He is classified as an own-child in the household, and he is from the United States. He works as a machine operator and inspector in the private sector, with a high school education. Last year, he had no capital gains or losses. He typically works 40 hours per week.###\nHence this label was No."
"This individual is a 36-year-old married White male working in the service sector as a private sector employee. He is a high school graduate. Last year, he had no capital gain or loss. He works 40 hours per week and his native country is not specified.###\nHence this label was No."
"The person is a 27-year-old White female from the United States who has never been married. She is not living with family and works in a professional specialty occupation in the local government. Despite working 60 hours per week, she did not have any capital gain or loss last year. She holds a bachelor's degree and may have an annual income over $50,000.###\nHence this label was No."
"This individual is a 57-year-old married White male from the United States. He works in the private sector in an executive or managerial position, having a bachelor's degree. Last year, he had no capital gains or losses. He works 40 hours per week and is the husband in the household.###\nHence this label was Yes."
"This 23-year-old White female who has never been married is an unmarried private sector employee working in the sales sector in the United States. She is a high school graduate with no capital gains or losses from the previous year, and she works 48 hours per week.###\nHence this label was No."
"This young, Black female who is single and lives in the United States works in the private sector in an office and administrative support role. She is a high school graduate working 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 29-year-old married White male from Canada, working in the craft and repair sector as a private sector employee. He holds a bachelor's degree and works 40 hours per week. Last year, he had no capital gains or losses. The prediction is that his annual income is over $50,000.###\nHence this label was No."
"This individual is a 58-year-old Black male from the United States. He is married and serves as the husband in the household. He has a high school education, currently unemployed, and did not experience any capital gains or losses last year. He works 30 hours per week.###\nHence this label was No."
"This individual is an 18-year-old Black male from the United States. He has never been married and is classified as an own-child in the household. His occupation, work class, and capital gains/losses from last year are not specified. He has completed 11th class education and works 30 hours per week.###\nHence this label was No."
"The individual is a 65-year-old White male from the United States. He is married and works in the private sector as a sales sector employee. He has a high school education and works 18 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"This individual is a 24-year-old White male from the United States. He is never married and not living with family. He works in the cleaning and maintenance sector as a private sector employee, with a college education of less than one year. He had no capital gains or losses last year and works a standard 40 hours per week.###\nHence this label was No."
"The person is a 33-year-old married White male from the United States. He works in the sales sector as a private sector employee, with a college education for less than one year. Despite working 20 hours per week, he had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 49-year-old married White male from the United States. He is the husband in the household. His occupation and work class information is not available. He had no capital gain last year but incurred a capital loss of $2002. He is a high school graduate and works 70 hours per week.###\nHence this label was No."
"The person is a 20-year-old White female from the United States. She is never married and is classified as an Own-child in relation to the head of the household. She works in office and administrative support for the federal government, with a high school graduate education. Last year, she had no capital gains or losses and works 40 hours per week.###\nHence this label was No."
"The individual is a 58-year-old Black male, married and works in the sales sector as a private sector employee in the United States. He has no capital gain or loss from the previous year, with a college education of less than one year. He works 40 hours per week as a husband in the household.###\nHence this label was No."
"This individual is a 20-year-old White female from Mexico. She has never been married and is listed as an own-child in the household. She works in the sales sector as a private sector employee, with a high school education. Last year, she had no capital gains or losses. She works 25 hours per week.###\nHence this label was No."
"This individual is a 53-year-old White male, separated, and not living with family. He is from the United States and works in the transportation, communication, and other public utilities sector in the local government. Last year, he had no capital gains or losses. He is a high school graduate and works 40 hours per week.###\nHence this label was No."
"The individual is a 34-year-old married White male from the United States. He holds a professional degree and works as an owner of a non-incorporated business, professional practice, or farm in a professional specialty occupation. Despite having no capital gains or losses last year, he puts in 55 hours of work per week.###\nHence this label was Yes."
"The individual is a 33-year-old single White male working in the private sector as a professional specialty. He has no dependents and resides in the United States. With a college education of less than one year, he works 52 hours per week and did not have any capital gains or losses last year.###\nHence this label was No."
"This is a 26-year-old white male from the United States who has never been married. He is not living with family and works in the craft and repair sector as a private sector employee. Despite being a high school graduate, he works 40 hours a week and did not have any capital gains or losses last year.###\nHence this label was No."
"This individual is a 44-year-old married White male from the United States. He is the husband in the household and works in the service sector as an owner of a non-incorporated business, professional practice, or farm. He has no capital gain or loss from last year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was Yes."
"The person is a 30-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, having finished 11th class for education. With no capital gain or loss last year, he works 45 hours per week.###\nHence this label was No."
"This 23-year-old White female, who has never been married, is living in the United States as an own-child in the household. She works in the private sector as an office and administrative support employee, with a college education of less than one year. Despite working 20 hours per week, she had no capital gain or loss last year. The prediction is that her annual income is likely below $50,000.###\nHence this label was No."
"The individual is a 41-year-old Black male from the United States who has never been married. He is not living with any family members. He works as a machine operator and inspector in the private sector, with a high school education. He worked 40 hours per week last year with no significant capital gains or losses.###\nHence this label was No."
"The individual is a 47-year-old married Asian-Pac-Islander male from India. He holds a doctoral degree and works in a professional specialty occupation for the state government. There were no capital gains or losses last year, and he works a standard 40 hours per week.###\nHence this label was Yes."
"This person is a 26-year-old unmarried White male from the United States. He works in the sales sector as a private sector employee and holds a bachelor's degree. He has no capital gains or losses from last year and works 45 hours per week.###\nHence this label was No."
"The person is a 62-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee with a bachelor's degree. Last year, he had a capital gain of 7688 and no capital loss. He works 50 hours per week.###\nHence this label was Yes."
"This individual is a 27-year-old married Black man from the United States. He works in the craft and repair sector for the state government, with a college education for less than one year. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"This data describes a 20-year-old Asian-Pacific-Islander female who has never been married. She is living with her parent(s) and is from the United States. She works in the private sector in an office administrative support role, with a college education for less than one year. Despite working 30 hours per week, her capital gain and loss were both at 0 last year.###\nHence this label was No."
"This person is a 56-year-old White female from the United States. She is divorced and not living with any family members. She works in a professional specialty occupation in the private sector, with a workweek of 40 hours. Her educational background is as a high school graduate. Last year, she had a capital gain of $4101 and did not incur any capital losses.###\nHence this label was No."
"The individual is a 57-year-old White female from the United States. She is divorced and not living with family. She is employed in the private sector in a professional specialty occupation, working 40 hours per week. She holds a master's degree and did not have any capital gain or loss last year.###\nHence this label was No."
"The individual is a 37-year-old married Black female from the United States. She works in the service sector for the local government, holding an associate's degree. She worked 50 hours per week last year and had no capital gains or losses.###\nHence this label was No."
"The person is a 47-year-old Black female from the United States. She has never been married and is classified as an unmarried individual in the household. She works in the private sector as an office and administrative support worker, with a standard 40-hour work week. Last year, she did not have any capital gain or loss. Her education level is completed 12th grade without obtaining a diploma.###\nHence this label was No."
"This person is a 51-year-old married White male from Canada, employed in the private sector as a craft and repair worker. He has no capital gain or loss from the previous year, and his education level is college for one or more years without a degree. He works 40 hours per week.###\nHence this label was Yes."
"This 41-year-old White female, who is divorced and unmarried, resides in the United States. She works in office and administrative support in the private sector, holds an associate's degree, and works 38 hours per week. She did not have any capital gain or loss last year. The prediction is whether her annual income exceeds $50,000.###\nHence this label was No."
"The person is a 44-year-old White male who is married and works as a sales sector professional in the United States. He owns a non-incorporated business, professional practice, or farm, with no capital gain or loss last year. He has less than one year of college education and works 25 hours per week.###\nHence this label was No."
"This individual is a 41-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. With a high school education, he works 40 hours per week with no capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 19-year-old White female from the United States who has never been married. She is classified as an own-child in relation to the head of the household. She is a high school graduate with no reported occupation or work class. In the previous year, she had no capital gains or losses. She works approximately 30 hours per week.###\nHence this label was No."
"The individual is a 45-year-old married white male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. Last year, he had a capital gain of $5013 and did not incur any capital losses. He works 45 hours per week as a husband.###\nHence this label was No."
"The individual is a 37-year-old Black male from the United States, married, and works as a craft and repair sector employee in the private sector. He is the husband in the household and has no capital gain or loss from the previous year. He completed 11th class education and works 25 hours per week.###\nHence this label was No."
"A 50-year-old married White female from El-Salvador, working as a machine operator and inspector in the private sector. She is a high school graduate and works 40 hours per week. Last year, she had a capital gain of 3137 and no capital loss.###\nHence this label was No."
"The person is a 40-year-old married Asian-Pacific-Islander male from South. He works in the sales sector as the owner of an incorporated business, professional practice, or farm. He holds a bachelor's degree and works 45 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The individual is a 42-year-old married White male, working as an owner of an incorporated business, professional practice, or farm in the field of execution and management. They hold a bachelor's degree and work approximately 60 hours per week. Although they did not have any capital gain last year, they experienced a capital loss of 1977. The native country of the individual is not specified in the data provided.###\nHence this label was Yes."
"This 31-year-old White female, who is divorced and not living with family, is a private sector employee in the sales sector in the United States. She is a high school graduate working 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 27-year-old Black male from the United States who has never been married. He is classified as an Own-child in the household. He works in execution and management for the state government, with a college education for less than one year. Despite working 40 hours per week, he did not have any capital gain or loss in the last year.###\nHence this label was No."
"This is a 30-year-old white male who is married and classified as an other-relative in the household. He is from the United States and works in the craft and repair sector as a private sector employee. Last year, he had no capital gain or loss. He is a high school graduate and works 40 hours per week.###\nHence this label was No."
"The individual is a 29-year-old Black male from the United States. He has never been married and is not living with family. His occupation and work class are not specified. He is a high school graduate and works 40 hours per week. Last year, he did not experience any capital gain or loss.###\nHence this label was No."
"This individual is a 30-year-old White male from the United States who is married and works in the private sector as a cleaning and maintenance employee. He is a high school graduate and works 40 hours a week with no capital gain or loss last year.###\nHence this label was No."
"The person in this dataset is a 62-year-old White male from the United States. He has never been married and is not living with any family members. He works in the craft and repair sector as a private sector employee. He is a high school graduate and works 40 hours per week. In the past year, he did not have any capital gains or losses.###\nHence this label was No."
"The individual is a 30-year-old Black female from the United States. She is married but is classified as unmarried in relation to the head of the household. She is employed in the service sector as a private sector employee, with a high school degree as her highest level of education. Her capital gain and loss last year were both 0. She works 38 hours per week.###\nHence this label was No."
"The person is a 27-year-old White male from Mexico, working in the cleaning and maintenance sector as a private sector employee. He is married and the husband in the household. He is a high school graduate and works 40 hours per week with no capital gains or losses last year.###\nHence this label was No."
"This 28-year-old White male, who has never been married, is not living with family in the United States. He works in the private sector as a craft and repair employee, with a high school education. He did not have any capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"This individual is a 45-year-old married White male from the United States. He works in the service sector for the state government, with a typical 40-hour work week. He is a high school graduate with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 44-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He has no capital gain or loss from last year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"This individual is a 50-year-old married Asian-Pac-Islander male who works in the service sector. He is the husband in the household and owns a non-incorporated business, professional practice, or farm. He is a high school graduate and worked 60 hours per week last year with no capital gain or loss.###\nHence this label was No."
"This individual is a 43-year-old white female from the United States. She is separated and unmarried, working in the private sector as an office and administrative support employee. With a bachelor's degree, she works 35 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This person is a 60-year-old married white male from the United States. He is the husband in the household and works as an owner of an incorporated business, professional practice, or farm, in the field of execution and management. He has an education equivalent to less than one year of college. Despite working 40 hours per week, he had no capital gain or loss the previous year.###\nHence this label was No."
"This person is a 50-year-old widowed Black female from the United States. She works in an office and administrative support role in the private sector, with a high school education. She has no capital gains or losses from the previous year and works 40 hours per week. Her relation to the head of the household is listed as Other-relative.###\nHence this label was No."
"This individual is a 47-year-old divorced white male from the United States. He works in the craft and repair sector for the local government, with an education level of college for less than one year. His relationship to the head of the household is listed as not-in-family. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"This individual is an 80-year-old married white male living in the United States. He works as an owner of a non-incorporated business, professional practice, or farm in the agriculture, forestry, and fisheries sector. With no capital gain or loss last year, he has completed 8th class education and works 30 hours per week.###\nHence this label was No."
"This individual is a 56-year-old widowed White female from the United States. She works in the service sector as a private sector employee with a bachelor's degree. She is not living with any family member and worked 40 hours per week. Last year, she did not have any capital gains or losses.###\nHence this label was No."
"This is a 22-year-old Black female from the United States who has never been married. She is categorized as an Own-child in the household. She works in the private sector as an office and administrative support employee, with an education level of college for less than one year. Last year, she had no capital gain or loss. She works 20 hours per week.###\nHence this label was No."
"The individual is a 51-year-old widowed white female from the United States. She holds a doctoral degree and works in a professional specialty occupation in the private sector. With a capital gain of $10,520 and no capital loss last year, she puts in 60 hours of work per week. She is not living with family and her annual income is predicted to be over $50,000.###\nHence this label was Yes."
"This person is a 31-year-old black female from the United States. She is never married and is classified as unmarried in relation to the head of the household. She works in the technology and support sector as a private sector employee. With a high school education, she works 40 hours per week with no capital gain or loss reported last year.###\nHence this label was No."
"This data is about a 19-year-old White male from the United States who is never married. He is classified as an Other-relative in relation to the head of the household. He works as a machine operator and inspector in the private sector, with a capital gain and loss of 0 last year. He finished 8th class for education and works 40 hours per week.###\nHence this label was No."
"This individual is a 21-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, having a high school education. With no capital gain or loss last year, he works 50 hours per week.###\nHence this label was No."
"This person is a 40-year-old White male from the United States who has never been married. He is not living with family and works as a professional specialist in the private sector. Despite not having a degree, he has attended college for one or more years. Last year, he had no capital gains or losses. He works 42 hours per week.###\nHence this label was No."
"This individual is a 49-year-old married White male from the United States. He works in the private sector as an executive manager, having graduated from high school. With a capital gain of $7688 and no capital loss reported last year, he works 55 hours per week.###\nHence this label was Yes."
"This person is a 25-year-old married white male from the United States. He works in the craft and repair sector for the state government, with a college education for less than one year. Despite working 50 hours per week, he had no capital gain or loss last year.###\nHence this label was Yes."
"This individual is an 18-year-old White male from the United States who has never been married. He is classified as an Own-child in the household. He works in the service sector as a private sector employee, with a 10th class education. Despite a low number of work hours per week (24), he shows no capital gain or loss from the previous year.###\nHence this label was No."
"The individual is a 22-year-old White male, divorced, not living with family, from the United States. He works in the private sector in the protective services sector, with no capital gain or loss last year. He has less than a year of college education and works 40 hours per week.###\nHence this label was No."
"This individual is a 42-year-old married White male from the United States. He is employed in the technology and support sector as a private sector employee. With a bachelor's degree, he works 45 hours per week and had a capital gain of $7298 last year with no capital loss.###\nHence this label was Yes."
"This individual is a 31-year-old married Asian-Pac-Islander male from Thailand. He holds a doctoral degree and works as a professional specialty in the private sector. Despite having no capital gain or loss last year, he puts in 50 hours of work per week.###\nHence this label was Yes."
"This individual is a 61-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, having completed 9th class education. With no capital gains or losses last year, he works 40 hours per week as a husband.###\nHence this label was No."
"This individual is a 51-year-old widowed White female from the United States. She is unmarried and works in the private sector as an office and administrative support employee. Despite having no capital gain or loss last year, she manages to work 45 hours per week. She has attended college for less than one year.###\nHence this label was No."
"A 42-year-old married White male, working in the craft and repair sector as a private sector employee in the United States. He is a high school graduate who works 40 hours per week, with a capital gain of 2885 and no capital loss last year.###\nHence this label was No."
"The individual is a 42-year-old married White male from the United States. He works in the sales sector as the owner of a non-incorporated business, professional practice, or farm. Last year, he had no capital gains or losses. He is a high school graduate and works 48 hours per week.###\nHence this label was No."
"This individual is a 40-year-old White male, married and working in the private sector as a craft and repair employee in the United States. He is a high school graduate and works 40 hours per week with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 23-year-old White female from the United States who has never been married. She is categorized as an Own-child in relation to the head of the household and works in office and administrative support in the private sector. She completed college for less than one year and works 25 hours per week. In the past year, she had no capital gains but incurred a capital loss of $1617.###\nHence this label was No."
"This individual is a 38-year-old White male from the United States who has never been married. He is not living with family and works in the agriculture, forestry, and fisheries sector as an owner of a non-incorporated business, professional practice, or farm. Despite being a high school graduate, he works 52 hours per week and did not experience any capital gain or loss last year.###\nHence this label was No."
"This person is a 45-year-old married Asian-Pac-Islander male from China. He works in the private sector as an executive and manager, holding a bachelor's degree. Despite working long hours per week (60 hours), he did not have any capital gain or loss last year. Moreover, his annual income is likely over $50,000.###\nHence this label was Yes."
"The person is a 27-year-old White male from the United States who has never been married. He is not living with family members. He works in the protective services sector as the owner of a non-incorporated business, professional practice, or farm. He has a high school education and works 30 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"This individual is a 34-year-old married white male from the United States. He works in the private sector in an executive or management role, with less than one year of college education. Despite working long hours per week (65), he did not report any capital gains or losses the previous year.###\nHence this label was Yes."
"This individual is a 26-year-old married White female, working in the sales sector as a private sector employee in the United States. She holds an associate's degree and works 50 hours per week. Last year, she did not have any capital gain or loss.###\nHence this label was Yes."
"This individual is a 19-year-old White female from the United States who has never been married. She is classified as an Own-child in the household. She works in the sales sector as a private sector employee, with a college education for less than one year. Last year, she had no capital gains or losses. She works 15 hours per week.###\nHence this label was No."
"The individual is a 19-year-old married White male residing in the United States. He works as a machine operator and inspector in the private sector, with a high school education. Despite working only 20 hours per week, he had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 49-year-old married white male from the United States working in the private sector as an execution and management professional. They are a high school graduate and work 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 47-year-old White male from the United States who is married and works as a machine operator and inspector in the private sector. He is the husband in the family and has a high school education. Despite working 50 hours per week, he did not have any capital gains or losses last year.###\nHence this label was Yes."
"The person is a 66-year-old white male from the United States. He is married and works in the craft and repair sector as an owner of a non-incorporated business, professional practice, or farm. He has a high school education and works 20 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"This individual is a 23-year-old Black male from the United States. He is never married and lives with the head of the household as their own child. He works in the private sector as an employee in the cleaning and maintenance sector. He is a high school graduate and works 40 hours per week. Last year, he had neither capital gains nor losses.###\nHence this label was No."
"This 45-year-old White female, who is separated and does not live with family, resides in the United States and works as an executive in the private sector. She holds a bachelor's degree and works 55 hours per week. Last year, she had no capital gains or losses.###\nHence this label was No."
"This individual is a 77-year-old divorced White female, living in the United States. She is not related to the head of the household and works in the sales sector as a private sector employee. Despite no capital gain last year, she experienced a capital loss of $1668. Her education level is college for one or more years without a degree, and she works 30 hours per week.###\nHence this label was No."
"The individual is a 53-year-old White male from the United States, married, and works in the private sector as a cleaning and maintenance employee. Despite having completed only 9th grade education, he works 41 hours per week and did not report any capital gains or losses last year.###\nHence this label was Yes."
"This individual is a 17-year-old White female from the United States who has never been married. She is classified as an Own-child in relation to the head of the household. She works in the sales sector as a private sector employee, with a 10th-grade education. Last year, she had a capital gain of 594 and a capital loss of 0. She works 12 hours per week and the model predicts that her annual income is over $50,000.###\nHence this label was No."
"The individual is a 40-year-old white male from the United States. He is divorced and not living with any family member. He works in the private sector as an employee in the cleaning and maintenance sector, putting in 40 hours per week. Despite having no capital gains or losses last year, he has received less than a year of college education.###\nHence this label was No."
"This individual is a 41-year-old married White male residing in the United States. He holds a doctoral degree and works in a professional specialty occupation in the private sector. Despite working long hours (60 hours per week), he had no capital gains or losses last year.###\nHence this label was Yes."
"This individual is a 47-year-old married white male from the United States. He works in the technology and support sector as a private sector employee. He is the husband in the household and has a high school education. Despite working 65 hours per week, he did not have any capital gain or loss in the last year.###\nHence this label was Yes."
"This individual is a 46-year-old married White male from the United States. He holds a master's degree and works in the private sector as an executive manager. Despite working 45 hours per week, he had no capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 33-year-old White male from the United States, currently married and working in the service sector for the state government. He has no capital gain or loss from the previous year and has completed 10th class education. He works 40 hours per week. The prediction is whether his annual income is over $50,000.###\nHence this label was No."
"The individual is a 43-year-old White male from the United States. He is married and the husband in the household. He has a high school education and works as an unknown occupation in an unknown work class, putting in 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The individual is a 29-year-old unmarried white male from the United States. He works in a professional specialty occupation for the state government, holding a master's degree. His relationship to the head of the household is listed as not-in-family. He had no capital gain or loss last year. He works 40 hours per week. The prediction is whether his annual income exceeds $50,000.###\nHence this label was No."
"The individual is a 28-year-old married White male, working in the sales sector as a private sector employee in the United States. He is the husband in his household and has a high school education. Despite working 55 hours per week, he did not have any capital gains or losses last year.###\nHence this label was No."
"This individual is a 44-year-old married white male from the United States. He works as a professional specialty in his own non-incorporated business, professional practice, or farm, and has a high school education. In the past year, he did not experience any capital gain but incurred a capital loss of $1902. He typically works 40 hours per week.###\nHence this label was Yes."
