"This individual is a 35-year-old married White male from the United States. He is the husband in the household and has a high school education. He did not have any capital gains or losses last year and his occupation and work class are unspecified. He works 40 hours per week.###\nHence this label was No."
"The individual is a 27-year-old White male from the United States. He is never married and has no direct family living with him. He works in the service sector as a private sector employee, putting in 40 hours per week. Despite finishing 12th grade without a diploma, he does not have any capital gain or loss from the previous year.###\nHence this label was No."
"The individual is a 48-year-old married white male from the United States. He works as an execution and management professional in the private sector, putting in 60 hours per week. Despite having no capital gain or loss last year, he is a high school graduate.###\nHence this label was No."
"The person is a 62-year-old White male from the United States who is married. He works for the state government in an office and administrative support role, with a bachelor's degree education. He has no capital gains or losses from the previous year and works 38 hours per week.###\nHence this label was No."
"This individual is a 29-year-old white male from the United States. He has never been married and is not living with family. He works in execution and management in the private sector, putting in 45 hours per week. With no capital gain or loss last year, he has received college education for less than one year.###\nHence this label was No."
"This 25-year-old White female, who has never been married, is not living with family in the United States. She works in the private sector as an office and administrative support employee, with a college education for less than one year. Despite working 45 hours per week, she had no capital gain or loss last year.###\nHence this label was No."
"The person is a 44-year-old separated white female from the Dominican Republic. She works as a professional specialty in the private sector, putting in 40 hours per week. Despite not having a college degree, she has gained valuable knowledge through college education for one or more years. With no capital gain or loss last year, the person's annual income is predicted to be below $50,000.###\nHence this label was No."
"This individual is a 30-year-old married White male from the United States. He is the husband in the household and works as an owner of a non-incorporated business, professional practice, or farm in the field of execution and management. Despite being a high school graduate, he works long hours, putting in 75 hours per week. Last year, he did not experience any capital gains or losses.###\nHence this label was No."
"The individual is a 59-year-old White male from the United States, with a master's degree in professional specialty. He is divorced and not living with family. He works in a local government job, putting in 40 hours per week. Last year, he did not have any capital gain or loss. His annual income is predicted to be over $50,000.###\nHence this label was Yes."
"This 21-year-old White male, who has never been married, is living in the United States as an own-child in the household. He works in the private sector in the service industry, with a college education of less than one year. Despite working 20 hours per week, he did not have any capital gain or loss last year.###\nHence this label was No."
"This individual is a 63-year-old White male from the United States. He is married and works in the private sector as an executive manager. He has no capital gains or losses from the previous year. He completed 10th class education and works 40 hours per week.###\nHence this label was No."
"The person is a 60-year-old married White female from the United States. She works as a machine operator and inspector in the private sector with 40 hours of work per week. She finished 8th class in terms of education. There were no capital gains or losses last year.###\nHence this label was No."
"The individual is a 63-year-old Black male who is married and works as a machine operator and inspector in the private sector. He is the husband in the household and resides in the United States. He is a high school graduate and works 40 hours per week, with no capital gain or loss in the last year.###\nHence this label was No."
"The individual is a 41-year-old married white male from the United States, working in the private sector as a professional specialty. He holds a bachelor's degree and works 45 hours per week. Last year, he did not experience any capital gain or loss. This person's annual income is predicted to be over $50,000.###\nHence this label was Yes."
"This individual is a 41-year-old White male from the United States. He is married and works in the private sector as a craft and repair worker. With a high school education, he works 44 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This 27-year-old White female, who has never been married, works in office and administrative support in the private sector in the United States. She is not living with family. She holds a bachelor's degree, works 40 hours per week, and had no capital gain or loss last year.###\nHence this label was No."
"This is a 25-year-old married White female from the United States. She works in the service sector for the state government with a bachelor's degree. She is a wife and works 40 hours per week with no capital gain or loss from the previous year.###\nHence this label was No."
"The individual is a 34-year-old Black male from the United States, married and working in the private sector as an office and administrative support employee. He is the husband in the household and has a high school education. He worked 40 hours per week last year and did not experience any capital gains or losses.###\nHence this label was Yes."
"The individual is a 54-year-old married white male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He is the husband in the household and has a high school education. Last year, he had no capital gain but incurred a capital loss of 2051. He works 50 hours per week.###\nHence this label was No."
"This 32-year-old White male, married individual works in the transportation, communication, and other public utilities sector in the private sector. He is classified as an own-child in relation to the head of the household within the United States. With a high school graduate education, he works for 40 hours per week and had no capital gains or losses the previous year.###\nHence this label was No."
"The individual is a 37-year-old married white male from the United States. He works in the sales sector as a private sector employee, holding a bachelor's degree. He is the husband in his household and worked 55 hours per week. In the last year, he had no capital gains or losses.###\nHence this label was Yes."
"The person is a 52-year-old widowed White female in the United States. She is not in a family relationship, works in the private sector in an office and administrative support role, and has a high school education. She worked 40 hours per week last year, with no capital gain or loss.###\nHence this label was No."
"The individual is a 50-year-old married White male from Mexico working in the private sector as a cleaning and maintenance employee. He finished 6th class for education and works 40 hours per week. Both his capital gain and loss last year were 0.###\nHence this label was No."
"This individual is a 30-year-old Black female from the United States. She is separated, unmarried, and works as a professional in a specialty occupation. She is the owner of a non-incorporated business, professional practice, or farm. She had no capital gain or loss last year. She completed less than a year of college education and works 40 hours per week.###\nHence this label was No."
"This individual is a 44-year-old Black woman from the United States. She is divorced and not living with family. She works in office and administrative support for the federal government, holding an associate's degree. Last year, she had no capital gain but incurred a capital loss of $1741. She works 40 hours per week.###\nHence this label was No."
"This individual is a 32-year-old white male from the United States. He is married and works as a machine operator and inspector in the private sector. He is a high school graduate and works 40 hours per week with no capital gain or loss last year. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"This individual is a 47-year-old divorced white female from the United States. She is not in a family relationship with the head of the household and works in the service sector as a private sector employee. She holds a bachelor's degree and works 40 hours per week. Last year, she had a capital gain of $99,999 and no capital loss.###\nHence this label was Yes."
"This individual is a 28-year-old married Black male from the United States. He works in the private sector as a cleaning and maintenance employee with an associate's degree. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was No."
"This is a 37-year-old Amer-Indian-Eskimo male who has never been married and is living with a relative (Own-child) in the United States. He is employed in the service sector as a private sector employee, with a high school education. Last year, he had no capital gains or losses. He works 18 hours per week. The prediction is whether his annual income is over $50,000.###\nHence this label was No."
"This individual is a 45-year-old White male from the United States, who is married and works in execution and management for the local government. He has no capital gain or loss from the previous year. He attended college for less than a year and works 40 hours per week.###\nHence this label was Yes."
"This individual is a 56-year-old married white male from England with a master's degree. He works in the private sector as an execution and management professional, putting in 60 hours per week. With no capital gains or losses last year, he appears to be financially stable. Overall, this person is likely to have an annual income over $50,000.###\nHence this label was Yes."
"The individual is a 36-year-old married White male from the United States. He works as a professional specialty in the federal government, holding a bachelor's degree. With no capital gains or losses last year, he puts in 40 hours of work per week, aiming to sustain an annual income exceeding $50,000.###\nHence this label was Yes."
"The individual is a 42-year-old married White male from the United States. He works as an executive in the private sector, with a bachelor's degree. Despite having no capital gain last year, he experienced a loss of $1902. He works for 50 hours per week.###\nHence this label was Yes."
"The individual is a 25-year-old married white male working as a machine operator and inspector in the private sector. He is a high school graduate and works 40 hours per week. He had no capital gains or losses last year. He is the husband in the household and is a native of the United States.###\nHence this label was No."
"This individual is a 48-year-old Caucasian male from the United States. He is divorced and not living with family. He works in the cleaning and maintenance sector for the federal government, with a high school education. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"The person in the dataset is a 42-year-old White female from the United States. She is divorced and does not have a partner. She works in the private sector as an executive/manager, with no capital gain or loss last year. She attended college for less than a year and works 45 hours per week.###\nHence this label was No."
"The individual is a 52-year-old white male from the United States, currently working as a private sector employee in the agriculture, forestry, and fisheries sector. He is divorced and not living with any family member. He holds a bachelor's degree, works 40 hours per week, and had no capital gains or losses last year.###\nHence this label was No."
"This person is a 22-year-old White male from the United States who has never been married. He is considered an own-child in relation to the head of the household. Currently, his occupation and work class are unknown. He had no capital gain or loss last year. His education level is college for less than one year, and he works 50 hours per week.###\nHence this label was No."
"This dataset includes information about a 38-year-old married White male from Nicaragua. He works in the craft and repair sector as a private sector employee, with a high school graduate education. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"This individual is a 40-year-old married white male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. Despite working long hours per week (60), he did not have any capital gain or loss last year.###\nHence this label was Yes."
"This individual is a 52-year-old White male from the United States. He is married and works in the private sector as an employee in the cleaning and maintenance sector. He is a high school graduate and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The individual is a 43-year-old married white male from the United States. He works in the private sector as a craft and repair employee, putting in 40 hours a week. He is a high school graduate and had no capital gain but experienced a loss of $1902 last year.###\nHence this label was Yes."
"This is a 43-year-old Asian-Pac-Islander woman who is divorced and has a dependent child. She works in the service sector as a private sector employee, with a high school education. Last year, she had no capital gain or loss. She works 40 hours per week in South.###\nHence this label was No."
"This is a 33-year-old White male from the United States who is married and works in the private sector as an execution and management professional. He is the husband in his household and has a high school education. Despite not having any capital gains or losses last year, he works 50 hours per week.###\nHence this label was No."
"This individual is a 19-year-old White male from the United States. He is never married and not living with family. He works in the cleaning and maintenance sector as a private sector employee, putting in 40 hours per week. He finished 12th class without a diploma and had no capital gain or loss last year.###\nHence this label was No."
"The person is a 49-year-old White male from the United States. He is married and works in the sales sector as the owner of an incorporated business, professional practice, or farm. He is a high school graduate and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This individual is a 51-year-old White female from the United States. She is married and works in a professional specialty occupation in the local government sector. She holds a bachelor's degree and works 40 hours per week. Last year, she had no capital gains or losses.###\nHence this label was Yes."
"This individual is a 44-year-old Black male, married, working in the private sector as an office and administrative support employee in the United States. He is the husband in the household and has a high school education. Last year, he had no capital gains or losses and works 52 hours per week.###\nHence this label was Yes."
"This person is a 44-year-old White male who is married and works in the sales sector. He is the husband in the household. He owns a non-incorporated business, professional practice, or farm. His capital gain and capital loss last year were both 0. He is a high school graduate and works 48 hours per week.###\nHence this label was No."
"This individual is a 31-year-old married White male from the United States. He works in the private sector as an office and administrative support employee, putting in 50 hours per week. Despite having no capital gain or loss last year, his level of education is college for less than one year.###\nHence this label was Yes."
"The person is a 46-year-old White male from the United States who is married and works in the private sector as a cleaning and maintenance employee. Despite working 35 hours per week, the person had no capital gain but experienced a capital loss of $1740 last year. He is a high school graduate.###\nHence this label was No."
"The individual is a 34-year-old White male from the United States who has never been married. He works in the private sector as an employee in the cleaning and maintenance sector, with a high school education. He is categorized as an own-child in relation to the head of the household, and he reported no capital gains or losses last year. He works 40 hours per week.###\nHence this label was No."
"This individual is an 18-year-old White male from the United States who has never been married. He is classified as an Own-child in the household. He works in the craft and repair sector as a private sector employee, with a capital gain and loss of 0 last year. He has completed 11th grade education and works 20 hours per week.###\nHence this label was No."
"The individual is a 65-year-old widowed White female living in the United States. She is categorized as an Other-relative in relation to the head of the household. Information about her occupation and work class is not provided. She has a high school education and works 25 hours per week. There were no capital gains or losses reported last year.###\nHence this label was No."
"The individual is a 23-year-old White female from the United States. She has never been married and is considered an own-child in relation to the head of the household. She works in the service sector as a private sector employee, with no capital gain or loss last year. She has completed less than a year of college education and works 40 hours per week.###\nHence this label was No."
"The person is a 52-year-old White male from the United States who has never been married. He works in the craft and repair sector as an owner of a non-incorporated business, professional practice, or farm. Despite having some college education for less than one year, he works 30 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 26-year-old married White male from the United States. He works in the sales sector as a private sector employee, putting in 50 hours per week. Despite having attended college for less than a year, he did not report any capital gain or loss last year.###\nHence this label was No."
"A 27-year-old married White male with a professional specialty occupation in the federal government, holding a professional degree. He works 45 hours per week and had no capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 24-year-old White male from the United States who has never been married. He is not living with family and works in the sales sector as a private sector employee. Last year, he had no capital gains or losses. He holds an associate's degree and works 35 hours per week.###\nHence this label was No."
"The individual is a 40-year-old married White male from the United States. He works in the sales sector as an owner of a non-incorporated business, professional practice, or farm. He holds a master's degree and works 60 hours per week. There were no capital gains or losses last year.###\nHence this label was No."
"This is a data entry for a 65-year-old White female in the United States. She is married and works as an executive in the private sector, with 40 hours of work per week. She attended college for less than a year. There were no capital gains or losses reported last year. The data suggests that she may have an annual income over $50,000.###\nHence this label was No."
"This individual is a 17-year-old White male from the United States. He has never been married and is categorized as an Own-child in the household. He works in the service sector as a private sector employee, having finished 10th class for education. Despite working 15 hours per week, he had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 28-year-old married White male from Japan. He holds a bachelor's degree and works as a professional specialty in the private sector. He has no capital gain or loss from the previous year, and he works 40 hours per week.###\nHence this label was No."
"This person is a 30-year-old married White male from the United States. He works in the private sector as an execution and management professional, with a college education of less than one year. He works 40 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 46-year-old White male from the United States who has never been married. He is not living with any family members and works in a professional specialty occupation for the state government. Despite having a bachelor's degree, he did not have any capital gain or loss last year. He works 40 hours per week.###\nHence this label was No."
"This individual is a 67-year-old widowed White female from the United States. She is not living with family and works in the service sector as an owner of a non-incorporated business, professional practice, or farm. Despite being a high school graduate, she works 30 hours per week and had no capital gains or losses last year.###\nHence this label was No."
"This 24-year-old White male, who has never been married, is not living with family. He works in the technology and support sector as a private sector employee in the United States. With a bachelor's degree, he works 35 hours per week with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 90-year-old White female from the United States. She is divorced and not living with any family members. She has not specified her occupation or work class. Last year, she had no capital gains or losses. She completed 10th class education and works only 7 hours per week.###\nHence this label was No."
"The individual is a 27-year-old married Asian-Pac-Islander male from India. He works in the technology and support sector as a private sector employee, with a bachelor's degree. He is the husband in the household and worked 40 hours per week with no capital gain or loss the previous year.###\nHence this label was Yes."
"This individual is a 38-year-old married white male from the United States. He works in the private sector as an executive or manager, with a bachelor's degree education. He has no capital gain or loss from the previous year and works 50 hours per week.###\nHence this label was Yes."
"This 23-year-old Black female from Trinadad&Tobago, who has never been married and is an unmarried private sector employee in office and administrative support, earned less than $50,000 last year. She has a college education for less than a year, and she works 40 hours per week.###\nHence this label was No."
"The person in the dataset is a 48-year-old white male from the United States. He is divorced and unmarried, working in the state government in an executive and management role with a bachelor's degree. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"This 23-year-old White female, who has never been married, works in office and administrative support in the private sector in the United States. She is not living with family, has a high school education, and worked 50 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 20-year-old White male from the United States who has never been married. He is an other-relative in the household and works as a machine operator and inspector in the private sector. With a capital gain and loss of 0 from last year, he has completed 8th class education and works 40 hours per week.###\nHence this label was No."
"The individual is a 28-year-old married White male from Cambodia, working in the sales sector as a private sector employee with a bachelor's degree. They are the husband and work 45 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 38-year-old married White male from the United States. He works in the private sector as an employee in the craft and repair sector, with a high school education. He worked 50 hours per week last year and had no capital gains or losses.###\nHence this label was Yes."
"A 24-year-old White female, divorced and classified as an Own-child in the household, residing in the United States. She works in the service sector as a private sector employee, with no capital gain or loss last year. She has completed 9th grade education and works 40 hours per week.###\nHence this label was No."
"The person is a 30-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a college education for less than one year. He is the husband in the household. Last year, he had no capital gains or losses. He works 50 hours per week.###\nHence this label was No."
"The individual is a 24-year-old White male from the United States. He has never been married and is not living with family. He works as a professional specialty in the private sector, with an associate's degree as his highest education. In the past year, he had no capital gains but experienced a loss of $1980. He works 50 hours per week.###\nHence this label was No."
"The individual is a 66-year-old married white male from the United States. He works in the craft and repair sector as a private sector employee, with no capital gain or loss last year. He has completed the 11th class and works 20 hours per week.###\nHence this label was No."
"This person is a 33-year-old White female from the United States. She is divorced, not living with family, and works as an office and administrative support in the private sector. She has an associate's degree and works 40 hours per week. Last year, she had no capital gains but incurred a capital loss of $880.###\nHence this label was No."
"The person is a 32-year-old white male from the United States. He is married and works in the private sector as an executive manager. He holds a bachelor's degree and works 60 hours per week. He reported no capital gains or losses in the last year.###\nHence this label was Yes."
"This person is a 29-year-old White female who has never been married and is living with a parent or guardian. She is from the United States and works in the service sector as a private sector employee. She graduated from high school and works 40 hours per week. Last year, she had no capital gains or losses.###\nHence this label was No."
"This person is a 61-year-old married White female from Mexico. She works in the agriculture, forestry, and fisheries sector as a private sector employee. She finished 6th class for education and works 45 hours per week. Her relationship to the head of the household is an other-relative. Last year, she had no capital gain or loss.###\nHence this label was No."
"The person is a 35-year-old White male with a master's degree working in a professional specialty occupation in the private sector. They are separated, not living with family, and are a native of the United States. They had no capital gains or losses last year and work 40 hours per week.###\nHence this label was Yes."
"The individual is a 39-year-old White male from the United States. He is married and works in the craft and repair sector for the federal government. He has a high school education and works 40 hours per week. Last year, he had no capital gain or loss.###\nHence this label was Yes."
"This 30-year-old White female who has never been married is not living with family in the United States. She works in the private sector as a technology and support sector employee, holding an associate's degree. With no capital gain or loss last year, she works 40 hours per week.###\nHence this label was No."
"This is a 21-year-old Amer-Indian-Eskimo female who has never been married. She is living with her parents as their own child in the United States. She works in a professional specialty in the private sector, with no capital gains or losses last year. She received some college education for less than a year and works only 4 hours per week.###\nHence this label was No."
"The individual is a 31-year-old white male from the United States. He is married and works in the craft and repair sector as a private sector employee. He has a high school education and works 40 hours per week. In the past year, he had no capital gains or losses.###\nHence this label was No."
"This individual is a 68-year-old married White male from Ireland who works in the private sector as a professional specializing in a bachelor's degree field. He puts in 40 hours a week and did not experience any capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 33-year-old White female from the United States. She is separated and unmarried, working as a professional specialty in the private sector. She has no capital gains or losses from the previous year and has received education for less than one year at college. She works 37 hours per week.###\nHence this label was No."
"This 19-year-old Black female, who has never been married, works in the service sector as a private sector employee in the United States. She attended college for less than a year and works 30 hours per week. Last year, she had a capital gain of 2036 and no capital loss.###\nHence this label was No."
"This young 24-year-old White female, who has never been married, is living in the United States as an own-child in the household. She works in the sales sector as a private sector employee, with a college education of less than one year. Last year, she had no capital gains or losses. She works 25 hours per week.###\nHence this label was No."
"This individual is a 19-year-old White female from the United States. She has never been married and is classified as an own-child in relation to the head of the household. She works in the private sector as an office and administrative support employee. With a college education for less than one year, she works 16 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual in the dataset is an 18-year-old White male from the United States. He has never been married and is classified as an own-child in the household. He has never worked and did not attend college for more than a year. In the past year, he had no capital gains or losses. He currently does not have any occupation and works only 4 hours per week.###\nHence this label was No."
"The person is a 43-year-old white male from the United States, married and working in the private sector as a sales employee. He has a college education for less than a year and works 40 hours per week. Last year, he had a capital gain of 7688 and no capital loss. The model predicts that this person has an annual income over $50,000.###\nHence this label was Yes."
"This is a 32-year-old White female from the United States. She is separated and unmarried, working as an owner in the agriculture, forestry, and fisheries sector. She has a college education for less than one year and works 65 hours per week. Last year, she had no capital gains or losses.###\nHence this label was No."
"The individual is a 52-year-old White male from the United States. He is married and works in the transportation, communication, and other public utilities sector as a private sector employee. He is the husband in the household. Despite working 60 hours per week, he had no capital gains or losses last year. He is a high school graduate.###\nHence this label was Yes."
"This data describes a 25-year-old White male who is married and works in the sales sector as a private sector employee in the United States. He has an associate's degree, works 40 hours per week, and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 39-year-old married White female, working in office and administrative support for the federal government. She is the wife in the household and a high school graduate from the United States. She had no capital gains or losses last year and works 40 hours per week.###\nHence this label was Yes."
"This individual is a 20-year-old Amer-Indian-Eskimo male who has never been married and is classified as an own-child in the household. He works as a machine operator and inspector in the private sector, with no capital gain or loss last year. His education level is college for less than one year, and he works 40 hours per week in his job located in the United States.###\nHence this label was No."
"This individual is a 23-year-old unmarried White female from the United States. She is categorized as an Own-child in the household. Working in the sales sector as a private sector employee, she has an educational background of less than one year of college. With no capital gain or loss in the previous year, she works 12 hours per week.###\nHence this label was No."
"A 50-year-old White male, married, and working in the private sector as an executive manager in the United States. He holds a bachelor's degree and works 40 hours per week, with a significant capital gain from the previous year.###\nHence this label was Yes."
"The individual is a 35-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. He works 40 hours per week and had no capital gains or losses last year.###\nHence this label was No."
"The person is a 21-year-old male from Mexico. He is not married and has no immediate family living with him. He works in the craft and repair sector as a private sector employee, with no capital gain or loss last year. He has completed 6th grade education and works 32 hours per week.###\nHence this label was No."
"The individual is a 25-year-old White male from the United States who is married and works in the private sector as a craft and repair employee. He has a college education for less than one year, works 40 hours per week, and had no capital gain or loss last year.###\nHence this label was No."
"This person is a 53-year-old white male from the United States who has never been married. He is not living with family and works in the agriculture, forestry, and fisheries sector as a private sector employee. He has a high school education and works 10 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This individual is a 25-year-old unmarried White male with a master's degree working in a professional specialty occupation in the private sector. He had no capital gains or losses last year and works 45 hours per week.###\nHence this label was No."
"This individual is a 32-year-old divorced female of Amer-Indian-Eskimo descent living in the United States. She is unmarried and works in the service sector as a private sector employee. With a high school education, she works 40 hours per week with no capital gain or loss recorded last year.###\nHence this label was No."
"The individual is a 29-year-old Black female from the United States who is never married. She is not living with family and works as an executive in the private sector. Despite having some college education, she does not have a degree. The person works 40 hours per week and had no capital gains or losses last year.###\nHence this label was No."
"The individual is a 32-year-old married white male from the United States. He is the husband in the household and works in the sales sector as an owner of a non-incorporated business, professional practice, or farm. He is a high school graduate and works 60 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"This person is a 35-year-old White male from the United States who has never been married. He works in the sales sector as a private sector employee, with a bachelor's degree. Last year, he had a capital gain of $10,520 and no capital loss. He works 45 hours per week.###\nHence this label was Yes."
"This 26-year-old White male from Honduras, who has never been married, is employed in the craft and repair sector in the private sector. He finished 10th class and works an average of 24 hours per week. With a capital gain and loss of 0 last year, the prediction is that his annual income is likely below $50,000.###\nHence this label was No."
"The individual is a 21-year-old married White female from the Dominican Republic. She works as a machine operator and inspector in the private sector, with a high school education. She is classified as an own-child in relation to the head of the household. She had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"This individual is a 50-year-old married White male from the United States. He works as a professional in a specialty occupation, specifically as an owner of a non-incorporated business, professional practice, or farm. He holds a professional degree and works 50 hours per week. Additionally, he had no capital gains or losses last year.###\nHence this label was Yes."
"The person is a 74-year-old white female from the United States. She is widowed and not living with any family members. She is employed in the private household sector as a private sector employee. She has no capital gain or loss from last year. She has attended college for one or more years but without obtaining a degree. She works 40 hours per week.###\nHence this label was No."
"This individual is a 54-year-old married Black male from Jamaica, working in the private sector as an executive manager. He holds a master's degree and works 40 hours per week. With no capital gains or losses last year, he is likely to have an annual income over $50,000.###\nHence this label was No."
"The person is a 43-year-old White male, divorced, and not living with family. He is from the United States and works in the craft and repair sector as a private sector employee. He had no capital gain or loss last year. His education level is high school graduate, and he works 35 hours per week.###\nHence this label was No."
"This person is a 44-year-old married male from the United States working in the agriculture, forestry, and fisheries sector as a private sector employee. He is a high school graduate and works 40 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"This individual is a 36-year-old white male from the United States. He is divorced and is currently unmarried. He works in the private sector as an employee in the agriculture, forestry, and fisheries sector. Despite being a high school graduate, he does not have any capital gains or losses from the previous year. He works an average of 50 hours per week.###\nHence this label was No."
"This 27-year-old Amer-Indian-Eskimo female is never married and not living with family. She works in office and administrative support in the private sector in the United States. Despite being a high school graduate, she works only 8 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 33-year-old married White male from the United States. He works in the private sector as an executive and manager, with a work week of 56 hours. He has no capital gains or losses from the previous year and has received education at college for less than one year.###\nHence this label was Yes."
"The individual is an 18-year-old Black male from the United States who has never been married. He is classified as an own-child in the household. He does not have a specified occupation or work class. Last year, he had no capital gain or loss. His education level is finishing 12th grade without a diploma, and he works 25 hours per week.###\nHence this label was No."
"The person is a 53-year-old unmarried White male from the United States. He works as a private sector employee in the sales sector and has a bachelor's degree. Last year, he had no capital gain but incurred a capital loss of $1669. He works 50 hours per week.###\nHence this label was No."
"The individual is a 39-year-old White male from the United States who has never been married. He is not living with family and works in the private sector as an employee in the cleaning and maintenance sector. He did not have any capital gain or loss last year. His education level is finishing 12th grade without obtaining a diploma. He works 40 hours per week.###\nHence this label was No."
"The individual is a 41-year-old White female from the United States. She is divorced and currently unmarried. She works in the private sector as an office and administrative support employee with an associate's degree. Last year, she had no capital gains or losses. She works 38 hours per week.###\nHence this label was No."
"This individual is a 47-year-old Black male who is married and does not live with family. He works in the private sector as an executive manager, with no capital gain or loss last year. He has less than a year of college education and works 40 hours per week.###\nHence this label was No."
"This is a 45-year-old White female from the United States, who is divorced and not living with family. She works in the private sector as an execution and management employee, having achieved a high school education. With no capital gain or loss last year, she puts in 46 hours of work per week.###\nHence this label was No."
