"The client is a 42-year-old divorced individual working as a blue-collar worker with secondary education. They do not have any credit in default, but they have a housing loan. Their average yearly balance is 898 euros, and they do not have a personal loan. The bank contacted them via a cellular phone call on the 18th of November, with a call duration of 136 seconds. This was the second call made to the client during this campaign, and a previous marketing campaign was unsuccessful. The client was last contacted 131 days ago, and there was one contact before this campaign.###\nHence this label was No."
"The client is a 37-year-old married individual working in administration with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication and the last call duration was 500 seconds. This client was contacted 2 times during this campaign, with no previous contacts. The outcome of the previous campaign is unknown. The client's average yearly balance is 11303 euros. The last contact was made on the 26th of May.###\nHence this label was No."
"A 59-year-old married individual with a management job and tertiary education was contacted via telephone as part of a marketing campaign by a Portuguese banking institution. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is 63 euros. The call lasted for 89 seconds and was the first contact made during this campaign. The outcome of any previous marketing campaigns with this client is unknown.###\nHence this label was No."
"The client is a 40-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default but have a housing loan. Their average yearly balance is 3736 euros and they do not have a personal loan. The communication type for the last contact is unknown, which took place on the 19th of May with a duration of 29 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 34-year-old single individual working in management with a tertiary education. They do not have credit in default and have an average yearly balance of 178 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 15th of May for a 14-second call, which was the second contact made during this campaign. The client has not been previously contacted for any campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual working in the administrative field with a secondary level education. They do not have credit in default and have an average yearly balance of 47 euros. They have a housing loan but do not have a personal loan. The bank made a cellular contact with the client on the 4th of May, with a call duration of 288 seconds. This was the 5th contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 44-year-old single individual working as a blue-collar worker with primary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via an unknown communication type on the 20th of June. The call duration was 258 seconds, and this was the 18th contact made to this client during this campaign. The client had not been previously contacted for any campaign. The outcome of the previous marketing campaign is unknown. Additionally, the client's average yearly balance is 10984 euros.###\nHence this label was No."
"The client is a 56-year-old married individual working in a blue-collar job with unknown education status. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 3197. The communication type for the campaign is cellular. The client was last contacted on the 25th of August and the call lasted for 83 seconds. This was the 13th contact made during this campaign. The client has not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 678 euros. They were contacted via cellular communication on the 5th of August and the call lasted for 104 seconds. This was the 3rd contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 35-year-old married individual working in management with secondary education. They do not have credit in default and have a housing loan but no personal loan. The contact was made via cellular communication, with the last call lasting 490 seconds on the 15th of July. This was the 5th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, and the client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 49-year-old unemployed single individual with tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication, and the last call lasted for 140 seconds. This client has been contacted 6 times during this campaign, with 12 days passing since the last contact from a previous campaign. The outcome of the previous marketing campaign with this client was 'other'. Their average yearly balance is 631 euros.###\nHence this label was No."
"The client is a 25-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default but have a housing loan. Their average yearly balance is 172 euros, and they do not have a personal loan. The client was contacted through an unknown communication type on the 29th of May. The last contact lasted for 95 seconds, and this was the third contact made during this campaign. They have not been contacted in any previous campaigns, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in the services sector with a secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 1337. The bank contacted them via cellular communication on the 17th of December and the call lasted 330 seconds. This was the 2nd contact made during this campaign and the 3rd overall, with 127 days passing since the previous contact. The outcome of the previous marketing campaign was successful.###\nHence this label was Yes."
"The client is a 54-year-old married individual working in a management position with a tertiary education. They do not have any credit in default, but they have housing and personal loans. The average yearly balance in their bank account is 7249 euros. The bank contacted them via cellular communication, with the last call lasting 102 seconds. This was the second time they were contacted during this campaign, with 77 days passing since they were last contacted from a previous campaign. In that previous campaign, there was a failure outcome.###\nHence this label was No."
"The client is a 38-year-old divorced individual working in management with tertiary education. They do not have credit in default, but they have both a housing and personal loan. The bank contacted them via cellular communication on the 4th of December, with a call duration of 18 seconds. This was the first contact made during this campaign. The client's average yearly balance is 0 euros, and there is no record of previous marketing campaign outcomes.###\nHence this label was No."
"The client is a 55-year-old married technician with secondary education. They do not have credit in default, have a housing loan, but do not have a personal loan. The average yearly balance is 1205 euros. The contact was made via an unknown communication type on the 5th of May, and the call lasted 158 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default but have a housing loan. Their average yearly balance is 333 euros, and they do not have a personal loan. The bank contacted them via a cellular phone call on the 21st of November, with a call duration of 118 seconds. This was the first contact made during this campaign, but they were previously contacted 4 times before. The outcome of the previous marketing campaign was a failure, and 113 days had passed since the last contact. The goal is to predict if the client will subscribe to a term deposit.###\nHence this label was No."
"The client is a young, 23-year-old student who is single. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 1284 euros, they have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 11th day of June. The call duration was 327 seconds, and this was the 10th contact made during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old married individual working in the services sector with secondary education. They do not have credit in default and have a housing loan. They have an average yearly balance of 1082 euros and do not have a personal loan. The bank's last contact with the client was on the 19th of November via a cellular phone call that lasted 770 seconds. This was the first contact made during the current campaign, and there were no previous contacts. The outcome of the previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 51-year-old married individual working as a blue-collar worker with secondary education. They do not have credit in default and have an average yearly balance of 1797 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 20th of August and the call lasted for 168 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 35-year-old married individual working as a blue-collar worker with secondary education was contacted by phone in May. They do not have any credit default, but have a housing loan. They have an average yearly balance of €674 and do not have a personal loan. The contact duration was 274 seconds during the 2nd call of the current campaign. The outcome of the previous marketing campaign is unknown, as this client was not contacted before.###\nHence this label was No."
"The client is a 29-year-old single individual working in management with a tertiary education. They do not have any credit in default but have a housing loan. They were contacted via an unknown communication type on the 6th day of May. The call lasted 211 seconds and it was the first contact made during this campaign. There is no record of any previous contact or outcome from a previous campaign. The client does not have a personal loan and their average yearly balance is 0 euros.###\nHence this label was No."
"This potential client is a 32-year-old single individual working in management with a secondary education. They do not have any credit in default and have an average yearly balance of 301 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 16th of April, and the call lasted 383 seconds. This is the third contact made during this campaign, following up after 345 days from the previous contact made during a different campaign, which resulted in failure.###\nHence this label was No."
"The client is a 47-year-old married individual who works in a blue-collar job and has unknown education. They do not have credit in default but have a housing loan. They do not have a personal loan. The average yearly balance in euros is 733. The last contact was made on the 7th day of May, and the call lasted for 268 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, and the communication type used is also unknown.###\nHence this label was No."
"The client is a 59-year-old married individual working in administration with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via an unknown communication type on the 18th of June and the call lasted 326 seconds. This was their first contact during this campaign. The outcome of any previous marketing campaign is unknown. The client has an average yearly balance of 479 euros.###\nHence this label was No."
"The client is a 39-year-old single individual working as a blue-collar worker with unknown education status. They do not have credit in default, but have a housing loan. They do not have a personal loan. The average yearly balance in euros is 2841. The type of contact communication is unknown. The client was last contacted on the 5th of June, with a call duration of 1121 seconds. This is the third contact made during this campaign, with no previous contacts for this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 26-year-old single individual working in management with a tertiary education. They do not have credit in default and have an average yearly balance of 1094 euros. They have a housing loan but do not have a personal loan. The bank contacted them via cellular communication on the 8th of September, and the call lasted for 137 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 52-year-old married individual working in the services sector with a tertiary education. They do not have credit in default and have both a housing and personal loan. Their average yearly balance is 2801 euros. The last contact made was on the 17th of June, with a duration of 311 seconds. This was the second contact made during this campaign, but there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The communication type used for contact is also unknown.###\nHence this label was No."
"The client is a 37-year-old married technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 277 euros. The communication type used for contact is cellular. The last contact was on the 4th of February and lasted for 244 seconds. This is the second contact made to the client during this campaign, with no previous contacts made. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old married technician with secondary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via an unknown communication type on the 23rd of May and had a successful call duration of 541 seconds. This was the second contact made during this campaign, with no previous contact history available. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old married individual working in administration with secondary education. They do not have credit in default and have an average yearly balance of 739 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 23rd of July for 250 seconds. This was the first contact made during this campaign, and there was no previous history of contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old single individual working in the services sector with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The average yearly balance is negative (-92 euros). The client was contacted via an unknown communication type on the 27th of May, with the call lasting 236 seconds. This was the first contact made during this campaign. There is no record of previous contact with the client or the outcome of any previous marketing campaigns.###\nHence this label was No."
"The client is a 37-year-old married individual working as an admin with primary education. They do not have any credit in default and have a housing loan. Their average yearly balance is 214 euros and they do not have a personal loan. The bank contacted them via cellular communication on the 9th of July, with a call duration of 645 seconds. This is the first contact made to the client during this campaign. The outcome of the previous marketing campaign is unknown since the client was not previously contacted.###\nHence this label was Yes."
"The client is a 48-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 343 euros. They were contacted via an unknown communication type on the 19th of June for 136 seconds. This is the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old divorced individual working in the services sector with a secondary level of education. They do not have credit in default but have a housing loan. They have an average yearly balance of 991 euros and do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting 89 seconds on the 6th day of May. This was the second time they were contacted during this campaign, following a previous unsuccessful marketing attempt 344 days ago.###\nHence this label was No."
"The client is a 37-year-old married technician with secondary education. They do not have credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 29th of January. The call lasted 88 seconds. This was the 3rd contact made during this campaign, with 5 previous contacts. The client was last contacted 244 days ago in a previous campaign where the outcome was a failure.###\nHence this label was No."
"The client is a 37-year-old single individual working as a blue-collar worker with unknown education status. They do not have any credit in default, a housing loan, or a personal loan. The average yearly balance in their account is 2188 euros. The last contact was made on the 16th of May for 193 seconds, which was the 8th contact during this campaign. There were no previous contacts with this client, and the outcome of the previous marketing campaign is unknown. The communication type used for contact is also unknown.###\nHence this label was No."
"The client is a 28-year-old single individual working in the services sector with a secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 1136. The communication with the client was done via cellular phone. The last contact was on the 28th of July, lasting for 89 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 32-year-old single technician with tertiary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The contact communication type is unknown. The last contact was on the 23rd of May and lasted 85 seconds. This was the first contact made during this campaign. There is no information on any previous marketing campaign outcome. The client's average yearly balance is 390 euros.###\nHence this label was No."
"The client is a 44-year-old married individual working in administration with a secondary level education. They do not have credit in default, have a housing loan, but no personal loan. The average yearly balance in euros is 2687. The communication type for the last contact is unknown, which lasted 131 seconds and occurred on the 16th day of May. This is the fourth contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married technician with unknown education. They do not have credit in default and have an average yearly balance of 886 euros. They have a housing loan but no personal loan. The communication type used for contact is cellular. The last contact was made on the 1st of September and lasted 115 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a married 34-year-old technician with tertiary education. They do not have credit in default and have a housing loan. Their average yearly balance is 5547 euros, and they do not have a personal loan. The bank contacted them via cellular communication on the 19th of August, with a call duration of 73 seconds. This is the 6th time they have been contacted during this campaign. There is no record of previous contact with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working as an admin, with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 3156 euros. The communication with the client was done via cellular phone call, with a duration of 170 seconds on the 2nd day of February. This was the first contact made during this campaign. There is no record of previous contact or outcome from a previous marketing campaign.###\nHence this label was No."
"The client is a 41-year-old married individual working in a blue-collar job with a secondary level education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication. The client was last contacted on the 4th of May for 106 seconds. This was the second time they were contacted during this campaign. There is no record of them being contacted in previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1354 euros.###\nHence this label was No."
"The client is a 50-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default and have a housing loan. Their average yearly balance is 953 euros and they do not have a personal loan. They were contacted via cellular communication, with the last call lasting 315 seconds on the 13th of May. This was the first contact during this campaign, but they were contacted 364 days after the previous campaign where there were 2 interactions, resulting in a failure outcome.###\nHence this label was No."
"The client is a 36-year-old married technician with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 23rd of May. The call lasted for 219 seconds, and this was the 4th contact during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 5902 euros.###\nHence this label was No."
"The client is a 57-year-old married individual working in management with primary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 19th of November for a 97-second call, which was the first contact during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 31-year-old single individual working in the services sector with secondary education. They do not have any credit in default, housing loan, or personal loan. The client was contacted via cellular communication on the 28th of July and the call lasted for 243 seconds. This is the second time they have been contacted during this campaign. There is no record of previous contacts or the outcome of past marketing campaigns with this client. Their average yearly balance is 0 euros.###\nHence this label was No."
"A 34-year-old unemployed single individual with secondary education was contacted via telephone for a marketing campaign by a Portuguese banking institution. They do not have any credit in default, housing loan, or personal loan. Their average yearly balance is 1965 euros. The call lasted 714 seconds and it was the first time they were contacted during this campaign. The outcome of any previous marketing campaign with the client is unknown. The call took place on the 4th of May.###\nHence this label was Yes."
"The client is a 41-year-old single technician with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via cellular communication for a duration of 154 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 51-year-old married individual working as an admin, with a secondary level education. They do not have any credit in default and do not have a housing loan but have a personal loan. The client was contacted via cellular communication, and the last call was made on the 13th of August, with a duration of 157 seconds. This was the second call made to the client during this campaign. The client was not previously contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 21.###\nHence this label was No."
"The client is a 58-year-old divorced individual working in management with a tertiary education. They do not have credit in default and do not have any existing housing or personal loans. The bank contacted them via cellular communication, with the last call lasting 92 seconds on the 14th day of August. This was the third contact made during this campaign, with 106 days passing since they were last contacted from a previous campaign. Prior to this campaign, they were contacted twice, with the outcome being successful. The client's average yearly balance is 5701 euros.###\nHence this label was No."
"The client is a 40-year-old self-employed individual who is single and has a tertiary level education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 28th of July and the call lasted for 1009 seconds. This was the 7th time they were contacted during this campaign. There was no previous contact with the client for a previous campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1616 euros.###\nHence this label was Yes."
"The client is a 57-year-old retired individual who is married with a tertiary education. They do not have any credit in default, housing loan, but they have a personal loan. The bank contacted them via a cellular communication type on the 28th of January, with a call duration of 139 seconds. This is the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 34 euros.###\nHence this label was No."
"The client is a 54-year-old single individual working as an admin, with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 15 euros. The client was contacted via cellular communication, with the call lasting 93 seconds on the 4th day of February. This was the first contact during this campaign, and there was no previous contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old self-employed individual who is married with a tertiary level of education. They do not have any credit in default and maintain an average yearly balance of 1676 euros. They have a housing loan but no personal loan. The communication with the client was via a cellular phone, and the last contact was on the 9th of September, lasting 223 seconds. This is the second time they have been contacted during this campaign. There is no record of previous contact with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old married entrepreneur with tertiary education and no credit in default. They have an average yearly balance of 1681 euros and do not have a housing or personal loan. The client was contacted via cellular communication on the 25th of July and the call lasted 159 seconds. This was the first contact made during this campaign. There is no record of previous contact with the client, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married individual working as a blue-collar worker with a secondary level of education. They do not have any credit in default, but they have a housing loan. They were contacted via cellular communication for this marketing campaign. The client was last contacted on the 3rd of February and the call lasted for 182 seconds. This is the second time they have been contacted during this campaign. The client has not been previously contacted for any marketing campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old married individual working in management with tertiary education. They do not have credit in default, but have a housing loan. They have been contacted 13 times during this campaign, with the last contact being on the 3rd day of June for 247 seconds. They have not been contacted in any previous campaign, and the outcome of the previous campaign is unknown. The client does not have a personal loan and their average yearly balance is 0 euros. The communication type used for contact is unknown.###\nHence this label was No."
"The client is a 35-year-old divorced individual working as an admin, with secondary education. They do not have credit in default, do not have a housing loan but have a personal loan. The average yearly balance is 20 euros. The client was contacted via cellular communication on the 17th of July, with a call duration of 287 seconds. This is the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married individual working in a management position with a tertiary level of education. They do not have any credit in default and do not have any housing or personal loans. The communication with the client was done via a cellular phone. The last contact was made on the 1st of July and lasted for 571 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2383 euros.###\nHence this label was Yes."
"The client is a 32-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, have a yearly balance of 726 euros, and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 20th of November, with a call duration of 188 seconds. This was their second contact during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 50-year-old divorced individual working in management with a tertiary education. They do not have any credit in default and have a housing loan. They were contacted via cellular communication. The client was last contacted on the 6th of August for 146 seconds, as part of the 5th contact in the current campaign. There was no previous contact with the client for a previous campaign, and the outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 3211 euros and does not have a personal loan.###\nHence this label was No."
"The client is a 38-year-old divorced individual working in administration with a secondary level education. They do not have any credit in default, but they do have a housing loan. Their average yearly balance is 156 euros and they do not have a personal loan. The client was contacted via an unknown communication type on the 17th of June and the call lasted for 544 seconds. This was the third contact made to the client during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
