"The client is a 30-year-old single individual working in administration with a secondary level education. They do not have credit in default and have an average yearly balance of 983 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication, with the last call lasting 189 seconds on the 27th of May. This was the second call made to the client during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 28-year-old single individual working in a blue-collar job with primary education. They do not have credit in default, but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 30th of July for a duration of 1011 seconds. This is the 20th contact made during this campaign. The client has not been previously contacted. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1199 euros.###\nHence this label was No."
"The client is a 46-year-old divorced individual working in a management role with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 30th of December and had a successful conversation lasting 369 seconds. This was the second time they were contacted during this campaign, with no prior contact history. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 461 euros.###\nHence this label was Yes."
"The client is a 36-year-old individual with an unknown job status, who is married and has primary education. They do not have any credit in default and do not have a housing or personal loan. The bank contacted them via cellular communication on the 21st of August and the call lasted 238 seconds. This was the second contact made to the client during this campaign. There was no previous contact with the client from a previous campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 38-year-old single individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 20th of August, with a call duration of 105 seconds. This is the second time they have been contacted during this campaign. The outcome of the previous marketing campaign is unknown, suggesting they may not have subscribed to a term deposit at that time.###\nHence this label was No."
"The client is a 46-year-old married individual working in management with a tertiary education. They do not have credit in default and have a housing and personal loan. The average yearly balance is 39 euros. The client was contacted via cellular communication on the 21st of November for 64 seconds, this being the first contact during this campaign. There is no information on previous contacts or the outcome of the previous marketing campaign.###\nHence this label was No."
"The client is a 44-year-old married individual working in a management position with a tertiary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in their account is 7454 euros. They were contacted via an unknown communication type on the 5th of June and the call lasted 243 seconds. This was the first contact made during this campaign. There is no information available on previous marketing campaign outcomes or previous contacts with the client.###\nHence this label was No."
"The client is a 31-year-old married individual working in a management role with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 827 euros. The last phone call was made on the 20th of May and lasted for 38 seconds. This was the first contact made to the client during this marketing campaign. The outcome of any previous marketing campaigns with this client is unknown. The communication type for this contact was unknown as well.###\nHence this label was No."
"The client is a 26-year-old single individual working in the services sector with secondary education. They do not have any credit in default and do not have any housing or personal loans. The client was contacted via cellular communication and the last call duration was 1136 seconds. This client was contacted 2 times during this campaign, with no previous contacts before. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 110 euros and the last contact was on the 30th day of January.###\nHence this label was Yes."
"The client is a 31-year-old single individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 9629. The communication type for contact is cellular. The last contact was on the 7th of October and lasted for 180 seconds. This is the second contact made during this campaign, with 96 days passing since the client was last contacted from a previous campaign. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 59-year-old retired married individual with secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance is negative. The bank contacted them via cellular communication, with the last call lasting 86 seconds on the 7th day of August. This was the 6th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 67-year-old retired married individual with primary education and no credit in default. They have an average yearly balance of 708 euros and do not have a housing or personal loan. The bank contacted them via cellular communication on the 11th of September. The call lasted 96 seconds, and this was the second contact made during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 49-year-old single individual working in management with tertiary education. They do not have credit in default and have an average yearly balance of 1093 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 18th of November and the call lasted for 152 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual working in management with a tertiary education. They do not have any credit in default but have a housing loan. Their average yearly balance is negative 34 euros and they do not have a personal loan. The bank contacted them via cellular communication on the 7th of August, with a call duration of 131 seconds. This was the second contact made during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 47-year-old married individual who works as a blue-collar employee and has a secondary level education was contacted via telephone for a marketing campaign. They do not have any credit in default, but have a housing loan. They do not have a personal loan. The average yearly balance in their bank account is 1230 euros. The call lasted for 378 seconds and it was the first time they were contacted during this campaign. The outcome of the previous marketing campaign is unknown. The contact was made on the 12th of November.###\nHence this label was Yes."
"The client is a 36-year-old divorced technician with primary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 5th of May for 320 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client has a negative average yearly balance of -127 euros.###\nHence this label was No."
"The client is a 36-year-old self-employed individual who is single and has a secondary level of education. They do not have any credit in default but have housing and personal loans. Their average yearly balance is 1173 euros. The communication type used for contacting the client is unknown. The last contact was made on the 20th of June and lasted for 50 seconds. This was the 5th contact during this campaign, with no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old divorced blue-collar worker with secondary education. They do not have credit in default, but they have a housing loan. They do not have a personal loan. The average yearly balance is 2540 euros. The last contact was made on the 14th of May via an unknown communication type, and it lasted for 189 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old married individual working in an administrative role with a secondary level of education. They do not have any credit in default but have a housing loan. Their average yearly balance is negative. They do not have a personal loan. The last contact was made on the 28th of May with a duration of 158 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown, and the communication type for this contact was also unknown.###\nHence this label was No."
"The client is a 32-year-old married individual working in management with a tertiary education. They do not have credit in default, have a housing loan but no personal loan. The average yearly balance in euros is 514. The client was contacted through an unknown communication type on the 28th of May and the call duration was 497 seconds. This was the second contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 54-year-old divorced individual working in management with tertiary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via telephone on the 18th of May for 17 seconds. This was the 11th contact made during this campaign. The client was not previously contacted for any campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married technician with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication and were last contacted on the 5th of August for 95 seconds. This is their second contact during this campaign, and they have not been contacted in any previous campaigns. The outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old married individual working in administration with secondary education. They do not have credit in default but have a housing loan. They were not previously contacted for a marketing campaign. The client does not have a personal loan and their average yearly balance is -143 euros. They were last contacted on the 23rd of May, with a call duration of 1034 seconds. During this campaign, they were contacted 9 times. The outcome of the previous marketing campaign is unknown. The communication type used for contacting the client is also unknown.###\nHence this label was No."
"A 29-year-old self-employed individual, married with a secondary education, having no credit default and no housing loan but a personal loan. They were contacted via cellular communication on the 22nd of October and had a successful previous marketing campaign outcome. With an average yearly balance of 123 euros, this client was contacted for 247 seconds during this campaign, which was the fourth contact overall. The previous contact was made 184 days ago.###\nHence this label was Yes."
"The client is a 37-year-old self-employed individual who is married with tertiary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular phone, with the call lasting 153 seconds. This was the first contact during this campaign, but they were contacted twice in a previous campaign, 225 days ago. The outcome of the previous campaign was categorized as \"other\". The client's average yearly balance is 11,387 euros.###\nHence this label was No."
"The client is a 43-year-old married individual working in a blue-collar job with a secondary level education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via an unknown communication type on the 8th of May and the call lasted 187 seconds. This was the first contact made during the current campaign and there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 39-year-old technician who is single. They have a secondary education and do not have credit in default. With an average yearly balance of 10236 euros, they do not have housing or personal loans. The client was contacted via an unknown communication type on the 20th of June for a short duration of 10 seconds. This was the third contact during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working in a management position with tertiary education. They do not have any credit in default and do not have a housing loan, but they do have a personal loan. The average yearly balance in euros is 126. The client was contacted via cellular communication, with the last call lasting 371 seconds on the 7th of July. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 27-year-old single individual working in the services sector with secondary education was contacted via cellular phone in July. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is negative. During the current campaign, they were contacted 2 times, with the last call lasting 283 seconds on the 8th day of the month. There were no previous contacts with this client, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old single technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 18th of November for a duration of 835 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2729 euros.###\nHence this label was Yes."
"The client is a 36-year-old married individual working as an admin with a secondary level education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via a cellular phone call on the 2nd day of February, and the call lasted for 102 seconds. This was the 2nd time they were contacted during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The average yearly balance in their account is 606 euros.###\nHence this label was No."
"The client is 42 years old, working in management, divorced, with a tertiary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance is 20 euros. The communication with the client was done via cellular phone, with the last contact being on the 25th of July and lasting 64 seconds. This was the second contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default and have an average yearly balance of 810 euros. They have a housing loan but no personal loan. The communication type for the last contact is unknown, which lasted for 19 seconds on the 14th day of May. This was the 14th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 41-year-old married individual working in a blue-collar job with primary education. They do not have credit in default and have a housing loan but no personal loan. They were last contacted in November via cellular communication, with the call lasting 290 seconds. This was the first contact during this campaign, but they had been contacted twice before. The outcome of the previous marketing campaign was successful, and they have an average yearly balance of 1461 euros.###\nHence this label was No."
"The client is a 43-year-old self-employed individual who is married and has a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in July. The client's average yearly balance is 2501 euros. They were previously contacted 161 days ago, with a last contact duration of 582 seconds. This is the second time they have been contacted during this campaign, and a total of 4 contacts were made with them before. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"A 50-year-old married individual working in a management position with a tertiary education was contacted via cellular communication for a direct marketing campaign. They do not have any credit in default, housing loan, or personal loan. They had an average yearly balance of 258 euros. The last contact was made on the 12th of August and lasted for 246 seconds. This was the 6th contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"A 26-year-old unemployed single individual with a secondary education was contacted for a marketing campaign. They do not have credit in default, housing loan, or personal loan. The communication type used is unknown, and the call lasted for 8 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with this client is also unknown. The average yearly balance in euros is 4.###\nHence this label was No."
"The client is a 37-year-old single individual working as a blue-collar worker with secondary education. They do not have credit in default but have a housing loan. Their average yearly balance is 13156 euros, and they do not have a personal loan. The client was contacted via an unknown communication type on the 21st of May. The call duration was 240 seconds, and this was the first contact made during this campaign. There is no information on any previous marketing campaign outcome or past contacts with the client.###\nHence this label was No."
"The client is a 35-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. They were contacted via cellular communication, and the last call duration was 199 seconds on the 17th of November. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 33-year-old single technician with secondary education, having no credit in default but with housing and personal loans, was contacted via an unknown communication type in June. They had an average yearly balance of 374 euros. The call lasted 185 seconds and it was the first contact made during this campaign. There is no record of previous contact or outcome from prior marketing campaigns.###\nHence this label was No."
"The client is a 40-year-old married individual working in a management position with a tertiary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in their account is 4539 euros. The last marketing campaign involved contacting them via cellular communication, with the last call lasting 256 seconds. This is the fourth time they have been contacted during this campaign, with the previous contact happening 439 days ago, resulting in a failed outcome.###\nHence this label was Yes."
"The client is a 30-year-old single individual working in the services sector with secondary education. They do not have any credit in default but have housing and personal loans. They were contacted via cellular communication on the 30th of July and the call lasted 109 seconds. This was the third time they were contacted during this campaign. There is no record of previous contact with this client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 726 euros.###\nHence this label was No."
"This individual is a 47-year-old married blue-collar worker with primary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellphone on the 26th of August, and the call lasted 292 seconds. This was the second time they were contacted during this campaign, with no prior contacts recorded. The outcome of the previous marketing campaign for this client is unknown. The average yearly balance in their account is 0 euros.###\nHence this label was No."
"The client is a 25-year-old blue-collar worker who is single and holds a secondary education degree. They do not have any credit in default and have a yearly average balance of 764 euros. They have a housing loan but do not have a personal loan. The bank contacted them via cellular communication on the 18th of May, with a call duration of 455 seconds. This was the first contact made during the current campaign. There was no previous contact with the client, and the outcome of any previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old divorced individual working in the services sector with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication, reaching out on the 11th of May for a duration of 151 seconds. This was the second time they were contacted during this campaign, with 370 days passed since the previous contact. The outcome of the previous marketing campaign with this client was a failure.###\nHence this label was No."
"The client is a 31-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default and have an average yearly balance of 33 euros. They have a housing loan but do not have a personal loan. The bank contacted them via cellular communication on the 24th of July, and the call duration was 901 seconds. This was the second contact made to the client during this campaign. The client has not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 39-year-old married technician with a tertiary education and no credit in default. They have a yearly balance of 99 euros and do not have any housing or personal loans. The client was contacted via cellular communication on the 14th of August and the call lasted for 170 seconds. This was their second contact during the current campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old unemployed individual who is married with a secondary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 135 euros and do not have a personal loan. The communication type for the last contact is unknown and it took place on the 13th day of May, with a duration of 259 seconds. This was the 6th contact made during this campaign, with no previous contacts before. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 37-year-old married individual working in a management position with a tertiary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in their account is 2283 euros. The communication with the client was done via a cellular phone. The last contact was on the 6th of August and lasted for 303 seconds. During this campaign, the client was contacted 2 times. There were 92 days since the client was last contacted from a previous campaign, where 4 contacts were made. The outcome of the previous marketing campaign was successful.###\nHence this label was Yes."
"The client is a 51-year-old unemployed married individual with a secondary education. They do not have credit in default but have a housing loan. They were contacted by telephone and the last call lasted 237 seconds. This was the second contact made during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown. The client does not have a personal loan and has an average yearly balance of 17,418 euros. The last contact was made on the 30th of January.###\nHence this label was No."
"The client is a 46-year-old divorced individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 19th of August and the call lasted 134 seconds. This was the second contact made to the client during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 134 euros.###\nHence this label was No."
"The client is a 57-year-old retired individual who is married with a secondary level education. They do not have any credit in default, do not have a housing loan but have a personal loan. The average yearly balance is negative at -418 euros. The method of communication during the campaign was unknown, with the last contact being on the 27th of June for 95 seconds. This was the first contact made during this campaign, and there is no information on any previous marketing campaign outcome.###\nHence this label was No."
"A 19-year-old student who is single and has unknown education status was contacted via cellular communication for a banking marketing campaign. They do not have credit in default, housing loan, or personal loan. Their average yearly balance is 108 euros. The previous marketing campaign with them was successful. The last contact was made on the 10th of August and lasted for 168 seconds. This was the first contact in the current campaign, and 182 days had passed since the previous contact.###\nHence this label was Yes."
"The client is a 40-year-old married individual working as an admin, with secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 21st of November. The call lasted 199 seconds, and this was the second time they were contacted during this campaign. There were no previous contacts with the client for marketing purposes. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 67 euros.###\nHence this label was No."
"The client is a 56-year-old married individual working in management with a tertiary education. They do not have credit in default and do not have a housing loan, but they do have a personal loan. The average yearly balance in euros is 171. The client was contacted via telephone on the 17th of July for 610 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old single admin worker with secondary education. They do not have credit in default, do not have a housing loan but have a personal loan. Their average yearly balance is 276 euros. The contact communication type is unknown. The last contact was on the 9th of June and lasted 346 seconds. This is the second time they have been contacted during this campaign. There is no record of previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old single individual working as a blue-collar worker with secondary education. They do not have any credit in default and do not have a housing loan, but they do have a personal loan. The client was contacted via cellular communication and the last call duration was 150 seconds on the 21st day of November. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is -552 euros.###\nHence this label was No."
"The client is a 52-year-old married individual working in an administrative role with a secondary education. They do not have a credit in default and have an average yearly balance of 225 euros. They have a housing loan but do not have a personal loan. The communication type during the marketing campaign was unknown. The client was last contacted on the 15th of May and the call lasted 167 seconds. This was the first contact made during this campaign, and there was no previous campaign contact history available. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 35-year-old married technician with tertiary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 20th of April. The client's average yearly balance is 703 euros. The duration of the last contact was 169 seconds, and it was the only contact made during this campaign. There were no previous contacts with the client, and the outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, housing loan, but have a personal loan. The average yearly balance is 0 euros. The client was contacted via cellular communication on the 22nd of July, with a call duration of 127 seconds. This was the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married individual working in the services sector with primary education. They do not have any credit in default, housing, or personal loans. The average yearly balance is 510 euros. They were contacted for this campaign twice, with the last contact lasting 316 seconds in June on the 9th day. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown, and the communication type for this campaign is also unknown.###\nHence this label was No."
"The client is a 28-year-old single individual working in a management position with tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 390. The client was last contacted via cellular communication on the 29th of September and the call duration was 845 seconds. This was the 1st contact during this campaign and the 5th contact overall. The previous marketing campaign with the client was successful, resulting in a term deposit subscription.###\nHence this label was Yes."
"The client is a 52-year-old unemployed married individual with tertiary education. They do not have credit in default, housing loan, or personal loan. The communication type with the client was cellular. The last contact was made on the 7th of July and lasted 107 seconds. This was the 6th contact during this campaign. The client has not been contacted in a previous campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1023 euros.###\nHence this label was No."
"The client is a 51-year-old married housemaid with primary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 289. The communication type during the last contact is unknown, which lasted for 97 seconds. This was the 5th contact during this campaign, with no previous contacts. The client was last contacted on the 14th of May. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 33-year-old single individual working in the administrative field with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication, with the last call lasting 189 seconds on the 12th of November. This was the second call made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 280 euros.###\nHence this label was No."
"The client is a 55-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan. They have been contacted via cellular communication and the last call lasted for 81 seconds. This is the first contact during this campaign, but they have been contacted 11 times in previous campaigns. The last contact from a previous campaign was 98 days ago and the outcome was categorized as 'other'. The client does not have a personal loan and maintains an average yearly balance of 2960 euros.###\nHence this label was No."
"The client is a 65-year-old retired individual who is married and has primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 18th of August. The client has an average yearly balance of 1760 euros. During the current campaign, they have been contacted 4 times, with the last call lasting 855 seconds. This is the first time they have been contacted in a previous campaign, with an unknown outcome.###\nHence this label was Yes."
"The client is a 33-year-old individual with an unknown job status, married, and holds a secondary education degree. They do not have any credit in default and do not have any housing or personal loans. The bank contacted them via cellular communication, and the last call was made on the 11th of August, with a duration of 566 seconds. This was the 7th contact made during this campaign, and the client was not contacted previously. The outcome of the previous marketing campaign for this client is unknown. The average yearly balance in euros for this client is 335.###\nHence this label was No."
"The client is a retired 64-year-old individual who is divorced. They have a secondary level education and do not have any credit in default. With an average yearly balance of 4833 euros, they do not have any housing or personal loans. The client was contacted via cellular communication on the 20th of October and the call lasted 621 seconds. This was the first contact during this campaign, with 3 previous contacts made in the past. The outcome of the previous marketing campaign for this client was a failure, and the last contact was made 181 days ago.###\nHence this label was Yes."
"The client is a 49-year-old blue-collar worker who is divorced and has a secondary level education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 17th of November and the call lasted for 221 seconds. This was the second call made to the client during this campaign. They have not been previously contacted by the bank. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 23 euros.###\nHence this label was No."
"The client is a 31-year-old unemployed single individual with secondary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 5th of June and the call lasted 548 seconds. This was the second time they were contacted during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 582 euros.###\nHence this label was Yes."
"The client is a 47-year-old married individual working in the administrative field with a secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance in euros is 70. The client was last contacted in April via cellular communication and the call duration was 144 seconds. This is the 4th contact made during this campaign, with 2 contacts made before. The previous marketing campaign was successful, and the last contact was 374 days ago.###\nHence this label was Yes."
"The client is a 44-year-old married housemaid with primary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 23rd of July, with a call duration of 952 seconds. This is the second contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 26 euros.###\nHence this label was No."
"The client is a 43-year-old divorced individual working in a blue-collar job with primary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 219. The communication type for the marketing campaign was via telephone, and the last call was made on the 13th of November, with a duration of 138 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old single technician with a tertiary education. They do not have credit in default and have a housing and personal loan. The average yearly balance is 226 euros. The client was contacted 3 times during this campaign, with the last contact lasting 283 seconds. The last contact was on the 6th of May and the previous marketing campaign outcome is unknown.###\nHence this label was No."
"The client is a 42-year-old unemployed married individual with secondary education. They do not have any credit in default, but have a housing loan. They were contacted via cellular communication and the previous marketing campaign's outcome is unknown. The client has an average yearly balance of 0 euros and does not have a personal loan. The last contact was on the 13th of May, lasting 74 seconds. This is the third contact made during this campaign, with no previous contacts.###\nHence this label was No."
"The client is a 38-year-old single individual working in management with tertiary education. They do not have credit in default and have an average yearly balance of 427 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication, with the last call lasting 17 seconds on the 6th day of May. This was the 3rd contact made during this campaign, following up after 169 days from the previous campaign where there were 2 contacts made. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 57-year-old married housemaid with primary education and no credit in default. They do not have a housing or personal loan. The average yearly balance is 473 euros. The contact communication type is unknown, and the last contact was on the 9th of June, lasting for 87 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 45-year-old single individual working in the services sector with a secondary level of education. They do not have any credit in default and have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 18th of June and the call lasted for 41 seconds. This was the 8th contact made to the client during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 359 euros.###\nHence this label was No."
"The client is a 45-year-old married technician with unknown education. They do not have credit in default, have a housing loan, but no personal loan. The bank contacted them via cellular communication, with the last call lasting 75 seconds on the 13th of October. This was the second call during this campaign, with a gap of 42 days since the previous contact. In the previous campaign, there was one contact which resulted in failure. The client's average yearly balance is 886 euros.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 2487 euros. They were contacted via cellular communication on the 30th of April and the call lasted 126 seconds. This was the first contact made during this campaign. There is no record of any previous contact or outcome from a past marketing campaign.###\nHence this label was No."
"The client is a 46-year-old married individual working in a blue-collar job with unknown education level. They do not have credit in default and have a housing loan but no personal loan. Their average yearly balance is 626 euros. The communication type used for contacting them is unknown. The last contact was made on the 19th of June and lasted 177 seconds. This was the second contact made during the current campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have a housing loan. Their average yearly balance is 7858 euros, and they do not have a personal loan. The client was last contacted on the 3rd day of June for 641 seconds during this marketing campaign, which was the second contact attempt. There is no record of any previous marketing campaign outcome or contact history with this client. The communication type during the contact is unknown.###\nHence this label was No."
"The client is a 30-year-old single technician with a secondary education. They do not have credit in default but have a personal loan. They do not have a housing loan. The client was last contacted in August via cellular communication and the call lasted 159 seconds. This was the 5th contact during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 276 euros.###\nHence this label was No."
"A 35-year-old married blue-collar worker with a secondary education, having a personal loan and an average yearly balance of 402 euros, was contacted via an unknown communication type. The client does not have a housing loan or credit in default. The last contact was on the 17th of June for 123 seconds, which was the first contact during this campaign. There is no record of previous contact or the outcome of any previous marketing campaign.###\nHence this label was No."
"The client is a 42-year-old divorced individual working in the administrative sector with a secondary education. They do not have credit in default and have an average yearly balance of 435 euros. They have a housing loan but no personal loan. The communication type during the marketing campaign was unknown. The last contact was on the 30th of May and lasted for 148 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 24-year-old student who is single and has a secondary level of education. They do not have any credit in default and do not have a housing or personal loan. The bank contacted them via cellular communication and the last call lasted 165 seconds. This was the first contact during this campaign, with 2 previous contacts made in the past. The previous marketing campaign was successful, resulting in the client subscribing to a term deposit. The client's average yearly balance is 1809 euros. The last contact was made on the 11th of October, 95 days after the previous campaign.###\nHence this label was Yes."
"The client is a 30-year-old married individual working in management with a tertiary education. They do not have any credit in default and have an average yearly balance of 5204 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 19th of November, and the call lasted 117 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is a 36-year-old divorced individual working in the services sector with a secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 18th of August. The call lasted 172 seconds, which was the 3rd contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 127 euros.###\nHence this label was No."
"The client is a 43-year-old blue-collar worker who is divorced and has secondary education. They do not have credit in default but have housing and personal loans. The client was contacted via cellular communication, with the last call lasting 92 seconds on the 7th day of May. This is the third time they have been contacted during this campaign, with 167 days passing since they were last contacted from a previous campaign. The client was contacted a total of 4 times before this campaign. The outcome of the previous marketing campaign was categorized as 'other'.###\nHence this label was No."
"A 30-year-old single technician with tertiary education and no credit in default, who has a housing loan but no personal loan. They were contacted via cellular communication and had a relatively low average yearly balance of 3 euros. The previous marketing campaign outcome was a failure. During the current campaign, they were contacted twice, with the last call lasting 45 seconds, occurring on the 6th day of May, after 169 days since the previous contact.###\nHence this label was No."
"The client is a 42-year-old married individual working as a blue-collar worker with a secondary level of education. They do not have any credit in default but have both a housing and personal loan. The bank contacted them via telephone on the 20th of November and had a conversation lasting 93 seconds. This was the 4th time they were contacted during this campaign, with no prior contact from previous campaigns. The outcome of the previous marketing campaign for this client is unknown. The client maintains an average yearly balance of 3396 euros.###\nHence this label was No."
"The client is a 35-year-old single individual working in management with a tertiary education. They do not have credit in default but have a housing loan. Their average yearly balance is negative. They do not have a personal loan. The communication type used for contact is cellular. The client was last contacted on the 18th of May, with a call duration of 166 seconds. This is the second time they have been contacted during this campaign, with a gap of 272 days since they were last contacted from a previous campaign. Prior to this campaign, they were contacted 6 times. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"A 42-year-old blue-collar single individual with secondary education, no credit in default, and no housing or personal loans. They were contacted via cellular communication and had a last contact duration of 567 seconds on the 28th of January. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The individual has an average yearly balance of 583 euros.###\nHence this label was No."
"The client is a 36-year-old single technician with tertiary education. They do not have credit in default and have an average yearly balance of 962 euros. They have a housing loan but no personal loan. The communication type used for contact is cellular. The client was last contacted on the 8th of May and the call duration was 568 seconds. This is the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"A 43-year-old married individual working in management with a tertiary education was contacted via cellular communication regarding a term deposit. They do not have a housing or personal loan and do not have credit in default. Their average yearly balance is negative. The last call lasted 57 seconds and took place on the 4th day of February. This was the first contact during this campaign, and there is no data on previous campaign outcomes or contacts.###\nHence this label was No."
"The client is a 41-year-old single technician with a secondary education. They do not have credit in default, a housing loan, or a personal loan. The bank contacted them via cellular communication on the 31st of July, with a call duration of 616 seconds. This was the third contact during this campaign, with no prior contact history. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3023 euros.###\nHence this label was No."
"The client is a 46-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via cellular communication on the 6th of May for 116 seconds. This was the 2nd contact during this campaign and the 3rd overall. The client was previously contacted 169 days ago, resulting in a failed outcome. Their average yearly balance is 147 euros.###\nHence this label was No."
"The client is a 35-year-old married individual working in management with a secondary education. They do not have credit in default, but they have a housing loan. Their average yearly balance is 2311 euros and they do not have a personal loan. The bank contacted them via cellular communication on the 5th of May, and the call lasted for 659 seconds. This was the second time they were contacted during this campaign, with 167 days passing since the previous contact. The outcome of the previous marketing campaign for this client was a failure.###\nHence this label was No."
"The client is a 33-year-old single individual working in management with tertiary education. They have a credit in default, but do not have a housing or personal loan. The average yearly balance is in debt. The communication type for the marketing campaign was cellular, with the last contact made on the 18th of August for 127 seconds. This is the 4th contact made during this campaign with this client. There were no previous contacts with the client for marketing purposes. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication and the last call, which lasted 221 seconds, occurred on the 11th of August. This was the third contact made to the client during the current campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1208 euros.###\nHence this label was No."
"The client is a 37-year-old married individual working as an admin, with unknown education status. They do not have credit in default and have an average yearly balance of 497 euros. They have a housing loan but no personal loan. The bank contacted them via telephone on the 19th of November, with a call duration of 178 seconds. This was the second contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old divorced individual working in the management sector with a tertiary education. They do not have any credit in default and have an average yearly balance of 697 euros. They have a housing loan but no personal loan. The communication with the client was done via cellular phone, and the last contact was on the 30th of January, lasting 139 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old self-employed individual who is married, with secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 19th of November. The call lasted for 180 seconds. This was the first contact made during this campaign, but they were contacted twice in a previous campaign, with the last contact being 111 days ago, which resulted in a failure outcome. The client's average yearly balance is 830 euros.###\nHence this label was No."
"The client is a 59-year-old married individual working in management with tertiary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 7th of September. The call lasted for 98 seconds, and this was the second contact made during this campaign. The client has not been previously contacted by the bank. The outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 315.###\nHence this label was No."
"The client is a 57-year-old individual working in a management position, who is divorced and has unknown educational background. They do not have any credit in default, housing loan, or personal loan. The communication type used for contacting the client is not specified. The client was last contacted on the 16th of June, with a call duration of 335 seconds. This was the 3rd contact made during the current campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 26-year-old single technician with a secondary education level. They do not have any credit in default, but they have a housing loan. Their average yearly balance is 75 euros and they do not have a personal loan. The client was contacted by phone on the 27th of May with an unknown communication type, and the call lasted 337 seconds. This was the second contact made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 49-year-old single technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 571 euros. The communication type used for contact was cellular. The last contact was on the 6th of May and lasted 321 seconds. This was the first contact made during this campaign. There is no information on previous campaign outcomes or contacts.###\nHence this label was No."
"The client is a 37-year-old divorced individual working as a blue-collar worker with a secondary level of education. They do not have credit in default and have an average yearly balance of 316 euros. They have a housing loan but do not have a personal loan. The communication type used for the last contact is unknown, which occurred on the 26th of May and lasted for 642 seconds. This client has been contacted twice during this campaign and has not been contacted previously. There were no contacts made before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 31-year-old single individual working in a management position with a tertiary education. They do not have any credit in default, but they do have a housing loan. Their average yearly balance is 130 euros and they do not have a personal loan. The bank contacted them via cellular communication on the 5th of May and the call lasted for 155 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaigns with the client is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default and have a housing loan. They were contacted via telephone on the 11th of May and the call lasted for 21 seconds. This was the first contact made during the current campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 372 euros and does not have a personal loan.###\nHence this label was No."
"The client is a 38-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 11th of August for 111 seconds. This was the second time they were contacted during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 1440 euros.###\nHence this label was No."
"The client is a 33-year-old single individual working in management with a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 5276 euros. They were contacted via cellular communication on the 4th day of November and the call lasted 572 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, indicating that they were not previously contacted.###\nHence this label was No."
"The client is a 33-year-old single individual working in management with a tertiary education. They do not have any credit in default, but have a housing loan. They have a yearly average balance of 1304 euros and do not have a personal loan. The client was contacted via cellular communication on the 18th of May and the call duration was 536 seconds. This was the second contact made during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 36-year-old married individual working in management with tertiary education. They do not have credit in default but have both a housing loan and a personal loan. Their average yearly balance is in the negative. The last contact was made on the 29th of May for a duration of 229 seconds, as part of the fourth contact made during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown, as the communication type used is also unknown.###\nHence this label was No."
"The client is a 38-year-old married technician with tertiary education. They do not have credit in default but have housing and personal loans. The average yearly balance is negative at -255 euros. They were contacted via cellular communication, with the last call lasting 63 seconds on the 24th of July. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 31-year-old single technician with a tertiary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via a cellular phone call on the 6th of May, with a call duration of 14 seconds. This was the 6th contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign for this client is unknown. The client's average yearly balance is 645 euros.###\nHence this label was No."
"The client is a 59-year-old retired married individual with primary education. They do not have credit in default, do not have a housing loan but have a personal loan. The bank contacted them via telephone on the 15th of July for 41 seconds. This was the 5th contact made during this campaign. The client was not contacted previously. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is -90 euros.###\nHence this label was No."
"The client is a 43-year-old married individual working in a blue-collar job with a secondary level of education. They do not have any credit in default, have a yearly average balance of 0 euros, and have a housing loan but no personal loan. The client was contacted via cellular communication, with the call lasting 440 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old unemployed married individual with primary education. They have credit in default, a housing loan, and no personal loan. The communication type for the contact is unknown. The client was last contacted on the 8th of May for 218 seconds, as part of the 2nd contact in the current campaign. They have not been previously contacted for any campaign. The outcome of the previous marketing campaign is unknown. The average yearly balance is negative at -581 euros.###\nHence this label was No."
"The client is a 45-year-old married individual working in administration with a secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 30th of July and the call lasted for 129 seconds. This is the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3307 euros.###\nHence this label was No."
"The client is a 55-year-old divorced individual working in a blue-collar job with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting 36 seconds on the 7th day of May. This was the third contact made during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is in the negative at -152 euros.###\nHence this label was No."
"The client is a 36-year-old married person working in the services sector with a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The communication type used for contacting the client is unknown. The client was last contacted on the 11th of June for 181 seconds and has been contacted a total of 2 times during the current campaign. There is no record of previous contacts with this client. The outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 2153 euros.###\nHence this label was No."
"The client is a 48-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via an unknown communication type on the 19th of June. The call lasted for 63 seconds, and this was the second time they were contacted during this marketing campaign. They had not been contacted in any previous campaigns, and the outcome of the previous campaign is unknown. The client has an average yearly balance of 13501 euros.###\nHence this label was No."
"The client is a 33-year-old student who is single and has tertiary education. They do not have any credit in default and have an average yearly balance of 3404 euros. They have a housing loan but no personal loan. The communication with the client was done via cellular phone. The last contact was made on the 20th of November and lasted for 105 seconds. This was the second contact made during this campaign and a total of 3 contacts were made before this campaign. The previous marketing campaign outcome was a failure, and the client was last contacted 171 days ago.###\nHence this label was No."
"A 26-year-old student who is single and has a secondary level education was contacted via their cellular phone. They have no credit in default, housing loan, or personal loan. With an average yearly balance of 480 euros, they were contacted once during this campaign, which lasted 104 seconds. The client was not previously contacted for any campaign, and the outcome of the previous marketing campaign is unknown. The last contact with the client was on the 30th of April.###\nHence this label was No."
"The client is a 26-year-old student who is single and has secondary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted the client via cellular communication on the 27th of May. The call lasted for 107 seconds, and this was the second time they were contacted during this campaign. There were no previous contacts with the client, and the outcome of any previous marketing campaigns is unknown. The client's average yearly balance is 0 euros.###\nHence this label was No."
"The client is a 32-year-old student who is single. Their education level is unknown. They do not have any credit in default and do not have housing or personal loans. The average yearly balance in their account is 4110 euros. They were contacted via cellular communication, with the last call lasting 119 seconds on the 6th day of February. This was the 8th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 31-year-old single individual working in the services sector, with secondary education and no credit in default, was contacted via cellular communication. They have no housing or personal loans and had an average yearly balance of 1027 euros. The client was contacted in July, with the last call lasting 217 seconds. This was the third contact made during the current campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 42-year-old married individual working in administration with a secondary education. They do not have any credit in default and have a housing loan. The client does not have a personal loan. The bank contacted them via an unknown communication type on the 14th day of May. The call lasted for 238 seconds, and it was the first contact made during this campaign. There is no information on any previous contact with the client. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 2656 euros.###\nHence this label was No."
"The client is a 30-year-old entrepreneur who is divorced, with secondary education. They do not have credit in default and have a housing loan. They were contacted via cellular communication on the 23rd of July, with a call duration of 108 seconds. This was the 4th contact made during this campaign. There were no previous contacts with the client, and the outcome of the previous campaign is unknown. The client does not have a personal loan and has an average yearly balance of 151 euros.###\nHence this label was No."
"The client is a 37-year-old self-employed individual who is divorced and has a tertiary education. They have credit in default and an average yearly balance of 353 euros. They have a housing loan and a personal loan. The communication with the client was done via cellular phone. The last contact was on the 18th of November and lasted for 134 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 55-year-old divorced individual working as a blue-collar worker with a secondary education. They do not have any credit in default and do not have any housing or personal loans. They were contacted via an unknown communication type on the 6th of June. The call lasted 182 seconds and this was the second contact made during this campaign. There was no previous contact with the client before this campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 4053 euros.###\nHence this label was No."
"The client is a 34-year-old married technician with secondary education. They do not have credit in default, but have a housing loan. They have a yearly average balance of 178 euros and do not have a personal loan. The bank contacted them via cellular communication on the 13th of May, with a call duration of 253 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign with this client is unknown.###\nHence this label was No."
"The client is a 43-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default, but have a housing loan. They have been contacted via cellular communication and the last call duration was 351 seconds. The client was last contacted 337 days ago from a previous campaign, where the outcome was a failure. They have not taken a personal loan. In the current campaign, this client has been contacted only once, and there were 3 previous contacts made before this campaign.###\nHence this label was No."
"The client is a 41-year-old single technician with a tertiary education. They do not have credit in default and have an average yearly balance of 1646 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 4th day of February, with a call duration of 261 seconds. This was the 1st contact during this campaign and they were contacted 184 days after the last contact from a previous campaign. There were a total of 6 contacts before this campaign, with the outcome of the previous campaign being successful.###\nHence this label was Yes."
"The client is a 50-year-old married individual working in a blue-collar job with unknown education. They do not have credit in default and have a housing loan. They have an average yearly balance of 123 euros and do not have a personal loan. The communication type for contact is cellular, and the last contact was on the 7th of August for 276 seconds. This is the second contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old married individual working as an admin, with secondary education. They do not have any credit in default and have an average yearly balance of 253 euros. They have a housing loan but no personal loan. The last contact was made on the 9th of May, with a duration of 515 seconds. This client has been contacted 4 times during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The communication type used for contact is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in an administrative role with a tertiary education. They do not have any credit in default and have an average yearly balance of 79 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 5th of August and the call lasted 203 seconds. This was the 1st contact during this campaign, and there were 5 previous contacts. The outcome of the previous marketing campaign was successful, with 92 days passing since the client was last contacted.###\nHence this label was Yes."
"The client is a 40-year-old married individual working in administration with primary education. They do not have credit in default and have a yearly balance of 1314 euros. They have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 29th of May and the call lasted 284 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaigns with the client is unknown.###\nHence this label was No."
"This is a record of a 31-year-old married individual working in management with tertiary education. They do not have credit in default, have a housing loan, but no personal loan. The communication type for the marketing campaign is unknown. The client was last contacted on the 23rd of May and the call lasted for 237 seconds. This was the first contact made during this campaign. The outcome of any previous marketing campaign with this client is also unknown.###\nHence this label was No."
"The client is a 36-year-old married individual working as an admin, with secondary education. They do not have any credit in default, but they have a housing loan. Their average yearly balance is 0 euros and they do not have a personal loan. The bank contacted them via cellular communication, with the last call lasting for 83 seconds on the 24th of April. This was the second call made to the client during this campaign. The client has not been previously contacted. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old divorced technician with secondary education. They do not have credit in default, have a housing loan, and do not have a personal loan. The average yearly balance is 809 euros. The contact communication type is unknown. The last contact was on the 15th day of May, with a duration of 118 seconds. This was the 4th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old single individual working in management with a secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 0 euros. The bank contacted the client via cellular phone on the 22nd of July, with a call duration of 403 seconds. This was the 7th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old single individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 4831. The client was last contacted on the 30th of July via cellular communication, with a call duration of 852 seconds. This is their third contact during this campaign, with 11 contacts made in previous campaigns as well. The outcome of the previous marketing campaign was successful, leading to this contact.###\nHence this label was Yes."
"The client is a 32-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default and have a housing loan. Their average yearly balance is 1148 euros, and they do not have a personal loan. The client was contacted via cellular communication, with the call lasting 121 seconds on the 20th of April. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 53-year-old married individual working in a blue-collar job with primary education. They do not have credit in default, have a housing loan, but do not have a personal loan. They were contacted via cellular communication on the 16th of April and the call duration was 1410 seconds. This client was contacted once during this campaign and twice before. The previous marketing campaign outcome was a failure, and 325 days had passed since they were last contacted. Their average yearly balance is 241 euros.###\nHence this label was No."
"The client is a 53-year-old unemployed single individual with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in July and the call lasted for 259 seconds. This was the client's 3rd contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 4 euros.###\nHence this label was No."
"The client is a 38-year-old divorced individual working in administration with a secondary level education. They do not have any credit in default and have an average yearly balance of 673 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 7th of May, with a call duration of 429 seconds. This is the first contact made during this campaign, but they have been contacted 3 times in previous campaigns. The outcome of the previous marketing campaign was categorized as \"other\".###\nHence this label was No."
"The client is a 33-year-old single technician with tertiary education and no credit in default. They have an average yearly balance of 176 euros and do not have a housing or personal loan. They were contacted via cellular communication on the 29th of August for 112 seconds. This was the second contact made during this campaign, with no previous contacts made. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old divorced individual working in administration with a primary level of education. They do not have credit in default and have an average yearly balance of 179 euros. They have a housing loan but no personal loan. The communication with the client was through a cellular phone. The last contact was made on the 15th of May, lasting 67 seconds. This was the first contact during this campaign, with 368 days passed since the previous campaign contact. Prior to this campaign, the client was contacted two times, with the previous outcome being a failure.###\nHence this label was No."
"The client is a 46-year-old divorced individual working in management with tertiary education. They do not have credit in default, have a housing loan but no personal loan. The average yearly balance is negative at -94 euros. They were contacted via cellular communication, with the last call lasting 183 seconds on the 21st of November. This was the 4th contact during this campaign, with no previous contacts. The outcome of the previous campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working as a blue-collar worker with unknown education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 2284 euros and do not have a personal loan. The communication type used for contact was telephone. The last contact was made on the 31st of July, lasting 1088 seconds. This was the 17th contact made during this campaign, with no previous contacts made. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 35-year-old divorced individual working in the services sector with a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in their account is 305 euros. The client was contacted through an unknown communication type on the 9th of June and the call lasted for 327 seconds. This was the second contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old unemployed individual who is single and has secondary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 31st of July and the call lasted for 40 seconds. This was the 10th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 48 euros.###\nHence this label was No."
"A 25-year-old single technician with a secondary education was contacted via cellphone in July. They have no credit in default, housing loan, or personal loan. They had an average yearly balance of 534 euros. The call lasted 167 seconds, which was the 7th contact attempt during this campaign with them. This client had not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old married blue-collar worker with primary education. They do not have credit in default but have a housing loan. They do not have a personal loan. They were contacted by phone, and the communication type is unknown. The client was last contacted on the 8th of May and the call lasted for 194 seconds. This was the 3rd contact made during this campaign. There is no information on previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married technician with tertiary education. They do not have credit in default and do not have housing or personal loans. The client was contacted via an unknown communication type on the 11th day of June. The last contact duration was 156 seconds, and a total of 2 contacts were made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1454 euros.###\nHence this label was No."
"A 27-year-old single individual working in the services sector with a secondary education was contacted via cellular communication. They have no credit in default, housing loan, or personal loan. They have an average yearly balance of 453 euros. The client was last contacted on the 19th of April and the call lasted for 142 seconds. This was the second contact made during the current campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 35-year-old married individual working in management with a tertiary education. They do not have any credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 9th of February for a 27-second conversation. This was the 7th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 182 euros.###\nHence this label was No."
"The client is a 24-year-old single individual working in a blue-collar job with secondary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The average yearly balance is negative at -10 euros. They were contacted once during the campaign, with the call lasting 106 seconds. The contact was made via an unknown communication type on the 13th day of May. The client had not been contacted in any previous campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old divorced individual working in a management position with tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 6th of May and the call lasted for 248 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3 euros.###\nHence this label was No."
"The client is a 35-year-old married individual working in a management position with a secondary education. They do not have any credit in default but have housing and personal loans. They were contacted via cellular communication and were last contacted on the 16th of April for 348 seconds. This is their third contact during this campaign with no previous contacts. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 2415 euros.###\nHence this label was No."
"The client is a 30-year-old married technician with tertiary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via telephone on the 20th of October and the call lasted 73 seconds. This was the first contact during this campaign. There is no record of previous contact with the client, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 239 euros.###\nHence this label was No."
"The client is a 31-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have an average yearly balance of 1664 euros. They have a housing loan but do not have a personal loan. The bank contacted them via cellular communication on the 20th of April, with a call duration of 158 seconds. This is the second time they have been contacted during this campaign, with 182 days passing since the previous campaign contact. The outcome of the previous marketing campaign was successful, suggesting a positive response from the client.###\nHence this label was No."
"The client is a 55-year-old married individual working in management with a tertiary education. They do not have credit in default and have both a housing loan and a personal loan. The bank typically contacts them via cellular communication. The client was last contacted on the 30th of July and the call lasted 94 seconds. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 2366 euros.###\nHence this label was No."
"The client is a 56-year-old married individual working in a blue-collar job with secondary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via cellular communication on the 14th of August, with a call duration of 265 seconds. This was the second time they were contacted during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1119 euros.###\nHence this label was No."
"The client is a 53-year-old married individual working in a management position with a tertiary education. They do not have any credit in default and have a housing loan. They were contacted via cellular communication on the 21st of May for a duration of 429 seconds. This is the 1st contact during this campaign, with 6 previous contacts. The client has a yearly average balance of 1356 euros and does not have a personal loan. The outcome of the previous marketing campaign was a failure, and the client was last contacted 193 days ago.###\nHence this label was No."
"The client is a 30-year-old single administrative worker with secondary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance is 115 euros. The client was contacted via an unknown communication type on the 6th of May and the call lasted 66 seconds. This was the third contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 45-year-old married individual working in a management position with a secondary level of education. They do not have any credit in default and have a housing loan. They do not have a personal loan. The communication with the client was done via cell phone. The last contact was on the 8th of May and lasted 181 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 458 euros.###\nHence this label was No."
"The client is a 38-year-old single technician with secondary education. They do not have credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication in April and the call lasted 271 seconds. This was the second call during this campaign, with one previous contact 307 days ago that resulted in a failed outcome. The client's average yearly balance is 12,926 euros.###\nHence this label was No."
"The client is a 52-year-old single individual working in a management position with a tertiary education. They do not have credit in default, have a housing loan, but no personal loan. The bank contacted them via cellular communication on the 21st of November, with a call duration of 79 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 5728 euros.###\nHence this label was No."
"The client is a 40-year-old student who is single. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 5349 euros, they do not have any housing or personal loans. The last contact was made on the 6th of June, with a duration of 471 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old married entrepreneur with secondary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in their account is 9902 euros. The bank contacted them via cellular communication on the 18th of June and the call lasted for 88 seconds. This was the third contact made to the client during this campaign. The client was not previously contacted in any previous campaigns and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old married individual working as a blue-collar worker with primary education. They do not have any credit in default and have a housing loan. They were contacted via cellular communication and the last call duration was 983 seconds. This is the 4th time they have been contacted during this campaign. The client has not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 51-year-old single individual working in management with unknown education status. They do not have credit in default but have a housing loan. They do not have a personal loan. The average yearly balance is -461 euros. The contact was made through an unknown communication type, with a call duration of 33 seconds on the 28th of May. This was the second contact during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 48-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The contact communication type is unknown. The client was last contacted on the 9th of May and the call duration was 752 seconds. This is the third time the client is being contacted during this campaign. There was no previous contact with the client from a previous campaign and the outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 231.###\nHence this label was No."
"The client is a 37-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default and have an average yearly balance of 496 euros. They have a housing loan but no personal loan. The communication type during the campaign was unknown. The client was last contacted on the 8th of May and the call lasted for 137 seconds. This was the second contact made during this campaign, with no previous contacts made. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 56-year-old married individual working in the services sector with a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication in August, with the last call lasting 26 seconds on the 27th day of the month. This was the 11th contact made to the client during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown, as the client was not contacted before. Their average yearly balance is 83 euros.###\nHence this label was No."
"The client is a 53-year-old married individual working in management with a tertiary education. They do not have any credit in default and do not have any housing or personal loans. Their average yearly balance is 3754 euros. The bank contacted them via cellular communication on the 22nd of April, and the call lasted 307 seconds. This was the first contact during this campaign, but they were contacted twice in the past. The outcome of the previous marketing campaign for this client was a failure, and they were last contacted 278 days ago.###\nHence this label was Yes."
"The client is a 50-year-old married individual working in management with a tertiary education. They do not have credit in default and do not have any housing or personal loans. The client was contacted via cellular communication on the 18th of November and the call lasted 273 seconds. This was the second contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The average yearly balance in euros for the client is 2570.###\nHence this label was No."
"The client is a 50-year-old divorced individual working in a blue-collar job with primary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in euros is negative. They were contacted via cellular communication on the 10th of July and the call lasted for 387 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown as the client was not previously contacted.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 5th of August and the call lasted for 203 seconds. This was the first contact made during this marketing campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 699 euros and they have not been contacted in any previous campaigns.###\nHence this label was No."
"The client is a 37-year-old unemployed single individual with secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 2722. The communication type is telephone. The last contact was on the 27th of April and lasted 426 seconds. This is the second contact during this campaign and there were 3 previous contacts. The previous marketing campaign outcome was categorized as 'other'.###\nHence this label was Yes."
"The client is a 57-year-old married individual working in a management position with unknown education status. They do not have any credit in default or housing or personal loans. They were contacted via cellular communication and the last call lasted 585 seconds. This was the first contact during this campaign, with no previous contact history. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 32-year-old married individual working in management with tertiary education was contacted via cellular communication. They do not have a housing or personal loan, nor any credit defaults. With an average yearly balance of 2213 euros, they were previously contacted 7 times during the current campaign, with the last contact lasting 73 seconds in August on the 28th day. There is no record of the client being contacted in previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 39-year-old married individual working in a blue-collar job with secondary education. They have a negative yearly balance and have a housing loan. They do not have a personal loan or any credit in default. The communication type during the marketing campaign was unknown. The client was last contacted on the 7th of May for 69 seconds, and this was their first contact in the current campaign. The outcome of the previous marketing campaign is unknown since the client was not contacted before.###\nHence this label was No."
"The client is a 39-year-old married individual working in a blue-collar job with secondary education. They do not have any credit in default, but they have a housing loan. They do not have a personal loan. The bank contacted them via telephone on the last day of October, and the call lasted for 158 seconds. This was the first contact made during this campaign, and there were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1307 euros.###\nHence this label was Yes."
"The client is a 59-year-old married entrepreneur with a tertiary level of education. They do not have credit in default, do not have a housing loan but have a personal loan. The average yearly balance is 1553 euros. The client was last contacted in November via a cellular phone call and the call duration was 79 seconds. This was the second contact made to the client during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working in the services sector with a secondary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 152 euros and do not have a personal loan. The last communication with the client was through an unknown contact method in the month of June on the 2nd day, with a call duration of 563 seconds. This was the first contact made during the current campaign. There is no information on any previous marketing campaign outcome or prior contact with the client.###\nHence this label was Yes."
"The client is a 30-year-old single technician with a secondary education. They do not have credit in default and do not have any housing or personal loans. The communication type used for contacting the client was cellular. The last contact was made on the 5th of February and lasted 363 seconds. This was the 6th contact made during this campaign, with no previous contacts before this one. The outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 11.###\nHence this label was No."
"The client is a 47-year-old married technician with secondary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is 321 euros. The last contact was made on the 4th of July, with a duration of 111 seconds. This was the first contact during the current campaign. The outcome of any previous marketing campaigns is unknown. The communication type used for contact is also unknown.###\nHence this label was No."
"The client is a 35-year-old married technician with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular phone and their last call, which lasted 592 seconds, was on the 5th of August. This was the second call made to the client during this campaign, with no previous contacts. The outcome of the previous campaign is unknown. The client's average yearly balance is 489 euros.###\nHence this label was No."
"The client is a 32-year-old married individual working in a management role with a tertiary education. They do not have any credit in default, housing loan, or personal loan. The communication with the client was done via cellular phone. The client was last contacted on the 19th of August and the call lasted for 198 seconds. This was the 6th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old married individual working in management with a tertiary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 317 euros and do not have a personal loan. The client was contacted through an unknown communication type on the 23rd of May, with the call lasting 162 seconds. This is the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 29-year-old single individual working in the administrative field with secondary education. They do not have any credit in default but have housing and personal loans. Their average yearly balance is 818 euros. The client was contacted via an unknown communication type on the 5th of May for 61 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign for this client is unknown.###\nHence this label was No."
"The client is 45 years old and unemployed, with a single marital status and secondary education. They do not have credit in default and do not have a housing or personal loan. The communication type for the marketing campaign was cellular. The last contact was made on the 5th of February, with a duration of 437 seconds. This was the first contact made during this campaign. There is no information available about any previous marketing campaign outcome. The average yearly balance of the client is 33 euros.###\nHence this label was No."
"The client is a 47-year-old married individual working in a blue-collar job with secondary education. They do not have any credit default and have a housing loan. They have an average yearly balance of 7985 euros and do not have a personal loan. The last contact was made on the 29th of May, with a duration of 347 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown, as the client was not contacted before. The communication type used for contact is unknown.###\nHence this label was No."
"The client is a 31-year-old single individual working in the administration sector with a tertiary education. They do not have any credit in default and have a yearly balance of 5 euros. They do not have a housing loan but have a personal loan. The client was contacted via cellular communication, and the last call lasted 75 seconds. This was the second day of contact in February, with 206 days passing since the client's previous campaign contact. The outcome of the previous marketing campaign was a failure.###\nHence this label was No."
"The client is a 46-year-old married individual working in a blue-collar job with only primary education. They do not have any credit in default but have housing and personal loans. The average yearly balance is negative. The client was contacted via cellular communication, with the last call lasting 250 seconds on the 17th of April. This was the first time they were contacted during this campaign, but they had been contacted twice before in previous campaigns, resulting in failure.###\nHence this label was No."
"The client is a 38-year-old married individual working in management with tertiary education. They do not have credit in default and have a housing loan but no personal loan. The average yearly balance in their account is 5779 euros. The last contact was made on the 23rd of May via an unknown communication type, and it lasted for 75 seconds. This was the third contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 25-year-old single individual working in the administration sector with tertiary education. They do not have credit in default and have an average yearly balance of 760 euros. They have a housing loan but no personal loan. The communication type used for contacting the client is cellular. The client was last contacted on the 27th of May and the call lasted for 223 seconds. This is the third contact made during this campaign, with 89 days elapsed since the client was last contacted from a previous campaign. The client had been contacted twice before for marketing purposes, with the outcome of the previous campaign being a failure.###\nHence this label was Yes."
"The client is a 54-year-old married housemaid with a primary education and no credit default. They have an average yearly balance of 774 euros and do not have a housing or personal loan. The client was contacted via an unknown communication type on the 19th of June for 290 seconds. This is the first contact made with the client during this campaign, and there is no record of any previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 58-year-old retired individual who is divorced and has primary education. They do not have any credit in default, housing loan, or personal loan. The communication type during the marketing campaign was unknown. The client was last contacted on the 16th of May and the call lasted 228 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 30-year-old single individual working in management with a tertiary education was contacted via cellular communication. They do not have a housing or personal loan, nor do they have credit in default. They had an average yearly balance of 1675 euros. The client was previously not contacted for any marketing campaigns. The call lasted 181 seconds, and it was the first contact made during this campaign. The outcome of any previous marketing campaign with this client is unknown.###\nHence this label was No."
"This data represents a 31-year-old single individual working in management with a tertiary education. They do not have a credit in default, housing loan, or personal loan. They were contacted via telephone on the 29th of August and the call lasted 51 seconds. This was the first contact made during the current campaign. There is no information available on any previous marketing campaigns involving this client.###\nHence this label was No."
"The client is a 38-year-old single admin with secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance is 3823 euros. The contact communication type is unknown. The client was last contacted on the 6th of June for 81 seconds. This is the 5th contact during this campaign. The client was not previously contacted, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old single blue-collar worker with secondary education. They do not have credit in default, but have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 2nd day of June and the call lasted 98 seconds. This was the first contact made during this campaign. There is no information on any previous marketing campaign outcomes. The client's average yearly balance is 3561 euros.###\nHence this label was No."
"A 40-year-old single individual working in administration, with secondary education and no credit in default, was contacted via cellphone. They have a housing and personal loan, with an average yearly balance of 462 euros. The last marketing call took place on the 6th of April and lasted 272 seconds. This was the 1st contact during the current campaign, following 4 previous contacts. The outcome of the previous campaign was categorized as 'other', and the client was last contacted 335 days ago.###\nHence this label was No."
"The client is a 40-year-old married individual working in a blue-collar job with unknown education. They do not have any credit in default and have a housing loan but no personal loan. The bank contacted them via cellular communication on the 14th of July for 699 seconds, as part of their third contact in the current campaign. The client has not been contacted in any previous campaigns, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 50-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have a housing loan. The client does not have a personal loan. The bank contacted the client via cellular communication on the 7th day of August. The duration of the call was 46 seconds, and this was the second time the client was contacted during this campaign. There is no record of any previous contact with the client from previous campaigns, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is in the negative, at -54 euros.###\nHence this label was No."
"The client is a 44-year-old married individual working as a blue-collar worker with a secondary education. They do not have any credit in default and have a housing loan. They have an average yearly balance of 577 euros and do not have a personal loan. The last contact was made on the 28th of May through an unknown communication type, lasting 199 seconds. This was the third contact during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old blue-collar worker who is divorced and has primary education. They do not have credit in default and do not have a housing loan, but they do have a personal loan. The average yearly balance in euros is 4805. The communication with the client was done via cellular phone. The last contact was on the 4th of July and lasted for 138 seconds. This was the third contact made during this campaign. There were no previous contacts with the client before this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 49-year-old divorced technician with tertiary education. They do not have credit in default and do not have housing or personal loans. The average yearly balance in euros is 917. The communication type for the marketing campaign was cellular. The client was last contacted on the 11th of August and the call duration was 165 seconds. This was the 6th contact made to the client during this campaign. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 47-year-old married individual working in an administrative role with secondary education. They do not have any credit in default but have a housing loan. Their average yearly balance is 3936 euros and they do not have a personal loan. The bank contacted them via telephone for a short 15-second call on the last day of July. This was the second time they were contacted during this campaign. There were no previous contacts with this client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 42-year-old divorced individual working in a management position with a secondary education. They have credit in default and a housing loan. They do not have a personal loan. The average yearly balance in euros is 923. The communication type for contacting the client is unknown. The last contact was on the 19th of June and lasted for 129 seconds. This is the second time they have been contacted during this campaign. There is no record of previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 53-year-old married individual working in management with a tertiary level of education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 652. The last contact was made on the 5th of June, lasting for 91 seconds. This was the first contact made during this campaign. There is no information available about any previous marketing campaign outcome or contact history. The communication type used for contact is unknown.###\nHence this label was No."
"A 31-year-old single technician with a secondary education, having no credit in default, no housing or personal loan. They were contacted via cellular communication on the 26th of August, with a call duration of 267 seconds. This client was contacted 4 times during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The average yearly balance is 218 euros.###\nHence this label was No."
"The client is a 32-year-old unemployed individual who is single and has completed tertiary education. They do not have any credit in default and have an average yearly balance of 586 euros. They have a housing loan but do not have a personal loan. The client was contacted via cellular communication on the 9th of February and the call lasted for 12 seconds. This was the 5th contact made to the client during this campaign. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 30-year-old single individual working in management with a tertiary education. They do not have any credit in default and do not have any existing housing or personal loans. They were contacted via cellular communication on the 14th of September. The client's average yearly balance is 13774 euros. The duration of the last contact was 380 seconds, and it was the first contact made during this campaign. There is no record of any previous marketing campaign outcome or contact history with this client.###\nHence this label was No."
"The client is a 39-year-old married individual working in the services sector with secondary education. They do not have credit in default and have housing and personal loans. They were contacted via cellular communication on the 8th of May and the call lasted for 40 seconds. This was the 6th contact made during this campaign, with 2 previous contacts made before. The client was last contacted 343 days ago from a previous campaign, which ended in failure. Their average yearly balance is -762 euros.###\nHence this label was No."
"The client is a 37-year-old married individual working in the administration sector with unknown education status. They do not have any credit in default and have a housing loan. They do not have a personal loan. The client was contacted via cellular communication and the last call duration was 269 seconds. This is the 17th contact made to the client during this campaign. The last contact was made on the 30th of July. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 892 euros.###\nHence this label was No."
"The client is a 25-year-old single blue-collar worker with a secondary education. They do not have credit in default and have a housing loan. They were contacted via an unknown communication type, with the last call lasting 156 seconds. This was the 5th contact made during this campaign. The client was not contacted in any previous campaigns, and the outcome of the previous campaign is unknown. The client has an average yearly balance of 352 euros and does not have a personal loan. The last contact was made on the 30th of May.###\nHence this label was No."
"The client is a 34-year-old single individual working as a blue-collar worker with primary education. They do not have any credit in default and have an average yearly balance of 4260 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 15th of May, and the call lasted 375 seconds. This was the first contact made during this campaign, and there was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 57-year-old divorced individual working in an administrative role with a secondary level of education. They do not have any credit in default and have an average yearly balance of 1878 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication on the 17th of November for 219 seconds. This was the first contact made during this campaign, and there was no previous contact. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old single individual working in a management role with a tertiary education. They do not have any credit in default and have an average yearly balance of 293 euros. They have a housing loan but do not have a personal loan. The communication with the client was made through a cellular phone call, which lasted for 265 seconds. The call was made on the 14th of May as part of a marketing campaign, and it was the first contact attempt for this client. The outcome of any previous marketing campaigns with this client is unknown.###\nHence this label was No."
"A 29-year-old married blue-collar worker with secondary education, having no credit in default, a yearly balance of 296 euros, a housing loan, and no personal loan was contacted via an unknown communication type on the 4th of June. The call lasted for 153 seconds, and it was the first contact made during this campaign. There is no record of any previous contact or outcome from a previous marketing campaign.###\nHence this label was No."
"The client is a 54-year-old married housemaid with primary education. They do not have any credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via telephone on the 23rd of July, with a call duration of 70 seconds. This was the 2nd contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The average yearly balance of the client is 1319 euros.###\nHence this label was No."
"The client is a 55-year-old unemployed married individual with secondary education. They have credit in default, a yearly balance of 1108 euros, a housing loan, and a personal loan. They were contacted via an unknown communication type on the 2nd of June for a duration of 75 seconds. This was the 4th contact during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 38-year-old single entrepreneur with tertiary education. They have credit in default and a negative average yearly balance. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 18th of May, with a call duration of 119 seconds. This is the fourth contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 78-year-old retired individual who is married and has primary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 7th of September and the call lasted 537 seconds. This was the second time they were contacted during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 301 euros.###\nHence this label was No."
"The client is a 27-year-old self-employed individual who is single and holds a tertiary education. They do not have any credit in default but have a housing loan. The client's average yearly balance is -503 euros, indicating a negative balance. They do not have a personal loan. The communication type during the marketing campaign is unknown. The last contact with the client was on the 9th of May, with a duration of 98 seconds. This is the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is also unknown.###\nHence this label was No."
"The client is a 33-year-old married individual working in the services sector with secondary education. They do not have credit in default and have a housing loan but no personal loan. They were contacted via cellular communication on the 16th of April and the call lasted for 370 seconds. This was the first contact made during this campaign, with 3 previous contacts made in the past. The client was last contacted 146 days ago, and the outcome of the previous marketing campaign was a failure. Their average yearly balance is 1397 euros.###\nHence this label was No."
"The client is a 43-year-old married individual working as a blue-collar worker with primary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication. The last contact was made on the 12th of May and lasted for 144 seconds. This client has been contacted 5 times during this campaign and 16 times before. The previous marketing campaign with this client was unsuccessful. The average yearly balance is 250 euros.###\nHence this label was No."
"The client is a 57-year-old married technician with secondary education. They do not have credit in default but have a housing loan. They were contacted via an unknown communication type on the 14th of May. The client's average yearly balance is 3240 euros, and they do not have a personal loan. The last contact duration was 129 seconds, and this was the second contact made during this campaign. There is no record of previous contacts or the outcome of any previous marketing campaigns.###\nHence this label was No."
"The client is 35 years old, self-employed, and married with a tertiary education. They do not have any credit in default and do not have any housing or personal loans. The client was contacted via cellular communication and the last call lasted 335 seconds. This was the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 1987 euros. The last contact was made on the 8th of August.###\nHence this label was No."
"The client is a 34-year-old married individual working in a management role with tertiary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance in euros is 496. The communication type for contact is cellular. The last contact was made on the 12th of August and lasted 105 seconds. This client has been contacted 6 times during this campaign, with no prior contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 44-year-old divorced housemaid with secondary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 17th of November and had a successful call duration of 475 seconds. This was their first contact during this campaign. The outcome of the previous marketing campaign for this client is unknown. The average yearly balance in their account is 653 euros.###\nHence this label was No."
"The client is a 49-year-old married individual working in the services sector with primary education. They do not have any credit in default and have a housing loan. The client does not have a personal loan. The bank contacted the client via cellular communication on the 13th of August and the call lasted for 261 seconds. This was the second time the client was contacted during this campaign, with 179 days passing since the last contact from a previous campaign. The outcome of the previous marketing campaign with the client was successful.###\nHence this label was Yes."
"A married 50-year-old entrepreneur with a tertiary education and no credit in default was contacted via telephone on the 30th of July. The client had an average yearly balance of 230 euros, did not have a housing or personal loan, and had a 1089-second long conversation during the call. This was the 4th contact made during this campaign, with no previous contacts recorded. The outcome of the previous marketing campaign was unknown.###\nHence this label was Yes."
"The client is a 35-year-old married technician with tertiary education. They do not have any credit in default but have a housing loan. They have a yearly average balance of 8029 euros and do not have a personal loan. The client was contacted via cellular communication and the last call lasted 167 seconds. This was the first contact during this campaign, but they were contacted 4 times in previous campaigns. The previous marketing campaign was successful, resulting in the client subscribing to a term deposit. The last contact was made on the 26th of May, after 285 days since the previous campaign.###\nHence this label was No."
"The client is a 33-year-old single admin worker with primary education. They do not have credit in default and have a negative average yearly balance. They have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 28th of May. The call duration was 193 seconds and this was the second contact during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 32-year-old married technician with unknown education and no credit in default. They have an average yearly balance of 1879 euros and do not have a housing or personal loan. The contact communication type is unknown. The client was last contacted on the 19th of May and the call duration was 115 seconds. This is the first contact made during this campaign and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 55-year-old retired married individual with secondary education. They do not have credit in default, a housing loan, or a personal loan. The communication type used during the marketing campaign is unknown. The client was last contacted on the 18th of June for 72 seconds. This was the first contact made with the client, as there were no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 31 euros.###\nHence this label was No."
"The client is a 36-year-old married technician with secondary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance is 295 euros. The client was contacted via cellular communication on the 12th of August and the call lasted 129 seconds. This is the 6th contact made during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 55-year-old divorced individual working in management with a tertiary education. They do not have credit in default and have an average yearly balance of 2171 euros. They have a housing loan and a personal loan. The bank contacted them via telephone on the 13th of May, with the call lasting 318 seconds. This was the 5th contact made during this campaign and there was a gap of 176 days since the client was last contacted from a previous campaign. The outcome of the previous marketing campaign was successful.###\nHence this label was No."
"The client is a 39-year-old married individual working in a blue-collar job with secondary education. They have a negative yearly balance of -931 euros and have a housing loan. They do not have a personal loan and have a credit in default. The client was last contacted on the 28th of May for 92 seconds as part of a campaign where they were contacted 5 times. There is no record of previous contact with this client. The outcome of the previous marketing campaign is unknown, as well as the communication type used for contact in the current campaign.###\nHence this label was No."
"The client is a 53-year-old married individual working in the services sector with secondary education. They do not have credit in default but have housing and personal loans. The average yearly balance is negative. They were contacted via cellular communication on the 16th of April, with a call duration of 144 seconds. This is their second contact during the current campaign, with no previous contacts recorded. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 26-year-old married technician with a tertiary education. They do not have credit in default but have a housing loan. They have a negative average yearly balance. They were contacted once during this campaign, with the last contact being on the 3rd of June for 320 seconds. There were no previous contacts with this client, and the outcome of the previous marketing campaign is unknown. The client does not have a personal loan. The communication type for contact is unknown.###\nHence this label was No."
"The client is a 39-year-old single individual working as a blue-collar worker with a secondary education. They do not have any credit in default and have an average yearly balance of 383 euros. The client has a housing loan and a personal loan. The bank contacted them via cellular communication, reaching out on the 4th of February for a duration of 292 seconds. This was the second contact made during this campaign with no previous interactions. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 40-year-old married individual working in a management position with a secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance in euros is 106. The communication type during the marketing campaign was unknown. The client was last contacted on the 17th of June and the call duration was 676 seconds. This was the second call made to the client during this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 52-year-old married housemaid with primary education. They do not have credit in default, a housing loan, or a personal loan. The average yearly balance in euros is 335. The communication type used for contact is cellular. The client was last contacted on the 22nd of August and the call duration was 217 seconds. This is the 5th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 55-year-old married housemaid with primary education, who does not have credit in default and does not have a housing loan. They have a personal loan. The average yearly balance is 43 euros. The contact communication type is unknown. The last contact was on the 26th of June, with a duration of 464 seconds. This is the third contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 37-year-old married individual working in a management position with unknown education background. They have credit in default, a housing loan, but no personal loan. The bank made 4 phone calls to the client, reaching them on their cellular phone in July. The last call lasted for 85 seconds, and it was the first contact for this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 62 euros.###\nHence this label was No."
"The client is a 31-year-old married individual working in management with a tertiary education. They do not have any credit in default and have an average yearly balance of 537 euros. They have a housing loan but no personal loan. The communication with the client was through a cellular phone call on the 18th of August, with a call duration of 216 seconds. This was the first call made to the client during this campaign. The outcome of any previous marketing campaign with the client is unknown.###\nHence this label was Yes."
"The client is a 31-year-old single technician with secondary education. They do not have credit in default, have a housing loan but no personal loan. The bank usually contacts them via cellular communication. The last contact was on the 17th of April, with a duration of 660 seconds. This is the third time they have been contacted during this campaign. The outcome of the previous marketing campaign is unknown. Their average yearly balance is 538 euros.###\nHence this label was No."
