"The client is a 46-year-old married individual working in the services sector with a secondary level of education. They do not have any credit in default, housing loan, or personal loan. The communication with the client was through a cellular phone call on the 21st of August. The call lasted for 139 seconds, and this was the second contact made during this campaign. The client had not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 244 euros.###\nHence this label was No."
"The client is a 42-year-old married individual working in management with tertiary education. They do not have credit in default, housing loan, or personal loan. The bank contacted them via cellular communication on the 7th of December for 143 seconds. This was the 1st contact made during this campaign, following 3 previous contacts. The outcome of the previous marketing campaign was a failure. The client's average yearly balance is 144 euros.###\nHence this label was No."
"A 37-year-old married individual who works as a blue-collar employee and has primary level education was contacted for a marketing campaign. They do not have credit in default and do not have a personal loan, but they do have a housing loan. The contact was made via an unknown communication type in the month of May. The call lasted for 24 seconds, and this was the first contact made to the client during this campaign. The client's average yearly balance is 0 euros. Data on previous marketing campaigns with this client is not available.###\nHence this label was No."
"The client is a 40-year-old married individual working in the services sector with secondary education. They do not have credit in default but have housing and personal loans. Their average yearly balance is 5248 euros. The bank contacted them via cellular communication on the 20th of November, with a call duration of 194 seconds. This is the 4th contact made during this campaign, with 188 days passed since the last contact from a previous campaign. There have been a total of 8 contacts with this client before the current campaign, with the outcome of the previous marketing campaign being categorized as \"other\".###\nHence this label was No."
"The client is a 46-year-old married technician with tertiary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 19th of November and the call lasted 499 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign for this client is unknown. The client has an average yearly balance of 3941 euros.###\nHence this label was No."
"The client is a 57-year-old divorced individual working in management with tertiary education. They do not have credit in default and have an average yearly balance of 6468 euros. They have a housing loan but no personal loan. The client was contacted via cellular communication, with the last call lasting 684 seconds on the 31st of March. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 41-year-old married technician with a tertiary education. They do not have credit in default, a housing loan, but have a personal loan. The bank contacted them via cell phone on the 29th of July, with a call duration of 204 seconds. This was the third call made to the client during this campaign. There were no previous contacts with the client, and the outcome of the previous campaign is unknown. The client's average yearly balance is 91 euros.###\nHence this label was No."
"The client is a 26-year-old unemployed single individual with a secondary education. They do not have any credit in default and do not have any existing housing or personal loans. The bank contacted them via cellular communication, and the call lasted 218 seconds. This was the first contact made during the current campaign. The client's average yearly balance is 632 euros. The previous outcome of the marketing campaign is unknown.###\nHence this label was Yes."
"The client is a 50-year-old married technician with secondary education. They do not have credit in default, but they have a housing loan. They do not have a personal loan. The client was contacted via an unknown communication type on the 6th of June. The call lasted 103 seconds, and this was the second time they were contacted during this campaign. There was no previous contact with the client before this campaign, and the outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3503 euros.###\nHence this label was No."
"The client is a 47-year-old married entrepreneur with a secondary education. They do not have credit in default and do not have any housing or personal loans. The average yearly balance in euros is 8480. The communication type used for contacting the client was cellular. The last contact was made on the 29th of August and lasted 137 seconds. During this campaign, the client was contacted 9 times. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old married individual working in management with a tertiary education. They do not have credit in default and have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication on the 6th day of May. The call lasted 181 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign with this client is unknown. The client's average yearly balance is 2640 euros.###\nHence this label was No."
"The client is a 50-year-old married individual working in administration with a secondary education. They do not have any credit in default, housing loan, or personal loan. The average yearly balance is negative at -185 euros. The client was contacted via cellular communication on the 2nd day of February, with a call duration of 97 seconds. This was the first contact made during this campaign, and there were no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 46-year-old divorced technician with secondary education. They do not have credit in default, housing loan, or personal loan. They were contacted via cellular communication on the 11th of August and the call lasted 105 seconds. This was the second time they were contacted during this campaign. There is no record of previous contact. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 256 euros.###\nHence this label was No."
"The client is a 58-year-old self-employed individual who is divorced with a secondary level of education. They do not have any credit in default and have an average yearly balance of 613 euros. They have a housing loan but no personal loan. The last contact was made on the 8th of May via an unknown communication type, with a duration of 154 seconds. This is the second time they have been contacted during the current campaign, and they have not been contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 35-year-old entrepreneur who is single and has tertiary education. They have credit in default, but do not have a housing loan. They have a personal loan. The bank contacted them via cellular communication on the 8th of July, and the call lasted for 163 seconds. This was the first contact during this campaign. The outcome of any previous marketing campaign with this client is unknown. The client's average yearly balance is 793 euros.###\nHence this label was No."
"The client is a 40-year-old married individual working in management with primary education. They do not have any credit in default and have a housing loan but no personal loan. They were contacted via cellular communication, and the last call lasted 232 seconds on the 22nd of April. This was the 4th contact made during this campaign, with no previous contacts. The outcome of the previous campaign is unknown. The client's average yearly balance is 395 euros.###\nHence this label was Yes."
"The client is a 36-year-old married individual working as a blue-collar worker with secondary education. They do not have any credit in default and have a housing loan but no personal loan. The average yearly balance is 139 euros. The client was last contacted in May on the 6th day for 309 seconds, as part of the second contact made during the current campaign. There is no information on previous campaign contact outcomes. The communication type is listed as unknown.###\nHence this label was No."
"The client is a 39-year-old single individual working in management with a tertiary education. They do not have any credit in default and have an average yearly balance of 202 euros. They have a housing loan but no personal loan. The bank contacted them via cellular communication on the 12th of May, with a call duration of 59 seconds. This is the second time they have been contacted during this campaign, with 301 days passing since the previous contact. The outcome of the previous marketing campaign was classified as 'other'.###\nHence this label was No."
"The client is a 37-year-old entrepreneur who is divorced. They have a secondary level of education and do not have any credit in default. With an average yearly balance of 1190 euros, they have a housing loan but no personal loan. The client was contacted via an unknown communication type on the 9th of May, with a call duration of 268 seconds. It was the third contact made during this campaign. There were no previous contacts with the client before this campaign, and the outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 50-year-old married technician with tertiary education, having no credit in default, an average yearly balance of 5907 euros, a housing loan, and a personal loan was contacted via cellular communication on the 12th of August. The call lasted for 338 seconds and it was the 2nd contact made during this campaign. The client was not contacted previously. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 34-year-old single technician with tertiary education. They do not have credit in default, have a housing loan but no personal loan. The bank contacted them via cellular communication on the 5th of February and the call lasted for 71 seconds. This was the second contact made during this campaign. There was no previous contact with the client. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 992 euros.###\nHence this label was Yes."
"The client is a 36-year-old single individual working in the administrative field with tertiary education. They do not have any credit in default and have an average yearly balance of 5007 euros. They have a housing loan but no personal loan. The communication with the client was done via cellular phone. The last contact was made on the 8th of October and lasted 135 seconds. This was the 3rd contact during this campaign and there were 4 contacts before this campaign. The previous marketing campaign outcome was a failure, and the client was last contacted 331 days ago.###\nHence this label was No."
"The client is a 37-year-old married technician with secondary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The communication type for contact is unknown. The client was last contacted on the 7th of May for 238 seconds, which was the 2nd contact in this campaign. There were no previous contacts with the client. The outcome of the previous marketing campaign is unknown. The average yearly balance in euros is 157.###\nHence this label was No."
"The client is a 41-year-old married individual working in the services sector with secondary education. They do not have any credit in default and have a housing loan. They were contacted via cellular communication on the 11th of May for a duration of 305 seconds. This is the first contact made during this campaign. The outcome of the previous marketing campaign is unknown. The client has an average yearly balance of 1319 euros and does not have a personal loan.###\nHence this label was No."
"The client is a 59-year-old retired married individual with primary education. They do not have credit in default but have a housing loan. They do not have a personal loan. The bank contacted them via cellular communication and the last call duration was 515 seconds. This is the third time they have been contacted during this campaign. The client was not contacted in any previous campaigns. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 3400 euros. The last contact with the client was on the 5th of August.###\nHence this label was Yes."
"The client is a 40-year-old single individual working as an admin, with secondary education. They do not have credit in default, housing loan, or personal loan. The average yearly balance is 664 euros. The bank contacted them via cellular communication on the 19th of November, with a call duration of 188 seconds. This is the second time they have been contacted during this campaign, after 121 days from the previous contact. The outcome of the previous marketing campaign was successful.###\nHence this label was No."
"The client is a 36-year-old self-employed individual who is married with a tertiary education. They do not have any credit in default and have a housing loan but no personal loan. The communication type during the marketing campaign was unknown. The client was last contacted on the 28th of May for 64 seconds. This was the 4th contact made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 15 euros.###\nHence this label was No."
"The client is a 38-year-old single individual working in the services sector with secondary education. They do not have credit in default and have an average yearly balance of 7695 euros. They have a housing loan but no personal loan. The communication type for the marketing campaign is unknown. The client was last contacted on the 14th of May and the call lasted 193 seconds. This is the second contact made during this campaign, with no prior contacts. The outcome of the previous marketing campaign for this client is also unknown.###\nHence this label was No."
"The client is a 59-year-old divorced individual working in management with primary education. They do not have credit in default and have a housing loan. Their average yearly balance is 13308 euros and they do not have a personal loan. The last contact was made on the 13th of May through an unknown communication type, with a duration of 131 seconds. This was the first contact made during this campaign. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"The client is a 28-year-old student who is single and has tertiary education. They do not have any credit in default, housing loan, or personal loan. The bank contacted them via cellular communication. The last contact was made on the 30th of April and lasted for 384 seconds. This was the 1st contact during this campaign, but the 7th overall. The outcome of the previous marketing campaign was categorized as 'other'. The client's average yearly balance is 3054 euros.###\nHence this label was Yes."
"The client is a 41-year-old married individual working in the services sector with a tertiary education. They do not have credit in default and have an average yearly balance of 412 euros. They have a housing loan but do not have a personal loan. The communication type for the contact is unknown. The client was last contacted on the 3rd day of June and the call lasted for 154 seconds. This is the 5th contact made to the client during this campaign, with no previous contacts. The outcome of the previous marketing campaign is unknown.###\nHence this label was No."
"A 24-year-old single blue-collar worker with a secondary education and no credit in default was contacted via cellular communication. They have a housing loan but no personal loan. During the current campaign, they were contacted 10 times, with the last call lasting 16 seconds on the 18th day of May. This is the first time they have been contacted for this campaign. The outcome of the previous marketing campaign is unknown. The client's average yearly balance is 6 euros.###\nHence this label was No."
