"The individual has not donated blood in 14 months, has donated a total of 7 times, amounting to 1750 c.c., and has been donating blood for 72 months.###\nHence this label was No."
"The individual donated blood once 14 months ago, giving a total of 250cc. This was the first donation made by the individual, and they have not donated blood since then.###\nHence this label was No."
"The individual has not donated blood for 21 months and has donated a total of 2 times. They have donated a total of 500 cc of blood over a period of 25 months since their first donation.###\nHence this label was No."
"The individual has donated blood three times in the past, with the most recent donation being 11 months ago. In total, they have donated 750 cubic centimeters of blood. They have been donating blood for a total of 28 months.###\nHence this label was No."
"The individual donated blood 6 times in the past, with the most recent donation occurring 2 months ago. The total amount of blood donated is 1500 cubic centimeters. They have been donating blood for 28 months in total.###\nHence this label was No."
"The individual has not donated blood in 16 months, but has donated a total of 16 times, resulting in 4000 cc of blood given. They have been donating for 77 months.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation occurring 4 months ago. The total amount of blood donated is 1250 c.c. and they have been donating for 58 months since their first donation.###\nHence this label was No."
"The individual donated blood once in the past, with a total of 250 cubic centimeters donated. The last donation was 2 months ago, and they have been donating for 2 months in total.###\nHence this label was No."
"The individual has donated blood 17 times, with the last donation being 3 months ago. The total amount of blood donated is 4250 c.c. and they have been donating for 86 months since their first donation.###\nHence this label was No."
"The individual donated blood 3 times, with the most recent donation being 2 months ago. They have donated a total of 750 c.c. of blood over the course of 75 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 13 times, with the most recent donation occurring 21 months ago. Over a period of 57 months since the first donation, a total of 3250 cubic centimeters of blood has been donated.###\nHence this label was No."
"The individual donated blood once in the past, giving a total of 250cc. The last donation was 2 months ago, and they have been donating for 2 months in total.###\nHence this label was Yes."
"The individual has donated blood three times in the past, with the most recent donation being 21 months ago. They have donated a total of 750 c.c. of blood over a period of 26 months since their first donation.###\nHence this label was No."
"The individual has donated blood 16 times, with the most recent donation being 4 months ago. Over the course of 98 months, they have donated a total of 4000 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood twice in the past, with the last donation being 2 months ago. The total amount of blood donated is 500 cubic centimeters. They have been donating blood for a total of 4 months.###\nHence this label was No."
"This individual donated blood once two months ago, giving a total of 250cc. They have been donating for only 2 months.###\nHence this label was No."
"The individual donated blood 4 months ago for the first time, and has donated a total of 250 c.c. of blood so far.###\nHence this label was Yes."
"The individual has donated blood twice in the past, with the most recent donation occurring 2 months ago. The total amount of blood donated is 500 c.c. and the individual has been donating for 22 months.###\nHence this label was No."
"The individual has donated blood 12 times, with the most recent donation being 4 months ago. The total amount of blood donated is 3000 c.c. They have been donating blood for 88 months.###\nHence this label was No."
"The individual has not donated blood for 16 months and has donated a total of 3 times, resulting in 750cc of blood donated. They have been donating for the past 50 months.###\nHence this label was No."
"The individual has donated blood 6 times, with the most recent donation being 4 months ago. They have donated a total of 1500 c.c. of blood over the course of 35 months since they first started donating.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation being 23 months ago. Over the course of 64 months since the first donation, they have donated a total of 2000 c.c. of blood.###\nHence this label was No."
"This individual last donated blood 11 months ago, has donated a total of 2 times, which amounts to 500cc of blood. They have been donating for 38 months.###\nHence this label was Yes."
"The individual has donated blood recently, 2 months ago. They have a high frequency of donations, with a total of 50 donations. In total, they have donated a large amount of blood, 12500 cubic centimeters. They have been donating for a long time, 98 months since their first donation.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250 c.c. of blood, two months ago. They have been donating blood for two months.###\nHence this label was Yes."
"The individual has donated blood recently, 4 months ago, and has donated a total of 5 times, resulting in a total of 1250 c.c. of blood donated. They have been donating for a period of 14 months.###\nHence this label was Yes."
"The individual has donated blood 4 times in total. The last donation was 2 months ago, and they have been donating for 14 months. The total amount of blood donated is 1000 cubic centimeters.###\nHence this label was No."
"The individual donated blood 3 times in the past, with the most recent donation being 11 months ago. The total amount of blood donated is 750 cubic centimeters. The individual has been donating blood for 26 months.###\nHence this label was No."
"The individual donated blood once, with a total of 250cc, just 2 months after their first donation, and has not donated blood for 2 months since then.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the most recent donation being 14 months ago. The total amount of blood donated is 1000 c.c. and they have been donating blood for 26 months in total.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 14 months ago. The total amount of blood donated is 1250 c.c. The individual has been donating blood for the past 74 months.###\nHence this label was No."
"The individual has donated blood 6 times, with the last donation being 14 months ago. The total amount of blood donated is 1500 c.c. Their first donation was 51 months ago.###\nHence this label was No."
"The individual donated blood 2 times in the past, with the most recent donation being 9 months ago. Over a period of 52 months since the first donation, they have donated a total of 500 c.c. of blood.###\nHence this label was No."
"The individual donated blood once 14 months ago, giving a total of 250cc. This was their first donation, and they have not donated since then.###\nHence this label was No."
"The individual has donated blood 11 times in total, with the most recent donation being 11 months ago. They have donated a total of 2750 c.c. of blood over a period of 42 months since their first donation.###\nHence this label was No."
"The individual donated blood 3 times in total, with the most recent donation being 13 months ago. The total amount of blood donated is 750 c.c. The individual has been donating blood for 14 months.###\nHence this label was Yes."
"The individual has donated blood 4 times in total, with the most recent donation being 2 months ago. Over a period of 35 months since the first donation, they have donated a total of 1000 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood 10 times, with the most recent donation being 8 months ago. They have donated a total of 2500 c.c. of blood over a period of 63 months since their first donation.###\nHence this label was No."
"This individual last donated blood 16 months ago, has donated a total of 1 time, totaling 250 c.c. of blood, and has been donating for 16 months since their first donation.###\nHence this label was No."
"The individual has donated blood 14 times, with the most recent donation being 3 months ago. Over the course of 35 months, they have donated a total of 3500 c.c. of blood.###\nHence this label was No."
"The individual has donated blood 4 times in the past, with the most recent donation being 4 months ago. In total, they have donated 1000 cubic centimeters of blood. They have been donating blood for 18 months.###\nHence this label was No."
"The individual has donated blood 11 times, with the most recent donation being 4 months ago. Over the course of 64 months, they have donated a total of 2750 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250 c.c. two months ago. They have been donating for a total of two months.###\nHence this label was Yes."
"The individual donated blood once two months ago, giving a total of 250 c.c. They have been donating for a total of two months since their first donation.###\nHence this label was No."
"The individual donated blood 3 times, with the most recent donation being 2 months ago. Over the course of 14 months, they donated a total of 750 cc of blood.###\nHence this label was No."
"The individual has donated blood recently, 2 months since the last donation. They have a history of being a frequent donor, with a total of 14 donations made. In total, they have donated 3500 c.c. of blood. The individual has been donating for a relatively long time, 48 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood for a total of 4 times, with the most recent donation being 11 months ago. They have donated a total of 1000 c.c. of blood over a period of 28 months since their first donation.###\nHence this label was No."
"The individual has donated blood 5 times, with the most recent donation being 11 months ago. In total, they have donated 1250 c.c. of blood over the course of 33 months since they started donating.###\nHence this label was No."
"The individual has donated blood 14 times in total, with the most recent donation being 4 months ago. The total amount of blood donated is 3500 c.c. and they have been donating for the past 40 months.###\nHence this label was No."
"The individual has donated blood 3 times in total, with the most recent donation being 4 months ago. Over the course of 25 months, they have donated a total of 750 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood 6 times in total, with the most recent donation being 4 months ago. They have donated a total of 1500 c.c. of blood over a period of 35 months since their first donation.###\nHence this label was No."
"The individual donated blood 14 times, with the most recent donation being 1 month ago. Over the course of 95 months, they have donated a total of 3500 c.c. of blood.###\nHence this label was No."
"The individual donated blood once, 2 months ago, giving a total of 250 c.c. The first donation was also made 2 months ago.###\nHence this label was No."
"The individual has donated blood 8 times, with the most recent donation being 13 months ago. In total, they have donated 2000 c.c. of blood over a period of 26 months since their first donation.###\nHence this label was No."
"The individual donated blood 13 times in total, with the most recent donation being 1 month ago. Over the course of 47 months, they have donated a total of 3250 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood 2 times, with the most recent donation being 4 months ago. The total amount donated is 500 c.c. and they have been donating for 30 months.###\nHence this label was No."
"The individual has donated blood five times in total, with the most recent donation being 4 months ago. They have donated a total of 1250 c.c. of blood over a period of 35 months since their first donation.###\nHence this label was Yes."
"The individual has not donated blood in 16 months, has donated blood 3 times in total, contributing a total of 750 c.c. of blood. They have been donating blood for 21 months.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 11 months ago. The total amount of blood donated is 1250 c.c. and they have been donating for a period of 18 months.###\nHence this label was No."
"The individual has donated blood twice before, with the last donation being 21 months ago. In total, they have donated 500 cubic centimeters of blood. They have been donating blood for 26 months.###\nHence this label was No."
"The individual has donated blood 14 times, with the last donation being 20 months ago. They have donated a total of 3500 c.c. of blood over a period of 69 months since their first donation.###\nHence this label was Yes."
"The individual donated blood 2 times, with the most recent donation being 4 months ago. They have donated a total of 500cc of blood over a period of 52 months since their first donation.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the last donation being 14 months ago. They have donated a total of 1000 c.c. of blood over a period of 38 months since they first started donating.###\nHence this label was No."
"The individual donated blood once, giving a total of 250cc, and it has been 4 months since their last donation. They have been donating for 4 months in total.###\nHence this label was No."
"The individual has donated blood once, giving a total of 250 c.c. of blood. The last donation was 11 months ago, and they have been donating for 11 months in total.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the last donation being 3 months ago. Over the span of 29 months since their first donation, they have contributed a total of 1000 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood 2 times, with the most recent donation occurring 6 months ago. This person has donated a total of 500 cubic centimeters of blood over the span of 11 months since their first donation.###\nHence this label was Yes."
"The individual donated blood once 14 months ago, giving a total of 250cc. They have been a blood donor for 14 months.###\nHence this label was No."
"The individual donated blood once 4 months ago, giving a total of 250 c.c. of blood. They have been donating for 4 months now.###\nHence this label was No."
"The individual donated blood once 21 months ago, contributing a total of 250 c.c. of blood. This was also the first time they donated blood.###\nHence this label was Yes."
"The individual has donated blood 6 times, the last donation being 4 months ago. The total amount of blood donated is 1500 c.c. The time since the first donation is 41 months.###\nHence this label was Yes."
"The individual has donated blood twice in the past, with the most recent donation occurring 23 months ago. They have donated a total of 500 cubic centimeters of blood over a period of 38 months since their first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250cc, 4 months ago. This was their first donation and they have not donated since.###\nHence this label was No."
"The individual donated blood 2 months ago for the first time, then donated a total of 250 c.c. of blood after that. It has been 2 months since their last donation.###\nHence this label was No."
"The individual donated blood 2 times in total, with the last donation being 4 months ago. They have donated a total of 500 c.c. of blood over a period of 4 months since they first started donating.###\nHence this label was Yes."
"The individual has donated blood 6 times, with the most recent donation being 4 months ago. The total amount of blood donated is 1500 cubic centimeters, and they have been donating for 28 months.###\nHence this label was Yes."
"The individual last donated blood 11 months ago, has donated a total of 3 times, amounting to 750 cc, and has been donating for 15 months.###\nHence this label was No."
"The individual has donated blood 6 times, with the most recent donation being 16 months ago. The total amount of blood donated is 1500 c.c. and they have been donating for a period of 40 months. Based on this information, we aim to predict whether this person will consent to donate blood again.###\nHence this label was No."
"The individual donated blood 5 times in total, with the most recent donation being 16 months ago. The total amount of blood donated is 1250 c.c. and they have been donating for the past 71 months.###\nHence this label was No."
"This individual donated blood once, giving a total of 250 c.c. It has been 21 months since their first donation and their most recent donation was also 21 months ago. The task is to predict whether they will consent to donate blood again in the future.###\nHence this label was No."
"The individual has donated blood three times, with the most recent donation occurring 6 months ago. The total amount of blood donated is 750 cubic centimeters. They have been donating blood for 14 months.###\nHence this label was No."
"The individual donated blood 2 times, with the last donation occurring 4 months ago. Over 500cc of blood has been donated in total since they started donating 29 months ago.###\nHence this label was No."
"The individual has donated blood 7 times in total, with the most recent donation being 14 months ago. Over the course of 73 months since the first donation, they have donated a total of 1750 c.c. of blood.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 c.c. of blood, 14 months ago. This was also their first donation, indicating they are a relatively new donor.###\nHence this label was No."
"The individual has donated blood 6 times in total, with the most recent donation being 2 months ago. Over the course of 28 months since their first donation, they have donated a total of 1500 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood 9 times, with the most recent donation being 4 months ago. In total, they have donated 2250 c.c. of blood over a period of 28 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood twice in the past and a total of 500cc of blood. Their last donation was 21 months ago, and they have been donating for a total of 23 months.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the most recent donation being 11 months ago. Over the course of 34 months since their first donation, they have donated a total of 1000 c.c. of blood.###\nHence this label was No."
"The individual has not donated blood for 14 months, has donated a total of 2 times, giving a total of 500cc of blood, and has been donating for 35 months.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 4 months ago. The total amount of blood donated is 1250 c.c. and they have been donating for 33 months.###\nHence this label was Yes."
"The individual donated blood once 11 months ago, giving a total of 250cc. This was the first time they donated blood, suggesting they might be a new donor.###\nHence this label was No."
"The individual last donated blood 23 months ago, has donated a total of 2 times, amounting to 500 c.c. of blood, and has been donating for 23 months in total.###\nHence this label was No."
"The individual donated blood 5 times in total, with the most recent donation being 4 months ago. They have donated a total of 1250 cubic centimeters of blood over a period of 23 months since their first donation.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250 c.c., just 4 months after their first donation.###\nHence this label was No."
"The individual has donated blood 3 times, with the last donation being 14 months ago. In total, they have donated 750 c.c. of blood over a period of 35 months since their first donation.###\nHence this label was No."
"The individual has donated blood 15 times, with the most recent donation being 8 months ago. In total, they have donated 3750 c.c. of blood over the course of 77 months since they first started donating. The prediction task is to determine if this person will consent or avoid donating blood in the future.###\nHence this label was No."
"The individual has donated blood 8 times, with the most recent donation being 4 months ago. The total amount of blood donated is 2000 c.c. and they have been donating blood for the past 48 months.###\nHence this label was Yes."
"The individual has donated blood 5 times in total, with the last donation being 14 months ago. The total amount donated is 1250 cubic centimeters, and the individual has been donating for 14 months since the first donation.###\nHence this label was No."
"The individual donated blood three times, with the most recent donation being 23 months ago. In total, they donated 750 cubic centimeters of blood over a period of 33 months since their first donation.###\nHence this label was No."
"The individual has donated blood once in the past, 11 months ago, contributing a total of 250 c.c. The first donation was also made 11 months ago. The individual has not donated blood since then.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation being 2 months ago. Over the course of 32 months, they have donated a total of 1750 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood once in the past 11 months, contributing a total of 250 c.c. of blood. This was also the first time they donated blood, showing a willingness to contribute despite a relatively recent donation history.###\nHence this label was No."
"The individual has donated blood twice in the past, with a total of 500cc of blood donated. Their last donation was 14 months ago, and they have been donating for 35 months in total.###\nHence this label was Yes."
"The individual donated blood 14 times, with the most recent donation being 5 months ago. They have donated a total of 3500 cubic centimeters of blood over a span of 86 months since their first donation.###\nHence this label was No."
"The individual has donated blood 6 times, with the most recent donation being 3 months ago. They have donated a total of 1500 c.c. of blood over a period of 21 months since their first donation.###\nHence this label was No."
"The individual has donated blood twice, with the most recent donation being 11 months ago. The total amount of blood donated is 500 cubic centimeters. They have been donating blood for a total of 70 months.###\nHence this label was No."
"The individual has donated blood once in the past, approximately 9 months ago, giving a total of 250 c.c. They have been donating blood for 9 months.###\nHence this label was No."
"The donor has not donated blood in 23 months, has donated a total of 2 times, amounting to 500cc of blood, and has been donating for 28 months.###\nHence this label was No."
"The individual has donated blood 14 times, with the last donation occurring 16 months ago. They have donated a total of 3500 c.c. of blood over a period of 83 months since their first donation.###\nHence this label was No."
"The individual has donated blood recently, just 2 months ago, and has a history of donating 3 times, with a total of 750 c.c. of blood donated. They have been donating for a relatively short period of time, only 4 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood five times, with the most recent donation occurring 14 months ago. Over the course of 28 months since their first donation, they have donated a total of 1250 cubic centimeters of blood.###\nHence this label was Yes."
"The individual has donated blood twice before, with the last donation occurring 21 months ago. In total, they have donated 500 c.c. of blood. They have been donating blood for 33 months.###\nHence this label was No."
"The individual has donated blood 13 times in total, with the last donation being made 0 months ago. Over the course of 28 months since the first donation, they have donated a total of 3250 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood 7 times, with the most recent donation being 11 months ago. Over the course of 75 months since their first donation, they have contributed a total of 1750 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood 10 times, with the most recent donation being 3 months ago. Over the course of 33 months, they have donated a total of 2500 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood 4 times in total, with the most recent donation being 21 months ago. Over the course of 52 months since their first donation, they have donated a total of 1000 c.c. of blood.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 c.c. 23 months ago, and it was their first time donating.###\nHence this label was No."
"The individual donated blood once, giving a total of 250cc, and it has been 4 months since their last donation. They first donated blood 4 months ago.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the most recent donation being 2 months ago. They have donated a total of 1000 cubic centimeters of blood over a period of 14 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood twice in the past, with the most recent donation being 2 months ago. The total amount of blood donated is 500 c.c. The individual has been donating blood for 11 months now.###\nHence this label was No."
"The individual donated blood 7 times in total, with the most recent donation being 2 months ago. They have donated a total of 1750 cubic centimeters of blood over a period of 58 months since their first donation.###\nHence this label was Yes."
"The individual donated blood 2 months ago for the 2nd time, amounting to a total of 500 c.c. They have been donating for 11 months since they first started.###\nHence this label was Yes."
"The individual has donated blood 8 times, with the most recent donation being 14 months ago. They have donated a total of 2000 c.c. of blood over a period of 46 months since their first donation.###\nHence this label was No."
"The individual in this example last donated blood 16 months ago. They have donated blood a total of 3 times, with a cumulative amount of 750 cubic centimeters. Their first donation was made 46 months ago.###\nHence this label was No."
"The individual has donated blood 11 times, with the most recent donation being 9 months ago. Over the course of 49 months, they have donated a total of 2750 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood 3 times in the past, with the most recent donation being 11 months ago. In total, they have donated 750 c.c. of blood over the course of 16 months since their first donation.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250 cubic centimeters, 23 months ago. This was also the first time they donated blood.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 2 months ago. They have donated a total of 1250 cubic centimeters of blood over the course of 34 months since their first donation.###\nHence this label was No."
"The individual last donated blood 2 months ago, has donated blood a total of 34 times amounting to 8500 c.c., and has been donating blood for the past 77 months.###\nHence this label was Yes."
"The individual has donated blood 15 times, with the most recent donation occurring 2 months ago. Over a period of 49 months since their first donation, they have donated a total of 3750 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood frequently, with a total of 8 donations over 38 months. Their most recent donation was 2 months ago, and they have donated a total of 2000 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood 23 times, with the most recent donation being 4 months ago. Over a period of 58 months since the first donation, the total amount of blood donated is 5750 c.c.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation made 2 months ago. Over a period of 35 months since they first donated blood, they have donated a total of 1750 cubic centimeters.###\nHence this label was Yes."
"The individual has donated blood 9 times in total, with the most recent donation being 11 months ago. The total amount of blood donated is 2250 cubic centimeters. This person has been donating blood for 38 months in total.###\nHence this label was No."
"The individual has donated blood 8 times, with the most recent donation being 11 months ago. They have donated a total of 2000 c.c. of blood over the past 41 months since they started donating.###\nHence this label was Yes."
"The individual donated blood once, 23 months ago, giving a total of 250 c.c. They have been donating for 23 months now.###\nHence this label was No."
"The individual donated blood 9 months ago for the first time and has donated a total of 250cc of blood in 1 donation.###\nHence this label was No."
"The individual donated blood 11 times, with the most recent donation being 2 months ago. The total amount of blood donated is 2750 c.c. over a period of 41 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 18 times, with the most recent donation being 14 months ago. Over the course of 78 months, they have donated a total of 4500 c.c. of blood.###\nHence this label was No."
"This individual donated blood 4 times in total, with the most recent donation being 2 months ago. Over the course of 16 months since their first donation, they have donated a total of 1000 c.c. of blood.###\nHence this label was No."
"The individual has donated blood 6 times in total, with the most recent donation occurring 4 months ago. Over the course of 43 months, they have donated a total of 1500 cc of blood.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation being 4 months ago. In total, they have donated 1750 c.c. of blood over a span of 52 months since their first donation.###\nHence this label was No."
"The individual has donated blood once in the past, approximately 14 months ago, giving a total of 250 cubic centimeters of blood. It has been 14 months since their first donation.###\nHence this label was No."
"The individual donated blood 9 times, with the last donation being 12 months ago. The total amount of blood donated is 2250 cubic centimeters over a period of 60 months since their first donation.###\nHence this label was No."
"The individual donated blood once 14 months ago, giving a total of 250cc. It has been 14 months since their first donation. The task is to predict whether this person will consent to donate blood again.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation being 4 months ago. The total amount of blood donated is 500 c.c. and the individual has been donating for 13 months. The task is to predict whether this individual will agree to donate blood again.###\nHence this label was No."
"The individual has donated blood 3 times, with the most recent donation being 14 months ago. In total, they have donated 750 c.c. of blood over a period of 28 months since their first donation.###\nHence this label was No."
"The individual has donated blood 14 times in total, with the most recent donation occurring 23 months ago. The total amount of blood donated is 3500 cubic centimeters. The individual has been donating blood for 93 months.###\nHence this label was No."
"The individual donated blood once 4 months ago, contributing a total of 250 c.c. Their first donation was also 4 months ago.###\nHence this label was Yes."
"The individual last donated blood 11 months ago, has donated blood once for a total of 250 c.c., and has been donating for 11 months.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation being 4 months ago. The total amount of blood donated is 1750 c.c. and they have been donating for 25 months.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation occurring 10 months ago. Over the course of 39 months since they started donating, they have given a total of 2000 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood 12 times in total, with the most recent donation occurring 2 months ago. The total amount of blood donated is 3000 c.c. and they have been donating for the past 70 months.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250 cubic centimeters, two months ago. It has been two months since their first donation.###\nHence this label was No."
"The individual has donated blood 43 times, with the most recent donation being 2 months ago. In total, they have donated 10750 c.c. of blood over the course of 86 months since their first donation.###\nHence this label was Yes."
"The individual donated blood 6 times in total, with the most recent donation being 2 months ago. Over the course of 41 months, they have donated a total of 1500 cubic centimeters of blood.###\nHence this label was Yes."
"The individual has donated blood 12 times, with the last donation occurring 16 months ago. The total amount of blood donated is 3000 c.c. The individual has been donating blood for 50 months.###\nHence this label was No."
"The individual donated blood 7 times in total, with the most recent donation being 11 months ago. Over a period of 64 months since their first donation, they have donated a total of 1750 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood 5 times, with the last donation being 4 months ago. In total, they have donated 1250 cc of blood over a period of 74 months since their first donation.###\nHence this label was No."
"The individual donated blood 4 times in total, with the last donation being 14 months ago. They have donated a total of 1000 cc of blood over a period of 22 months since their first donation.###\nHence this label was Yes."
"The individual last donated blood 4 months ago, has donated a total of 2 times, giving a total of 500 c.c. of blood. They have been donating for 59 months in total.###\nHence this label was No."
"This individual donated blood 2 months ago for the 2nd time, totaling 500 c.c. They have been donating for 33 months in total.###\nHence this label was No."
"The individual has donated blood seven times, with the most recent donation occurring 14 months ago. They have donated a total of 1750 cubic centimeters of blood over a period of 35 months since their first donation.###\nHence this label was No."
"The individual has donated blood 6 times, with the most recent donation being 2 months ago. They have donated a total of 1500 c.c. of blood over a period of 26 months since their first donation.###\nHence this label was No."
"The individual has donated blood 6 times in total, with the most recent donation being 4 months ago. They have donated a total of 1500 cubic centimeters of blood over a period of 30 months since their first donation.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the most recent donation being 16 months ago. Over the course of 23 months since their first donation, they have donated a total of 1000 c.c. of blood.###\nHence this label was No."
"The individual donated blood 5 times, with the most recent donation being 4 months ago. They have donated a total of 1250 c.c. of blood over a period of 58 months since they first started donating.###\nHence this label was No."
"The individual donated blood 4 times in total, with the most recent donation being 2 months ago. The total amount of blood donated is 1000 c.c. and they have been donating for 26 months.###\nHence this label was No."
"The individual donated blood 4 months ago for the first time, donating a total of 250cc. They have donated blood only once so far.###\nHence this label was No."
"The individual has donated blood 7 times, with the last donation being 4 months ago. In total, they have donated 1750 c.c. of blood over a period of 58 months since their first donation.###\nHence this label was No."
"The individual has donated blood 16 times in total, with the most recent donation occurring 3 months ago. Over the course of 74 months since they first donated blood, they have contributed a total of 4000 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation occurring 2 months ago. Over a period of 46 months since their first donation, they have donated a total of 1750 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood 2 times in total, with the last donation being 4 months ago. The total amount of blood donated is 500 c.c. The individual has been donating blood for 4 months.###\nHence this label was No."
"The individual has not donated blood for 21 months, has donated a total of 2 times, giving a total of 500 c.c. of blood, and has been donating for 52 months.###\nHence this label was No."
"The individual last donated blood 16 months ago and has donated a total of 10 times, providing a total of 2500 cubic centimeters of blood. They have been donating blood for 62 months.###\nHence this label was No."
"The individual has donated blood 7 times, with the last donation being 14 months ago. The total amount of blood donated is 1750 cubic centimeters. The individual has been donating blood for the past 45 months.###\nHence this label was No."
"The individual donated blood once 21 months ago, giving a total of 250 cubic centimeters. They have been donating for 21 months since their first donation.###\nHence this label was No."
"The individual last donated blood 14 months ago, has donated a total of 3 times, giving a total of 750 cubic centimeters of blood. They have been donating for 31 months.###\nHence this label was No."
"The individual has donated blood twice in the past, with the last donation being 18 months ago. The total amount of blood donated is 500 cubic centimeters. The individual has been donating blood for 23 months.###\nHence this label was No."
"The individual donated blood 5 times, with the most recent donation being 9 months ago. They have donated a total of 1250 cubic centimeters of blood over the past 19 months since their first donation.###\nHence this label was No."
"The individual has donated blood 8 times totalling 2000 c.c. over the past 28 months, with the most recent donation being 16 months ago.###\nHence this label was No."
"The individual has donated blood four times in total, with the most recent donation made 14 months ago. Over the course of 57 months, they have donated a total of 1000 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood once, providing 250 c.c. of blood, 16 months ago, which was also 16 months after their first donation.###\nHence this label was No."
"The individual has donated blood 6 times, with the most recent donation being 4 months ago. They have donated a total of 1500 cubic centimeters of blood over a period of 35 months since their first donation.###\nHence this label was Yes."
"The individual in the dataset has not donated blood for 16 months. They have donated blood 7 times, with a total of 1750 cubic centimeters donated. It has been 87 months since their first donation.###\nHence this label was Yes."
"The individual donated blood 4 months ago for the 4th time, resulting in a total of 1000 c.c. donated over a period of 34 months since their first donation.###\nHence this label was Yes."
"The individual donated blood 6 times, with the most recent donation being 2 months ago. Over a period of 16 months since their first donation, they have donated a total of 1500 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood 16 times in total, with the last donation being 15 months ago. The total amount of blood donated is 4000 cubic centimeters, and they have been donating for 82 months since the first time.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the most recent donation being 23 months ago. The total amount of blood donated is 1000 c.c. They have been donating blood for 53 months since they started.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation being 11 months ago. They have contributed a total of 1750 cubic centimeters of blood over the past 37 months.###\nHence this label was No."
"The individual donated blood 7 times, with the most recent donation being 4 months ago. The total amount of blood donated is 1750 cubic centimeters, and the individual has been donating for the past 62 months.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 14 months ago. The total amount of blood donated is 1250 cubic centimeters, and they have been donating for a period of 50 months.###\nHence this label was No."
"The individual donated blood 2 times, with the most recent donation being 23 months ago. The total amount of blood donated is 500 c.c. and they have been donating for a period of 28 months.###\nHence this label was No."
"The individual has donated blood 6 times in total, with the most recent donation being 4 months ago. They have donated a total of 1500 c.c. of blood over the past 39 months since they first started donating.###\nHence this label was No."
"The individual has donated blood 11 times, with the most recent donation occurring 7 months ago. Over a period of 89 months, they have contributed a total of 2750 c.c. of blood.###\nHence this label was No."
"The individual has donated blood once in the past, approximately 11 months ago, giving a total of 250cc of blood. This was also the individual's first donation, indicating a recent entry into the donation system.###\nHence this label was Yes."
"The donor last donated blood 14 months ago, has donated a total of 2 times, amounting to 500 c.c., and has been donating for 14 months.###\nHence this label was No."
"The individual donated blood 4 times in total, with the most recent donation being 23 months ago. Over 1000 cubic centimeters of blood has been donated since the first donation, which occurred 45 months ago.###\nHence this label was No."
"The individual has donated blood 8 times, with the most recent donation being 8 months ago. They have donated a total of 2000 c.c. of blood over the course of 52 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 6 times, with the most recent donation being 4 months ago. The total amount of blood donated is 1500 c.c. This person has been donating blood for the past 14 months.###\nHence this label was No."
"The individual has donated blood 5 times, with the most recent donation being 11 months ago. In total, they have donated 1250 cubic centimeters of blood. They have been donating blood for the past 37 months.###\nHence this label was Yes."
"The individual has donated blood three times in the past, with the most recent donation being 11 months ago. They have donated a total of 750 c.c. of blood over a period of 76 months since their first donation.###\nHence this label was No."
"The individual donated blood 3 times, with the most recent donation being 2 months ago. They have donated a total of 750 c.c. of blood over the course of 9 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 6 times, with the most recent donation being 4 months ago. Over a period of 38 months since their first donation, they have donated a total of 1500 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood 9 times, with the most recent donation being 8 months ago. In total, they have donated 2250 c.c. of blood over a period of 64 months since their first donation.###\nHence this label was No."
"The individual has donated blood 3 times, with the most recent donation being 4 months ago. They have donated a total of 750 c.c. of blood over a period of 28 months since their first donation.###\nHence this label was No."
"The individual has donated blood three times in total, with the most recent donation occurring 4 months ago. Over the course of 16 months since their first donation, they have donated a total of 750cc of blood.###\nHence this label was Yes."
"The individual last donated blood 11 months ago, has donated blood once in total amounting to 250 c.c., and has been donating for 11 months since their first donation.###\nHence this label was No."
"The individual donated blood 4 months ago for the 4th time, resulting in a total of 1000 c.c. of blood donated over 46 months since their first donation.###\nHence this label was No."
"The individual has donated blood 26 times, with the most recent donation made 0 months ago. The total amount of blood donated is 6500 c.c. and the first donation was made 76 months ago.###\nHence this label was Yes."
"The individual donated blood once 21 months ago, giving a total of 250 c.c. of blood. They have been donating blood for 21 months since their first donation.###\nHence this label was No."
"The individual has donated blood 11 times, with the most recent donation being 2 months ago. They have donated a total of 2750 c.c. of blood over the past 23 months since they first started donating.###\nHence this label was No."
"The individual donated blood 3 times, with the last donation being 21 months ago. In total, they donated 750 c.c. of blood over a period of 38 months since their first donation.###\nHence this label was No."
"The individual has donated blood twice in the past, with the last donation being 4 months ago. They have donated a total of 500 c.c. of blood over a period of 46 months since their first donation.###\nHence this label was No."
"The individual donated blood 7 times, with the most recent donation being 4 months ago. Over the course of 32 months, they have donated a total of 1750 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250 c.c. of blood. This donation occurred 4 months ago, and it was their first time donating.###\nHence this label was No."
"The individual has donated blood once in the past, giving a total of 250cc of blood. They last donated blood 2 months ago and have been donating for 2 months.###\nHence this label was No."
"The individual has donated blood 6 times in total, with the most recent donation being 2 months ago. Over the course of 15 months since their first donation, they have donated a total of 1500 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood once 40 months ago, giving a total of 250 cc of blood. It has been 40 months since their first donation.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation occurring 4 months ago. Over the course of 46 months since first donation, they have donated a total of 2000 c.c. of blood.###\nHence this label was Yes."
"The individual has not donated blood for 23 months, has donated a total of 12 times, contributing 3000 c.c. of blood in total over a period of 86 months since their first donation.###\nHence this label was No."
"The individual donated blood 2 times, with the most recent donation occurring 4 months ago. Over a period of 9 months since their first donation, they have donated a total of 500 c.c. of blood.###\nHence this label was Yes."
"The individual donated blood 4 months ago for the first time, then donated a total of 250 c.c. of blood over 1 donation. The last donation was 4 months prior to the most recent data collection.###\nHence this label was No."
"The individual has donated blood 5 times in the past, with the most recent donation being 2 months ago. The total amount of blood donated is 1250 cubic centimeters. They have been donating blood for a total of 11 months.###\nHence this label was Yes."
"The individual has donated blood recently, 4 months ago. They have donated a total of 7 times, resulting in a cumulative of 1750 c.c. of blood donated. They have been donating for a period of 52 months.###\nHence this label was No."
"The individual has donated blood 5 times in the past, with the most recent donation being 11 months ago. The total amount of blood donated is 1250 cubic centimeters. They have been donating blood for a period of 41 months.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 c.c. of blood, 4 months ago for the first time. They have donated blood only once, with 4 months passing since their last donation.###\nHence this label was No."
"The individual donated blood 4 times in total, with the most recent donation being 2 months ago. The total amount of blood donated is 1000 cubic centimeters. This person has been donating blood for 16 months.###\nHence this label was No."
"The individual donated blood 2 months ago for the second time, totaling 500 c.c. of blood. They have been donating for 4 months in total.###\nHence this label was No."
"The individual has donated blood three times in total, with the most recent donation being 16 months ago. The total amount of blood donated is 750 cubic centimeters. The individual has been donating blood for 23 months.###\nHence this label was No."
"The individual donated blood once 22 months ago, giving a total of 250 c.c. They have been donating for 22 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 6 times, with the last donation being 2 months ago. Over a period of 75 months, they have donated a total of 1500 cc of blood.###\nHence this label was No."
"The individual has donated blood on 11 occasions, with the most recent donation being 12 months ago. Over a period of 23 months since first donation, they have donated a total of 2750 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood 12 times in the past, with the most recent donation being 1 month ago. The total amount of blood donated is 3000 cc over a period of 35 months since the first donation.###\nHence this label was No."
"The individual last donated blood 2 months ago. They have donated a total of 8 times, resulting in 2000 cubic centimeters of blood given. It has been 35 months since they made their first donation.###\nHence this label was Yes."
"The individual has donated blood once, where the most recent donation was 4 months ago. The total amount of blood donated is 250 cubic centimeters, and the individual has been donating for a total of 4 months.###\nHence this label was Yes."
"The individual has donated blood three times in total, with the most recent donation being 4 months ago. Over the span of 34 months, they have donated a total of 750 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood 6 times in total, with the most recent donation occurring 16 months ago. They have donated a total of 1500 c.c. of blood over a period of 35 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 4 times in total, with the most recent donation being 2 months ago. The total amount of blood donated is 1000 cubic centimeters. This person has been donating blood for 16 months.###\nHence this label was No."
"The individual has donated blood 11 times, with the last donation being 12 months ago. Over a period of 39 months since the first donation, they have donated a total of 2750 c.c. of blood.###\nHence this label was No."
"The individual donated blood 3 times in total, with the last donation being 11 months ago. The total amount donated is 750 c.c. and the individual has been donating blood for 23 months since the first donation.###\nHence this label was No."
"The individual has donated blood 9 times in total, with the most recent donation occurring 9 months ago. The total amount of blood donated is 2250 cubic centimeters. This person has been donating blood for 54 months.###\nHence this label was No."
"The individual donated blood 8 times in total, with the last donation made 4 months ago. The total amount of blood donated is 2000 cubic centimeters, and they have been donating blood for 28 months since their first donation.###\nHence this label was No."
"The individual has donated blood three times in total, with the most recent donation occurring 21 months ago. The total amount of blood donated is 750 c.c., and the individual has been donating for 35 months.###\nHence this label was No."
"The individual has donated blood 4 times in total. The last donation was 2 months ago, and the first donation was made 16 months ago. The total amount of blood donated is 1000 c.c.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the most recent donation being 14 months ago. The total amount of blood donated is 1000 cc. The individual has been donating blood for 26 months.###\nHence this label was No."
"The individual has donated blood 7 times in total, with the most recent donation being 4 months ago. They have donated a total of 1750 cubic centimeters of blood. The time since their first donation is 58 months.###\nHence this label was No."
"The individual has donated blood 3 times in the past, with the most recent donation occurring 21 months ago. They have donated a total of 750cc of blood over the course of 70 months since their first donation.###\nHence this label was No."
"The individual has donated blood twice in the past, with the most recent donation being 2 months ago. The total amount of blood donated is 500 c.c. The person has been donating blood for a total of 4 months.###\nHence this label was No."
"The individual has donated blood once in the past, 11 months ago, contributing 250cc of blood. They have been donating for 11 months in total.###\nHence this label was Yes."
"The individual has donated blood six times in total, with the most recent donation having been made 11 months ago. Over a period of 58 months, they have donated a total of 1500 cubic centimeters of blood.###\nHence this label was No."
"The individual has donated blood 9 times, with the most recent donation occurring 4 months ago. Over the course of 38 months, they have donated a total of 2250 cubic centimeters of blood.###\nHence this label was Yes."
"The individual donated blood 10 times, with the most recent donation being 4 months ago. Over the course of 28 months since the first donation, they have donated a total of 2500 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood twice in total, with the last donation occurring 4 months ago. The total amount of blood donated is 500 c.c. and they have been donating for 51 months.###\nHence this label was Yes."
"The individual has donated blood three times in the past, with the most recent donation being 6 months ago. In total, they have donated 750 c.c. of blood over a period of 26 months since their first donation.###\nHence this label was No."
"The individual last donated blood 9 months ago, has donated blood a total of 2 times, resulting in a total of 500 c.c. donated, and has been donating blood for 16 months.###\nHence this label was Yes."
