"The individual has donated blood three times in total, with the most recent donation being 2 months ago. The total amount of blood donated is 750 cubic centimeters. They have been donating blood for 35 months.###\nHence this label was No."
"The individual has donated blood three times in total, with the most recent donation occurring 4 months ago. They have donated a total of 750 c.c. of blood over a period of 34 months since their first donation.###\nHence this label was No."
"The individual has donated blood three times, with the most recent donation occurring 0 months ago. The total amount of blood donated is 750 cubic centimeters, and they have been donating for a period of 4 months.###\nHence this label was No."
"The individual has donated blood 3 times in total, with the most recent donation being 2 months ago. They have donated a total of 750 c.c. of blood over a period of 9 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 6 times in total, with the most recent donation being 3 months ago. Over the course of 21 months since their first donation, they have donated a total of 1500 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood once 11 months ago, giving a total of 250cc. This was their first donation, and they have not donated since then.###\nHence this label was Yes."
"The individual donated blood once, giving a total of 250cc, just 2 months after their first donation. Their most recent donation was also 2 months ago.###\nHence this label was No."
"The individual has donated blood 5 times, with the most recent donation occurring 4 months ago. The total amount of blood donated is 1250 c.c. and they have been donating for a total of 23 months since their first donation.###\nHence this label was No."
"The individual has not donated blood for 25 months, has donated blood 6 times in total, with a cumulative amount of 1500 c.c., and has been donating blood for 50 months up to now.###\nHence this label was No."
"The individual donated blood once nine months ago, giving a total of 250 cubic centimeters. It has been nine months since their first donation.###\nHence this label was No."
"The individual donated blood once 23 months ago, contributing a total of 250cc. This was the first time they donated blood, and they have not donated since then.###\nHence this label was No."
"The individual donated blood 4 months ago for the second time, totaling 500cc. They have been donating blood for 4 months in total.###\nHence this label was Yes."
"The individual donated blood 3 times, with the most recent donation being 4 months ago. They have donated a total of 750 cubic centimeters of blood over a period of 16 months since their first donation.###\nHence this label was No."
"The individual donated blood once, 2 months ago, giving a total of 250 c.c. They have been donating for 2 months in total.###\nHence this label was No."
"The individual donated blood 4 months ago for the first and only time, giving a total of 250 cubic centimeters.###\nHence this label was Yes."
"The individual donated blood 3 times in total, with the most recent donation being 14 months ago. The total amount of blood donated is 750 cubic centimeters. The individual has been donating blood for 33 months.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation being 7 months ago. They have donated a total of 1250 c.c. of blood over a period of 35 months since their first donation.###\nHence this label was No."
"The individual has donated blood 4 times in total, with the last donation being 13 months ago. The total amount of blood donated is 1000 cubic centimeters. The individual has been donating blood for the past 21 months.###\nHence this label was No."
"This individual donated blood 7 times, with the last donation being 4 months ago. In total, they donated 1750 c.c. of blood over a period of 52 months since their first donation.###\nHence this label was No."
"The individual has donated blood 7 times, with the most recent donation being 4 months ago. The total amount of blood donated is 1750 cubic centimeters over a span of 58 months since their first donation.###\nHence this label was No."
"The individual donated blood 2 months ago for the first time, and has since donated a total of 250cc in 1 session.###\nHence this label was Yes."
"The individual donated blood 19 times, with a total of 4750 c.c. over a period of 69 months. Their last donation was 4 months ago.###\nHence this label was Yes."
"This individual donated blood 7 times in total, with the most recent donation being 2 months ago. They have donated a total of 1750 c.c. of blood over the course of 35 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 9 times in total, with the most recent donation being 4 months ago. Their cumulative donation amount is 2250 c.c. and they have been donating blood for 38 months.###\nHence this label was Yes."
"The individual has donated blood 34 times in total, with the most recent donation occurring 2 months ago. The total amount of blood donated is 8500 cubic centimeters. The individual has been donating blood for 77 months.###\nHence this label was Yes."
"The individual has not donated blood for 16 months, has donated a total of 12 times, resulting in a total of 3000 c.c. of blood donated. They have been donating for a period of 50 months.###\nHence this label was No."
"The individual has donated blood once in the past, approximately 16 months ago, giving a total of 250 c.c. Since then, they have not donated again and their total time since their first donation is also 16 months.###\nHence this label was No."
"The individual donated blood once 21 months ago, giving a total of 250 c.c. Since then, they have not donated again. Their first donation was also 21 months ago.###\nHence this label was No."
"The individual has donated blood once in the past, 16 months ago, giving a total of 250 c.c. They have been donating for 16 months since their first donation.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 c.c. of blood, two months ago. This was their first donation, and they have not donated since then.###\nHence this label was No."
"The individual has donated blood twice, with a total of 500 c.c. over a period of 14 months. Their last donation was 14 months ago.###\nHence this label was Yes."
"The individual last donated blood 4 months ago, has donated blood a total of 5 times, resulting in 1250cc of blood donated, and has been donating blood for 26 months.###\nHence this label was Yes."
"The individual has donated blood 3 times in total, with the last donation being 2 months ago. The total amount of blood donated is 750 c.c. over a period of 16 months since their first donation.###\nHence this label was Yes."
"The individual has donated blood 16 times, with the most recent donation being 21 months ago. In total, they have donated 4000 c.c. of blood over a period of 64 months since their first donation.###\nHence this label was No."
"The individual donated blood 11 times, with the most recent donation being 4 months ago. Over a period of 61 months, they have donated a total of 2750 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood 4 months ago for the 4th time, contributing a total of 1000 c.c. of blood over a period of 18 months.###\nHence this label was No."
"The individual has donated blood 6 times in total, with the most recent donation being 16 months ago. Over a period of 35 months since their first donation, they have donated a total of 1500 cubic centimeters of blood.###\nHence this label was Yes."
"The individual has donated blood 7 times, with the most recent donation being 4 months ago. In total, they have donated 1750 cubic centimeters of blood over a period of 58 months since they first started donating.###\nHence this label was No."
"The individual has donated blood 13 times, with the most recent donation being 0 months ago. The total amount of blood donated is 3250 cubic centimeters. This person has been donating blood for 28 months.###\nHence this label was Yes."
"The individual has donated blood 5 times in total, with the most recent donation being 4 months ago. Over the course of 58 months, they have donated a total of 1250 cubic centimeters of blood.###\nHence this label was No."
"The individual donated blood 2 times, with the last donation being 11 months ago. The total amount donated is 500 cubic centimeters, and they have been donating for 14 months since their first donation.###\nHence this label was No."
"The individual has donated blood three times in total, with the most recent donation being 14 months ago. They have donated a total of 750 c.c. of blood over a period of 31 months since their first donation.###\nHence this label was No."
"The individual has donated blood 10 times in total, with the most recent donation being 16 months ago. The total amount of blood donated is 2500 c.c. and they have been donating blood for 89 months.###\nHence this label was No."
"The individual has donated blood 11 times, with the last donation made 2 months ago. They have donated a total of 2750 c.c. of blood over a period of 46 months since they first started donating.###\nHence this label was No."
"The individual has donated blood recently, 1 month ago, and has donated a total of 13 times, amounting to 3250 cubic centimeters. They have been donating for 47 months.###\nHence this label was No."
"The individual has not donated blood in 74 months, has donated blood once (totaling 250 c.c.), and has been donating for 74 months.###\nHence this label was No."
"The individual donated blood once two months ago, giving a total of 250cc. This was their first donation, and they have not donated since.###\nHence this label was No."
"The individual last donated blood 16 months ago, has donated blood 8 times, totaling 2000 cubic centimeters, and has been donating for 28 months.###\nHence this label was No."
"The individual donated blood 4 months ago, has donated a total of 4 times, totaling 1000 c.c., and has been donating for 46 months.###\nHence this label was No."
"The individual has donated blood three times in the past, with the last donation being 21 months ago. The total amount of blood donated is 750 cubic centimeters. This person has been donating blood for 64 months.###\nHence this label was No."
"The individual donated blood 6 times, with the most recent donation being 4 months ago. Over a period of 52 months since the first donation, a total of 1500 c.c. of blood was donated.###\nHence this label was No."
"The individual has donated blood 5 times in total, with the most recent donation occurring 9 months ago. Over a time span of 19 months since the first donation, they have contributed a total of 1250 c.c. of blood to the Blood Transfusion Service Center in Hsin-Chu City, Taiwan.###\nHence this label was No."
"The individual has donated blood 8 times in total, with the most recent donation being 2 months ago. Over the course of 28 months since their first donation, they have donated a total of 2000 cubic centimeters of blood.###\nHence this label was Yes."
"The individual has donated blood three times, with the most recent donation being 23 months ago. They have donated a total of 750 cubic centimeters of blood over a period of 33 months since their first donation.###\nHence this label was No."
"The individual donated blood 10 times in total, with the most recent donation being 2 months ago. The total amount of blood donated is 2500 cubic centimeters. They have been donating blood for 28 months.###\nHence this label was Yes."
"The individual donated blood 50 times, with the last donation being 2 months ago. Over a period of 98 months since starting to donate blood, they have contributed a total of 12500 c.c. of blood.###\nHence this label was Yes."
"The individual donated blood 4 times in the past, with the most recent donation being 2 months ago. Over a period of 14 months, they donated a total of 1000 c.c. of blood.###\nHence this label was Yes."
"The individual has donated blood 11 times, with the most recent donation being 7 months ago. Over a period of 89 months since their first donation, they have contributed a total of 2750 c.c. of blood.###\nHence this label was No."
"The individual has donated blood four times in the past, with the most recent donation being 4 months ago. The total amount of blood donated is 1000 c.c. and they have been donating for 43 months. The task is to predict whether this person will donate blood again in the future.###\nHence this label was Yes."
"An individual donated blood 2 times, with a total of 500 c.c., and their last donation was 14 months ago. They have been donating for 14 months.###\nHence this label was No."
"The individual donated blood 3 times in total, with the most recent donation being 16 months ago. Over the course of 50 months, they have donated a total of 750cc of blood.###\nHence this label was No."
"The individual donated blood once, giving a total of 250 c.c. four months ago. This was the first time they donated blood.###\nHence this label was No."
"The individual has donated blood 5 times, with the most recent donation being 14 months ago. They have donated a total of 1250 c.c. of blood over a period of 50 months since their first donation.###\nHence this label was No."
"The individual donated blood once 23 months ago, giving a total of 250 c.c. They have been donating for 23 months since starting.###\nHence this label was Yes."
