"This individual is a 42-year-old female who has been pregnant 6 times. Her diastolic blood pressure is 78 mmHg and her triceps skin fold thickness is 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85 mg/dL, and her 2-hour serum insulin level is 0 µU/mL. She has a body mass index of 31.2 and a diabetes pedigree function of 0.382.###\nHence this label was avoid."
"This individual is a 51-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 26 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 136 mg/dL, and her 2-hour serum insulin level is 135 μU/mL. She has a body mass index of 26.0 and a diabetes pedigree function of 0.647.###\nHence this label was avoid."
"The patient is a 30-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 72, triceps skin fold thickness of 23, plasma glucose concentration of 121, and 2-hour serum insulin of 112. Her body mass index is 26.2 and her diabetes pedigree function is 0.245. These measurements suggest a moderate risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 22-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 60 and a normal triceps skin fold thickness of 18. Her glucose level after a 2-hour oral glucose tolerance test is 95, and her insulin level is 58. With a healthy body mass index of 23.9 and a low diabetes pedigree function score of 0.26, she appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 27-year-old who has been pregnant twice. They have a very low diastolic blood pressure of 54 and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 120, and they have no insulin present. Despite a normal body mass index of 26.8, their diabetes pedigree function is 0.455, indicating a some level of genetic predisposition to diabetes.###\nHence this label was avoid."
"The data belongs to a 25-year-old individual who has been pregnant twice. She has a healthy diastolic blood pressure of 68 and a slightly below average triceps skin fold thickness of 22. Her plasma glucose concentration after a 2-hour GTT is normal at 114. She has no insulin present at the 2-hour mark. Despite a slightly elevated BMI of 28.7, her diabetes pedigree function is low at 0.092, indicating a relatively low risk of developing diabetes.###\nHence this label was avoid."
"A 24-year-old female, who is pregnant for the first time, has a lower than normal diastolic blood pressure (54) and a slightly below average triceps skin fold thickness (13). Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range (119), as well as her 2-hour serum insulin levels (50). She has a healthy body mass index of 22.3 and a low diabetes pedigree function score of 0.205.###\nHence this label was avoid."
"The individual in the dataset is a 51-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 28. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 155, and her 2-hour serum insulin level is 150. With a body mass index of 33.3 and a diabetes pedigree function of 1.353, she may be at risk for developing diabetes.###\nHence this label was consent."
"This data belongs to a 21-year-old individual who is pregnant for the first time. She has a normal diastolic blood pressure of 64 and a healthy triceps skin fold thickness of 35. Her glucose tolerance test results show a plasma glucose concentration of 113 and her 2-hour serum insulin level is zero. Despite these values, her body mass index is 33.6, indicating she may be overweight. The diabetes pedigree function value is 0.543, suggesting some genetic predisposition to diabetes.###\nHence this label was consent."
"This is a 21-year-old individual who has been pregnant 2 times. Their diastolic blood pressure is 75 mmHg, triceps skin fold thickness is 32 mm, and plasma glucose concentration after a glucose tolerance test is 112 mg/dL. They have a 2-hour serum insulin level of 0 µU/mL and a body mass index of 35.7 kg/m². The diabetes pedigree function, which assesses the genetic influence on diabetes, is 0.148.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant twice and has a relatively low diastolic blood pressure of 62. Their triceps skin fold thickness is 13, indicating a healthy body composition. The plasma glucose concentration after a glucose tolerance test is low at 68, as is the 2-hour serum insulin level at 15. With a body mass index of 20.1, this person is within the normal weight range. Their diabetes pedigree function is 0.257, suggesting a low genetic risk of diabetes.###\nHence this label was avoid."
"This individual is a 22-year-old who is pregnant for the first time. They have a diastolic blood pressure of 80, a triceps skin fold thickness of 11, and a plasma glucose concentration of 103 after a glucose tolerance test. Their 2-hour serum insulin level is 82, and they have a low body mass index of 19.4. The diabetes pedigree function value is 0.491, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 26-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 88 mmHg, triceps skin fold thickness of 41 mm, and a plasma glucose concentration of 119 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 170 μU/mL, and she has a body mass index of 45.3. The diabetes pedigree function indicates a genetic predisposition to diabetes with a value of 0.507.###\nHence this label was avoid."
"The patient is a 36-year-old female who is pregnant for the ninth time. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 32 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 112 mg/dL. She has a 2-hour serum insulin level of 175 μU/mL and a body mass index of 34.2 kg/m². The diabetes pedigree function, indicating the genetic influence of diabetes, is 0.26.###\nHence this label was consent."
"The patient is a 30-year-old female who has never been pregnant before. She has normal diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. However, she has elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. Her body mass index is in the overweight range, and she has a moderately high diabetes pedigree function score, indicating a potential genetic predisposition to diabetes.###\nHence this label was consent."
"A 28-year-old individual who has been pregnant 4 times shows normal diastolic blood pressure and moderate triceps skin fold thickness. Their blood glucose levels are within normal range after a glucose tolerance test, and they have low insulin levels. Despite a slightly elevated body mass index, their risk of developing diabetes is predicted as low based on their family history.###\nHence this label was avoid."
"The patient is a young adult woman in her twenties, with a low number of pregnancies. She has very low diastolic blood pressure and a moderate triceps skin fold thickness. Her glucose and insulin levels appear normal after a glucose tolerance test. She has a healthy body mass index and a low diabetes pedigree function score. This data suggests that the patient is at a low risk of developing diabetes.###\nHence this label was avoid."
"A 23-year-old individual who has been pregnant 3 times with healthy diastolic blood pressure, moderate triceps skin fold thickness, and slightly elevated glucose levels after a GTT. They have normal insulin levels, a lower BMI, and a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 64-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 120, and her 2-hour serum insulin level is 0. With a body mass index of 25.0 and a diabetes pedigree function of 0.409, she may be at risk for developing diabetes.###\nHence this label was avoid."
"This is a 28-year-old individual who has been pregnant 6 times, with a diastolic blood pressure and triceps skin fold thickness of 0. The plasma glucose concentration after a glucose tolerance test is 96, while the 2-hour serum insulin level is 0. The individual has a body mass index of 23.7 and a low diabetes pedigree function of 0.19.###\nHence this label was avoid."
"A 57-year-old individual who has been pregnant 8 times and has a diastolic blood pressure of 76. They have a triceps skin fold thickness of 29, a plasma glucose concentration of 196, and a 2-hour serum insulin level of 280. With a body mass index of 37.5 and a diabetes pedigree function of 0.605, this individual's risk for developing diabetes may be of concern.###\nHence this label was consent."
"A 34-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 78, a triceps skin fold thickness of 23, and a plasma glucose concentration of 130 after a glucose tolerance test. Their 2-hour serum insulin level is 79, with a body mass index of 28.4 and a diabetes pedigree function of 0.323.###\nHence this label was consent."
"This 32-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 75. They have a triceps skin fold thickness of 0, a high plasma glucose concentration of 156 after a GTT, and no serum insulin after 2 hours. With a body mass index of 48.3 and a diabetes pedigree function of 0.238, this person's risk of developing diabetes may be elevated.###\nHence this label was consent."
"This individual is a 27-year-old female who has been pregnant twice. Her diastolic blood pressure is 70 mmHg, triceps skin fold thickness is 16 mm, and plasma glucose concentration after a glucose tolerance test is 99 mg/dL. She has a 2-hour serum insulin level of 44 mU/L and a body mass index of 20.4 kg/m². Her diabetes pedigree function is 0.235, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This data represents a 27-year-old individual who has been pregnant 6 times. They have a low diastolic blood pressure of 60 and a normal triceps skin fold thickness of 27. Their blood glucose level after a glucose tolerance test is within normal range at 109. They have no insulin in their system after a 2-hour period. With a body mass index of 25.0, they are considered to be at a healthy weight. The diabetes pedigree function value is low at 0.206, indicating a lower genetic risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 22-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 76 mmHg and a triceps skin fold thickness of 43mm. Her plasma glucose concentration after a glucose tolerance test is 199 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 42.9 and a high diabetes pedigree function score of 1.394, indicating a potential risk for developing diabetes.###\nHence this label was consent."
"A 24-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure (72 mmHg) and a slightly high triceps skin fold thickness measurement (33 mm). A 2-hour oral glucose tolerance test indicates elevated plasma glucose levels (171 mg/dL) and high serum insulin levels (135 mu U/ml). The individual has a moderately high body mass index of 33.3 and a low diabetes pedigree function score of 0.199.###\nHence this label was consent."
"This individual is a 62-year-old who has been pregnant 2 times. They have a normal diastolic blood pressure of 70 and a high triceps skin fold thickness of 99. Their plasma glucose concentration after a GTT is elevated at 197, while their 2-hour serum insulin is low at 0. They have a body mass index (BMI) of 34.7 and a moderate diabetes pedigree function score of 0.575.###\nHence this label was consent."
"This is a young, non-pregnant individual with a normal diastolic blood pressure and high skin fold thickness. They have high glucose levels after a glucose tolerance test, no insulin production, and a very high body mass index. Their family history indicates a moderate genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 28-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 64, a triceps skin fold thickness of 29, and a plasma glucose concentration of 129 after a glucose tolerance test. Her 2-hour serum insulin level is 115, and her body mass index is 26.4. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.219.###\nHence this label was consent."
"This patient is a 37-year-old woman who has been pregnant 10 times. She has a normal diastolic blood pressure of 70 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour GTT is 179, and her 2-hour serum insulin is 0. Despite having a high body mass index of 35.1, her diabetes pedigree function is low at 0.2.###\nHence this label was avoid."
"This patient is a 21-year-old female who is 1-time pregnant. She has a diastolic blood pressure of 74 mmHg, triceps skin fold thickness of 22 mm, plasma glucose concentration of 143 mg/dL after a 2-hour oral glucose tolerance test, and 2-hour serum insulin level of 61 μU/mL. Her body mass index is 26.2 kg/m² and her diabetes pedigree function is 0.256, indicating a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 45-year-old who has been pregnant 6 times. Their diastolic blood pressure is 94, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. However, their plasma glucose concentration after a glucose tolerance test is 183, indicating a possibility of diabetes. With a body mass index of 40.8 and a high diabetes pedigree function of 1.461, this person may be at risk for developing diabetes.###\nHence this label was avoid."
"This data pertains to a 45-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 70, triceps skin fold thickness of 18, and a plasma glucose concentration of 125 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 122, with a body mass index of 28.9. The diabetes pedigree function is calculated to be 1.144.###\nHence this label was consent."
"The person in this dataset is a 38-year-old who has never been pregnant. They have normal diastolic blood pressure and triceps skin fold thickness. Their glucose level after a 2-hour oral test is within a normal range. However, they have no insulin present in their serum. Their body mass index indicates they are overweight. The diabetes pedigree function suggests a moderate genetic predisposition to the disease.###\nHence this label was consent."
"This is a snapshot of a patient's health data showing no history of pregnancy, young age, healthy diastolic blood pressure, moderate triceps skin fold thickness, normal plasma glucose levels, zero insulin levels, average body mass index, and a low diabetes pedigree score.###\nHence this label was consent."
"The patient is a 70-year-old individual who has been pregnant 4 times and has a diastolic blood pressure of 82. Their triceps skin fold thickness is 18, plasma glucose concentration after a glucose tolerance test is 145, and 2-hour serum insulin level is 0. They have a body mass index of 32.5 and a diabetes pedigree function of 0.235.###\nHence this label was consent."
"This is a 39-year-old individual who has been pregnant 10 times. Their diastolic blood pressure is 76, triceps skin fold thickness is 28, and plasma glucose concentration after a 2-hour oral glucose tolerance test is 129. Additionally, they have a 2-hour serum insulin level of 122, a body mass index of 35.9, and a diabetes pedigree function of 0.28.###\nHence this label was avoid."
"The data belongs to a 21-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 36. Her plasma glucose concentration at 2 hours during a glucose tolerance test is 114, with a 2-hour serum insulin level of 200. She has a body mass index of 38.1 and a diabetes pedigree function value of 0.289.###\nHence this label was avoid."
"The patient is a 62-year-old female who has been pregnant once. She has a very low diastolic blood pressure of 54 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 135, with a 2-hour serum insulin level of 0. Despite having a normal body mass index of 26.7, she has a slightly elevated diabetes pedigree function of 0.687.###\nHence this label was avoid."
"This is a data entry of a 25-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 70, a triceps skin fold thickness of 0, and a 2-hour serum insulin of 0. Their plasma glucose concentration after a glucose tolerance test is 82. With a body mass index of 21.1 and a low diabetes pedigree function score of 0.389, this individual appears to have a relatively low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"The patient is a 29-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 76, triceps skin fold thickness of 37, and a plasma glucose concentration of 120 after a glucose tolerance test. Their 2-hour serum insulin level is 105, with a body mass index of 39.7. Additionally, their diabetes pedigree function value is 0.215.###\nHence this label was avoid."
"A 25-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure of 70. She has a relatively high triceps skin fold thickness of 31, indicating a potential risk of obesity. Her plasma glucose concentration after a glucose tolerance test is quite elevated at 193, suggestive of possible diabetes. Despite a 0 insulin level, she has a high body mass index of 34.9, indicating obesity. However, her low diabetes pedigree function score of 0.241 suggests a lower genetic risk for diabetes.###\nHence this label was consent."
"This 22-year-old patient has been pregnant 3 times and shows signs of potential risk for diabetes with high diastolic blood pressure, elevated plasma glucose concentration, high serum insulin levels, and a BMI indicating obesity. However, the patient has a relatively low triceps skin fold thickness and a low diabetes pedigree function, which may indicate a lower genetic predisposition for diabetes.###\nHence this label was consent."
"This individual is 30 years old and has been pregnant 3 times. They have a diastolic blood pressure of 64 and a triceps skin fold thickness of 37. Their plasma glucose concentration in an oral glucose tolerance test is 170, and their 2-hour serum insulin level is 225. They have a body mass index of 34.5 and a diabetes pedigree function of 0.356.###\nHence this label was consent."
"This patient is a 21-year-old who has never been pregnant. They have a diastolic blood pressure of 86 and a triceps skin fold thickness of 27. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 126, and their 2-hour serum insulin level is 120. With a body mass index of 27.4 and a diabetes pedigree function of 0.515, this patient's risk of developing diabetes may be worth monitoring.###\nHence this label was avoid."
"This patient is a 31-year-old female who has been pregnant 7 times. Her diastolic blood pressure is 74, and she has a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 107, and her 2-hour serum insulin level is 0. With a body mass index of 29.6 and a diabetes pedigree function of 0.254, this patient's risk of developing diabetes is uncertain based on these measurements.###\nHence this label was consent."
"The patient is a 41-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 112, with a 2-hour serum insulin level of 0. The patient has a body mass index of 37.8 and a diabetes pedigree function of 0.261.###\nHence this label was consent."
"This data belongs to a 49-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 78, a triceps skin fold thickness of 31, and a body mass index of 27.6. In a 2-hour oral glucose tolerance test, their plasma glucose concentration was 125. Their 2-hour serum insulin level is 0, and their diabetes pedigree function is 0.565.###\nHence this label was consent."
"This patient is a 27-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 72, triceps skin fold thickness of 25, plasma glucose concentration of 128, and 2-hour serum insulin level of 190. Her body mass index is 32.4 and her diabetes pedigree function is 0.549. Overall, she shows some risk factors for diabetes, such as high insulin levels and BMI, but further evaluation would be needed for a definitive diagnosis.###\nHence this label was consent."
"The patient is a young, non-pregnant individual with normal blood pressure, no triceps skin fold thickness, and moderate body mass index. Their glucose and insulin levels are within normal range, and they have a low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 86, triceps skin fold thickness of 16, and a plasma glucose concentration of 81 following a glucose tolerance test. Her 2-hour serum insulin level is 66, with a body mass index of 27.5 and a diabetes pedigree function of 0.306.###\nHence this label was avoid."
"This is a 21-year-old individual who has been pregnant twice. They have a normal diastolic blood pressure of 64 and a low triceps skin fold thickness of 0. Their plasma glucose concentration is 108 after a 2-hour oral glucose tolerance test, and their 2-hour serum insulin level is 0. The individual has a body mass index of 30.8, indicating they are overweight. Their diabetes pedigree function is low at 0.158, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 39-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 74 and triceps skin fold thickness of 31. Her plasma glucose concentration after a glucose tolerance test is 84, with a 2-hour serum insulin level of 0. She has a body mass index of 38.3 and a diabetes pedigree function of 0.457.###\nHence this label was avoid."
"A 23-year-old woman who is pregnant for the first time has a healthy diastolic blood pressure of 64. Her triceps skin fold thickness is moderate at 13. She has a normal glucose concentration of 82 after a 2-hour oral glucose tolerance test. Her insulin level is slightly elevated at 95. With a body mass index of 21.2, she is in the healthy weight range. Her diabetes pedigree function score is low at 0.415, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"A 24-year-old woman who has been pregnant 6 times shows normal diastolic blood pressure and low triceps skin fold thickness. Her glucose levels after a GTT are within normal range, with no insulin present. She has a slightly elevated body mass index and a low diabetes pedigree function score.###\nHence this label was avoid."
"This is a 21-year-old woman who is pregnant for the first time. She has a healthy diastolic blood pressure of 64 and a normal triceps skin fold thickness of 24. Her blood sugar level after a glucose tolerance test is 91, and her insulin level after 2 hours is 0. She has a body mass index of 29.2, indicating she is overweight. Her diabetes pedigree function is low at 0.192, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"A 40-year-old individual who has been pregnant 6 times with a low diastolic blood pressure of 60. They have a moderate triceps skin fold thickness of 39 and a normal plasma glucose concentration of 115 after a glucose tolerance test. Their insulin level at 2 hours is 0, indicating normal insulin production. Despite a slightly elevated body mass index of 33.7, their diabetes pedigree function is low at 0.245.###\nHence this label was consent."
"The individual in this dataset is a 42-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 84, a triceps skin fold thickness of 35, and a plasma glucose concentration of 136 after a glucose tolerance test. Her 2-hour serum insulin level is 130, and her body mass index is 28.3. She has a low diabetes pedigree function score of 0.26.###\nHence this label was consent."
"This data describes a 21-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 58 and a low triceps skin fold thickness of 10. Her plasma glucose concentration after a glucose tolerance test is normal at 99, and she has no insulin present in her serum after 2 hours. She has a healthy body mass index of 25.4 and a relatively low diabetes pedigree function score of 0.551.###\nHence this label was avoid."
"This individual is 42 years old and has been pregnant 8 times. They have a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 23. Their blood glucose level after a glucose tolerance test is low at 65 and they have no insulin present in their serum after 2 hours. Despite having a body mass index of 32.0, which is considered overweight, their diabetes pedigree function is low at 0.6 indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 48-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 92 mmHg and a triceps skin fold thickness of 18 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 106 mg/dL, and her 2-hour serum insulin level is 0 uU/mL. She has a body mass index of 22.7 and a diabetes pedigree function of 0.235.###\nHence this label was avoid."
"A 23-year-old individual who is pregnant for the first time and has a low diastolic blood pressure of 58. Their triceps skin fold thickness is 36, plasma glucose concentration after a GTT is 118, and 2-hour serum insulin level is 94. They have a body mass index of 33.3 and a low diabetes pedigree function of 0.261.###\nHence this label was avoid."
"This individual is a 37-year-old woman who has been pregnant 5 times. She has a normal diastolic blood pressure of 82. Her triceps skin fold thickness is minimal at 0. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 130. She has low 2-hour serum insulin levels at 0. She has a relatively high body mass index of 39.1 and a slightly elevated diabetes pedigree function of 0.956.###\nHence this label was consent."
"This data represents a 22-year-old individual who has never been pregnant and shows normal levels of diastolic blood pressure. The individual has a moderate triceps skin fold thickness and a slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is low, and they have a high body mass index indicating overweight. The individual also has a low diabetes pedigree function score, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 24-year-old woman who is pregnant for the first time has normal diastolic blood pressure and body mass index. Her triceps skin fold thickness is average, while her glucose levels after a glucose tolerance test are slightly elevated. She has high insulin levels and a low diabetes pedigree function score, indicating a potential risk for developing diabetes in the future.###\nHence this label was avoid."
"This individual is 34 years old and has been pregnant 4 times. They have a diastolic blood pressure of 80 and a triceps skin fold thickness of 15. Their plasma glucose concentration after a GTT is 123, and their 2-hour serum insulin level is 176. With a body mass index of 32.0 and a diabetes pedigree function of 0.443, this person's risk of developing diabetes may need to be monitored.###\nHence this label was avoid."
"A 26-year-old woman who has been pregnant three times shows normal diastolic blood pressure and low triceps skin fold thickness. Her glucose levels are low after a glucose tolerance test, but her insulin levels are higher than usual. She has a high body mass index and a relatively low diabetes pedigree function score.###\nHence this label was consent."
"This individual is a 29-year-old who has never been pregnant. She has normal diastolic blood pressure and triceps skin fold thickness. Her glucose levels after a GTT are within normal range. She has no serum insulin present, indicating normal insulin sensitivity. Her body mass index is in the overweight range. The diabetes pedigree function score suggests a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This patient is a 28-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 98 and a body mass index of 52.9, indicating obesity. Her triceps skin fold thickness and 2-hour serum insulin levels are both measured at 0. Despite these risk factors, her plasma glucose concentration is within normal range at 115. The diabetes pedigree function value is low at 0.209, suggesting a lower genetic risk for diabetes. Overall, this patient shows signs of obesity and history of pregnancies, but currently has a normal glucose level and lower genetic predisposition for diabetes.###\nHence this label was consent."
"This 33-year-old individual has been pregnant 8 times and has a diastolic blood pressure of 70. They have no triceps skin fold thickness, no 2-hour serum insulin, and a plasma glucose concentration of 108 after an oral glucose tolerance test. Their body mass index is 30.5 and they have a diabetes pedigree function value of 0.955.###\nHence this label was consent."
"The patient is a 59-year-old individual who is pregnant for the first time. They have low diastolic blood pressure and a normal triceps skin fold thickness. However, their plasma glucose concentration after a glucose tolerance test is high, indicating potential risk for diabetes. Additionally, they have very high serum insulin levels and a slightly elevated body mass index. The diabetes pedigree function suggests a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a young adult female who has never been pregnant. She has a normal diastolic blood pressure and a low triceps skin fold thickness. Her glucose levels are within the normal range after a 2-hour oral glucose tolerance test. She has no insulin present in her serum. Her body mass index is low, indicating she is underweight. The diabetes pedigree function score is also low, suggesting a low risk of developing diabetes.###\nHence this label was avoid."
"This data represents a 21-year-old individual who is 1 time pregnant with measurements indicating normal blood pressure, low triceps skin fold thickness, low plasma glucose concentration after a glucose tolerance test, high serum insulin levels, slightly elevated body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 33-year-old female who has been pregnant 9 times. She has a low diastolic blood pressure of 62 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 89, and her 2-hour serum insulin level is 0. She has a low body mass index of 22.5 and a relatively low diabetes pedigree function of 0.142.###\nHence this label was avoid."
"The patient is a 28-year-old woman who is in her first pregnancy. She has a normal diastolic blood pressure of 82. Her triceps skin fold thickness is minimal at 0. During a glucose tolerance test, her plasma glucose level after 2 hours is 138. Her insulin level at this time is also low at 0. She has a high body mass index of 40.1 and a relatively low diabetes pedigree function score of 0.236.###\nHence this label was avoid."
"A 55-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 70, triceps skin fold thickness of 33, plasma glucose concentration of 195 after a GTT, 2-hour serum insulin level of 145, body mass index of 25.1, and a diabetes pedigree function of 0.163.###\nHence this label was consent."
"A 28-year-old individual who is pregnant for the first time showed normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test was higher than normal at 144. They had no insulin present in their serum after 2 hours. Despite having a high body mass index of 41.3, their diabetes pedigree function score was relatively low at 0.607, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 25-year-old female who has been pregnant twice. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 32 mm. Her plasma glucose concentration after a GTT is 68 mg/dL and her 2-hour serum insulin level is 66 μU/mL. She has a body mass index of 25.0 kg/m² and a diabetes pedigree function of 0.187. Overall, this patient's diagnostic measurements indicate a relatively low risk of developing diabetes.###\nHence this label was avoid."
"A 21-year-old female who has never been pregnant shows normal diastolic blood pressure, high triceps skin fold thickness, and elevated plasma glucose levels after a glucose tolerance test. She has low insulin levels, a high body mass index, and a moderate familial tendency for diabetes.###\nHence this label was consent."
"A 21-year-old individual who has been pregnant twice, with a healthy diastolic blood pressure of 62 and a moderate triceps skin fold thickness of 32. Their plasma glucose concentration after a glucose tolerance test is normal at 108, and their 2-hour serum insulin level is 56. They have a healthy body mass index of 25.2 and a low diabetes pedigree function score of 0.128. Overall, this individual appears to have relatively low risk for developing diabetes based on these measurements.###\nHence this label was avoid."
"The patient is a 24-year-old individual who has been pregnant four times. They have normal diastolic blood pressure, a moderate triceps skin fold thickness, and a normal glucose concentration after a 2-hour oral glucose tolerance test. Their insulin levels are low, and they have a slightly elevated body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This individual is 58 years old and has never been pregnant. She has a diastolic blood pressure of 78, a triceps skin fold thickness of 32, and a high plasma glucose concentration of 173 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 265, and she has a high body mass index of 46.5. Additionally, her diabetes pedigree function is 1.159, indicating a potential genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 54-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 29 mm. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 150 mg/dL. Her 2-hour serum insulin level is 126 μU/ml. She has a body mass index of 35.2 and a diabetes pedigree function score of 0.692. Overall, these measurements indicate a risk for developing diabetes and may require medical attention.###\nHence this label was consent."
"This individual is a 22-year-old who has been pregnant three times and shows no signs of diastolic blood pressure, triceps skin fold thickness, 2-hour serum insulin, or body mass index. Their plasma glucose concentration after a glucose tolerance test is 80, and their diabetes pedigree function is 0.174.###\nHence this label was avoid."
"The patient is a 58-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 43. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 140. She also has a 2-hour serum insulin level of 325. With a body mass index of 39.2 and a diabetes pedigree function of 0.528, she may be at risk for developing diabetes.###\nHence this label was consent."
"A 22-year-old female who is one month pregnant and has normal diastolic blood pressure, but a slightly below average triceps skin fold thickness. Her plasma glucose concentration is within the normal range after a two-hour oral glucose tolerance test, however, her insulin level is high. She has a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was avoid."
"A 31-year-old woman who has been pregnant 4 times has a diastolic blood pressure of 78. She has a triceps skin fold thickness of 0, indicating low body fat. Her plasma glucose concentration after a glucose tolerance test is 158, and she has no serum insulin after 2 hours. Her body mass index is 32.9, suggesting she is overweight. Her diabetes pedigree function is 0.803, indicating a moderate likelihood of developing diabetes based on family history.###\nHence this label was consent."
"The individual in the data is 39 years old and has been pregnant 8 times. They have a diastolic blood pressure of 74 and a triceps skin fold thickness of 38. Their plasma glucose concentration after a 2-hour glucose tolerance test is 126, and their 2-hour serum insulin level is 75. The individual has a body mass index of 25.9 and a diabetes pedigree function of 0.162.###\nHence this label was avoid."
"This 47-year-old individual has been pregnant 7 times and shows normal diastolic blood pressure. They have a lower triceps skin fold thickness and no insulin level after a glucose tolerance test. However, their plasma glucose concentration is slightly elevated. With a high body mass index and a low diabetes pedigree function, this person may have a moderate risk of developing diabetes.###\nHence this label was consent."
"The patient is a 23-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 42 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 153 mg/dL. She also has a 2-hour serum insulin level of 485 μU/mL and a body mass index of 40.6, indicating obesity. Her diabetes pedigree function is 0.687, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 41-year-old woman who has been pregnant 7 times shows normal diastolic blood pressure and moderate triceps skin fold thickness. Her glucose levels after a GTT are slightly below average, while her insulin levels are within the normal range. She has a relatively high body mass index and a moderate diabetes pedigree function score.###\nHence this label was avoid."
"This patient is a 23-year-old female who has been pregnant 4 times. She has a diastolic blood pressure reading of 0, triceps skin fold thickness of 0, and 2-hour serum insulin level of 0. Her plasma glucose concentration after a glucose tolerance test is 132, and she has a body mass index of 32.9. The diabetes pedigree function for this patient is 0.302.###\nHence this label was consent."
"This individual is a 23-year-old who is pregnant for the first time. She has a very low diastolic blood pressure of 54 mmHg. Her triceps skin fold thickness is 25 mm, indicating a moderate amount of subcutaneous fat. Her plasma glucose concentration after a glucose tolerance test is 91 mg/dL. She has a 2-hour serum insulin level of 100 mU/mL. With a body mass index of 25.2, she falls within the normal weight range. Her diabetes pedigree function score is low at 0.234, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"A 22-year-old individual, who is pregnant for the first time, has a diastolic blood pressure of 78 and a triceps skin fold thickness of 42. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 181, and their 2-hour serum insulin level is 293. With a body mass index of 40.0 and a diabetes pedigree function value of 1.258, this individual's risk for developing diabetes may be high.###\nHence this label was consent."
"The patient is a 22-year-old woman who has never been pregnant. She has a diastolic blood pressure of 66, triceps skin fold thickness of 27, and a plasma glucose concentration of 119 after a glucose tolerance test. Her 2-hour serum insulin level is 0, indicating low insulin production. She has a high body mass index of 38.8 and a low diabetes pedigree function of 0.259.###\nHence this label was avoid."
"The patient is 33 years old and has been pregnant 9 times. Their diastolic blood pressure is 56, and their triceps skin fold thickness is 0. They have a plasma glucose concentration of 122 after a GTT and a 2-hour serum insulin level of 0. With a body mass index of 33.3, the patient has a diabetes pedigree function of 1.114.###\nHence this label was consent."
"A 22-year-old individual who has been pregnant 2 times has a diastolic blood pressure of 62 and a triceps skin fold thickness of 10. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 108, with a 2-hour serum insulin level of 278. They have a body mass index of 25.3 and a diabetes pedigree function of 0.881.###\nHence this label was avoid."
"The patient is a 24-year-old female who has been pregnant 3 times. She has low diastolic blood pressure (58 mmHg) and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125 mg/dL. She has no serum insulin present and a moderately high body mass index of 31.6. Her diabetes pedigree function score is low at 0.151.###\nHence this label was avoid."
"A 38-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure, no triceps skin fold thickness, and normal plasma glucose concentration 2 hours after a glucose tolerance test. She has no serum insulin after 2 hours and has a slightly elevated body mass index. Her diabetes pedigree function is low.###\nHence this label was avoid."
"This 57-year-old individual, who has been pregnant 5 times, shows normal diastolic blood pressure of 74. However, they have no triceps skin fold thickness, indicating a potential health concern. Their plasma glucose concentration after a glucose tolerance test is 114, which is within the normal range. They have no insulin level after 2 hours, a body mass index of 24.9, and a diabetes pedigree function value of 0.744, suggesting a moderate genetic predisposition to diabetes.\n###\nHence this label was avoid."
"This individual is 30 years old and has been pregnant 10 times. \nThey have a diastolic blood pressure reading of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. \nTheir plasma glucose concentration after a glucose tolerance test is 115. \nWith a body mass index of 0.0 and a diabetes pedigree function of 0.261, this individual may have a low risk of developing diabetes based on these measurements.###\nHence this label was consent."
"A 25-year-old individual, who is pregnant for the first time, with normal diastolic blood pressure and a healthy BMI. Their triceps skin fold thickness is within normal range, and their glucose levels after a 2-hour oral glucose tolerance test are also normal. However, their insulin levels are slightly elevated. The individual has a low diabetes pedigree function score, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 24-year-old who has never been pregnant. Their diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin levels are all at 0. However, their plasma glucose concentration after a glucose tolerance test is 119, and their body mass index is 32.4, indicating they may be overweight. They have a low diabetes pedigree function score of 0.141, suggesting a relatively lower genetic risk of diabetes.###\nHence this label was consent."
"This data belongs to a 21-year-old individual who is 1 time pregnant. They have a diastolic blood pressure of 64, triceps skin fold thickness of 19, and a plasma glucose concentration of 97 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 82, body mass index is 18.2, and diabetes pedigree function is 0.299.###\nHence this label was avoid."
"This patient, a 22-year-old female, has been pregnant twice and shows abnormal values in several key health indicators: diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin are all at 0. Despite having a low plasma glucose concentration after a glucose tolerance test, the patient has a low BMI and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"A 60-year-old individual, who has been pregnant 5 times, shows normal diastolic blood pressure of 75. They have average triceps skin fold thickness at 26, with a slightly low 2-hour serum insulin of 0 and a plasma glucose concentration of 109. Despite having a high body mass index of 36.0, their diabetes pedigree function is relatively low at 0.546.###\nHence this label was avoid."
"The patient is a 25-year-old female who is 3 times pregnant. She has a low diastolic blood pressure of 50 and a low triceps skin fold thickness of 10. Her plasma glucose concentration is within the normal range at 113, and she has a moderate 2-hour serum insulin level of 85. With a body mass index of 29.5, she is considered overweight. The diabetes pedigree function score is 0.626, indicating a moderate genetic risk for diabetes. Overall, the patient shows some signs of risk factors for diabetes, but further monitoring and evaluation are recommended.###\nHence this label was avoid."
"The individual is a young adult who has never been pregnant. Their diastolic blood pressure, triceps skin fold thickness, and plasma glucose concentration are within normal ranges. Their 2-hour serum insulin level is slightly elevated. They have a high body mass index, indicating overweight or obesity. The diabetes pedigree function suggests a moderate genetic predisposition to diabetes. Overall, this individual may have a moderate risk of developing diabetes due to their insulin levels and BMI.###\nHence this label was avoid."
"This individual is a 25-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 60 and a triceps skin fold thickness of 0, indicating low body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 90, which is within the normal range. She has a low 2-hour serum insulin level of 0 and a healthy body mass index of 23.5. The diabetes pedigree function is low at 0.191, suggesting a low genetic risk for diabetes. Overall, based on these factors, this individual appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"This data belongs to a 22-year-old individual who has been pregnant twice. They have a low diastolic blood pressure of 56 and a moderate triceps skin fold thickness of 28. Their plasma glucose concentration after a GTT is low at 56, and they have a normal 2-hour serum insulin level of 45. With a healthy body mass index of 24.2 and a low diabetes pedigree function score of 0.332, this individual shows no significant risk factors for developing diabetes based on these measurements.###\nHence this label was avoid."
"The patient is 54 years old and has been pregnant 2 times. They have normal diastolic blood pressure and triceps skin fold thickness. Their glucose level after a 2-hour oral glucose tolerance test is 109, with no insulin present. The patient has a high body mass index of 42.7 and a moderate diabetes pedigree function of 0.845.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 32. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 103. She has a 2-hour serum insulin level of 0. With a body mass index of 39.1 and a diabetes pedigree function of 0.344, she may be at risk for developing diabetes.###\nHence this label was consent."
"This individual is a 23-year-old who has never been pregnant. They have a diastolic blood pressure of 80 mmHg and a triceps skin fold thickness of 37 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 127 mg/dL and their 2-hour serum insulin level is 210 μU/mL. With a body mass index of 36.3 and a diabetes pedigree function of 0.804, this individual's risk for developing diabetes may be influenced by these factors.###\nHence this label was avoid."
"A 21-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 50 mmHg, a triceps skin fold thickness of 23 mm, a plasma glucose concentration of 84 mg/dL after a glucose tolerance test, a 2-hour serum insulin level of 76 µU/ml, a body mass index of 30.4, and a diabetes pedigree function value of 0.968.###\nHence this label was avoid."
"This is a 24-year-old individual who has been pregnant 2 times. Their diastolic blood pressure is 80, triceps skin fold thickness is 14, and plasma glucose concentration after a glucose tolerance test is 90. They have a 2-hour serum insulin level of 55 and a body mass index of 24.4. The diabetes pedigree function for this individual is 0.249.###\nHence this label was avoid."
"This individual is a 59-year-old who has never been pregnant. Their diastolic blood pressure is 84, triceps skin fold thickness is 27, and their plasma glucose concentration after a glucose tolerance test is 137. They have no insulin after 2 hours, a body mass index of 27.3, and a low diabetes pedigree function of 0.231.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 0 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 90 mg/dL. She has a 2-hour serum insulin level of 0 μU/ml and a body mass index of 28.0 kg/m². Her diabetes pedigree function is 0.61, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 33-year-old female who has been pregnant twice. She has a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 24 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 75 mg/dL, and her 2-hour serum insulin level is 55 μU/mL. She has a body mass index of 29.7, indicating she is overweight. Her diabetes pedigree function is 0.37, suggesting a moderate family history of diabetes.###\nHence this label was avoid."
"A 27-year-old individual who has been pregnant 3 times with normal diastolic blood pressure and a moderate triceps skin fold thickness. Their glucose levels after a 2-hour oral test are within the normal range, but their insulin levels are elevated. They have a healthy body mass index and a slightly above average diabetes pedigree function score.###\nHence this label was avoid."
"A 28-year-old woman who has been pregnant twice shows no diastolic blood pressure or triceps skin fold thickness. Her glucose levels are normal at 146, with low insulin levels. Despite a healthy body mass index of 27.5, she has a moderate diabetes pedigree function of 0.24, indicating a potential genetic risk for diabetes.###\nHence this label was consent."
"This data represents a relatively young individual with a low number of pregnancies and low diastolic blood pressure. The individual has a moderate triceps skin fold thickness and a normal plasma glucose concentration after a glucose tolerance test. Additionally, the individual has very low serum insulin levels, a slightly elevated body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"This individual is a 22-year-old who has never been pregnant and shows normal diastolic blood pressure and triceps skin fold thickness. They have a slightly elevated glucose level after a GTT, high serum insulin levels, and a high body mass index. The diabetes pedigree function indicates a moderate genetic susceptibility to diabetes.###\nHence this label was avoid."
"The patient, a 35-year-old female, has been pregnant 5 times. She has a healthy diastolic blood pressure of 74 and a slightly below average triceps skin fold thickness of 29. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 116, while her 2-hour serum insulin level is 0. With a body mass index of 32.3, she falls into the overweight category. Her diabetes pedigree function score is 0.66, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant twice. She has a very low diastolic blood pressure of 52 and zero triceps skin fold thickness. Her plasma glucose level after a 2-hour oral glucose tolerance test is 92, and she has no insulin in her serum. Despite having a body mass index of 30.1, which indicates she is overweight, her diabetes pedigree function is low at 0.141. Overall, she appears to have some risk factors for diabetes but also some protective factors.###\nHence this label was avoid."
"The patient is a 46-year-old female who has never been pregnant. She has normal diastolic blood pressure and no triceps skin fold thickness. Her glucose level after a 2-hour oral glucose tolerance test is 105, with low insulin levels. She has a slightly elevated body mass index of 29.6 and a low diabetes pedigree function of 0.197. Overall, the patient shows some signs of potential risk for diabetes, but further evaluation may be needed for a definitive diagnosis.###\nHence this label was avoid."
"The individual is a 45-year-old woman who has been pregnant 9 times. She has a low diastolic blood pressure of 70 and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 130, and her 2-hour serum insulin level is zero. She has a body mass index of 34.2 and a diabetes pedigree function of 0.652.###\nHence this label was consent."
"The individual is a 52-year-old woman who has been pregnant once. She has normal diastolic blood pressure and a slightly elevated plasma glucose concentration after a glucose tolerance test. She has a relatively high body mass index and a moderately high diabetes pedigree function score. Additionally, her triceps skin fold thickness is within normal range but her 2-hour serum insulin level is low.###\nHence this label was consent."
"The patient is a 21-year-old female who is in the early stage of her pregnancy. She has a very low diastolic blood pressure of 55, no triceps skin fold thickness, and a low plasma glucose concentration of 80 after a glucose tolerance test. Her insulin levels are also low at 0, and she has a relatively low body mass index of 19.1. The diabetes pedigree function score is 0.258, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 22-year-old who has never been pregnant. Their diastolic blood pressure is 64, triceps skin fold thickness is 37, and plasma glucose concentration after a GTT is 104. Their 2-hour serum insulin level is 64, and they have a body mass index of 33.6. With a low diabetes pedigree function score of 0.51, this person shows relatively normal values across most of the diagnostic measurements.###\nHence this label was consent."
"This is a patient, 24 years old, who has been pregnant 2 times. She has a low diastolic blood pressure of 54 and a moderately high triceps skin fold thickness of 28. Her plasma glucose concentration after a glucose tolerance test is normal at 100. She has a higher than average serum insulin level of 105. With a body mass index of 37.8, she is considered obese. Her diabetes pedigree function score is moderate at 0.498.###\nHence this label was avoid."
"This data belongs to a 24-year-old individual who has been pregnant 4 times and shows low levels in key health indicators such as triceps skin fold thickness and serum insulin. However, their blood pressure, glucose levels, body mass index, and diabetes pedigree function are within healthy ranges.###\nHence this label was avoid."
"This 37-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 72. They have a triceps skin fold thickness of 29 and a plasma glucose concentration of 154 after a GTT. Their 2-hour serum insulin level is 126, with a body mass index of 31.3. The diabetes pedigree function for this individual is 0.338.###\nHence this label was avoid."
"The patient is a 40-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 23.0 kg/m^2 and a diabetes pedigree function value of 0.254.###\nHence this label was avoid."
"A 30-year-old individual who has been pregnant 5 times with very low diastolic blood pressure, moderate triceps skin fold thickness, and normal glucose levels. They have moderate serum insulin levels, a slightly elevated body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 42-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 66 and a moderately high triceps skin fold thickness of 29. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 100. She has high 2-hour serum insulin levels of 196 and a body mass index of 32.0, indicating she is overweight. Her diabetes pedigree function score is relatively low at 0.444, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 24-year-old individual who has been pregnant 5 times with a healthy diastolic blood pressure of 68 and a moderate triceps skin fold thickness of 28. Their glucose levels after a 2-hour oral glucose tolerance test are normal at 86, with a slightly elevated serum insulin level of 71. They have a body mass index indicating overweight at 30.2 and a low diabetes pedigree function score of 0.364.###\nHence this label was avoid."
"The patient is a 27-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 94 mmHg. Her triceps skin fold thickness is 41mm. During a glucose tolerance test, her plasma glucose concentration after 2 hours is 147 mg/dL. She has no detectable insulin levels after 2 hours. Her body mass index is 49.3, indicating obesity. The diabetes pedigree function value is 0.358, suggesting a low genetic risk for diabetes.###\nHence this label was consent."
"This 26-year-old individual has been pregnant 6 times and shows unusual measurements in some health indicators: diastolic blood pressure, triceps skin fold thickness, serum insulin, and body mass index are at zero. However, plasma glucose concentration after a glucose tolerance test is 114, indicating a normal level. The diabetes pedigree function is low at 0.189, suggesting a relatively low genetic risk of developing diabetes.###\nHence this label was avoid."
"This is a 46-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 72 and a triceps skin fold thickness of 19. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 118. Their 2-hour serum insulin level is 0. With a body mass index of 23.1 and a diabetes pedigree function score of 1.476, this individual's risk for developing diabetes may be relatively low.###\nHence this label was avoid."
"This data describes a 21-year-old individual who has been pregnant twice, with a diastolic blood pressure of 60. They have a triceps skin fold thickness of 17, a plasma glucose concentration of 99 after a glucose tolerance test, and a 2-hour serum insulin level of 160. Their body mass index is 36.6 and the diabetes pedigree function is 0.453.###\nHence this label was avoid."
"This 22-year-old individual, who has been pregnant once, has a diastolic blood pressure of 78 mmHg. They have a triceps skin fold thickness of 27 mm and their plasma glucose concentration after a glucose tolerance test is 87 mg/dL. Their 2-hour serum insulin level is 32 μU/mL and their body mass index is 34.6 kg/m². The diabetes pedigree function indicates a low genetic risk for diabetes at 0.101.###\nHence this label was avoid."
"This patient is 29 years old and has been pregnant 4 times. She has a low diastolic blood pressure of 66 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 110. She has a 2-hour serum insulin level of 0 and a body mass index of 31.9. The Diabetes Pedigree Function value is 0.471.###\nHence this label was avoid."
"The patient is a 53-year-old woman who has been pregnant 9 times. She has normal diastolic blood pressure, no triceps skin fold thickness, and a healthy body mass index. Her plasma glucose concentration is slightly elevated at 156 mg/dL after a 2-hour oral glucose tolerance test. The patient has no insulin in her serum and a low diabetes pedigree function of 0.23.###\nHence this label was consent."
"The patient is a 52-year-old woman who has never been pregnant. She has a normal diastolic blood pressure of 72 and a triceps skin fold thickness of 0, indicating low levels of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 123, which is within the normal range. She has no insulin present in her serum after 2 hours. Her body mass index is 36.3, which is classified as obese. The diabetes pedigree function value is 0.258, indicating a moderate genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 21-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 58 and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 105, with no detectable serum insulin. She has a healthy body mass index of 24.3 and a low diabetes pedigree function of 0.187. Overall, she appears to have a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"A 25-year-old individual, who has been pregnant 3 times, with a diastolic blood pressure of 62 mmHg. They have a triceps skin fold thickness of 24 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 108 mg/dL. They have no insulin level after 2 hours. Their body mass index is 26.0, and their diabetes pedigree function is 0.223.###\nHence this label was avoid."
"A 30-year-old individual, who has been pregnant 4 times, is showing normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 110, with no 2-hour serum insulin detected. Despite having a high body mass index of 37.6, the individual has a low diabetes pedigree function score of 0.191.###\nHence this label was avoid."
"This patient is a 24-year-old female who has never been pregnant and has a diastolic blood pressure of 84 mmHg. She has a triceps skin fold thickness of 29mm and a plasma glucose concentration of 126 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 215 μU/mL and her body mass index is 30.7 kg/m². Additionally, her diabetes pedigree function is 0.52, indicating a genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a young adult with a low number of pregnancies. They have a normal diastolic blood pressure and body mass index, along with a relatively low triceps skin fold thickness. Their glucose levels after a glucose tolerance test are within a healthy range. The individual has low insulin levels and a moderately low diabetes pedigree score.###\nHence this label was avoid."
"This data belongs to a 22-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, low triceps skin fold thickness, low glucose concentration after a glucose tolerance test, no insulin in her blood after 2 hours, and a slightly elevated body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 25-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and low 2-hour serum insulin levels. Her plasma glucose concentration after a glucose tolerance test is below the normal range. She has a low body mass index and a relatively low diabetes pedigree function score. Overall, the data suggests that this patient has a low risk of developing diabetes.###\nHence this label was avoid."
"A 21-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 78. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 90 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 0. Their body mass index is 42.7, and their diabetes pedigree function is 0.559.###\nHence this label was avoid."
"This patient is a 50-year-old individual who is slightly overweight (body mass index of 32.8) with a moderate risk of developing diabetes. They have only been pregnant once, have normal diastolic blood pressure, and moderate triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is elevated at 164, and they have a moderate level of insulin in their serum. Their diabetes pedigree function score is relatively low at 0.341. Overall, this individual may need to monitor their blood sugar levels closely to prevent the onset of diabetes.###\nHence this label was avoid."
"A 21-year-old individual who has been pregnant twice with a slightly low diastolic blood pressure of 52. They have a moderate triceps skin fold thickness of 15 and a normal plasma glucose concentration of 99 after a glucose tolerance test. Their 2-hour serum insulin levels are slightly elevated at 94, with a healthy body mass index of 24.6. The individual has a relatively low diabetes pedigree function score of 0.637.###\nHence this label was avoid."
"A 22-year-old female, who is pregnant for the first time, has a normal diastolic blood pressure of 74 and a low triceps skin fold thickness of 11. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 80, while her 2-hour serum insulin level is slightly elevated at 60. She has a body mass index of 30.0, indicating obesity, and a relatively low diabetes pedigree function of 0.527. Overall, this individual may have a moderate risk of developing diabetes due to her elevated insulin levels and high body mass index.###\nHence this label was avoid."
"This individual, aged 41, has been pregnant 6 times. They have a diastolic blood pressure of 74 and a triceps skin fold thickness of 18. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 104. Their 2-hour serum insulin level is 156. With a body mass index of 29.9 and a diabetes pedigree function of 0.722, this person's diabetes risk profile can be assessed.###\nHence this label was consent."
"This individual, aged 25, has been pregnant three times. They have a low diastolic blood pressure of 58 and a moderately low triceps skin fold thickness of 31. Their plasma glucose concentration after a glucose tolerance test is also low at 83. Their 2-hour serum insulin level is 18, indicating normal insulin sensitivity. With a body mass index of 34.3, they are considered obese. The diabetes pedigree function value is low at 0.336, suggesting a lower risk of developing diabetes based on genetic factors.###\nHence this label was avoid."
"A non-pregnant young individual with normal diastolic blood pressure, moderate triceps skin fold thickness, normal glucose levels after a glucose tolerance test, high serum insulin levels, obesity, and a relatively low diabetes pedigree function score.###\nHence this label was avoid."
"A 25-year-old woman who has never been pregnant has normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness suggests adequate body fat, and her blood glucose levels are within the normal range after a glucose tolerance test. Additionally, her insulin levels are normal, and her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is 33 years old and has been pregnant 6 times. They have lower than normal diastolic blood pressure at 50, with a moderate triceps skin fold thickness of 22. Their plasma glucose concentration after a glucose tolerance test is within normal range at 119, but their 2-hour serum insulin level is high at 176. Despite this, their body mass index is in the healthy range at 27.1, and they have a moderately high diabetes pedigree function score of 1.318.###\nHence this label was consent."
"A 21-year-old woman, who is pregnant for the first time, has a diastolic blood pressure of 78 mmHg, triceps skin fold thickness of 50mm, and a plasma glucose concentration of 71 mg/dL two hours after an oral glucose tolerance test. Her 2-hour serum insulin level is 45 μU/mL, and she has a body mass index of 33.2. Her diabetes pedigree function is 0.422, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"A 31-year-old woman who has never been pregnant has slightly elevated diastolic blood pressure and a high percentage of body fat. She has normal glucose levels after a 2-hour oral glucose tolerance test, but unusually high insulin levels. Her family history suggests a low risk for developing diabetes.###\nHence this label was consent."
"The patient is a 65-year-old who has been pregnant 5 times. She has a healthy diastolic blood pressure of 78 and no triceps skin fold thickness. Her plasma glucose concentration after a meal is 147, with no serum insulin detected. Despite having a body mass index of 33.7, she has a low diabetes pedigree function of 0.218.###\nHence this label was avoid."
"This individual is 58 years old and has been pregnant 8 times. They have a normal diastolic blood pressure of 72 and a very low triceps skin fold thickness of 0. Their glucose level after a GTT is 112, with no insulin present. They have a healthy body mass index of 23.6 and a low diabetes pedigree function of 0.84.###\nHence this label was avoid."
"A 43-year-old woman who has been pregnant 15 times has a diastolic blood pressure of 70. Her triceps skin fold thickness is 32, plasma glucose concentration is 136, and 2-hour serum insulin levels are at 110. She has a body mass index of 37.1 and a diabetes pedigree function of 0.153.###\nHence this label was consent."
"This individual is a 21-year-old who has never been pregnant. Her diastolic blood pressure is 70 mmHg and she has a triceps skin fold thickness of 26 mm. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 100 mg/dL and her 2-hour serum insulin level is 50 μU/ml. She has a body mass index of 30.8 kg/m² and a diabetes pedigree function of 0.597.###\nHence this label was avoid."
"A 22-year-old woman who has been pregnant 3 times with a low diastolic blood pressure of 54 and no triceps skin fold thickness. She has a normal plasma glucose concentration at 139 after a glucose tolerance test, no insulin after 2 hours, and a healthy body mass index of 25.6. Her diabetes pedigree function is low at 0.402.###\nHence this label was consent."
"This data is from a 24-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 80, triceps skin fold thickness of 45, plasma glucose concentration at 112 after a GTT, and 2-hour serum insulin level of 132. Her body mass index is 34.8 and her diabetes pedigree function is 0.217.###\nHence this label was avoid."
"This individual is a 46-year-old female who has been pregnant 12 times. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 31 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 84 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 29.7 kg/m^2 and a diabetes pedigree function of 0.297. Overall, her diagnostic measurements suggest a relatively low risk of developing diabetes.###\nHence this label was consent."
"The individual is a 24-year-old woman who has never been pregnant. She has a normal diastolic blood pressure reading of 80 and a slightly elevated triceps skin fold thickness of 31. Her glucose levels are within the normal range at 117 after a 2-hour oral glucose tolerance test, while her insulin levels are also normal at 53. Despite having a high body mass index of 45.2, her diabetes pedigree function score is low at 0.089, indicating a relatively low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 57-year-old woman who has been pregnant 10 times. She has normal diastolic blood pressure and low triceps skin fold thickness. Her glucose level after a 2-hour oral glucose tolerance test is within a healthy range. She has no insulin present after 2 hours. Her body mass index indicates she is overweight. The diabetes pedigree function suggests a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 45-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 84, a triceps skin fold thickness of 40, and a body mass index of 46.8, indicating obesity. Her plasma glucose concentration after a glucose tolerance test is 111, and she has no detectable serum insulin after 2 hours. Her diabetes pedigree function score is 0.925, suggesting a high genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 42-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 40 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 81 mg/dL, and her 2-hour serum insulin level is 48 µU/mL. With a body mass index of 46.7 kg/m² and a diabetes pedigree function value of 0.261, she may be at risk for developing diabetes.###\nHence this label was avoid."
"This individual is a 22-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. Her glucose concentration after a glucose tolerance test is within the normal range. She has a healthy body mass index and a low diabetes pedigree function, indicating a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 88 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 107, with a 2-hour serum insulin level of 0. Her body mass index is 36.8, and her diabetes pedigree function is 0.727.###\nHence this label was avoid."
"This patient is a 35-year-old woman who has never been pregnant. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 26mm. Her plasma glucose concentration after a glucose tolerance test is 180 mg/dL, and her 2-hour serum insulin level is 90 μU/mL. She has a body mass index of 36.5 and a low diabetes pedigree function score of 0.314.###\nHence this label was consent."
"This individual, aged 31, has been pregnant 6 times and shows normal values for diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin. They have a relatively low plasma glucose concentration after a glucose tolerance test. Their body mass index is in the normal range, and they have a moderate diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 31-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 39, and plasma glucose concentration of 109 after a glucose tolerance test. Her 2-hour serum insulin level is 114, body mass index is 27.9, and diabetes pedigree function is 0.64.###\nHence this label was consent."
"A 26-year-old individual who has been pregnant twice shows normal diastolic blood pressure, moderate triceps skin fold thickness, and slightly elevated plasma glucose concentration after a GTT. Their insulin levels are within a healthy range, but they have a higher body mass index. Overall, their diabetes pedigree function indicates a lower risk of developing diabetes.###\nHence this label was avoid."
"A 36-year-old woman, who has been pregnant 10 times, has a low diastolic blood pressure of 68. Her triceps skin fold thickness is 0, indicating low body fat. She has a normal plasma glucose concentration of 133 and no serum insulin after a 2-hour oral glucose tolerance test. With a healthy body mass index of 27.0 and a low diabetes pedigree function of 0.245, she appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"A 24-year-old female who is pregnant for the first time has a healthy diastolic blood pressure of 62, with a low triceps skin fold thickness of 12. Her glucose levels after a 2-hour oral glucose tolerance test are within normal range at 90, and she has a moderate insulin level of 43. Her body mass index is at a healthy 27.2, and she has a low diabetes pedigree function score of 0.58.###\nHence this label was avoid."
"The patient is a 63-year-old who has been pregnant three times. They have a normal diastolic blood pressure of 80 and a relatively low triceps skin fold thickness of 15. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 142, and they have no detectable insulin levels. With a body mass index of 32.4 and a low diabetes pedigree function of 0.2, the patient shows some risk factors for diabetes but also some healthy indicators.###\nHence this label was avoid."
"A 22-year-old patient who has never been pregnant has a diastolic blood pressure of 70. They have a triceps skin fold thickness of 38, a plasma glucose concentration of 137 after a glucose tolerance test, and a body mass index of 33.2. Their 2-hour serum insulin level is 0, and their diabetes pedigree function is 0.17.###\nHence this label was avoid."
"A 38-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 82. Their triceps skin fold thickness is 30mm and they have a plasma glucose concentration of 106mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0mu U/mL, and they have a body mass index of 39.5. Their diabetes pedigree function is 0.286.###\nHence this label was avoid."
"The patient is a young adult at the age of 21, with a low number of pregnancies (1). She has a normal diastolic blood pressure of 74 and a slightly below average triceps skin fold thickness of 20. During a glucose tolerance test, her plasma glucose concentration at 2 hours was 0, indicating good glucose control. Her 2-hour serum insulin level is 23, and her body mass index is within the normal range at 27.7. The diabetes pedigree function score is low at 0.299, suggesting a low genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 22-year-old who has been pregnant 3 times. They have a low diastolic blood pressure of 58 and a triceps skin fold thickness of 31, indicating a healthy body composition. Their plasma glucose concentration is 111 mg/dL, and their 2-hour serum insulin level is 44 uU/mL. With a body mass index of 29.5 and a low diabetes pedigree function of 0.43, this individual is at a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This is a 27-year-old individual who has never been pregnant and has a diastolic blood pressure of 80. They have a triceps skin fold thickness of 0, indicating lower body fat. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 91. They have no insulin present in their serum after the test. Despite having a body mass index of 32.4, which is considered overweight, their diabetes pedigree function is 0.601, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This 24-year-old individual, who has been pregnant 3 times, has a low diastolic blood pressure of 54. They have a triceps skin fold thickness of 21, a relatively normal plasma glucose concentration of 106, and a high 2-hour serum insulin level of 158. With a body mass index of 30.9, indicating overweight, and a low diabetes pedigree function score of 0.292, this person may have a higher risk of developing diabetes.###\nHence this label was avoid."
"This individual is a 43-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 31. Her plasma glucose concentration is 170 after a 2-hour oral glucose tolerance test, and she has no serum insulin present. With a body mass index of 44.0 and a diabetes pedigree function of 0.403, she may be at risk for developing diabetes.###\nHence this label was consent."
"A 41-year-old woman who has been pregnant twice shows no diastolic blood pressure, triceps skinfold thickness, or insulin after a glucose tolerance test. However, her plasma glucose concentration is 129 mg/dL, and she has a body mass index of 38.5, indicating potential risk for diabetes based on these measurements.###\nHence this label was avoid."
"The patient is 38 years old and has been pregnant 12 times. She has a healthy diastolic blood pressure of 70. The triceps skin fold thickness measurement is 40, indicating a moderate amount of body fat. A plasma glucose concentration test showed a reading of 151, which is slightly above normal. The 2-hour serum insulin level is high at 271. The patient's body mass index is 41.8, classified as obese. The diabetes pedigree function value is 0.742, suggesting a moderate genetic risk of developing diabetes.###\nHence this label was consent."
"A 48-year-old individual, who has been pregnant 12 times, with a diastolic blood pressure of 74, triceps skin fold thickness of 40, plasma glucose concentration of 88 after a GTT, 2-hour serum insulin level of 54, body mass index of 35.3, and a diabetes pedigree function score of 0.378.###\nHence this label was avoid."
"The patient is a 36-year-old woman who has been pregnant 6 times. She has a normal diastolic blood pressure of 82 and a low triceps skin fold thickness. Her plasma glucose concentration after a two-hour oral glucose tolerance test is 102, and her 2-hour serum insulin level is 0. Despite having a body mass index of 30.8, which is considered overweight, her diabetes pedigree function is low at 0.18.###\nHence this label was consent."
"This individual is a 37-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin level of 0. Her plasma glucose concentration after a GTT is 119 mg/dL. She has a body mass index of 25.2 and a low diabetes pedigree function score of 0.209.###\nHence this label was avoid."
"The patient is a 35-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 62 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a GTT is 123, with a 2-hour serum insulin level of 0. Her body mass index is 32.0 and the diabetes pedigree function is 0.226.###\nHence this label was consent."
"This patient is a 22-year-old female who has been pregnant 2 times. She has a diastolic blood pressure of 74, triceps skin fold thickness of 19, and a plasma glucose concentration of 88 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 53 μU/ml and her body mass index is 29.0. Additionally, she has a diabetes pedigree function score of 0.229.###\nHence this label was avoid."
"The patient is a 49-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 88, a triceps skin fold thickness of 36, and a plasma glucose concentration of 126 after a glucose tolerance test. Her 2-hour serum insulin level is 108, and her body mass index is 38.5. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This is a data record of a 34-year-old individual who has been pregnant 4 times. Their diastolic blood pressure is 68, and they have a triceps skin fold thickness of 0. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 120, and their 2-hour serum insulin level is 0. The individual has a body mass index of 29.6 and a diabetes pedigree function value of 0.709.###\nHence this label was avoid."
"The patient is 32 years old and has been pregnant 3 times. She has a diastolic blood pressure of 92 and a triceps skin fold thickness of 49. Her plasma glucose concentration after a glucose tolerance test is 129, and her 2-hour serum insulin level is 155. With a body mass index of 36.4 and a diabetes pedigree function of 0.968, she shows a risk for developing diabetes.###\nHence this label was consent."
"A 24-year-old individual who has never been pregnant has a diastolic blood pressure of 68. They have a triceps skin fold thickness of 42mm and a plasma glucose concentration of 135mg/dL after a glucose tolerance test. Their 2-hour serum insulin level is 250 μU/mL, and they have a body mass index of 42.3. Their diabetes pedigree function value is 0.365.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant 2 times. She has a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 35. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 101, and her 2-hour serum insulin level is 90. She has a low body mass index of 21.8 and a low diabetes pedigree function of 0.155.###\nHence this label was avoid."
"The patient is a 58-year-old woman who has been pregnant 9 times. She has a normal diastolic blood pressure of 68 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 91, with no insulin detected after 2 hours. She has a healthy body mass index of 24.2 and a low diabetes pedigree function of 0.2. Overall, her diagnostic measurements suggest a low risk of developing diabetes.###\nHence this label was avoid."
"This 23-year-old patient, who has been pregnant once, has a diastolic blood pressure of 86 mmHg. Their triceps skin fold thickness is 19mm. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 111 mg/dL, and their 2-hour serum insulin level is 0 μU/mL. They have a body mass index of 30.1 and a diabetes pedigree function of 0.143.###\nHence this label was avoid."
"A 28-year-old individual who has been pregnant 3 times and has a diastolic blood pressure of 66. Their triceps skin fold thickness is 39, plasma glucose concentration after a glucose tolerance test is 115, and 2-hour serum insulin level is 140. With a body mass index of 38.1 and a low diabetes pedigree function of 0.15, this individual's overall risk of developing diabetes appears to be relatively low.###\nHence this label was avoid."
"A 33-year-old individual, who has been pregnant 4 times, with a diastolic blood pressure of 70, triceps skin fold thickness of 14, plasma glucose concentration of 173 after a glucose tolerance test, 2-hour serum insulin level of 168, and a body mass index of 29.7. The diabetes pedigree function is 0.361.###\nHence this label was consent."
"A 24-year-old woman who has been pregnant 3 times shows low diastolic blood pressure of 52 mmHg. Her triceps skin fold thickness is 38mm, and she has high plasma glucose concentration of 162 mg/dL after a 2-hour glucose tolerance test. She has low insulin levels of 0 μU/ml and a high body mass index of 37.2. Her diabetes pedigree function is 0.652, indicating a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 21-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a healthy body mass index. Her plasma glucose concentration after a glucose tolerance test is 125, with low serum insulin levels. She has a low diabetes pedigree function score, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 50-year-old who has been pregnant 6 times. Their diastolic blood pressure is 62, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. However, their plasma glucose concentration after a glucose tolerance test is 162, indicating a possible risk for diabetes. They have a healthy body mass index of 24.3 and a low diabetes pedigree function of 0.178.###\nHence this label was consent."
"This data represents a 21-year-old individual who is pregnant for the first time. She has normal diastolic blood pressure and a moderately low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is slightly elevated. The individual has high levels of serum insulin. Despite a low body mass index, her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 43-year-old female who has been pregnant 8 times. She has a normal diastolic blood pressure of 78 mmHg and a high plasma glucose concentration of 188 mg/dL after a glucose tolerance test. She has no triceps skin fold thickness or serum insulin, but her body mass index is high at 47.9, indicating obesity. The diabetes pedigree function score is low at 0.137, suggesting a lower risk of developing diabetes based on family history.###\nHence this label was consent."
"A 43-year-old individual who has been pregnant 8 times with a diastolic blood pressure of 74, triceps skin fold thickness of 40, plasma glucose concentration at 100, 2-hour serum insulin level of 215, body mass index of 39.4, and a diabetes pedigree function of 0.661.###\nHence this label was consent."
"This patient is a 26-year-old female who has been pregnant 6 times. She has a normal diastolic blood pressure of 80 and a slightly above average body mass index of 32.5. Her triceps skin fold thickness is 28, indicating a moderate amount of body fat. Her plasma glucose concentration at 2 hours is 105, which is within the normal range. She has no insulin present in her bloodstream after a 2-hour oral glucose tolerance test. The diabetes pedigree function score of 0.878 suggests a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 36-year-old individual, who has been pregnant 7 times, with slightly high diastolic blood pressure of 88. Their triceps skin fold thickness is 44, plasma glucose concentration after a glucose tolerance test is 152. They have no 2-hour serum insulin. With a body mass index of 50.0, the individual has a low diabetes pedigree function of 0.337.###\nHence this label was consent."
"The individual is a 57-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 72 and a very low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is below the normal range at 95. The 2-hour serum insulin level is also very low. Despite having a high body mass index of 36.8, her diabetes pedigree function is relatively low at 0.485, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 33-year-old individual who has been pregnant 5 times and has a diastolic blood pressure of 72. They have a triceps skin fold thickness of 43, a plasma glucose concentration of 108 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 75. The individual has a body mass index of 36.1 and a diabetes pedigree function value of 0.263.###\nHence this label was avoid."
"The individual is 41 years old and has never been pregnant. They have a diastolic blood pressure of 104 mmHg and a triceps skin fold thickness of 25 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 189 mg/dL, with no detectable serum insulin. They have a body mass index of 34.3 and a diabetes pedigree function value of 0.435.###\nHence this label was consent."
"This individual is 30 years old, has been pregnant 4 times, and has a diastolic blood pressure of 84. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 137, and 0 insulin level after a glucose tolerance test. Their body mass index is 31.2 and their diabetes pedigree function is 0.252.###\nHence this label was avoid."
"The patient is a 27-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 20, and a body mass index of 28.4. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 110, and her 2-hour serum insulin level is 100. The diabetes pedigree function indicates a low genetic risk of diabetes at 0.118.###\nHence this label was avoid."
"The patient is a 21-year-old female who has been pregnant once. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 28, and a plasma glucose concentration of 116 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 27.4. She has a low diabetes pedigree function score of 0.204.###\nHence this label was avoid."
"This individual is a 49-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 85 mmHg and a triceps skin fold thickness of 15 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 184 mg/dL. She has a 2-hour serum insulin level of 0 uU/mL and a body mass index of 30.0 kg/m². Her diabetes pedigree function is 1.213, indicating a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 51-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 84 and a triceps skin fold thickness of 48. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 148, with a 2-hour serum insulin level of 237. Her body mass index is 37.6 and she has a diabetes pedigree function of 1.001.###\nHence this label was consent."
"This individual is a 26-year-old female who has been pregnant twice. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 25. Her plasma glucose concentration is 100 after a 2-hour oral glucose tolerance test, with a 2-hour serum insulin level of 71. She has a body mass index of 38.5 and a diabetes pedigree function value of 0.324.###\nHence this label was avoid."
"A 23-year-old female, who has been pregnant once, has a diastolic blood pressure of 86 mmHg and a triceps skin fold thickness of 30 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 143 mg/dL, with a 2-hour serum insulin level of 330 μU/mL. She has a body mass index of 30.1 and a diabetes pedigree function of 0.892.###\nHence this label was avoid."
"The patient, aged 67, has been pregnant 8 times and has a diastolic blood pressure of 80. They have a triceps skin fold thickness of 0, indicating very low subcutaneous fat. Their plasma glucose concentration after a glucose tolerance test is high at 194. There is no insulin present in their serum after 2 hours. Their body mass index is 26.1, considered slightly overweight. The patient has a relatively low diabetes pedigree function score of 0.551.###\nHence this label was avoid."
"This individual is a 30-year-old who has been pregnant once. They have a diastolic blood pressure of 70, triceps skin fold thickness of 40, and a body mass index of 38.1. Their plasma glucose concentration at 2 hours after an oral glucose tolerance test is 97. They have a 2-hour serum insulin level of 0 and a diabetes pedigree function score of 0.218.###\nHence this label was avoid."
"This patient is a 27-year-old female who has never been pregnant. She has a low diastolic blood pressure of 76 and a very low triceps skin fold thickness of 0, indicating low levels of body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 104, which is within the normal range. She has no insulin present in her serum after 2 hours. With a low body mass index of 18.4 and a moderately low diabetes pedigree function of 0.582, this patient is at a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This is a 23-year-old female who has been pregnant 3 times. She has a healthy diastolic blood pressure of 68 and a relatively low triceps skin fold thickness of 28. Her plasma glucose concentration after a meal is 74, and her 2-hour serum insulin level is 45. She has a body mass index of 29.7, indicating she is overweight. Her diabetes pedigree function score is 0.293, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This 41-year-old individual has been pregnant 5 times and shows low diastolic blood pressure. They have no triceps skin fold thickness and have a high plasma glucose concentration after a 2-hour oral glucose tolerance test. Their insulin levels are low, and they have a moderately high body mass index. The diabetes pedigree function indicates a low genetic predisposition to diabetes.###\nHence this label was consent."
"A 33-year-old woman, who is pregnant for the first time, has a diastolic blood pressure of 72. Her triceps skin fold thickness is 0, indicating low body fat. She has a high plasma glucose concentration of 163 after a glucose tolerance test. Her 2-hour serum insulin level is 0, showing possible insulin resistance. With a body mass index of 39.0, she is considered obese. Her diabetes pedigree function value is 1.222, suggesting a moderate genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 35-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 41. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 77. Her 2-hour serum insulin level is 42. She has a body mass index of 35.8 and a diabetes pedigree function of 0.156.###\nHence this label was avoid."
"The patient is a 37-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 15 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 133 mg/dL, and her 2-hour serum insulin level is 155 mu U/ml. With a body mass index of 32.4 and a diabetes pedigree function value of 0.262, this individual exhibits some risk factors for developing diabetes.###\nHence this label was avoid."
"The 28-year-old patient, who has been pregnant once, has a diastolic blood pressure of 68 and a triceps skin fold thickness of 49. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 172, with a high 2-hour serum insulin level of 579. The patient's body mass index is 42.4, and their diabetes pedigree function is 0.702. These values indicate a concerning risk for developing diabetes.###\nHence this label was consent."
"This individual is a 39-year-old with a history of 13 pregnancies. They have a diastolic blood pressure of 88, triceps skin fold thickness of 37, and a high plasma glucose concentration of 153 after a 2-hour glucose tolerance test. Additionally, their 2-hour serum insulin level is 140, body mass index is 40.6, and have a diabetes pedigree function of 1.174.###\nHence this label was avoid."
"A 24-year-old individual who has been pregnant 7 times shows no diastolic blood pressure, triceps skin fold thickness, or serum insulin. Their plasma glucose concentration after a glucose tolerance test is 105, with a low body mass index of 0.0. The diabetes pedigree function indicates a slight genetic predisposition to diabetes.###\nHence this label was avoid."
"This 28-year-old woman has been pregnant 3 times and shows signs of high risk for diabetes based on her diagnostic measurements. Her diastolic blood pressure is 76, triceps skin fold thickness is 36, and plasma glucose concentration at 2 hours is 158. Additionally, her 2-hour serum insulin is 245, body mass index is 31.6, and diabetes pedigree function is 0.851.###\nHence this label was consent."
"The patient is a 33-year-old female who has been pregnant 5 times. She has normal diastolic blood pressure and triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122 mg/dL. She has no insulin levels after 2 hours. The patient has a body mass index of 34.7, indicating she is overweight. The diabetes pedigree function score is 0.29, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 29-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 78 mmHg. Her triceps skin fold thickness is 29 mm. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 88 mg/dL. Her 2-hour serum insulin level is 76 μU/mL. She has a body mass index of 32.0, indicating that she is overweight. The diabetes pedigree function, which assesses the likelihood of developing diabetes based on family history, is 0.365.###\nHence this label was avoid."
"This 25-year-old individual has been pregnant twice and has a diastolic blood pressure of 74. Their triceps skin fold thickness is 26, plasma glucose concentration is 129, and 2-hour serum insulin is 205. With a body mass index of 33.2, they have a diabetes pedigree function of 0.591.###\nHence this label was avoid."
"A 23-year-old female, who has been pregnant twice, shows normal diastolic blood pressure and triceps skin fold thickness. Her glucose level after a 2-hour oral glucose tolerance test is 134, and she has low insulin levels. Her body mass index is 28.9, indicating she is slightly overweight. The diabetes pedigree function score is 0.542, suggesting a moderate genetic risk of developing diabetes.###\nHence this label was consent."
"This patient is a 32-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a glucose tolerance test is 115, and her 2-hour serum insulin level is 96. She has a body mass index (BMI) of 34.6 and a diabetes pedigree function of 0.529.###\nHence this label was consent."
"This is a 52-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 86, triceps skin fold thickness of 27, and a plasma glucose concentration of 176 after a glucose tolerance test. Their 2-hour serum insulin level is 156, and their body mass index is 33.3. Additionally, their diabetes pedigree function is 1.154.###\nHence this label was consent."
"A young woman, aged 21, with a low pregnancy history and healthy diastolic blood pressure. She has a relatively low triceps skin fold thickness and a normal glucose concentration after a meal. Her insulin levels are very low. Despite her low body mass index, she has a slight family history of diabetes.###\nHence this label was avoid."
"This is a case of a 22-year-old individual who is 1 time pregnant with a diastolic blood pressure of 60. They have a triceps skin fold thickness of 37, plasma glucose concentration of 87 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 75. Their body mass index is 37.2 and their diabetes pedigree function is 0.509.###\nHence this label was avoid."
"A 23-year-old individual who has been pregnant twice with a diastolic blood pressure of 70, a triceps skin fold thickness of 32, a plasma glucose concentration of 121 after a glucose tolerance test, and a 2-hour serum insulin level of 95. They have a body mass index of 39.1 and a diabetes pedigree function of 0.886.###\nHence this label was avoid."
"The patient is a 31-year-old woman who has been pregnant 4 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 39 mm. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 197 mg/dL. Additionally, her 2-hour serum insulin level is high at 744 μU/mL. She has a body mass index of 36.7, indicating obesity. The diabetes pedigree function value is 2.329, suggesting a genetic predisposition to diabetes. Overall, the patient exhibits multiple risk factors for developing diabetes.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant two times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 17. Her plasma glucose concentration is 90 after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 0. With a body mass index of 27.3 and a diabetes pedigree function of 0.085, this patient's risk of developing diabetes may be low.###\nHence this label was avoid."
"This is a 63-year-old individual who has been pregnant 4 times and has a diastolic blood pressure of 86. They have a triceps skin fold thickness of 31, a plasma glucose concentration of 132 after a glucose tolerance test, and a 2-hour serum insulin level of 0. Their body mass index is 28.0 and their diabetes pedigree function is 0.419.###\nHence this label was avoid."
"A 23-year-old individual who has never been pregnant shows normal diastolic blood pressure, average triceps skin fold thickness, and slightly elevated plasma glucose concentration at 119. Their 2-hour serum insulin levels are higher than average, and they have a body mass index indicating obesity. The individual has a moderately low diabetes pedigree function score of 0.725.###\nHence this label was avoid."
"This individual, aged 44, has been pregnant 13 times. They have a diastolic blood pressure reading of 0, a triceps skin fold thickness of 30, and a body mass index of 39.9. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 129. Their 2-hour serum insulin level is 0, and they have a diabetes pedigree function value of 0.569.###\nHence this label was consent."
"This is a 26-year-old individual who has never been pregnant and shows normal diastolic blood pressure. They have a low triceps skin fold thickness and a moderate body mass index of 35.7. Their plasma glucose concentration at 2 hours is within a healthy range. The individual has no insulin level after 2 hours of a glucose tolerance test. Their diabetes pedigree function is low at 0.198, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"The individual is a 27-year-old who has been pregnant 6 times. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 41. Their plasma glucose concentration after a glucose tolerance test is 154, and their 2-hour serum insulin level is 140. They have a body mass index of 46.1 and a diabetes pedigree function of 0.571.###\nHence this label was avoid."
"The individual is a young adult woman in her early twenties who has been pregnant twice. She has a slightly elevated diastolic blood pressure of 86 mmHg and a relatively high triceps skin fold thickness of 36mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range at 102 mg/dL. The 2-hour serum insulin level is 120 uU/ml, indicating normal insulin production. Despite a high body mass index of 45.5, her diabetes pedigree function is low at 0.127, suggesting a lower genetic predisposition to diabetes.###\nHence this label was consent."
"The data describes a 52-year-old individual who has been pregnant 8 times and has diastolic blood pressure of 76. They have a triceps skin fold thickness of 24, plasma glucose concentration of 124 after a glucose tolerance test, and 2-hour serum insulin level of 600. Their body mass index is 28.7 and they have a diabetes pedigree function value of 0.687.###\nHence this label was consent."
"This data belongs to a 28-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 62, triceps skin fold thickness of 31, plasma glucose concentration of 151, 2-hour serum insulin level of 120, and a body mass index of 35.5. The diabetes pedigree function is 0.692.###\nHence this label was avoid."
"A 28-year-old individual who has been pregnant 4 times shows normal diastolic blood pressure, average triceps skin fold thickness, slightly elevated glucose levels after a GTT, higher than normal insulin levels, a moderate body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"The individual is a 25-year-old who has never been pregnant. They have a diastolic blood pressure of 68 and a triceps skin fold thickness of 19. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 128. Additionally, their 2-hour serum insulin level is 180. They have a body mass index of 30.5 and a diabetes pedigree function of 1.391.###\nHence this label was consent."
"This individual is a 66-year-old with a history of 6 pregnancies. They have normal diastolic blood pressure and no triceps skin fold thickness. However, their plasma glucose concentration after a glucose tolerance test is high at 190, while their insulin level is low. They have a body mass index indicating obesity at 35.5 and a relatively low diabetes pedigree function value of 0.278.###\nHence this label was consent."
"A 22-year-old woman, who is 2 times pregnant, has a healthy diastolic blood pressure of 66 and a glucose concentration of 83 after a glucose tolerance test. She has a normal triceps skin fold thickness of 23 and a 2-hour serum insulin level of 50. Her body mass index is 32.2, indicating she is overweight. Additionally, her diabetes pedigree function value is 0.497, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 28-year-old individual who has been pregnant 5 times, with a diastolic blood pressure of 75. They have a triceps skin fold thickness of 0, a plasma glucose concentration of 147 after a glucose tolerance test, and a 2-hour serum insulin level of 0. Their body mass index is 29.9 and their diabetes pedigree function is 0.434.###\nHence this label was avoid."
"A 28-year-old woman, who has been pregnant once, has a diastolic blood pressure of 78. Her triceps skin fold thickness is 39, plasma glucose concentration is 121, and 2-hour serum insulin is 74. She has a body mass index of 39.0 and a diabetes pedigree function of 0.261.###\nHence this label was avoid."
"A 29-year-old individual who has been pregnant 4 times shows slightly elevated diastolic blood pressure at 88. Their triceps skin fold thickness is 47, indicating a moderate level of subcutaneous fat. The plasma glucose concentration after a glucose tolerance test is within a normal range at 90, while the 2-hour serum insulin level is relatively low at 54. Despite a high body mass index of 37.7, the individual has a relatively low diabetes pedigree function score of 0.362, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 42-year-old female who has been pregnant 8 times. She has a normal diastolic blood pressure of 76 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 100, and she has no serum insulin. Despite having a high body mass index of 38.7, her diabetes pedigree function is low at 0.19.###\nHence this label was avoid."
"This is data from a 25-year-old individual who has never been pregnant. They have normal diastolic blood pressure, normal triceps skin fold thickness, and low insulin levels. Their plasma glucose concentration after a glucose tolerance test is low. Despite having a high body mass index, their diabetes pedigree function indicates a low risk of developing diabetes.###\nHence this label was avoid."
"This 30-year-old patient, who has been pregnant twice, shows signs of high risk for diabetes based on their diagnostic measurements. Their diastolic blood pressure, triceps skin fold thickness, and body mass index are elevated. Additionally, their glucose and insulin levels after a GTT are notably high. Despite a relatively low diabetes pedigree function score, these results suggest a need for further monitoring and potential intervention to prevent the development of diabetes.###\nHence this label was avoid."
"A 21-year-old individual who has never been pregnant shows normal blood pressure and a slightly elevated triceps skin fold thickness. Their glucose levels after a glucose tolerance test are within the normal range, but they have higher than average insulin levels. Despite having a slightly elevated body mass index, their risk of developing diabetes is relatively low based on their family history.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant 3 times. She has a healthy diastolic blood pressure of 58 and a low triceps skin fold thickness of 11. Her plasma glucose concentration after a glucose tolerance test is 88, and her 2-hour serum insulin level is at 54. With a body mass index of 24.8 and a low diabetes pedigree function of 0.267, she appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 28-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 92 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 92, and her 2-hour serum insulin level is 0. She has a body mass index of 19.9 and a diabetes pedigree function of 0.188.###\nHence this label was avoid."
"The patient is a 42-year-old female who has been pregnant once. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 102 mg/dL. She has a 2-hour serum insulin level of 0 μU/mL and a body mass index of 39.5 kg/m². The diabetes pedigree function, which assesses the likelihood of developing diabetes based on family history, is 0.293.###\nHence this label was consent."
"This individual is a 38-year-old woman who has been pregnant 4 times. She has a good diastolic blood pressure of 78 and a relatively high triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 112, and she has no insulin in her serum. Despite having a body mass index of 39.4, her diabetes pedigree function is low at 0.236.###\nHence this label was avoid."
"A 21-year-old female who has been pregnant twice shows normal diastolic blood pressure and slightly below average triceps skin fold thickness. Her glucose levels after a two-hour oral test are within a healthy range, and her insulin levels are also normal. Despite having a slightly elevated body mass index, her risk for diabetes is relatively low based on her family history.###\nHence this label was avoid."
"This data describes a 32-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 41. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 81, and her 2-hour serum insulin level is 57. She has a body mass index of 46.3 and a diabetes pedigree function of 1.096.###\nHence this label was avoid."
"A 22-year-old individual who is pregnant for the first time has low diastolic blood pressure and a slightly above average body mass index. Their triceps skin fold thickness is within normal range. They have a moderate plasma glucose concentration and a normal 2-hour serum insulin level. The individual has a low diabetes pedigree function score, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 27-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure and lower-than-average triceps skin fold thickness. Her plasma glucose concentration is low after a 2-hour oral glucose tolerance test, and she has moderate insulin levels. Despite a slightly elevated body mass index, her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was consent."
"This individual is a 38-year-old who has been pregnant 10 times. They have a low diastolic blood pressure of 62 and a moderate triceps skin fold thickness of 36. Their glucose levels are slightly elevated at 129 after a GTT. They have no insulin in their system after a 2-hour serum test. Despite having a high body mass index of 41.2, their diabetes pedigree function is relatively low at 0.441.###\nHence this label was consent."
"This patient is a 21-year-old female who has been pregnant twice. She has normal diastolic blood pressure and a low triceps skin fold thickness. Her glucose levels after a glucose tolerance test are within normal range, and she has normal insulin levels. Additionally, her body mass index is in the healthy range. The patient has a low diabetes pedigree function score, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"A 26-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 64, triceps skin fold thickness of 25, plasma glucose concentration after a GTT of 180, 2-hour serum insulin level of 70, and a body mass index of 34.0. The diabetes pedigree function is 0.271.###\nHence this label was avoid."
"This patient is a 29-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 68 and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122, with a 0 serum insulin level. She has a high body mass index of 35.0 and a low diabetes pedigree function score of 0.394.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 52 and a moderate triceps skin fold thickness of 26. Her plasma glucose concentration after a glucose tolerance test is normal at 108, and she has a relatively low insulin level of 63. Despite her young age, her body mass index is in the overweight range at 32.5. The diabetes pedigree function score is low at 0.318, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 24-year-old who has been pregnant 4 times. They have a normal diastolic blood pressure of 70 and very low triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 128, with no insulin present. They have a high body mass index of 34.3 and a low diabetes pedigree function score of 0.303.###\nHence this label was avoid."
"This individual is a 23-year-old who has never been pregnant and has a diastolic blood pressure of 90. They have a triceps skin fold thickness of 33, a high plasma glucose concentration of 165, and a very high 2-hour serum insulin level of 680. With a body mass index of 52.3 and a low diabetes pedigree function of 0.427, this individual may be at risk for developing diabetes.###\nHence this label was avoid."
"The individual is a 21-year-old female who has never been pregnant. She has a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 23 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 118 mg/dL, and her 2-hour serum insulin level is 89 μU/mL. She has a body mass index of 0.0 and a diabetes pedigree function of 1.731.###\nHence this label was avoid."
"The patient is a 25-year-old female who has never been pregnant. She has a low diastolic blood pressure of 62 and a very low triceps skin fold thickness. Her glucose levels after a 2-hour GTT are normal at 101. Despite having no insulin present in her bloodstream, she has a low body mass index of 21.9. The patient has a slightly elevated diabetes pedigree function score of 0.336, indicating a slight genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 26-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 62 mmHg, a triceps skin fold thickness of 19 mm, and a plasma glucose concentration of 99 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 74 μU/mL, and she has a body mass index of 21.8 kg/m^2. Her diabetes pedigree function is 0.279, indicating a moderate genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old female who has never been pregnant. She has a diastolic blood pressure of 65 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a glucose tolerance test is 111 mg/dL and her 2-hour serum insulin level is 0 µU/mL. She has a body mass index of 24.6 and a diabetes pedigree function of 0.66.###\nHence this label was avoid."
"The patient is a 34-year-old female who has been pregnant 8 times. She has a normal diastolic blood pressure of 80 and a low triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 107, with no insulin detected after 2 hours. She has a healthy body mass index of 24.6 and a slightly elevated diabetes pedigree function of 0.856.###\nHence this label was avoid."
"This is a data entry for a 21-year-old individual who has never been pregnant. She has a diastolic blood pressure of 62 mmHg and a triceps skin fold thickness of 17mm. Her plasma glucose concentration is 139 mg/dL, and her 2-hour serum insulin level is 210 uU/mL. With a body mass index of 22.1, she has a low diabetes pedigree function score of 0.207.###\nHence this label was avoid."
"The patient is a 28-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 86 and a triceps skin fold thickness of 42. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 112, and her 2-hour serum insulin level is 160. With a body mass index of 38.4 and a diabetes pedigree function of 0.246, the patient's risk of developing diabetes may need to be monitored closely.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 19 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 169 mg/dL, and her 2-hour serum insulin level is 125 μU/mL. She has a body mass index of 29.9 and a diabetes pedigree function score of 0.268.###\nHence this label was consent."
"A 34-year-old individual who has been pregnant 7 times shows low diastolic blood pressure. Although having a high plasma glucose concentration and 2-hour serum insulin level, their body mass index is within the normal range. The individual also has a moderate triceps skin fold thickness and a slightly elevated diabetes pedigree function score.###\nHence this label was consent."
"This is a data entry of a 25-year-old individual who has been pregnant twice. They have a low diastolic blood pressure of 60 and a moderately thick triceps skin fold of 22. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 81. They have no insulin in their serum after 2 hours. The individual has a slightly elevated body mass index of 27.7 and a relatively low diabetes pedigree function of 0.29.###\nHence this label was avoid."
"The patient is a 47-year-old woman who has been pregnant 17 times. She has a diastolic blood pressure of 72, a triceps skin fold thickness of 41, and a body mass index of 40.9, indicating obesity. Her plasma glucose concentration at 2 hours is 163, which is elevated, and her 2-hour serum insulin level is 114. The diabetes pedigree function score is 0.817, suggesting a moderate genetic risk for diabetes. Overall, these measurements indicate a high risk for developing diabetes.###\nHence this label was consent."
"The patient is a 28-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 80 and a triceps skin fold thickness of 36. Her plasma glucose concentration is 80 after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 0. Her body mass index is 39.8, and she has a low diabetes pedigree function of 0.177.###\nHence this label was avoid."
"This data belongs to a young adult female who is 24 years old and has been pregnant once. She has low diastolic blood pressure of 56, average triceps skin fold thickness of 30, and normal glucose levels of 77. Her insulin levels after a glucose tolerance test are also normal at 56. She has a slightly elevated body mass index of 33.3 and a moderate diabetes pedigree function of 1.251. Overall, she seems to have relatively good health with no obvious signs of diabetes risk based on these measurements.###\nHence this label was avoid."
"A 24-year-old woman who has been pregnant 4 times shows normal diastolic blood pressure, slightly above-average triceps skin fold thickness, and normal glucose levels after a glucose tolerance test. Her insulin levels are elevated, and she has a slightly high body mass index. She has a low diabetes pedigree function score, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 44-year-old individual who has never been pregnant. They have a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 146 mg/dL, with a 2-hour serum insulin level of 0 μU/mL. The patient has a body mass index of 40.5 and a diabetes pedigree function value of 1.781.###\nHence this label was avoid."
"The patient is a 36-year-old woman who has been pregnant 3 times. She has a low diastolic blood pressure of 58 and a healthy triceps skin fold thickness of 22. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is high at 174, and she has a relatively high 2-hour serum insulin level of 194. Despite this, her body mass index is in the overweight range at 32.9, and her diabetes pedigree function, a measure of diabetes heredity, is on the lower side at 0.593.###\nHence this label was consent."
"The patient is a 51-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 86 mmHg and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125 mg/dL, with no detectable serum insulin. She has a body mass index of 37.6 and a diabetes pedigree function value of 0.304, indicating a potential risk for developing diabetes.###\nHence this label was avoid."
"A 29-year-old female who has been pregnant three times has a diastolic blood pressure of 90. She has a triceps skin fold thickness of 12 and a plasma glucose concentration of 111 after a glucose tolerance test. Her 2-hour serum insulin level is 78, and her body mass index is 28.4. She has a diabetes pedigree function value of 0.495.###\nHence this label was avoid."
"The patient is a 42-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 86, triceps skin fold thickness of 28, plasma glucose concentration of 156, and 2-hour serum insulin level of 155. With a body mass index of 34.3 and diabetes pedigree function of 1.189, she may be at risk of developing diabetes.###\nHence this label was consent."
"A 36-year-old woman, who has been pregnant 5 times, shows low diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is low at 44, with no serum insulin detected. Despite having a normal body mass index of 25.0, she has a moderate diabetes pedigree at 0.587.###\nHence this label was avoid."
"This 29-year-old individual has been pregnant 6 times and has a diastolic blood pressure of 70. Their triceps skin fold thickness is 23, and their plasma glucose concentration after a glucose tolerance test is 134. With a 2-hour serum insulin level of 130 and a body mass index of 35.4, this person has a diabetes pedigree function of 0.542.###\nHence this label was consent."
"This 21-year-old patient has been pregnant twice and shows extremely low values for diastolic blood pressure, triceps skin fold thickness, 2-hour serum insulin, and body mass index. Their plasma glucose concentration after a glucose tolerance test is 84, and their diabetes pedigree function is 0.304.###\nHence this label was avoid."
"A 25-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure and high plasma glucose levels after a glucose tolerance test. She also has elevated insulin levels, above average body mass index, and a moderate family history of diabetes.###\nHence this label was consent."
"The individual is a 25-year-old who has been pregnant 4 times. They have a diastolic blood pressure of 90, triceps skin fold thickness of 23, and a plasma glucose concentration of 84 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 56, with a body mass index of 39.5 and a diabetes pedigree function of 0.159.###\nHence this label was avoid."
"The patient is a 46-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 33 mm. Her plasma glucose concentration is 100 mg/dL after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 105 μU/mL. She has a body mass index of 30.0 and a diabetes pedigree function of 0.488.###\nHence this label was avoid."
"This individual is a 60-year-old who has been pregnant 7 times and has a diastolic blood pressure of 95. Their triceps skin fold thickness is 31, plasma glucose concentration after a glucose tolerance test is 179, and 2-hour serum insulin is 0. They have a body mass index of 34.2 and a diabetes pedigree function of 0.164.###\nHence this label was avoid."
"A 41-year-old individual who has been pregnant 10 times, shows normal diastolic blood pressure and triceps skin fold thickness, with a slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. They have no serum insulin present, a high body mass index of 31.2, and a low diabetes pedigree function score of 0.258.###\nHence this label was avoid."
"This patient is a 23-year-old female who has never been pregnant. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 27 mm. Her plasma glucose concentration after a glucose tolerance test is 179 mg/dL. Her 2-hour serum insulin level is 0 uU/mL. She has a body mass index of 44.1, indicating obesity. The diabetes pedigree function score is 0.686, suggesting a moderate genetic risk for diabetes.###\nHence this label was consent."
"The patient is a 26-year-old woman who is pregnant for the first time. She has normal diastolic blood pressure and a moderately low triceps skin fold thickness. Her glucose tolerance test results indicate normal plasma glucose levels. The patient has slightly elevated 2-hour serum insulin levels and a healthy body mass index. Her diabetes pedigree function score suggests a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 23-year-old woman who has been pregnant twice. She has a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 17. Her plasma glucose concentration from a 2-hour oral glucose tolerance test is at a normal level of 101. However, her 2-hour serum insulin is high at 265, indicating potential insulin resistance. She has a healthy body mass index of 24.2 and a moderately elevated diabetes pedigree function score of 0.614, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is a 44-year-old woman who has been pregnant 12 times. She has a relatively low diastolic blood pressure of 62 and a triceps skin fold thickness of 7, indicating a healthy body composition. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 92, which is within the normal range. However, her 2-hour serum insulin level is high at 258, suggesting potential insulin resistance. With a body mass index of 27.6, she is classified as overweight. Her diabetes pedigree function score is 0.926, indicating a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 21-year-old female who has never been pregnant. She has a low diastolic blood pressure of 64 and a moderate triceps skin fold thickness of 22. Her glucose levels are normal at 84, but she has slightly elevated insulin levels at 66. Despite having a high body mass index of 35.8, her diabetes pedigree function is low at 0.545. Overall, this patient shows some signs of potential risk for developing diabetes, particularly due to her weight.###\nHence this label was avoid."
"The patient is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 147, and her 2-hour serum insulin level is 0. She has a body mass index of 39.4 and a diabetes pedigree function of 0.257.###\nHence this label was consent."
"This individual is a 25-year-old who has been pregnant 2 times. They have a diastolic blood pressure of 0, triceps skin fold thickness of 23, and a plasma glucose concentration of 87 after a glucose tolerance test. Their 2-hour serum insulin level is 0, body mass index is 28.9, and diabetes pedigree function is 0.773.###\nHence this label was avoid."
"A 42-year-old woman who has been pregnant 7 times is being evaluated for diabetes risk. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 42. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 150. Her 2-hour serum insulin is 342, and her body mass index is 34.7. The diabetes pedigree function, a measure of diabetes heredity, is 0.718.###\nHence this label was avoid."
"This is a data entry for a 28-year-old individual with 6 pregnancies. Their diastolic blood pressure is 90, triceps skin fold thickness is 39, and plasma glucose concentration after a glucose tolerance test is 102. The 2-hour serum insulin level is 0, and their body mass index is 35.7. The diabetes pedigree function score is 0.674.###\nHence this label was avoid."
"This individual is a 22-year-old who has never been pregnant and has a low diastolic blood pressure of 64. They have a slightly above average triceps skin fold thickness of 41, a normal plasma glucose concentration of 105, and high 2-hour serum insulin levels of 142. With a body mass index of 41.5, they are considered obese. The diabetes pedigree function score is low at 0.173, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"This data represents a 31-year-old individual who is pregnant for the first time. Their diastolic blood pressure is 90, triceps skin fold thickness is 51, plasma glucose concentration is 122 after a 2-hour oral glucose tolerance test, and 2-hour serum insulin level is 220. The individual has a body mass index of 49.7 and a diabetes pedigree function value of 0.325.###\nHence this label was consent."
"This patient is a 46-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 82, a triceps skin fold thickness of 46, and a body mass index of 46.1, indicating they may be overweight. Their plasma glucose concentration after a glucose tolerance test is 144, which is within normal range. However, their 2-hour serum insulin level is high at 180, suggesting possible insulin resistance. The diabetes pedigree function score is 0.335, indicating a mild genetic predisposition to diabetes. Overall, this individual may have an increased risk of developing diabetes, especially considering their high insulin levels and BMI.###\nHence this label was consent."
"This individual is 47 years old and has been pregnant 5 times. They have a normal diastolic blood pressure of 78. However, their triceps skin fold thickness and 2-hour serum insulin levels are both 0, which may warrant further investigation. Their plasma glucose concentration after a glucose tolerance test is 143, indicating they may have high blood sugar. With a body mass index of 45.0 and a low diabetes pedigree function of 0.19, this individual may be at risk for developing diabetes.###\nHence this label was avoid."
"A 21-year-old individual who has been pregnant twice shows normal diastolic blood pressure and body mass index. They have a slightly low triceps skin fold thickness and their 2-hour serum insulin levels are at zero. However, their plasma glucose concentration after a glucose tolerance test is within a healthy range. The diabetes pedigree function value is relatively low, indicating a lower risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 39-year-old female who has been pregnant 7 times. She has a low diastolic blood pressure of 54 and a moderately high triceps skin fold thickness of 32. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is elevated at 160, and she has a relatively high 2-hour serum insulin level of 175. Despite her high BMI of 30.5, her diabetes pedigree function is relatively low at 0.588.###\nHence this label was consent."
"A 28-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within normal range, but her insulin levels are slightly higher than average. She has a moderate body mass index and a family history of diabetes.###\nHence this label was avoid."
"This 21-year-old individual, who has been pregnant once, has a low diastolic blood pressure of 24. Their triceps skin fold thickness is 19, indicating a relatively healthy body composition. With a plasma glucose concentration of 89 after a 2-hour oral glucose tolerance test, their blood sugar levels appear normal. The 2-hour serum insulin level is 25, suggesting good insulin sensitivity. Their body mass index is 27.8, which is considered overweight but not in the obesity range. The diabetes pedigree function score of 0.559 indicates a moderate genetic predisposition to diabetes. Overall, based on these measurements, this individual appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"This is a dataset for a 28-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 64, a triceps skin fold thickness of 23, and a plasma glucose concentration of 84 after a glucose tolerance test. Her 2-hour serum insulin level is 115, and her body mass index is 36.9. The diabetes pedigree function for this individual is 0.471.###\nHence this label was avoid."
"The individual is a 25-year-old woman who has never been pregnant, with a diastolic blood pressure of 66 mmHg. She has a triceps skin fold thickness of 39 mm and a high plasma glucose concentration of 180 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0 μU/mL, and she has a body mass index of 42.0 kg/m^2. Additionally, her diabetes pedigree function value is 1.893, indicating a potential genetic predisposition for diabetes.###\nHence this label was consent."
"The patient is a 37-year-old female who has been pregnant 7 times. She has normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. She has no serum insulin present, a high body mass index, and a moderate diabetes pedigree function score.###\nHence this label was avoid."
"A 46-year-old individual who has never been pregnant with normal diastolic blood pressure and low triceps skin fold thickness. They have low plasma glucose concentration, zero serum insulin, and a high body mass index, indicating possible risk for diabetes. Their diabetes pedigree function is low, suggesting a lower genetic predisposition to the condition.###\nHence this label was avoid."
"A 24-year-old woman, who has been pregnant twice, with a normal diastolic blood pressure of 66. She has a healthy body weight with a body mass index of 25.0. Her glucose levels are within the normal range at 112 after a 2-hour oral glucose tolerance test. Additionally, she has low 2-hour serum insulin levels and a low diabetes pedigree function score of 0.307.###\nHence this label was avoid."
"A 40-year-old individual who has been pregnant 6 times has a diastolic blood pressure of 72. Their triceps skin fold thickness is 27, plasma glucose concentration after a glucose tolerance test is 144, and 2-hour serum insulin level is 228. With a body mass index of 33.9 and a low diabetes pedigree function score of 0.255, this person appears to have certain risk factors for diabetes.###\nHence this label was avoid."
"The individual is a 29-year-old who has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and normal levels of serum insulin. However, their plasma glucose concentration after a glucose tolerance test is elevated. Despite having a high body mass index, their diabetes pedigree function is relatively low.###\nHence this label was consent."
"This is a dataset of a young female who is in her early twenties. She has been pregnant once. Her diastolic blood pressure is low at 50 mmHg. She has a relatively low triceps skin fold thickness of 10 mm. Her glucose levels are also low at 73 mg/dL after a 2-hour oral glucose tolerance test. There is no insulin present in her blood after the test. She has a healthy body mass index of 23.0. Her diabetes pedigree function, which indicates the likelihood of developing diabetes based on family history, is low at 0.248. Overall, based on these measurements, she appears to be at low risk for developing diabetes.###\nHence this label was avoid."
"A 24-year-old individual who has been pregnant twice has a diastolic blood pressure of 62 and a triceps skin fold thickness of 28. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 92, with no detectable insulin levels. They have a body mass index of 31.6 and a low diabetes pedigree function score of 0.13.###\nHence this label was avoid."
"The patient is a 60-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 68, a triceps skin fold thickness of 36, and a plasma glucose concentration of 181 after a glucose tolerance test. Her 2-hour serum insulin level is 495, and she has a body mass index of 30.1. The diabetes pedigree function value is 0.615. Based on these measurements, the patient may be at risk for developing diabetes.###\nHence this label was consent."
"This 27-year-old woman is pregnant for the first time and has a diastolic blood pressure of 122. She has no triceps skin fold thickness, and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 96. Her 2-hour serum insulin level is 0, and her body mass index is 22.4. Additionally, her diabetes pedigree function score is 0.207.###\nHence this label was avoid."
"A 37-year-old woman who has been pregnant 4 times shows normal diastolic blood pressure and a low triceps skin fold thickness. Her glucose levels after a meal are within a healthy range, while her insulin levels are slightly elevated. She has a low body mass index and a moderate diabetes pedigree function score. Overall, her risk of developing diabetes appears to be low.###\nHence this label was avoid."
"A 45-year-old individual who has been pregnant 9 times shows normal diastolic blood pressure but no triceps skin fold thickness. They have a moderate glucose concentration of 140 mg/dL after a GTT and no insulin present. Despite having a high BMI of 32.7, their diabetes pedigree function is relatively low at 0.734.###\nHence this label was consent."
"A 56-year-old individual who has been pregnant 4 times shows normal diastolic blood pressure, but elevated triceps skin fold thickness and body mass index. Their plasma glucose concentration after a glucose tolerance test is within the normal range, but their insulin level is high. Additionally, they have a moderately high diabetes pedigree function score, indicating a potential genetic predisposition to diabetes.###\nHence this label was consent."
"The data provided is from a 37-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 88 mmHg, a triceps skin fold thickness of 39 mm, and a plasma glucose concentration of 128 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 110 μU/mL, and she has a body mass index of 36.5. Additionally, her diabetes pedigree function is 1.057.###\nHence this label was consent."
"This is a 25-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 62 and a triceps skin fold thickness of 18. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 90, and their 2-hour serum insulin level is 59. Their body mass index is 25.1 and they have a diabetes pedigree function value of 1.268.###\nHence this label was avoid."
"The patient is a 66-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 88 mmHg, no triceps skin fold thickness, and a plasma glucose concentration of 114 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0 μU/mL, and her body mass index is 27.8 kg/m². The diabetes pedigree function, a measure of hereditary influence on diabetes, is 0.247.###\nHence this label was avoid."
"A 57-year-old individual who has been pregnant 13 times, with a diastolic blood pressure of 82. Their triceps skin fold thickness is 19, plasma glucose concentration after a 2-hour oral glucose tolerance test is 145, and 2-hour serum insulin level is 110. They have a body mass index of 22.2 and a diabetes pedigree function value of 0.245.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant four times and has a relatively low diastolic blood pressure of 62. They have a triceps skin fold thickness of 31 and a high plasma glucose concentration of 154 after a glucose tolerance test. Additionally, their 2-hour serum insulin level is elevated at 284. With a body mass index of 32.8 and a low diabetes pedigree function of 0.237, this individual may be at risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 84 mmHg, triceps skin fold thickness of 0 mm, and a high plasma glucose concentration of 178 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 0 μU/mL, indicating a potential issue with insulin production. She has a high body mass index of 39.9, which is classified as obese. The diabetes pedigree function score is 0.331, suggesting a genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a young adult female, 22 years old, who has never been pregnant. She has a low diastolic blood pressure of 65 and a healthy body mass index of 24.6. Despite having a low 2-hour serum insulin level of 0, her plasma glucose concentration after a glucose tolerance test is within normal range at 101. The patient also has a relatively low triceps skin fold thickness of 28, indicating a lower amount of subcutaneous fat. Her diabetes pedigree function value is low at 0.237, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"This 22-year-old individual who has never been pregnant has a slightly elevated diastolic blood pressure of 82. They have a relatively low triceps skin fold thickness of 14, but a high plasma glucose concentration of 188 after a glucose tolerance test. Their 2-hour serum insulin level is also elevated at 185. With a body mass index of 32.0 and a diabetes pedigree function of 0.682, this person may have an increased risk of developing diabetes.###\nHence this label was consent."
"The patient is a 53-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 27, plasma glucose concentration of 187 after a glucose tolerance test, and 2-hour serum insulin level of 207. Her body mass index is 43.6 and her diabetes pedigree function is 1.034.###\nHence this label was consent."
"This 28-year-old individual has been pregnant twice and has low diastolic blood pressure. Their triceps skin fold thickness and body mass index indicate a high level of body fat. The plasma glucose concentration after a glucose tolerance test is within normal range. However, their 2-hour serum insulin levels are elevated. Overall, their diabetes pedigree function suggests a moderate genetic risk for developing diabetes.###\nHence this label was avoid."
"This individual is a 26-year-old female who has been pregnant twice. She has a diastolic blood pressure of 76, triceps skin fold thickness of 27, and a plasma glucose concentration of 122 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 200. She has a body mass index of 35.9 and a diabetes pedigree function of 0.483. These measurements provide insight into her current health status and risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 23-year-old who has been pregnant 6 times. She has a low diastolic blood pressure of 50 and a moderate triceps skin fold thickness of 30. Her plasma glucose concentration after a glucose tolerance test is within normal range at 93. Additionally, her 2-hour serum insulin level is 64, indicating normal insulin production. With a body mass index of 28.7, she is considered overweight. Her diabetes pedigree function value is 0.356, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"This individual, a 29-year-old, has been pregnant twice. Their diastolic blood pressure is 76, triceps skin fold thickness is 35, and plasma glucose concentration is 146 after a glucose tolerance test. They have a 2-hour serum insulin level of 194 and a body mass index of 38.2. Their diabetes pedigree function is 0.329.###\nHence this label was avoid."
"The patient in this dataset is a 46-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 37. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 102. She has no insulin in her serum after 2 hours. Her body mass index is 32.9 and her diabetes pedigree function is 0.665.###\nHence this label was consent."
"The patient is a 42-year-old woman who has been pregnant 8 times. She has a low diastolic blood pressure of 55 and a healthy body mass index of 24.4. Her triceps skin fold thickness is 20, indicating normal fat distribution. Her plasma glucose concentration after a glucose tolerance test is 85, with 2-hour serum insulin level of 0 suggesting good insulin sensitivity. Additionally, her diabetes pedigree function score is low at 0.136, indicating mild genetic predisposition to diabetes.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant twice and has a diastolic blood pressure of 74. Their triceps skin fold thickness is 30, while their plasma glucose concentration after a GTT is 107. They have a 2-hour serum insulin level of 100 and a body mass index of 33.6. The diabetes pedigree function is calculated to be 0.404.###\nHence this label was avoid."
"This individual is a 45-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 78, triceps skin fold thickness of 30, and a plasma glucose concentration of 154 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 100, and she has a body mass index of 30.9. Her diabetes pedigree function is 0.164, indicating a potential genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 32-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 74 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 102, and her 2-hour serum insulin level is 0. She has a body mass index (BMI) of 29.5 and a low diabetes pedigree function of 0.121.###\nHence this label was avoid."
"A 31-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 78, triceps skin fold thickness of 37, plasma glucose concentration at 128 after a glucose tolerance test, 2-hour serum insulin level of 182, and a body mass index of 43.3. The diabetes pedigree function indicates a genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 40-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 0, indicating low body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 159. She has no 2-hour serum insulin present. Despite her relatively normal body mass index of 27.4, her diabetes pedigree function is 0.294, suggesting a moderate genetic risk for developing diabetes.###\nHence this label was avoid."
"This is a dataset of a young adult woman who is 24 years old and has been pregnant once. She has a normal diastolic blood pressure of 68 and a healthy body mass index of 26.5. Her triceps skin fold thickness is within the average range at 19. Despite having a low 2-hour serum insulin level of 0, her plasma glucose concentration at 107 indicates normal blood sugar levels. Additionally, her diabetes pedigree function score is low at 0.165, suggesting a low genetic risk for diabetes.###\nHence this label was avoid."
"A 28-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure, a moderately high triceps skin fold thickness, and slightly elevated plasma glucose concentration at 2 hours. She has high levels of 2-hour serum insulin and a high body mass index. Despite these factors, her diabetes pedigree function is relatively low, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 41-year-old individual, who has been pregnant 7 times, with a diastolic blood pressure of 68, triceps skin fold thickness of 28, and a high plasma glucose concentration of 194 after a glucose tolerance test. They have a serum insulin level of 0, a body mass index of 35.9, and a diabetes pedigree function of 0.745.###\nHence this label was consent."
"A 33-year-old individual who has been pregnant 4 times and has a diastolic blood pressure of 60. Their triceps skin fold thickness is 33, plasma glucose concentration after a GTT is 103, and 2-hour serum insulin level is 192. With a body mass index of 24.0 and a diabetes pedigree function of 0.966, this person's risk for developing diabetes may be influenced by these factors.###\nHence this label was avoid."
"This data describes a 21-year-old individual who has been pregnant 3 times. Their diastolic blood pressure is 60, triceps skin fold thickness is 18, and 2-hour serum insulin is 0. The plasma glucose concentration at 2 hours in an oral glucose tolerance test is 87. Additionally, their body mass index is 21.8 and their diabetes pedigree function is 0.444.###\nHence this label was avoid."
"A 22-year-old woman, who is pregnant for the first time, has a normal diastolic blood pressure of 70. She has a relatively low triceps skin fold thickness of 13, indicating a healthy body fat percentage. Her plasma glucose concentration after a two-hour oral glucose tolerance test is 130, which is within the normal range. Her 2-hour serum insulin level is 105, suggesting normal pancreatic function. With a body mass index of 25.9, she is considered to be overweight but not obese. The diabetes pedigree function score of 0.472 indicates a moderately low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 60-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 90 and a triceps skin fold thickness of 7. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 129 mg/dL, and her 2-hour serum insulin level is 326 µU/mL. She has a body mass index of 19.6 and a diabetes pedigree function of 0.582.###\nHence this label was avoid."
"A 32-year-old individual, who has been pregnant 5 times, with a diastolic blood pressure of 74. They have a triceps skin fold thickness of 27, a plasma glucose concentration of 99 after a glucose tolerance test, and no insulin after 2 hours. Their body mass index is 29.0, and their diabetes pedigree function is 0.203.###\nHence this label was avoid."
"The patient is a 25-year-old woman who has never been pregnant. Her diastolic blood pressure is 62, and her triceps skin fold thickness is 30. She has a plasma glucose concentration of 107 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 74. Her body mass index is 36.6, and her diabetes pedigree function is 0.757.###\nHence this label was consent."
"The patient is a 25-year-old female who has been pregnant twice. She has a diastolic blood pressure of 58 mmHg and a triceps skin fold thickness of 24 mm, indicating a moderate level of body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 127 mg/dL. Additionally, her 2-hour serum insulin level is high at 275 μU/mL, which may suggest insulin resistance. Despite these factors, her body mass index is within the normal range at 27.7, and she has a moderately high diabetes pedigree function score of 1.6, indicating a genetic predisposition to diabetes.###\nHence this label was avoid."
"A 21-year-old woman who is pregnant for the first time has a healthy diastolic blood pressure of 60. Her triceps skin fold thickness is 8mm, indicating a moderate amount of subcutaneous fat. Her glucose levels are normal at 109 mg/dL after a 2-hour oral glucose tolerance test. However, her insulin levels are high at 182 μU/mL, suggesting potential insulin resistance. With a body mass index of 25.4, she is considered overweight. Her diabetes pedigree function score of 0.947 indicates a family history of diabetes.###\nHence this label was avoid."
"The patient is a 25-year-old female who is pregnant for the first time. She has a below-average diastolic blood pressure of 62, a healthy triceps skin fold thickness of 25, and a normal plasma glucose concentration of 92 after a GTT. Her insulin level at 2 hours is 41, indicating normal pancreatic function. With a low body mass index of 19.5 and a diabetes pedigree function of 0.482, she has a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"This data describes a 42-year-old female who has been pregnant twice. She has a diastolic blood pressure of 90, a triceps skin fold thickness of 30, and a plasma glucose concentration of 89 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 33.5. The diabetes pedigree function for this individual is 0.292.###\nHence this label was avoid."
"This patient is a 29-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 80 and a triceps skin fold thickness of 0. Her plasma glucose concentration at 2 hours is 92, with a 2-hour serum insulin level of 0. She has a body mass index of 42.2 and a diabetes pedigree function of 0.237.###\nHence this label was avoid."
"The patient is a 36-year-old woman who is pregnant for the first time. She has a normal diastolic blood pressure of 68 and a low triceps skin fold thickness of 8. Her plasma glucose concentration after a glucose tolerance test is 90, and her insulin level is 0. With a body mass index of 24.5 and a moderate diabetes pedigree function of 1.138, she may have a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 30-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 62, triceps skin fold thickness of 12, and a plasma glucose concentration of 117 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 29.7. The diabetes pedigree function is 0.38.###\nHence this label was consent."
"This data belongs to an 81-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 74, triceps skin fold thickness of 33, plasma glucose concentration of 134, 2-hour serum insulin level of 60, body mass index of 25.9, and a diabetes pedigree function of 0.46.###\nHence this label was avoid."
"This patient is a 43-year-old female who has been pregnant 13 times. She has a diastolic blood pressure of 90, triceps skin fold thickness of 33, and a plasma glucose concentration of 152 after a GTT. Her 2-hour serum insulin level is 29, and her body mass index is 26.8. The diabetes pedigree function for this patient is 0.731.###\nHence this label was consent."
"This individual, a 43-year-old female, has had one pregnancy. She has a diastolic blood pressure of 82, triceps skin fold thickness of 25, and a plasma glucose concentration of 95 after a glucose tolerance test. Her 2-hour serum insulin level is high at 180. Despite having a body mass index of 35.0, her diabetes pedigree function is low at 0.233. The data suggests a potential risk for diabetes due to elevated insulin levels and high body mass index.###\nHence this label was consent."
"The patient is 38 years old, has been pregnant 5 times, and has a normal diastolic blood pressure of 74. They have no triceps skin fold thickness and a plasma glucose concentration of 124 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 34.0. The diabetes pedigree function score is 0.22, indicating a low genetic likelihood of developing diabetes.###\nHence this label was consent."
"This data represents a 54-year-old individual who has been pregnant 9 times. They have a diastolic blood pressure of 110 mmHg and a triceps skin fold thickness of 24 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 171 mg/dL, with a 2-hour serum insulin level of 240 uU/ml. They have a body mass index of 45.4 and a diabetes pedigree function value of 0.721.###\nHence this label was consent."
"The patient is a 26-year-old female who is 3 times pregnant and has a low diastolic blood pressure of 44. She has a moderate triceps skin fold thickness of 20 and a normal plasma glucose concentration of 102 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is high at 94, and she has a slightly elevated body mass index of 30.8. The diabetes pedigree function indicates a low genetic predisposition to diabetes at 0.4.###\nHence this label was avoid."
"The patient is a 42-year-old woman who has been pregnant 11 times. She has a healthy diastolic blood pressure of 68 and a relatively high triceps skin fold thickness of 40. Her plasma glucose concentration after a glucose tolerance test is 103, and she has no measurable insulin levels after 2 hours. With a body mass index of 46.2 and a low diabetes pedigree function of 0.126, she may have a lower risk of developing diabetes.###\nHence this label was avoid."
"A 25-year-old woman who has never been pregnant shows normal blood pressure and insulin levels. She has high glucose concentration after a meal, a higher-than-average BMI, and a moderate family history of diabetes.###\nHence this label was consent."
"The patient is a 22-year-old individual who has been pregnant once. They have normal diastolic blood pressure, slightly below average triceps skin fold thickness, and normal plasma glucose concentration after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is unusually low. They have a healthy body mass index and a moderately high diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 37-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 32. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 105, and her 2-hour serum insulin level is 68. With a body mass index of 30.8 and a low diabetes pedigree function score of 0.122, this patient is at average risk for developing diabetes.###\nHence this label was avoid."
"A 32-year-old woman who has never been pregnant showed normal diastolic blood pressure and triceps skin fold thickness. Her glucose levels were slightly elevated after a glucose tolerance test. She had no insulin present in her serum, and her body mass index indicated she was overweight. Her diabetes pedigree function score was moderately high. Overall, she shows some risk factors for developing diabetes in the future.###\nHence this label was consent."
"A 23-year-old female, who has been pregnant twice, with low diastolic blood pressure and no triceps skin fold thickness, has a normal plasma glucose concentration after a 2-hour oral glucose tolerance test. She has no serum insulin level, a healthy body mass index, and a low diabetes pedigree function score.###\nHence this label was avoid."
"The patient is a 40-year-old female who has been pregnant 3 times. She has normal diastolic blood pressure, average triceps skin fold thickness, and low insulin levels. Her glucose tolerance test results indicate normal plasma glucose concentration. However, she has a high body mass index and a moderately low diabetes risk based on her pedigree function.###\nHence this label was avoid."
"A 31-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 60, triceps skin fold thickness of 20, plasma glucose concentration after a glucose tolerance test of 125, 2-hour serum insulin level of 140, body mass index of 33.8, and a diabetes pedigree function of 0.088.###\nHence this label was avoid."
"The individual is a 27-year-old female who has been pregnant 5 times. She has a normal diastolic blood pressure of 72 and a moderate triceps skin fold thickness of 33. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 95, and she has low 2-hour serum insulin levels. She has a high body mass index of 37.7 and a relatively low diabetes pedigree function score of 0.37.###\nHence this label was avoid."
"The individual is a 22-year-old who has never been pregnant. She has a diastolic blood pressure of 64, triceps skin fold thickness of 39, and a plasma glucose concentration of 95 after a glucose tolerance test. Her 2-hour serum insulin level is 105, and she has a body mass index of 44.6. Her diabetes pedigree function is 0.366.###\nHence this label was avoid."
"This individual is a 44-year-old who has been pregnant 5 times. Their diastolic blood pressure is 76 mmHg and their triceps skin fold thickness is 0 mm. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 115 mg/dL, and their 2-hour serum insulin level is 0 μU/mL. They have a body mass index of 31.2 and a diabetes pedigree function of 0.343.###\nHence this label was consent."
"This is a 24-year-old female who has never been pregnant and has a diastolic blood pressure of 65 mmHg. She has a triceps skin fold thickness of 26 mm and a plasma glucose concentration of 140 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130 μU/mL, and she has a body mass index of 42.6, indicating obesity. Her diabetes pedigree function score is 0.431, suggesting a moderate genetic risk for diabetes.###\nHence this label was consent."
"This individual is a 26-year-old female who is pregnant for the first time. She has low diastolic blood pressure (30 mmHg), average triceps skin fold thickness (42 mm), and low plasma glucose concentration after a 2-hour oral glucose tolerance test (88 mg/dL). Her 2-hour serum insulin level is high (99 mu U/ml) and she has a high body mass index (55.0 kg/m^2). Her diabetes pedigree function score is moderate (0.496), indicating a potential genetic risk for diabetes.###\nHence this label was consent."
"This 23-year-old patient, who is pregnant for the first time, has a healthy diastolic blood pressure of 74. Their triceps skin fold thickness is 26, indicating a moderate amount of body fat. The patient's plasma glucose concentration after a glucose tolerance test is 140, which is within the normal range. Their insulin level is 180, suggesting normal pancreatic function. With a body mass index of 24.1, this patient falls within the healthy weight category. The diabetes pedigree function score of 0.828 indicates a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"A 54-year-old individual who has been pregnant 8 times shows normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a glucose tolerance test. There is no insulin present in the blood, and the body mass index is at the minimum level. The individual's diabetes pedigree function is low.###\nHence this label was consent."
"This patient is a 25-year-old female who has never been pregnant, with normal diastolic blood pressure, no triceps skin fold thickness, and very low insulin levels. Her plasma glucose concentration after a glucose tolerance test is 94, and she has a very low body mass index. Her diabetes pedigree function score is 0.256, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"A 29-year-old individual who has been pregnant 4 times, with a diastolic blood pressure of 60, triceps skin fold thickness of 27, plasma glucose concentration of 148 after a glucose tolerance test, 2-hour serum insulin level of 318, body mass index of 30.9, and a diabetes pedigree function of 0.15. These measurements provide key insights into the individual's health profile and potential risk factors for diabetes.###\nHence this label was consent."
"This patient is a 42-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 29mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 149 mg/dL, and her 2-hour serum insulin level is 127 uU/mL. With a body mass index of 29.3 and a diabetes pedigree function of 0.349, this patient's risk for developing diabetes may be moderate.###\nHence this label was consent."
"The patient is a 63-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 158 and her 2-hour serum insulin level is 0. The patient has a body mass index of 29.8 and a diabetes pedigree function of 0.207.###\nHence this label was avoid."
"This 25-year-old individual has been pregnant 3 times and shows a low diastolic blood pressure of 52. They have no triceps skin fold thickness or serum insulin, but their plasma glucose concentration after a glucose tolerance test is 121, indicating normal levels. Despite having a high body mass index of 36.0, their diabetes pedigree function is low at 0.127, suggesting a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was consent."
"The patient is a young adult, 23 years old, who has been pregnant once. They have a low diastolic blood pressure of 60 and a slightly above average triceps skin fold thickness of 42. During a glucose tolerance test, their plasma glucose concentration at 2 hours was low at 79. Their 2-hour serum insulin level is below normal at 48. Despite having a high body mass index of 43.5, their diabetes pedigree function is relatively low at 0.678.###\nHence this label was avoid."
"The patient is a 50-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 74, triceps skin fold thickness of 26, plasma glucose concentration of 138 after a glucose tolerance test, 2-hour serum insulin level of 144, and a body mass index of 36.1. Her diabetes pedigree function is 0.557. Given these measurements, it is important to monitor her risk of developing diabetes closely.###\nHence this label was consent."
"The patient is a 37-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 110 mmHg and a triceps skin fold thickness of 31mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 189 mg/dL. The 2-hour serum insulin level is 0 uU/mL. She has a body mass index of 28.5 and a diabetes pedigree function of 0.68.###\nHence this label was avoid."
"The patient is a 66-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 166 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index (BMI) of 26.6 and a diabetes pedigree function of 0.304.###\nHence this label was avoid."
"A 43-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 68. They have a triceps skin fold thickness of 49, a plasma glucose concentration of 129, and a 2-hour serum insulin level of 125. With a body mass index of 38.5 and a diabetes pedigree function of 0.439, this individual's medical profile suggests a risk for developing diabetes.###\nHence this label was consent."
"A 27-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 76, no triceps skin fold thickness, a high plasma glucose concentration of 166 after a glucose tolerance test, no serum insulin after 2 hours, and a high body mass index of 45.7. The diabetes pedigree function is low at 0.34.###\nHence this label was consent."
"This individual is a 65-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 108, a triceps skin fold thickness of 37, and a body mass index of 39.2. Her plasma glucose concentration after a glucose tolerance test is 103, and she has a very low 2-hour serum insulin level of 0. Her diabetes pedigree function score is 0.305.###\nHence this label was avoid."
"The patient is a 48-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 0. Her blood glucose level after a 2-hour oral glucose tolerance test is 104. She does not have any insulin present in her serum. Her body mass index is 28.8 and her diabetes pedigree function is 0.153.###\nHence this label was avoid."
"This data belongs to a 41-year-old individual who has been pregnant 7 times. They have a low diastolic blood pressure of 78, no triceps skin fold thickness, and a below-normal plasma glucose concentration of 62 after a glucose tolerance test. Their 2-hour serum insulin level is 0, indicating low insulin production. Despite having a body mass index of 32.6, which is in the overweight range, their diabetes pedigree function is low at 0.391, suggesting a relatively lower genetic risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 65-year-old individual who has never been pregnant and has a very low diastolic blood pressure of 50. They have a triceps skin fold thickness of 0, indicating a very lean body composition. Despite this, their plasma glucose concentration after a 2-hour oral glucose tolerance test is elevated at 161, suggesting a potential risk for diabetes. They have a very low 2-hour serum insulin level of 0, and their body mass index is within the healthy range at 21.9. The diabetes pedigree function score of 0.254 indicates a low genetic predisposition to diabetes.###\nHence this label was avoid."
"A 23-year-old woman, pregnant for the first time, with low diastolic blood pressure and a moderate triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is normal, while her serum insulin level is elevated. She has a healthy body mass index and a moderate diabetes pedigree function score.###\nHence this label was avoid."
"A 39-year-old woman, who has been pregnant 8 times, has a diastolic blood pressure of 70 and a triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 74, and her 2-hour serum insulin level is 49. With a body mass index of 35.3 and a diabetes pedigree function value of 0.705, her risk of developing diabetes may be evaluated.###\nHence this label was avoid."
"The patient is a young adult, aged 21, who is slightly overweight. She has been pregnant once. Her blood pressure and glucose levels are within normal range. The skinfold thickness indicates a moderate amount of subcutaneous fat. She has a low insulin level and a moderately low diabetes pedigree function score, suggesting a lower risk for developing diabetes.###\nHence this label was avoid."
"This is a 24-year-old individual who is pregnant for the first time. They have normal diastolic blood pressure and a moderately high triceps skin fold thickness. Their glucose levels are within the normal range after a 2-hour oral glucose tolerance test. The individual has a moderate level of serum insulin and a slightly elevated body mass index. Their diabetes pedigree function value indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 29-year-old female who has never been pregnant. She has normal diastolic blood pressure and a slightly elevated body mass index. Despite having a normal glucose concentration after a GTT, she has a low insulin level and a moderate thickness of triceps skin fold. Her risk of developing diabetes is relatively low based on the diabetes pedigree function.###\nHence this label was avoid."
"The patient is a 28-year-old who has never been pregnant. She has a low diastolic blood pressure of 70 and a high body mass index of 37.9. Despite having a normal triceps skin fold thickness, her plasma glucose concentration after a glucose tolerance test is elevated at 146. She has no insulin present in her serum after a 2-hour period. Her diabetes pedigree function score is 0.334, indicating a moderate genetic risk for diabetes.###\nHence this label was consent."
"This individual is a 28-year-old female who has been pregnant twice. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 20, and a plasma glucose concentration of 92 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 24.2. Her diabetes pedigree function score is 1.698.###\nHence this label was avoid."
"A 46-year-old woman who has been pregnant 4 times shows normal diastolic blood pressure and no triceps skin fold thickness. Her glucose levels are within a healthy range, and she has low insulin levels. She maintains a moderate body mass index and has a relatively low diabetes pedigree.###\nHence this label was consent."
"A 29-year-old woman who has been pregnant twice shows high plasma glucose concentration and high insulin levels after an oral glucose tolerance test. She has a healthy body mass index, low diastolic blood pressure, and moderate triceps skin fold thickness. The diabetes pedigree function indicates a low genetic predisposition to diabetes.###\nHence this label was consent."
"The individual is a 50-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 24 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 112 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 28.2 and a diabetes pedigree function value of 1.282.###\nHence this label was consent."
"A 52-year-old individual who has been pregnant twice with normal blood pressure, no triceps skin fold thickness, and low insulin levels has a moderate body mass index of 27.0. Their glucose levels after a glucose tolerance test are within normal range and they have a low risk of developing diabetes based on their diabetes pedigree function score of 0.259.###\nHence this label was consent."
"This patient is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 90, triceps skin fold thickness of 24, and a body mass index of 30.4, indicating she may be overweight. Her plasma glucose concentration after a glucose tolerance test is 142, and her 2-hour serum insulin is high at 480. Despite a low diabetes pedigree function of 0.128, these values suggest she may be at risk for developing diabetes.###\nHence this label was consent."
"A 62-year-old individual who has been pregnant 12 times with a diastolic blood pressure of 78. They have a relatively low triceps skin fold thickness of 17, normal plasma glucose concentration of 121, and no insulin after a GTT. With a body mass index of 26.5, and a low diabetes pedigree function of 0.259.###\nHence this label was avoid."
"This is a data entry from a diabetes dataset. The patient is a 43-year-old female who has been pregnant 6 times, with a diastolic blood pressure of 58. She has a triceps skin fold thickness of 33 mm and a plasma glucose concentration of 98 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 190 μU/mL, and she has a body mass index of 34.0. Her diabetes pedigree function is 0.43, indicating a low to moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This is a data record of a 24-year-old individual who has been pregnant 3 times. She has low diastolic blood pressure and her triceps skin fold thickness is within normal range. Her plasma glucose level after a 2-hour oral glucose tolerance test is 99, and her insulin level is 86. She has a healthy body mass index of 25.6 and a low diabetes pedigree function score of 0.154.###\nHence this label was avoid."
"The patient is a 50-year-old woman who has been pregnant 6 times. She has normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 147 mg/dL, and she has normal 2-hour serum insulin levels. She has a body mass index of 29.5, which classifies her as overweight. Her diabetes pedigree function score is 0.178, indicating a slightly increased risk of developing diabetes.###\nHence this label was consent."
"A 21-year-old individual who has been pregnant twice has normal diastolic blood pressure and a healthy body mass index. Their 2-hour plasma glucose concentration is slightly elevated, but their insulin levels are within a normal range. The triceps skin fold thickness suggests a moderate level of subcutaneous fat. Overall, the individual has a relatively low risk of developing diabetes based on these measurements.###\nHence this label was avoid."
"The patient is a 45-year-old female who is in the early stages of pregnancy. She has a slightly elevated diastolic blood pressure of 102 mmHg. Her triceps skin fold thickness is within normal range, indicating healthy body fat levels. The patient's glucose levels after a 2-hour oral glucose tolerance test are 133 mg/dL, suggesting normal blood sugar regulation. She has a moderate insulin level of 140 μU/mL, indicating adequate response to glucose. The patient's body mass index is 32.8, placing her in the overweight category. Her diabetes pedigree function score is low at 0.234, suggesting a lower genetic risk for diabetes.###\nHence this label was consent."
"This is a dataset of a 26-year-old individual who has never been pregnant. She has a diastolic blood pressure of 76, a triceps skin fold thickness of 43, and a high plasma glucose concentration of 165 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 255 μU/mL and her body mass index is 47.9, indicating obesity. Despite these indicators, her diabetes pedigree function is relatively low at 0.259, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a young adult woman, 21 years old, who has never been pregnant. She has low diastolic blood pressure of 60 and slightly below average triceps skin fold thickness of 29. Her glucose levels are high at 177 after a glucose tolerance test, and she has very high insulin levels of 478. Despite her high insulin levels, her body mass index is elevated at 34.6, indicating she may be overweight. She also has a relatively high diabetes pedigree function score of 1.072, suggesting a moderate familial predisposition to diabetes. Overall, this patient may be at risk for developing diabetes due to her high glucose levels, insulin resistance, and elevated BMI.###\nHence this label was consent."
"The patient is a young, non-pregnant individual with slightly elevated diastolic blood pressure. They have a high triceps skin fold thickness and a significantly high plasma glucose concentration after a glucose tolerance test. The patient also has very high insulin levels, a high body mass index, and a low diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 24-year-old female who is pregnant for the first time. She has a slightly low diastolic blood pressure of 74, a high triceps skin fold thickness of 50, and an elevated plasma glucose concentration of 136 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is also high at 204, and she has a body mass index of 37.4, indicating obesity. Despite these risk factors, her diabetes pedigree function is relatively low at 0.399, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The data belongs to a 25-year-old individual who has been pregnant twice. They have a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 16. The plasma glucose concentration after a 2-hour oral glucose tolerance test is on the lower side at 87. Their 2-hour serum insulin level is 52, indicating normal insulin production. With a body mass index of 32.7, they are considered overweight. The diabetes pedigree function score is low at 0.166, suggesting a low genetic risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 34-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 70 mmHg, triceps skin fold thickness of 33 mm, plasma glucose concentration of 124 mg/dL after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 402 μU/mL. Her body mass index is 35.4, and her diabetes pedigree function is 0.282.###\nHence this label was avoid."
"The patient is a 37-year-old female who has been pregnant seven times. She has a normal diastolic blood pressure of 70 and a slightly above average triceps skin fold thickness of 33. Her plasma glucose concentration is within normal range at 124, but her 2-hour serum insulin levels are high at 215. Despite this, her body mass index is in the healthy range at 25.5, and her diabetes pedigree function indicates a low genetic risk of diabetes at 0.161.###\nHence this label was avoid."
"The patient is a 41-year-old female who has been pregnant 13 times. She has a very low diastolic blood pressure of 60 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 76, and her 2-hour serum insulin level is 0. Despite having a high body mass index of 32.8, her diabetes pedigree function is low at 0.18.###\nHence this label was avoid."
"The patient is a 22-year-old female who has been pregnant twice. She has normal diastolic blood pressure, zero triceps skin fold thickness, and normal insulin levels. Her plasma glucose concentration after a GTT is elevated. She has a healthy body mass index and a moderately low diabetes pedigree function.###\nHence this label was avoid."
"The patient is a 22-year-old female who is pregnant for the first time. She has normal diastolic blood pressure and a slightly below average triceps skin fold thickness. Her glucose level is within the normal range after a 2-hour oral glucose tolerance test, but she has high insulin levels. She has a healthy body mass index and a low diabetes pedigree function score, indicating a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 29-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 64 and triceps skin fold thickness of 33. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 189, and her 2-hour serum insulin level is 325. She has a body mass index of 31.2 and a diabetes pedigree function of 0.583.###\nHence this label was consent."
"This individual, a 22-year-old, has been pregnant 4 times. They have a low diastolic blood pressure of 70 and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 136, with no insulin detected after 2 hours. They have a body mass index of 31.2 and a diabetes pedigree function value of 1.182.###\nHence this label was consent."
"This individual is 35 years old and has been pregnant 11 times. Their diastolic blood pressure is 74, with a triceps skin fold thickness of 0. They have a plasma glucose concentration of 85 mg/dL after a 2-hour oral glucose tolerance test, and their 2-hour serum insulin level is 0. With a body mass index of 30.1 and a diabetes pedigree function of 0.3, this data suggests a potential risk for developing diabetes.###\nHence this label was avoid."
"This patient is a 29-year-old female who is 1 time pregnant and has a diastolic blood pressure of 56. She has a triceps skin fold thickness of 0 and a plasma glucose concentration of 146 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, her body mass index is 29.7, and her diabetes pedigree function is 0.564.###\nHence this label was avoid."
"This data represents a 22-year-old individual who has been pregnant 4 times and has a low diastolic blood pressure of 60. They have a healthy triceps skin fold thickness of 23 and a normal plasma glucose concentration of 97 after a GTT. Their 2-hour serum insulin level is 0, indicating normal insulin sensitivity. With a body mass index of 28.2 and a low diabetes pedigree function of 0.443, this individual appears to have a low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 21-year-old woman who has never been pregnant. She has a low diastolic blood pressure of 52 mmHg and no triceps skin fold thickness. Her glucose level after a two-hour oral glucose tolerance test is 102 mg/dL. There is no detectable insulin in her serum. She has a healthy body mass index of 25.1 and a low diabetes pedigree function of 0.078.###\nHence this label was avoid."
"The patient is a 22-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 70 and a triceps skin fold thickness of 28. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 106, with 2-hour serum insulin levels at 135. They have a body mass index of 34.2 and a low diabetes pedigree function of 0.142.###\nHence this label was avoid."
"The individual in question is a 23-year-old who has never been pregnant. Despite having a low diastolic blood pressure of 82, their triceps skin fold thickness is higher than average at 31. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is lower than normal at 84. Additionally, their 2-hour serum insulin level is elevated at 125. With a high body mass index of 38.2, their diabetes pedigree function is relatively low at 0.233. This combination of factors suggests a potential risk for developing diabetes and warrants further monitoring and possibly intervention.###\nHence this label was avoid."
"This patient is a 31-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 62, no triceps skin fold thickness, a plasma glucose concentration 92 after a glucose tolerance test, no insulin after 2 hours, a body mass index of 25.9, and a low diabetes pedigree function score of 0.167.###\nHence this label was avoid."
"A 22-year-old individual who has never been pregnant, with low diastolic blood pressure, moderate triceps skin fold thickness, high plasma glucose concentration after a GTT, moderately high insulin levels, high body mass index, and a relatively low diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 68-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 82 and a triceps skin fold thickness of 0. Their plasma glucose concentration is 91 after a 2-hour oral glucose tolerance test, with a 2-hour serum insulin level of 0. The patient has a body mass index of 35.6 and a diabetes pedigree function of 0.587.###\nHence this label was avoid."
"The patient is a 52-year-old female who has been pregnant 5 times. She has normal diastolic blood pressure, no triceps skin fold thickness, and a high plasma glucose concentration of 162 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is low, and she has a high body mass index of 37.7. The patient has a low diabetes pedigree function score of 0.151, indicating a relatively lower risk of developing diabetes.###\nHence this label was consent."
"This data represents a 35-year-old individual who has been pregnant 11 times. The individual has a diastolic blood pressure of 76 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 138 mg/dL, with a 2-hour serum insulin level of 0 μU/mL. The individual has a body mass index of 33.2 and a diabetes pedigree function of 0.42.###\nHence this label was avoid."
"This is a medical dataset of a 22-year-old individual who has never been pregnant. She has a low diastolic blood pressure of 60 and a moderate triceps skin fold thickness of 25. Her glucose levels are normal at 93, but her insulin levels are slightly elevated at 92. She has a healthy body mass index of 28.7 and a relatively low diabetes pedigree function of 0.532. Overall, her risk of developing diabetes appears to be relatively low based on these measurements.###\nHence this label was avoid."
"A 22-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 60 and a triceps skin fold thickness of 17. They have a plasma glucose concentration of 98 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 120. With a body mass index of 34.7 and a diabetes pedigree function of 0.198, the individual's risk for developing diabetes may need to be monitored closely.###\nHence this label was avoid."
"This individual is a 38-year-old woman who has been pregnant once. She has a diastolic blood pressure of 74 and a high plasma glucose concentration of 173 after a glucose tolerance test. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0. Despite her high body mass index of 36.8, her diabetes pedigree function is relatively low at 0.088.###\nHence this label was consent."
"A 41-year-old individual who has been pregnant 7 times with diastolic blood pressure of 84, triceps skin fold thickness of 33, plasma glucose concentration after a glucose tolerance test of 184, no insulin level after 2 hours, a body mass index of 35.5, and a diabetes pedigree function of 0.355.###\nHence this label was consent."
"A 31-year-old woman who has never been pregnant has slightly elevated diastolic blood pressure and a high triceps skin fold thickness. Her glucose levels are within the normal range after a 2-hour oral glucose tolerance test. However, her insulin levels are elevated, and she has a high body mass index of 46.8, indicating obesity. Despite her family history of diabetes, her diabetes pedigree function is moderate.###\nHence this label was avoid."
"This 29-year-old patient has been pregnant 3 times and shows normal diastolic blood pressure. They have no triceps skin fold thickness and zero insulin levels. However, their plasma glucose concentration after a glucose tolerance test is high at 182. Their body mass index is in the overweight range at 30.5, and they have a low diabetes pedigree function score of 0.345.###\nHence this label was consent."
"This individual is a 41-year-old woman who has been pregnant 12 times. She has normal diastolic blood pressure (85 mmHg) and a moderately high body mass index (37.4 kg/m^2). Her triceps skin fold thickness is slightly elevated at 33 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range at 140 mg/dL. She has no detectable serum insulin levels. Her diabetes pedigree function score is relatively low at 0.244, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"A 29-year-old woman who has been pregnant six times has a normal diastolic blood pressure and low triceps skin fold thickness. Her plasma glucose concentration after an oral glucose tolerance test is within the normal range, while her 2-hour serum insulin level is low. She has a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 30-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 96 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 117 mg/dL. She has a 2-hour serum insulin level of 0 µU/mL and a body mass index of 28.7 kg/m2. Her diabetes pedigree function is 0.157. ###\nHence this label was avoid."
"The patient is a 24-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 60 and a high triceps skin fold thickness of 46. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 108, and her 2-hour serum insulin level is elevated at 178. Despite her high insulin level, she has a high body mass index of 35.5 and a relatively low diabetes pedigree function score of 0.415. This combination of factors may indicate a risk for developing diabetes in the future.###\nHence this label was avoid."
"A 43-year-old individual who has been pregnant 5 times shows normal diastolic blood pressure and a moderately low triceps skin fold thickness. Their glucose levels are within the normal range after a 2-hour oral glucose tolerance test, and their insulin levels are slightly elevated. They have a slightly high body mass index and a relatively high diabetes pedigree function score, indicating a potential risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 32-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 0, a triceps skin fold thickness of 0, and a 2-hour serum insulin level of 0. Her plasma glucose concentration after a glucose tolerance test is 100. She has a body mass index of 30.0 and a diabetes pedigree function of 0.484.###\nHence this label was consent."
"This individual is a 39-year-old female who has been pregnant 8 times. She has normal diastolic blood pressure and zero triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 133, with no serum insulin present. However, she has a high body mass index of 32.9 and a low diabetes pedigree function of 0.27.###\nHence this label was consent."
"A 29-year-old woman who has been pregnant twice has normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range. She has no serum insulin after 2 hours and a healthy body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is a 72-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 0 mmHg and a triceps skin fold thickness of 0 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 119 mg/dL. The 2-hour serum insulin level is 0 μU/mL. The patient has a body mass index of 19.6, and their diabetes pedigree function is 0.832.###\nHence this label was avoid."
"The data describes a 22-year-old individual who is pregnant for the first time. She has normal diastolic blood pressure. Her triceps skin fold thickness is average. After a 2-hour oral glucose tolerance test, her plasma glucose concentration is low. Her insulin level is within the normal range. She has a healthy body mass index. The diabetes pedigree function indicates a low genetic predisposition to diabetes.###\nHence this label was avoid."
"A 34-year-old woman who has been pregnant 10 times has a diastolic blood pressure of 74 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 168. She has a body mass index of 38.0 and a diabetes pedigree function of 0.537.###\nHence this label was consent."
"A 25-year-old individual who has been pregnant 2 times shows a low diastolic blood pressure of 58. They have a moderately high triceps skin fold thickness of 40, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range at 105. Their 2-hour serum insulin level is slightly elevated at 94. Despite having a relatively high body mass index of 34.9, their diabetes pedigree function is low at 0.225.###\nHence this label was avoid."
"A 33-year-old woman who has never been pregnant is showing signs of potential diabetes risk with very low diastolic blood pressure, moderately high triceps skin fold thickness, and high plasma glucose concentration after a glucose tolerance test. She also has elevated serum insulin levels, a high body mass index, and an increased diabetes pedigree function score. These factors combined suggest a need for further evaluation and monitoring for diabetes.###\nHence this label was consent."
"A 23-year-old female, who is pregnant for the first time, has a diastolic blood pressure of 62 mmHg. She has a triceps skin fold thickness of 24 mm and a plasma glucose concentration of 88 mg/dl after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 44 μU/ml, and she has a body mass index of 29.9. The diabetes pedigree function value is 0.422, indicating a low to moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This individual is a 25-year-old who has never been pregnant. Their diastolic blood pressure is 76 mmHg, triceps skin fold thickness is 56 mm, and BMI is 53.2. They have a plasma glucose concentration of 162 mg/dL after a GTT, and a 2-hour serum insulin level of 100 mU/ml. Their diabetes pedigree function is 0.759. Overall, this person shows some indicators that may suggest a risk of developing diabetes.###\nHence this label was consent."
"This individual is a 24-year-old who is pregnant for the first time. She has normal diastolic blood pressure, average triceps skin fold thickness, and slightly low plasma glucose concentration after a 2-hour oral glucose tolerance test. Her insulin levels are within the normal range. Despite having a high body mass index, her risk of developing diabetes is relatively low, indicated by her low diabetes pedigree function score.###\nHence this label was avoid."
"A 28-year-old woman, who is pregnant for the first time, has a healthy diastolic blood pressure of 74. Her triceps skin fold thickness is within a normal range at 12mm. She has a plasma glucose concentration of 100 mg/dL after a 2-hour oral glucose tolerance test and a relatively low insulin level of 46 mIU/L. With a body mass index of 19.5, she is considered underweight. Her diabetes pedigree function is low at 0.149, indicating a lower genetic risk of diabetes.###\nHence this label was avoid."
"This 25-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 80. They have a triceps skin fold thickness of 35, a plasma glucose concentration of 139 after a GTT, and a 2-hour serum insulin level of 160. Their body mass index is 31.6 and they have a diabetes pedigree function of 0.361.###\nHence this label was consent."
"This is a 51-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 72 and a triceps skin fold thickness of 19. Their plasma glucose concentration after a glucose tolerance test is 166, and their 2-hour serum insulin level is 175. With a body mass index of 25.8 and a diabetes pedigree function of 0.587, this individual's data suggest they may have a moderate risk of developing diabetes.###\nHence this label was consent."
"The patient is a 44-year-old woman who has been pregnant 13 times. She has a high diastolic blood pressure of 114 and a high glucose concentration of 158 after a 2-hour oral glucose tolerance test. Despite having a body mass index of 42.3, she has a triceps skin fold thickness and serum insulin level of 0, indicating potential risk for developing diabetes. Her diabetes pedigree function is low at 0.257.###\nHence this label was consent."
"This is data from a 33-year-old individual who is pregnant for the first time. The individual has a diastolic blood pressure of 98, a triceps skin fold thickness of 41, and a plasma glucose concentration of 128 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 58, and their body mass index is 32.0. The individual also has a diabetes pedigree function value of 1.321.###\nHence this label was consent."
"The patient is a 49-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 88 mmHg and a body mass index of 30.4, indicating overweight. Her triceps skin fold thickness is 0, suggesting low subcutaneous fat. Despite having a high plasma glucose concentration of 165 mg/dL after a glucose tolerance test, her 2-hour serum insulin level is 0. Her diabetes pedigree function is 0.302, indicating a moderate genetic risk for diabetes.###\nHence this label was consent."
"A 26-year-old woman who has never been pregnant has a diastolic blood pressure of 110. Her triceps skin fold thickness is 46mm, and she had a plasma glucose concentration of 129mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130muU/mL, and she has a body mass index of 67.1 kg/m^2. Her diabetes pedigree function is 0.319, indicating a moderate genetic risk for diabetes.###\nHence this label was consent."
"This individual is a 30-year-old female who has been pregnant twice. She has a healthy diastolic blood pressure of 68 and a slightly below average triceps skin fold thickness of 28. Her plasma glucose concentration after a glucose tolerance test is 124, and she has a high level of serum insulin at 205. Despite this, her body mass index is within the overweight range at 32.9. Her diabetes pedigree function is 0.875, indicating a moderate genetic risk for diabetes.###\nHence this label was consent."
"This is a data entry of a 27-year-old individual with 1 pregnancy history. Their diastolic blood pressure is 60, triceps skin fold thickness is 23, plasma glucose concentration is 117, and 2-hour serum insulin is 106. The individual has a body mass index of 33.8 and a diabetes pedigree function of 0.466.###\nHence this label was avoid."
"The patient is a 39-year-old woman who has been pregnant 3 times. She has a low diastolic blood pressure of 56, a triceps skin fold thickness of 34, and a normal plasma glucose concentration of 96 from a glucose tolerance test. Her 2-hour serum insulin level is high at 115, and she has a healthy body mass index of 24.7. Additionally, her diabetes pedigree function score is 0.944, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This patient is a 26-year-old who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a glucose tolerance test. She has no insulin present in her serum, a high body mass index, and a low diabetes pedigree function.###\nHence this label was consent."
"The patient is a 42-year-old woman who has been pregnant 10 times. She has a low diastolic blood pressure of 66 mmHg. The triceps skin fold thickness is 0, indicating low body fat. Additionally, her plasma glucose concentration after a glucose tolerance test is 108 mg/dL. She has no insulin production after 2 hours of the test. Despite having a body mass index of 32.4, she has a low diabetes pedigree function score of 0.272.###\nHence this label was consent."
"This patient is 37 years old and has been pregnant 5 times. They have a diastolic blood pressure of 108 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 137, with a 2-hour serum insulin level of 0. Their body mass index is 48.8 and their diabetes pedigree function is 0.227.###\nHence this label was consent."
"This individual is a 41-year-old female who is 9 times pregnant. She has a diastolic blood pressure of 80, triceps skin fold thickness of 37, and a low plasma glucose concentration of 57 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, indicating low insulin production. She has a body mass index of 32.8, reflecting overweight, and a low diabetes pedigree function value of 0.096, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 33-year-old woman who has been pregnant 9 times shows normal diastolic blood pressure and a slightly higher triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is elevated, along with a high level of serum insulin. She has a moderately high body mass index and a moderate diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 67-year-old who has never been pregnant. They have a very low diastolic blood pressure of 60 and zero triceps skin fold thickness. Their plasma glucose concentration after a 2-hour GTT is extremely low at 57, and they have no serum insulin present. Despite their low values in other areas, their body mass index is in the healthy range at 21.7. The patient has a moderately low diabetes pedigree function of 0.735. Overall, this individual shows some concerning values related to diabetes risk factors.###\nHence this label was avoid."
"This is a 21-year-old individual who has been pregnant twice and has a diastolic blood pressure of 90 mmHg. They have a triceps skin fold thickness of 19 mm and a plasma glucose concentration of 117 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 71 μU/mL and their body mass index is 25.2. The diabetes pedigree function, which assesses the risk of diabetes based on family history, is 0.313 for this individual.###\nHence this label was avoid."
"A 56-year-old individual, who has been pregnant 10 times, with a diastolic blood pressure of 72, triceps skin fold thickness of 18, plasma glucose concentration of 94 after a glucose tolerance test, no insulin after 2 hours, a body mass index of 23.1, and a diabetes pedigree function of 0.595.###\nHence this label was avoid."
"This individual is 37 years old and has been pregnant 4 times. They have a low diastolic blood pressure of 65 and no triceps skin fold thickness. Their plasma glucose concentration is 114 after a 2-hour oral glucose tolerance test, with no serum insulin detected. They have a low body mass index of 21.9 and a relatively low diabetes pedigree function of 0.432.###\nHence this label was avoid."
"This individual is a 26-year-old woman who has been pregnant 4 times. She has a normal diastolic blood pressure of 72 and zero triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is elevated at 171, but her 2-hour serum insulin level is zero. Despite having a high body mass index of 43.6, her diabetes pedigree function value is relatively low at 0.479.###\nHence this label was consent."
"A 45-year-old woman, who has been pregnant 8 times, with normal diastolic blood pressure of 78. She has a moderate triceps skin fold thickness of 32mm. Her plasma glucose concentration after a 2-hour glucose tolerance test is 154, and she has no insulin in her serum. Despite a slightly high body mass index of 32.4, she has a low diabetes pedigree function score of 0.443.###\nHence this label was consent."
"This is a data entry for a 22-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 100, a triceps skin fold thickness of 35, and a high plasma glucose concentration of 123 after a glucose tolerance test. Their 2-hour serum insulin level is 240, indicating possible insulin resistance. With a body mass index of 57.3 and a diabetes pedigree function value of 0.88, there may be a higher risk of developing diabetes in the future.###\nHence this label was avoid."
"The patient is a 40-year-old individual who has been pregnant 10 times. They have a low diastolic blood pressure of 70 and a triceps skin fold thickness of 27. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 111. The 2-hour serum insulin level is 0, indicating possible insulin resistance. The patient's body mass index is 27.5 and their diabetes pedigree function is low at 0.141. Overall, this individual shows some signs of potential diabetes risk due to the combination of factors such as pregnancy history, glucose levels, and insulin levels.###\nHence this label was consent."
"This patient is 35 years old and has never been pregnant. They have a high diastolic blood pressure of 100. Their triceps skin fold thickness is 39, indicating a moderate amount of subcutaneous fat. The plasma glucose concentration at 2 hours is 93, which is within normal range. The 2-hour serum insulin level is 72. With a body mass index of 43.4, this patient is considered obese. The diabetes pedigree function value is 1.021, suggesting a moderate genetic risk for diabetes. Overall, this individual shows signs of potential health risks related to obesity and high blood pressure.###\nHence this label was avoid."
"The individual in this dataset is a 31-year-old who has been pregnant 4 times. They have normal diastolic blood pressure, slightly below average triceps skin fold thickness, and slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin levels are high, and their body mass index falls within the healthy range. Additionally, they have a relatively low diabetes pedigree function score, indicating a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 21-year-old individual who has never been pregnant with low diastolic blood pressure, a moderate triceps skin fold thickness, and normal plasma glucose concentration. They have slightly elevated serum insulin levels and a healthy body mass index. Their diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"This data belongs to a 24-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 78, triceps skin fold thickness of 50, and a plasma glucose concentration of 112 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 140, and they have a body mass index of 39.4. The diabetes pedigree function value for this individual is 0.175.###\nHence this label was avoid."
"This individual is a 22-year-old who has been pregnant once. They have a normal diastolic blood pressure of 68 and a healthy body mass index of 32.0. Their triceps skin fold thickness is 35, indicating a moderate amount of subcutaneous fat. The plasma glucose concentration at 2 hours in an oral glucose tolerance test is 0, which is unusually low. The 2-hour serum insulin level is also 0, suggesting they may have issues with insulin production or utilization. The diabetes pedigree function score is 0.389, indicating a mild family history of diabetes.###\nHence this label was avoid."
"The patient is a 25-year-old female who has never been pregnant. She has a normal diastolic blood pressure of 68 mmHg and a slightly below average triceps skin fold thickness of 32 mm. Her plasma glucose concentration is normal at 91 mg/dL, but her 2-hour serum insulin level is elevated at 210 mU/L. She has a high body mass index of 39.9, indicating obesity. The diabetes pedigree function score is low at 0.381, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 25-year-old woman who has been pregnant once has a slightly below normal diastolic blood pressure of 78. She has a moderately high triceps skin fold thickness of 29, and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 116. Her 2-hour serum insulin level is high at 180, and she has a high body mass index of 36.1. Her diabetes pedigree function, which indicates the likelihood of developing diabetes based on family history, is moderate at 0.496.###\nHence this label was avoid."
"The patient is a 30-year-old female who has been pregnant three times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 30 mm. Her plasma glucose concentration at 2 hours is 120 mg/dL, and her 2-hour serum insulin level is 135 μU/mL. She has a body mass index of 42.9 kg/m² and a diabetes pedigree function of 0.452. Overall, the data suggests that the patient may have an increased risk of developing diabetes.###\nHence this label was avoid."
"A 25-year-old individual who has been pregnant 3 times, with a healthy diastolic blood pressure of 68 and a normal triceps skin fold thickness of 30. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 84, and they have a 2-hour serum insulin level of 106. With a body mass index of 31.9 and a low diabetes pedigree function score of 0.591, this person appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 50-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 35 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 148 mg/dL. She has no serum insulin after 2 hours and has a body mass index of 33.6 kg/m². The diabetes pedigree function for this patient is 0.627.###\nHence this label was consent."
"The patient is a 26-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 118. Her 2-hour serum insulin level is 0. With a body mass index of 44.5 and a diabetes pedigree function of 0.904, this patient may be at risk for developing diabetes.###\nHence this label was avoid."
"This individual is a 49-year-old with a history of 6 pregnancies and has a diastolic blood pressure of 68. Their triceps skin fold thickness is 26, plasma glucose concentration at 165, and 2-hour serum insulin level at 168. The individual has a body mass index of 33.6 and a diabetes pedigree function of 0.631.###\nHence this label was avoid."
"A 36-year-old individual who has been pregnant 7 times shows normal diastolic blood pressure and a healthy body mass index. Despite having a low triceps skin fold thickness, they have slightly low plasma glucose levels and moderate insulin levels. Their risk of developing diabetes is relatively low, as indicated by their diabetes pedigree function score.###\nHence this label was avoid."
"The patient is 55 years old, has been pregnant 3 times, and has a diastolic blood pressure of 78. The triceps skin fold thickness and 2-hour serum insulin levels are both 0. The plasma glucose concentration after a glucose tolerance test is 128. The patient has a body mass index of 21.1 and a diabetes pedigree function of 0.268.###\nHence this label was avoid."
"The patient is a 67-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 146, and they have a 2-hour serum insulin level of 0. With a body mass index of 38.5 and a diabetes pedigree function of 0.52, the patient's risk of developing diabetes may be assessed as low.###\nHence this label was consent."
"A 48-year-old woman, who has been pregnant 11 times, with normal diastolic blood pressure, slightly above average triceps skin fold thickness, average plasma glucose concentration, elevated 2-hour serum insulin levels, high body mass index, and a moderately high diabetes pedigree function score. These factors may indicate a moderate risk of developing diabetes.###\nHence this label was consent."
"This is a data entry for a 59-year-old individual who has been pregnant 6 times. They have normal diastolic blood pressure of 78 mmHg and below average triceps skin fold thickness. Despite a high plasma glucose concentration of 194 mg/dL after a glucose tolerance test, their insulin levels are zero. With a healthy body mass index of 23.5 and a low diabetes pedigree function of 0.129, this individual may be at risk for developing diabetes due to the high glucose levels and lack of insulin response.###\nHence this label was consent."
"A 22-year-old individual, who is pregnant for the first time, with slightly elevated diastolic blood pressure and a higher-than-average triceps skin fold thickness. Their plasma glucose concentration is in the normal range after a glucose tolerance test, but they have significantly elevated 2-hour serum insulin levels. Despite having a high body mass index, indicating obesity, they have a moderately high diabetes pedigree function score.###\nHence this label was avoid."
"A 27-year-old woman who has been pregnant twice has a diastolic blood pressure of 65. She has no triceps skin fold thickness and her 2-hour serum insulin level is 0. Despite having a normal plasma glucose concentration of 85, she has a high body mass index of 39.6. Her diabetes pedigree function is 0.93, indicating a family history of diabetes.###\nHence this label was avoid."
"A 21-year-old individual who has never been pregnant has normal diastolic blood pressure and glucose levels. They have low triceps skin fold thickness, no insulin in their blood after a glucose tolerance test, and a healthy body mass index. Additionally, their diabetes pedigree function score is low, indicating a low genetic risk for diabetes.###\nHence this label was avoid."
"The patient is 43 years old and has been pregnant 8 times. They have a diastolic blood pressure of 106, triceps skin fold thickness of 46, and a plasma glucose concentration of 167 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 231, and they have a body mass index of 37.6. The diabetes pedigree function is 0.165.###\nHence this label was consent."
"This 28-year-old individual has been pregnant once and has a diastolic blood pressure of 50. Their triceps skin fold thickness is 40, plasma glucose concentration after a GTT is 125, and 2-hour serum insulin level is 167. With a body mass index of 33.3 and a diabetes pedigree function of 0.962, this individual's data suggests a risk assessment for developing diabetes.###\nHence this label was consent."
"This individual is a 55-year-old with a history of 6 pregnancies. They have a low diastolic blood pressure of 61 and 0 triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 137. They have no insulin in their serum, a body mass index of 24.2, and a low diabetes pedigree function of 0.151.###\nHence this label was avoid."
"A 30-year-old woman who is pregnant for the first time has a relatively healthy profile with a normal diastolic blood pressure and a moderate triceps skin fold thickness. Her glucose levels after a 2-hour oral glucose tolerance test are within normal range. Though her insulin levels are low, her body mass index is also relatively low, and her diabetes pedigree function indicates a low risk of developing diabetes.###\nHence this label was avoid."
"A 53-year-old woman, who has been pregnant twice, with normal diastolic blood pressure and low triceps skin fold thickness. Her glucose levels after a glucose tolerance test are within normal range, and she has no insulin resistance. She has a healthy body mass index and a low diabetes pedigree score.###\nHence this label was avoid."
"This individual is a 34-year-old with a history of 5 pregnancies. They have a diastolic blood pressure of 84, a triceps skin fold thickness of 44, and a plasma glucose concentration of 155 after a glucose tolerance test. Their 2-hour serum insulin level is 545, and they have a body mass index of 38.7. The diabetes pedigree function, which assesses the genetic influence of diabetes, is 0.619.###\nHence this label was avoid."
"This 22-year-old individual has never been pregnant and has normal diastolic blood pressure. Their triceps skin fold thickness is on the lower side. Their glucose levels are within normal range after a 2-hour oral glucose tolerance test. They have moderately high insulin levels and a healthy body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was avoid."
"A 38-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 74, triceps skin fold thickness of 16, plasma glucose concentration of 89, 2-hour serum insulin of 85, body mass index of 30.4, and a diabetes pedigree function of 0.551.###\nHence this label was avoid."
"This patient is a 25-year-old female who has never been pregnant. Her diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin levels are all recorded as zero. However, her plasma glucose concentration after a glucose tolerance test is 138 mg/dL. She has a high body mass index of 36.3 and a relatively high diabetes pedigree function score of 0.933, indicating a higher risk of developing diabetes.###\nHence this label was consent."
"A 21-year-old individual who is pregnant for the first time with a diastolic blood pressure of 60, triceps skin fold thickness of 32, plasma glucose concentration of 124, no 2-hour serum insulin, and a body mass index of 35.8. The diabetes pedigree function is 0.514.###\nHence this label was avoid."
"The patient is a 69-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 82 and a triceps skin fold thickness of 0. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 136. Their 2-hour serum insulin level is 0, and their body mass index is 0.0. The diabetes pedigree function for this individual is 0.64.###\nHence this label was avoid."
"The patient is a 32-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 30 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125 mg/dL and her 2-hour serum insulin level is 120 uU/ml. She has a body mass index of 30.0 and a diabetes pedigree function value of 0.464.###\nHence this label was avoid."
"The patient is a 41-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 26 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125 mg/dL, with a 2-hour serum insulin level of 115 μU/mL. She has a body mass index of 31.1 and a low diabetes pedigree function score of 0.205.###\nHence this label was consent."
"A 27-year-old female who has been pregnant twice shows normal diastolic blood pressure and a moderate level of triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within a healthy range, and she has a very low insulin level. Despite having a slightly high body mass index, her diabetes pedigree function indicates a low genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a young adult female in her early twenties who is pregnant for the first time. She has a below average diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness is within normal range. The patient had a slightly elevated plasma glucose concentration after a glucose tolerance test, indicating a potential risk for developing diabetes. Additionally, her 2-hour serum insulin levels are higher than usual. Overall, her diabetes pedigree function is moderately elevated.###\nHence this label was avoid."
"The patient is a 36-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 78, triceps skin fold thickness of 32, plasma glucose concentration of 151, 2-hour serum insulin level of 210, and a body mass index of 42.9. The diabetes pedigree function is 0.516, indicating a moderate genetic risk of developing diabetes.###\nHence this label was consent."
"The patient, a 32-year-old woman, has been pregnant 9 times. She has a diastolic blood pressure of 84 and a triceps skin fold thickness of 21. Her plasma glucose concentration after a glucose tolerance test is 164, and her 2-hour serum insulin level is 0. With a body mass index of 30.8 and a diabetes pedigree function value of 0.831, this data suggests a potential risk for developing diabetes.###\nHence this label was consent."
"A 22-year-old woman with a history of 8 pregnancies has a normal diastolic blood pressure of 86. Despite having no triceps skin fold thickness and 0 serum insulin, her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120. She has a healthy body mass index of 28.4 and a low diabetes pedigree function score of 0.259.###\nHence this label was consent."
"This data belongs to a 28-year-old individual who has been pregnant 4 times. Their diastolic blood pressure is 88, triceps skin fold thickness is 11, and plasma glucose concentration after a 2-hour oral glucose tolerance test is 127. Additionally, their 2-hour serum insulin levels are at 155, with a body mass index of 34.5. The diabetes pedigree function, which predicts the likelihood of developing diabetes based on family history, is 0.598.###\nHence this label was avoid."
"This patient is a 61-year-old woman who has been pregnant 7 times. She has a low diastolic blood pressure of 60. Her triceps skin fold thickness is 33, indicating a moderate amount of subcutaneous fat. She had a plasma glucose concentration of 142 measured after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is high at 190. Her body mass index is 28.8, which falls in the overweight category. The diabetes pedigree function score is 0.687, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 41-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 143. Additionally, her 2-hour serum insulin level is 0 and she has a body mass index of 34.9. The diabetes pedigree function for this patient is 0.129.###\nHence this label was consent."
"The individual is a 24-year-old who has never been pregnant. They have normal diastolic blood pressure and a healthy triceps skin fold thickness. The plasma glucose concentration after a glucose tolerance test is within normal range. Their insulin level is slightly elevated. They have a high body mass index, indicating overweight or obesity. The diabetes pedigree function score suggests a low genetic predisposition to diabetes.###\nHence this label was avoid."
"The patient is a 63-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 48. Her plasma glucose concentration after a glucose tolerance test is 101, and her 2-hour serum insulin level is 180. She has a body mass index of 32.9 and a diabetes pedigree function of 0.171.###\nHence this label was avoid."
"A 54-year-old individual who has been pregnant 6 times with a diastolic blood pressure of 76. Their triceps skin fold thickness is 0, indicating low subcutaneous fat levels. They have a plasma glucose concentration of 125 mg/dL after a glucose tolerance test and an insulin level of 0 at the 2-hour mark. With a body mass index of 33.8, they are considered to be in the obese category. The diabetes pedigree function value is 0.121, suggesting a low genetic predisposition to diabetes.###\nHence this label was consent."
"The individual in the dataset is a 30-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 56 mmHg. Her triceps skin fold thickness is 39mm. After a 2-hour oral glucose tolerance test, her plasma glucose concentration is 111 mg/dL. Her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 30.1 and a diabetes pedigree function value of 0.557.###\nHence this label was avoid."
"The patient is a 28-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 70, a triceps skin fold thickness of 18, and a body mass index of 31.6. Her plasma glucose concentration after a glucose tolerance test is 163, and her 2-hour serum insulin level is 105. The diabetes pedigree function indicates a low genetic risk of diabetes at 0.268.###\nHence this label was consent."
"This individual is 41 years old and has been pregnant once. They have a diastolic blood pressure reading of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. Their plasma glucose concentration after a glucose tolerance test is 180. With a body mass index of 43.3 and a diabetes pedigree function of 0.282, this individual's risk for developing diabetes may need to be monitored closely.###\nHence this label was consent."
"A 28-year-old woman who has never been pregnant has a normal diastolic blood pressure of 66. She has a slightly above average triceps skin fold thickness of 32, indicating some excess body fat. Her plasma glucose concentration after a 2-hour GTT is high at 198, suggesting she may have diabetes. Additionally, her 2-hour serum insulin level is elevated at 274, indicating her body is producing excess insulin. With a high body mass index of 41.3 and a moderately low diabetes pedigree function score of 0.502, this woman may be at high risk for developing diabetes.###\nHence this label was consent."
"This data describes a 45-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 94 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 111. She has a 2-hour serum insulin level of 0 and a body mass index of 32.8. The diabetes pedigree function, which indicates the likelihood of developing diabetes based on family history, is 0.265.###\nHence this label was avoid."
"This individual is 40 years old and has been pregnant 11 times. They have a diastolic blood pressure and triceps skin fold thickness of 0. Their plasma glucose concentration after a GTT is 135, while their 2-hour serum insulin level is 0. They have a high body mass index of 52.3 and a diabetes pedigree function of 0.578.###\nHence this label was consent."
"This 33-year-old individual has been pregnant 4 times and has a relatively low diastolic blood pressure of 68. They have a moderately healthy triceps skin fold thickness of 38 and a normal plasma glucose concentration of 99. Despite having no insulin levels after a glucose tolerance test, their body mass index is at 32.8, indicating they may be overweight. Additionally, their diabetes pedigree function score is low at 0.145, suggesting a lower genetic predisposition to diabetes.###\nHence this label was avoid."
"This data describes a 61-year-old individual who has been pregnant 4 times. The individual has a diastolic blood pressure of 92, a triceps skin fold thickness of 0, and a plasma glucose concentration of 146 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and their body mass index is 31.2. The diabetes pedigree function for this individual is 0.539, indicating a moderate risk of developing diabetes.###\nHence this label was consent."
"The patient is a 60-year-old who has been pregnant 4 times. She has a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 0. Her glucose level after a 2-hour oral glucose tolerance test is 134. She has no insulin secretion after 2 hours and has a healthy body mass index of 23.8. The diabetes pedigree function score is low at 0.277, indicating a low genetic risk for diabetes.###\nHence this label was consent."
"A 22-year-old woman who is one-time pregnant has a low diastolic blood pressure of 48. She has a slight triceps skin fold thickness of 18, and her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 71. Additionally, she has a moderate 2-hour serum insulin level of 76 and a low body mass index of 20.4. Her diabetes pedigree function is relatively low at 0.323.###\nHence this label was avoid."
"This data represents a 21-year-old individual who is pregnant for the first time. She has a relatively low diastolic blood pressure of 62 and a moderate triceps skin fold thickness of 41. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 139, and her 2-hour serum insulin level is notably high at 480. She has a high body mass index of 40.7 and a relatively low diabetes pedigree function of 0.536.###\nHence this label was avoid."
"This data belongs to a 25-year-old individual who has been pregnant 2 times. They have a normal diastolic blood pressure of 58 and a healthy triceps skin fold thickness of 33. Their plasma glucose concentration after a glucose tolerance test is slightly elevated at 144. They have a higher than average 2-hour serum insulin level of 135. Despite this, their body mass index is within the overweight range at 31.6. The individual has a relatively low diabetes pedigree function score of 0.422, indicating a moderate genetic risk for diabetes.###\nHence this label was consent."
"This individual is 36 years old and has been pregnant 7 times. They have a low diastolic blood pressure of 66 and no triceps skin fold thickness. Their plasma glucose concentration after a GTT is 159, with no serum insulin detected. They have a body mass index of 30.4 and a low diabetes pedigree function of 0.383.###\nHence this label was consent."
"The patient is a 32-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 32. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 97, and her 2-hour serum insulin level is 91. She has a body mass index of 40.9 and a diabetes pedigree function of 0.871.###\nHence this label was consent."
"The patient is a 26-year-old woman who has never been pregnant. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 45, and a plasma glucose concentration of 95 after a GTT. Her 2-hour serum insulin level is 92, and she has a body mass index of 36.5. The diabetes pedigree function for this individual is 0.33.###\nHence this label was avoid."
"This individual is a 46-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 62, triceps skin fold thickness of 26, and a plasma glucose concentration of 155 after a glucose tolerance test. Her 2-hour serum insulin level is high at 495. She has a body mass index of 34.0 and a diabetes pedigree function of 0.543, indicating a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 28-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 58 and a relatively low triceps skin fold thickness of 22. Her plasma glucose concentration after a glucose tolerance test is 85, and her 2-hour serum insulin level is 49. With a body mass index of 27.8, she has a moderate risk of developing diabetes based on her diabetes pedigree function of 0.306.###\nHence this label was avoid."
"A 27-year-old individual, who has never been pregnant, has a normal diastolic blood pressure of 82. Their triceps skin fold thickness is at a healthy level of 39. However, their plasma glucose concentration after a glucose tolerance test is elevated at 152, indicating a potential concern for diabetes. Additionally, their 2-hour serum insulin levels are high at 272, suggesting a possible insulin resistance. Despite having a body mass index of 41.5, which is considered obese, their diabetes pedigree function score is low at 0.27, indicating a lower genetic risk for diabetes. It is recommended for this individual to monitor their blood sugar levels closely and consider lifestyle changes to reduce their risk of developing diabetes.###\nHence this label was avoid."
"The patient is a 39-year-old female who has been pregnant 3 times. She has a low diastolic blood pressure of 70 and no triceps skin fold thickness. Her glucose levels are normal at 78, with no insulin present after a 2-hour glucose tolerance test. She has a slightly elevated body mass index of 32.5 and a low diabetes pedigree function score of 0.27. Overall, the data suggests a relatively low risk for developing diabetes.###\nHence this label was avoid."
"The patient is a 31-year-old female who has been pregnant 6 times. She has a normal diastolic blood pressure of 70 and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is high at 195, while her 2-hour serum insulin level is low. Despite having a slightly elevated body mass index of 30.9, her diabetes pedigree function is relatively low at 0.328.###\nHence this label was consent."
"The individual in this dataset is a 21-year-old who has never been pregnant. They have a diastolic blood pressure of 88, triceps skin fold thickness of 29, and a plasma glucose concentration of 78 after a glucose tolerance test. Their 2-hour serum insulin level is 40, body mass index is 36.9, and their diabetes pedigree function is 0.434.###\nHence this label was avoid."
"The patient is a 30-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 21. Her plasma glucose concentration 2 hours after a glucose tolerance test is 88, with a 2-hour serum insulin level of 23. She has a body mass index of 24.4 and a diabetes pedigree function of 0.342. Overall, the patient's diagnostic measurements indicate a moderate risk for developing diabetes.###\nHence this label was avoid."
"A 30-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure and no triceps skinfold thickness. Her glucose level after a 2-hour oral test is 116, with no insulin present. She has a healthy body mass index of 25.6 and a low diabetes pedigree function of 0.201.###\nHence this label was avoid."
"This data belongs to a 22-year-old individual who has been pregnant 2 times. They have a low diastolic blood pressure of 58 and a healthy triceps skin fold thickness of 26. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 88, with a moderate 2-hour serum insulin level of 16. Their body mass index is 28.4, indicating they are slightly overweight. The diabetes pedigree function value is 0.766, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was avoid."
"This data belongs to a 28-year-old individual who has been pregnant 2 times. They have a diastolic blood pressure reading of 66, triceps skin fold thickness of 20, and a plasma glucose concentration of 100 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 90, body mass index is 32.9, and their diabetes pedigree function is 0.867. This data provides insights into various health parameters that can help assess the individual's risk of developing diabetes.###\nHence this label was consent."
"This patient is a 29-year-old woman who is pregnant for the first time. She has normal diastolic blood pressure, but a higher than average triceps skin fold thickness. Her plasma glucose level after a glucose tolerance test is below the normal range. She also has elevated insulin levels after 2 hours. Her body mass index is indicative of obesity. Despite the risk factors, her diabetes pedigree function score is relatively low.###\nHence this label was avoid."
"This patient is a 47-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 106, triceps skin fold thickness of 23, and a plasma glucose concentration of 68 after a glucose tolerance test. Her 2-hour serum insulin level is 49, and her body mass index is 35.5. Additionally, her diabetes pedigree function is 0.285.###\nHence this label was avoid."
"The patient is a 45-year-old female who has been pregnant 5 times. She has a normal diastolic blood pressure of 80 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 128, with a serum insulin level of 0. She has a body mass index of 34.6 and a low diabetes pedigree function of 0.144.###\nHence this label was avoid."
"A 30-year-old patient who has been pregnant 4 times with a diastolic blood pressure of 74. The patient has a triceps skin fold thickness of 25mm, a plasma glucose concentration of 147 mg/dL after a 2-hour oral glucose tolerance test, and a high 2-hour serum insulin level of 293 μU/mL. With a body mass index of 34.9 and a diabetes pedigree function of 0.385, the patient may be at risk for developing diabetes.###\nHence this label was avoid."
"A 37-year-old woman who has been pregnant 5 times shows normal diastolic blood pressure and low insulin levels. Her triceps skin fold thickness and body mass index are within healthy ranges. Despite a relatively low plasma glucose concentration after a glucose tolerance test, her diabetes pedigree function suggests a slight genetic predisposition to diabetes.###\nHence this label was avoid."
"This data represents a 25-year-old individual who has been pregnant 4 times. She has a diastolic blood pressure of 62 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 76 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 34.0, indicating obesity, and a diabetes pedigree function of 0.391, suggesting a moderate genetic risk for diabetes.###\nHence this label was avoid."
"This individual is 27 years old and has been pregnant 5 times. They have a low diastolic blood pressure of 60 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 73, and their 2-hour serum insulin level is 0. With a body mass index of 26.8 and a diabetes pedigree function of 0.268, this person shows some unusual health indicators that may warrant further investigation.###\nHence this label was avoid."
"The patient is 36 years old and has been pregnant 4 times. They have a very low diastolic blood pressure and triceps skin fold thickness. However, their plasma glucose concentration after a glucose tolerance test is high at 183. Their 2-hour serum insulin is at 0, indicating a potential issue with insulin production. The patient has a body mass index of 28.4 and a relatively low diabetes pedigree function score of 0.212. Overall, the data suggests a concerning risk for developing diabetes due to the high glucose levels and low insulin levels.###\nHence this label was consent."
"A 21-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 65, a triceps skin fold thickness of 22, and a plasma glucose concentration of 94 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 24.7. The diabetes pedigree function is 0.148.###\nHence this label was avoid."
"This patient is a 26-year-old female who has never been pregnant. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 18 mm. Her plasma glucose concentration is 120 mg/dL after a 2-hour oral glucose tolerance test, with a 2-hour serum insulin level of 63 μU/ml. Her body mass index is 30.5 kg/m², and her diabetes pedigree function is 0.285. This individual's overall risk of developing diabetes may be influenced by these factors.###\nHence this label was avoid."
"The data represents a 40-year-old individual who has been pregnant 7 times. They have a diastolic blood pressure of 88, a triceps skin fold thickness of 42, and a plasma glucose concentration of 168 after a glucose tolerance test. Their 2-hour serum insulin level is 321, and they have a body mass index of 38.2. The diabetes pedigree function value is 0.787.###\nHence this label was consent."
"This individual is 34 years old and has been pregnant 3 times. They have a diastolic blood pressure of 68, triceps skin fold thickness of 15, and a plasma glucose concentration of 191 after a glucose tolerance test. Their 2-hour serum insulin level is 130, body mass index is 30.9, and diabetes pedigree function is 0.299. Overall, these measurements suggest a risk for developing diabetes.###\nHence this label was avoid."
"This 23-year-old individual has been pregnant 3 times and shows normal diastolic blood pressure, with zero triceps skin fold thickness and serum insulin levels. Their glucose levels after a GTT are within normal range at 116. With a healthy body mass index of 23.5 and a low diabetes pedigree function of 0.187, this individual shows a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was avoid."
"This is a 27-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 88 mmHg, a triceps skin fold thickness of 41 mm, and a body mass index of 39.3. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 126 mg/dL. Their 2-hour serum insulin level is 235 mu U/ml, and their diabetes pedigree function is 0.704.###\nHence this label was avoid."
"The patient is a 21-year-old female who is pregnant for the first time. She has a normal diastolic blood pressure of 64 and a healthy triceps skin fold thickness of 27. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 96, and she has a moderate level of serum insulin at 87. Her body mass index is 33.2, indicating she is overweight. The diabetes pedigree function score is low at 0.289, suggesting a lower genetic risk of diabetes.###\nHence this label was avoid."
"This person is 28 years old and has been pregnant 4 times. \nThey have a low diastolic blood pressure of 60 and a Triceps skin fold thickness of 32. \nTheir plasma glucose concentration after a glucose tolerance test is 95.\nThey have no serum insulin after 2 hours.\nTheir body mass index is 35.4 and their diabetes pedigree function is 0.284.###\nHence this label was avoid."
"A 34-year-old woman who has been pregnant 7 times shows low diastolic blood pressure of 64, no triceps skin fold thickness, and fasting plasma glucose concentration within normal range at 114. Her insulin levels are low at 0, but her body mass index is 27.4, indicating a healthy weight. The diabetes pedigree function score is 0.732, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was consent."
"The patient is a 27-year-old female who has been pregnant twice. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 27. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122, with a 2-hour serum insulin level of 0. She has a body mass index of 36.8 and a diabetes pedigree function of 0.34.###\nHence this label was avoid."
"This is a 27-year-old individual who has been pregnant 3 times. They have a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 106, and they have no detectable 2-hour serum insulin. Despite a slightly elevated body mass index of 25.8, their diabetes pedigree function is low at 0.207, indicating a relatively lower risk of developing diabetes.###\nHence this label was avoid."
"This patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 90, a triceps skin fold thickness of 0, and a high plasma glucose concentration of 196 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a high body mass index of 39.8. The diabetes pedigree function score is 0.451, indicating a potential genetic predisposition to diabetes.###\nHence this label was consent."
"This 26-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 64. They have a triceps skin fold thickness of 44, a plasma glucose concentration of 109, and a 2-hour serum insulin level of 99. With a body mass index of 34.8 and a diabetes pedigree function of 0.905, this person's health metrics suggest a risk for developing diabetes.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant twice. She has a lower than normal diastolic blood pressure of 56 and a moderately high triceps skin fold thickness of 27. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range at 106. The patient has a high level of 2-hour serum insulin at 165. Despite this, her body mass index is only 29.0, indicating that she is overweight but not obese. The patient has a low diabetes pedigree function score of 0.426, suggesting a lower genetic risk for diabetes.###\nHence this label was avoid."
"A 58-year-old individual who has been pregnant 5 times shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is high, along with a high level of serum insulin. They have a moderately high body mass index and a relatively low diabetes pedigree function score.###\nHence this label was consent."
"The patient is a 22-year-old female who has been pregnant 3 times. She has a low diastolic blood pressure of 64 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 130, with no insulin detected in her serum. She has a healthy body mass index of 23.1 and a low diabetes pedigree function score of 0.314.###\nHence this label was avoid."
"A 23-year-old individual who has been pregnant twice has a normal diastolic blood pressure and triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 99, while their insulin levels are normal. With a body mass index of 22.2 and a low diabetes pedigree function of 0.108, this person shows no obvious signs of high risk for developing diabetes.###\nHence this label was avoid."
"A 37-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 82, triceps skin fold thickness of 32, plasma glucose concentration of 144 after a GTT, no serum insulin after 2 hours, a body mass index of 38.5, and a diabetes pedigree function of 0.554.###\nHence this label was consent."
"A 52-year-old individual, who has been pregnant 13 times, with a diastolic blood pressure of 70, no triceps skin fold thickness, a plasma glucose concentration of 106 after a GTT, zero 2-hour serum insulin, a body mass index of 34.2, and a diabetes pedigree function of 0.251.###\nHence this label was avoid."
"The patient is a 25-year-old woman who has been pregnant 5 times. She has low diastolic blood pressure (48 mmHg) and a normal triceps skin fold thickness of 0 mm. Her glucose levels after a 2-hour oral glucose tolerance test are on the lower side (78 mg/dL), and she has normal insulin levels. Despite having a slightly high body mass index (33.7), her risk of developing diabetes is relatively low with a diabetes pedigree function of 0.654.###\nHence this label was avoid."
"The 40-year-old individual has been pregnant 9 times and shows normal diastolic blood pressure. They have a slightly above average triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is slightly elevated. The 2-hour serum insulin level is also high. The individual has a high body mass index and a moderate diabetes pedigree function score.###\nHence this label was consent."
"This individual is a 42-year-old female who has been pregnant 13 times. She has a diastolic blood pressure of 90, a triceps skin fold thickness of 0, and a plasma glucose concentration of 126 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 43.4. She has a diabetes pedigree function value of 0.583.###\nHence this label was consent."
"The patient is a 45-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 40. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 102 and she has a 2-hour serum insulin level of 105. With a body mass index of 37.2, she has a low diabetes pedigree function of 0.204.###\nHence this label was avoid."
"This individual is a young adult, aged 22, who has never been pregnant. They have a healthy diastolic blood pressure of 66 and a moderately high triceps skin fold thickness of 40. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 131, with a very low 2-hour serum insulin level of 0. Despite their slightly elevated body mass index of 34.3, their diabetes pedigree function is low at 0.196.###\nHence this label was consent."
"This is a dataset for a 21-year-old individual who has never been pregnant. She has a normal diastolic blood pressure of 78 and a healthy body mass index of 32.4. Her triceps skin fold thickness and 2-hour serum insulin levels are low, both at 0. However, her plasma glucose concentration after a glucose tolerance test is 132, indicating a slightly elevated but not diabetic level. The diabetes pedigree function value is 0.393, suggesting a moderate genetic predisposition to diabetes. Overall, this individual shows some risk factors for diabetes, but is not currently classified as having the condition.###\nHence this label was avoid."
"The patient is a 25-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 74 and a slightly above average triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range at 112. She has low insulin levels at 0, and her body mass index is in the overweight range at 31.6. Her diabetes pedigree function is relatively low at 0.197, indicating a lower genetic risk for diabetes.###\nHence this label was consent."
"This 37-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 80. Their triceps skin fold thickness is 32, with a plasma glucose concentration of 0 after a GTT. The 2-hour serum insulin level is also 0. Despite having a high body mass index of 41.0, the individual has a relatively low diabetes pedigree function of 0.346.###\nHence this label was consent."
"This 26-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 64. Their triceps skin fold thickness is 35, plasma glucose concentration is 139 after a glucose tolerance test, and 2-hour serum insulin level is 140. With a body mass index of 28.6 and a diabetes pedigree function of 0.411, this person's risk of developing diabetes may need to be monitored.###\nHence this label was avoid."
"The patient is a 25-year-old female who has been pregnant twice. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 15 mm. Her plasma glucose concentration after a glucose tolerance test is 81 mg/dl, and her 2-hour serum insulin level is 76 uU/mL. She has a body mass index of 30.1 and a diabetes pedigree function score of 0.547.###\nHence this label was avoid."
"A 38-year-old individual who has been pregnant 8 times shows no diastolic blood pressure, no triceps skin fold thickness, and no insulin levels, but has a plasma glucose concentration of 120. They have a body mass index of 30.0 and a low diabetes pedigree function score of 0.183.###\nHence this label was consent."
"This individual is a 48-year-old woman who has been pregnant 9 times. She has a healthy diastolic blood pressure of 72 and a moderate triceps skin fold thickness of 22. Her glucose levels after a 2-hour oral glucose tolerance test are within normal range at 120. She has a moderate insulin level of 56. Despite having a low body mass index of 20.8, she has a family history of diabetes with a diabetes pedigree function of 0.733.###\nHence this label was avoid."
"A 23-year-old individual who is pregnant for the first time shows a healthy diastolic blood pressure of 76. Their triceps skin fold thickness is moderate at 34, and their plasma glucose concentration 2 hours after consuming glucose is normal at 89. Their 2-hour serum insulin level is within the normal range at 37. With a body mass index of 31.2, they are considered overweight. The diabetes pedigree function score indicates a low genetic risk of diabetes at 0.192.###\nHence this label was avoid."
"This is a case of a 29-year-old individual who has never been pregnant and has a diastolic blood pressure of 0 mmHg, Triceps skin fold thickness of 0 mm, and 2-hour serum insulin of 0 mu U/ml. However, the individual has a plasma glucose concentration of 115 mg/dl and a high body mass index of 35.3, indicating a risk for diabetes. The diabetes pedigree function is 0.134, suggesting a low genetic predisposition to the disease.###\nHence this label was avoid."
"This individual is a 53-year-old female who has been pregnant twice. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 45. Her plasma glucose concentration after a glucose tolerance test is 197, and her 2-hour serum insulin level is high at 543. She has a body mass index of 30.5 and a relatively low diabetes pedigree function score of 0.158. These measurements suggest that she may be at risk for developing diabetes.###\nHence this label was consent."
"This 42-year-old individual has been pregnant 7 times and shows a diastolic blood pressure of 66. They have no triceps skin fold thickness and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 114. The 2-hour serum insulin level is 0, and their body mass index is 32.8. The diabetes pedigree function value is 0.258.###\nHence this label was consent."
"This individual is a 58-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 90 mmHg and a Triceps skin fold thickness of 34mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 176 mg/dL and her 2-hour serum insulin level is 300 mu U/ml. She has a body mass index of 33.7 and a diabetes pedigree function of 0.467. Overall, this data suggests a potential risk for developing diabetes due to elevated glucose levels, insulin resistance, and high BMI.###\nHence this label was consent."
"This is a dataset of a 25-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 70 and a triceps skin fold thickness of 52. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 100, and their 2-hour serum insulin level is 57. The individual has a body mass index of 40.5 and a diabetes pedigree function of 0.677.###\nHence this label was avoid."
"This is a data entry for a 22-year-old individual who is 1 time pregnant with low diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. They have elevated plasma glucose concentration after a 2-hour oral glucose tolerance test, a healthy body mass index, and a low diabetes pedigree function.###\nHence this label was avoid."
"The patient is a 34-year-old woman who has been pregnant 10 times. She has normal diastolic blood pressure and very low triceps skin fold thickness. Her glucose tolerance test result is 115, and she has no insulin present in her serum after 2 hours. Despite her pregnancies, her body mass index is within a healthy range at 24.0. She also has a slightly elevated diabetes pedigree function score of 1.022.###\nHence this label was avoid."
"This is a dataset of a 26-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 50 and a moderately low triceps skin fold thickness of 15. Her plasma glucose concentration is at a normal level of 101 after a glucose tolerance test, and her 2-hour serum insulin level is slightly elevated at 36. With a healthy body mass index of 24.2 and a moderately low diabetes pedigree function value of 0.526, this individual appears to have a relatively low risk of developing diabetes.###\nHence this label was avoid."
"This individual, aged 34, has been pregnant twice and has normal diastolic blood pressure. They have a moderately high triceps skin fold thickness and a slightly elevated plasma glucose concentration after a GTT. Their 2-hour serum insulin levels are above average. Despite having a high body mass index, they have a relatively low diabetes pedigree function.###\nHence this label was avoid."
