"A 47-year-old individual who has been pregnant 10 times with slightly elevated diastolic blood pressure and a moderately high body mass index. They have lower than normal triceps skin fold thickness and plasma glucose concentration after a glucose tolerance test. The 2-hour serum insulin level is also on the lower side. Overall, the individual has a relatively low diabetes pedigree function score, indicating a lower genetic risk for developing diabetes.###\nHence this label was No."
"This 55-year-old individual has been pregnant 7 times and has a diastolic blood pressure of 70. Their triceps skin fold thickness is 33, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is 195. Their 2-hour serum insulin level is 145, and they have a body mass index of 25.1. Additionally, their diabetes pedigree function is 0.163.###\nHence this label was Yes."
"This individual is a 31-year-old female who has been pregnant twice. She has a healthy diastolic blood pressure of 78 and a relatively high triceps skin fold thickness of 37. Her plasma glucose concentration after a glucose tolerance test is 128, and her 2-hour serum insulin level is elevated at 182. With a body mass index of 43.3, she is considered obese. Additionally, her diabetes pedigree function is 1.224, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 41-year-old woman who has been pregnant 9 times. She has a normal diastolic blood pressure of 80 and a moderately high triceps skin fold thickness of 37. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 57, and her 2-hour serum insulin level is also low at 0. Despite her slightly elevated body mass index of 32.8, her diabetes pedigree function is low at 0.096, indicating a low genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 27-year-old female who has been pregnant three times. She has a diastolic blood pressure of 72, a triceps skin fold thickness of 30, and a plasma glucose concentration of 103 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 152, and she has a body mass index of 27.6. The diabetes pedigree function indicates a low genetic risk of diabetes at 0.73.###\nHence this label was No."
"A 28-year-old individual who has been pregnant three times with a diastolic blood pressure of 66, triceps skin fold thickness of 39, plasma glucose concentration of 115, 2-hour serum insulin of 140, and a body mass index of 38.1. Their diabetes pedigree function is 0.15, indicating a low genetic risk of developing diabetes.###\nHence this label was No."
"A 54-year-old individual, who has been pregnant 7 times, with normal diastolic blood pressure and slightly elevated triceps skin fold thickness. They have a moderate plasma glucose concentration after a glucose tolerance test, elevated serum insulin levels, and a high body mass index. Their diabetes pedigree function indicates a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 51-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure reading of 86, no triceps skin fold thickness, and a plasma glucose concentration of 125 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 37.6. The diabetes pedigree function for this patient is 0.304.###\nHence this label was No."
"This 22-year-old individual, who is pregnant for the first time, has a healthy diastolic blood pressure of 80. Their triceps skin fold thickness is 25, indicating a normal amount of subcutaneous fat. With a plasma glucose concentration of 79 and 2-hour serum insulin of 37, their blood sugar levels seem stable. Their body mass index is 25.4, which falls within the normal range. The diabetes pedigree function value of 0.583 suggests a moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is a 34-year-old female who has been pregnant twice. She has a diastolic blood pressure of 64, triceps skin fold thickness of 35, and a plasma glucose concentration of 106 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 119, and she has a body mass index of 30.5. Her diabetes pedigree function is 1.4.###\nHence this label was No."
"The patient is a 66-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 92 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 190 mg/dL, with a 2-hour serum insulin level of 0 uU/mL. She has a body mass index of 35.5 and a diabetes pedigree function of 0.278.###\nHence this label was Yes."
"The individual in the dataset is a 26-year-old woman who is pregnant for the first time. She has a very low diastolic blood pressure of 38 and a moderately low triceps skin fold thickness of 18. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 109, and her 2-hour serum insulin level is elevated at 120. She has a healthy body mass index of 23.1 and a relatively low diabetes pedigree function score of 0.407.###\nHence this label was No."
"This patient is 25 years old and has been pregnant 4 times. They have normal diastolic blood pressure and low triceps skin fold thickness. Their plasma glucose concentration after a GTT is low, with no serum insulin detected. They have a high body mass index and a low diabetes pedigree function.###\nHence this label was No."
"This patient is a 21-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 60 and a relatively low triceps skin fold thickness of 17. Her plasma glucose concentration after a GTT is normal at 99 and her 2-hour serum insulin level is elevated at 160. She has a high body mass index of 36.6 and a relatively low diabetes pedigree function of 0.453. Overall, she may be at risk for developing diabetes due to her high insulin levels and elevated BMI.###\nHence this label was No."
"A 42-year-old woman who has been pregnant 8 times is showing some abnormal health metrics. Her diastolic blood pressure is lower than usual at 55, and her triceps skin fold thickness is 20. Despite that, her plasma glucose concentration after a glucose tolerance test is normal at 85. Surprisingly, she has no insulin in her blood after a 2-hour test. Her body mass index is within the healthy range at 24.4, and her diabetes pedigree function indicates a low genetic risk at 0.136.###\nHence this label was No."
"A 43-year-old individual who has been pregnant 13 times shows slightly elevated diastolic blood pressure of 90. They have a moderate triceps skin fold thickness of 33, and a relatively high plasma glucose concentration of 152 after a glucose tolerance test. Despite having a low serum insulin level of 29, their body mass index is within the healthy range at 26.8. The diabetes pedigree function value of 0.731 indicates a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"This individual is a 53-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 86, no triceps skin fold thickness, and a healthy body mass index of 24.8. Her plasma glucose concentration after a glucose tolerance test is 156, with no insulin detected in her serum. She has a low diabetes pedigree function score of 0.23, suggesting a relatively low genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 58-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 90 and a triceps skin fold thickness of 34. Their plasma glucose concentration after a GTT is 176, with a 2-hour serum insulin level of 300. The patient's body mass index is 33.7 and their diabetes pedigree function is 0.467.###\nHence this label was Yes."
"This individual is 30 years old and has been pregnant 3 times. Their diastolic blood pressure is 64, triceps skin fold thickness is 37, plasma glucose concentration after a glucose tolerance test is 170, and 2-hour serum insulin is 225. They have a body mass index of 34.5 and a diabetes pedigree function of 0.356.###\nHence this label was Yes."
"The person in this data is 31 years old, has been pregnant 6 times, has low diastolic blood pressure (70), no triceps skin fold thickness, high plasma glucose concentration (195), no insulin after a glucose tolerance test, is overweight (body mass index of 30.9), and has a low diabetes pedigree function score of 0.328.###\nHence this label was Yes."
"The patient is a 52-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 24. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 124, and her 2-hour serum insulin level is 600. She has a body mass index of 28.7 and a diabetes pedigree function of 0.687.###\nHence this label was Yes."
"The patient is a 32-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 30 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125 mg/dL, and her 2-hour serum insulin level is 120 uU/mL. She has a body mass index of 30.0 kg/m^2 and a diabetes pedigree function of 0.464.###\nHence this label was No."
"This individual is a 23-year-old who has been pregnant once. They have a low diastolic blood pressure of 54 and a healthy triceps skin fold thickness of 25. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 91, and they have a relatively high 2-hour serum insulin level of 100. With a body mass index of 25.2 and a low diabetes pedigree function of 0.234, this individual seems to have relatively good overall health with some indicators of high insulin levels.###\nHence this label was No."
"The patient is a 22-year-old woman who is pregnant for the first time. She has a normal diastolic blood pressure of 80 and a below-average body mass index of 19.4. Her triceps skin fold thickness is 11, indicating a relatively low amount of subcutaneous fat. The patient's plasma glucose concentration is 103 after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 82. Her diabetes pedigree function is 0.491, suggesting a moderate genetic predisposition to diabetes. Overall, based on these measurements, the patient appears to have a low risk of developing diabetes.###\nHence this label was No."
"This is a young individual who has never been pregnant. She has elevated diastolic blood pressure and high glucose levels after a glucose tolerance test. Her insulin levels are also elevated, indicating possible insulin resistance. Additionally, she has a high body mass index and a moderate diabetes pedigree function, suggesting a family history of diabetes.###\nHence this label was No."
"This 25-year-old individual who has never been pregnant has a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 36 mm. Their glucose levels after a 2-hour oral glucose tolerance test is 97 mg/dL, with a serum insulin level of 100 μU/mL. They have a body mass index of 36.8 and a diabetes pedigree function of 0.6.###\nHence this label was No."
"The patient is a 38-year-old woman who has been pregnant three times. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 16, and a body mass index of 30.4, indicating she may be overweight. Her plasma glucose concentration at 2 hours is 89, and her 2-hour serum insulin level is 85. The diabetes pedigree function score is 0.551, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This 31-year-old individual has been pregnant 8 times and has a diastolic blood pressure of 76. They have a triceps skin fold thickness of 39, a plasma glucose concentration of 109, and a 2-hour serum insulin level of 114. With a body mass index of 27.9 and a diabetes pedigree function of 0.64, this person's risk of developing diabetes may be worth monitoring.###\nHence this label was Yes."
"This patient is a 22-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 86 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120, and her 2-hour serum insulin level is 0. She has a body mass index of 28.4 and a diabetes pedigree function of 0.259. Overall, the data indicates a mix of normal and concerning values related to blood pressure, glucose levels, and insulin levels, which may require further evaluation for potential diabetes risk.###\nHence this label was Yes."
"This patient is a 23-year-old female who has been pregnant 3 times. She has a healthy diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 28 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 74 mg/dL, and her 2-hour serum insulin level is 45 mIU/L. With a body mass index of 29.7 and a low diabetes pedigree function value of 0.293, she appears to have a relatively low risk of developing diabetes.###\nHence this label was No."
"A 37-year-old individual who has been pregnant 6 times with a healthy diastolic blood pressure of 70. They have a triceps skin fold thickness of 32, a plasma glucose concentration of 105, and a 2-hour serum insulin level of 68. With a body mass index of 30.8, indicating overweight, and a low diabetes pedigree function score of 0.122, the individual shows relatively average risk factors for diabetes.###\nHence this label was No."
"The patient is a 24-year-old female who is pregnant for the first time. She has low diastolic blood pressure, moderately high triceps skin fold thickness, normal glucose levels after a 2-hour oral glucose tolerance test, high serum insulin levels, and a high body mass index. Her diabetes pedigree function score is relatively low.###\nHence this label was No."
