"The patient is a 33-year-old woman who has been pregnant 5 times. She has a normal diastolic blood pressure of 72 and a slightly above average triceps skin fold thickness of 43. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range at 108. The 2-hour serum insulin level is also normal at 75. Despite having a high body mass index of 36.1, her diabetes pedigree function is low at 0.263.###\nHence this label was No."
"A 81-year-old individual, who has been pregnant 9 times, with a diastolic blood pressure of 74, triceps skin fold thickness of 33, plasma glucose concentration at 2 hours of 134, 2-hour serum insulin of 60, and a body mass index of 25.9. They have a diabetes pedigree function of 0.46.###\nHence this label was No."
"This individual is a 21-year-old who has never been pregnant. They have a diastolic blood pressure of 64, a triceps skin fold thickness of 23, and a plasma glucose concentration of 118 after a glucose tolerance test. Their 2-hour serum insulin level is 89, with a body mass index of 0.0. Additionally, their diabetes pedigree function score is 1.731.###\nHence this label was No."
"The patient is a 40-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. Her plasma glucose concentration after a GTT is 135 mg/dL. She has a high body mass index of 52.3 and a moderately elevated diabetes pedigree function of 0.578.###\nHence this label was Yes."
"A 40-year-old individual, who has been pregnant 7 times, with a diastolic blood pressure of 88, triceps skin fold thickness of 42, plasma glucose concentration of 168 after a 2-hour oral glucose tolerance test, 2-hour serum insulin level of 321, body mass index of 38.2, and a diabetes pedigree function of 0.787.###\nHence this label was Yes."
"The individual is a 24-year-old who has been pregnant 3 times. They have a diastolic blood pressure of 72, a triceps skin fold thickness of 33, and a plasma glucose concentration of 171 mg/dL after a glucose tolerance test. Their 2-hour serum insulin level is 135 μU/mL, and they have a body mass index of 33.3. Additionally, their diabetes pedigree function is 0.199.###\nHence this label was Yes."
"This 22-year-old patient, who is pregnant for the first time, has a healthy diastolic blood pressure of 70. Their triceps skin fold thickness is 28, indicating a moderate amount of subcutaneous fat. The plasma glucose concentration after a glucose tolerance test is 106, which is within the normal range. The 2-hour serum insulin level is elevated at 135, suggesting potential insulin resistance. With a body mass index of 34.2, this patient is classified as obese. The diabetes pedigree function score is low at 0.142, indicating a lower risk of developing diabetes based on family history.###\nHence this label was No."
"This 22-year-old individual has never been pregnant and has a healthy diastolic blood pressure of 82. They have a relatively low triceps skin fold thickness of 15, and a normal glucose concentration of 98 after a glucose tolerance test. Their insulin level is 84, which is within a healthy range. With a body mass index of 25.2, they are classified as overweight, but not obese. Their diabetes pedigree function value is low at 0.299, indicating a lower genetic risk for diabetes. Overall, this individual displays mostly healthy indicators, with a few areas that may benefit from attention for preventative care.###\nHence this label was No."
"The patient is a 58-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 72, no triceps skin fold thickness, and a plasma glucose concentration of 112 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 23.6. Her diabetes pedigree function is 0.84.###\nHence this label was No."
"A 42-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 66, a triceps skin fold thickness of 42, and a plasma glucose concentration of 150 after a glucose tolerance test. Their 2-hour serum insulin level is 342, with a body mass index of 34.7 and a diabetes pedigree function of 0.718.###\nHence this label was No."
"A 36-year-old woman, who has been pregnant 8 times, has a diastolic blood pressure of 78 mmHg. Her triceps skin fold thickness is 32 mm and her plasma glucose concentration after a GTT is 151 mg/dL. She has a 2-hour serum insulin level of 210 mu U/mL and a body mass index of 42.9. Her diabetes pedigree function is 0.516, indicating a moderate genetic risk for diabetes.###\nHence this label was Yes."
"This data belongs to a 46-year-old individual who has been pregnant 12 times. They have a diastolic blood pressure of 84, triceps skin fold thickness of 33, and a plasma glucose concentration of 100 after a glucose tolerance test. Their 2-hour serum insulin level is 105, and they have a body mass index of 30.0. The diabetes pedigree function for this individual is 0.488.###\nHence this label was No."
"The patient is a 29-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 56 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 146 mg/dL. She has no insulin present in her serum after the test. Her body mass index is 29.7, indicating she is overweight. The diabetes pedigree function value is 0.564, suggesting a moderate genetic risk for diabetes.###\nHence this label was No."
"This individual is a 65-year-old who has never been pregnant. \nThey have a low diastolic blood pressure of 50 and a very low triceps skin fold thickness of 0. \nTheir glucose levels are elevated at 161 mg/dL after a 2-hour oral glucose tolerance test. \nDespite having no insulin levels after 2 hours, their body mass index is in the healthy range at 21.9. \nThe diabetes pedigree function score is low at 0.254.###\nHence this label was No."
"A 30-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure and slightly above average triceps skin fold thickness. Their glucose levels after a GTT are within normal range, but their insulin levels are elevated. They have a high body mass index and a low risk of developing diabetes based on their family history.###\nHence this label was No."
"This data belongs to a 29-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 76, triceps skin fold thickness of 35, plasma glucose concentration of 146, 2-hour serum insulin of 194, body mass index of 38.2, and a diabetes pedigree function of 0.329.###\nHence this label was No."
"This data describes a 27-year-old individual who has been pregnant 3 times. They have a healthy diastolic blood pressure of 72 and a slightly elevated triceps skin fold thickness of 30. Their glucose levels are normal at 103, but they have a high insulin level of 152. Despite this, their body mass index is within a healthy range at 27.6. The individual has a low risk of developing diabetes based on their diabetes pedigree function score of 0.73.###\nHence this label was No."
"This 23-year-old individual has been pregnant twice and shows normal diastolic blood pressure. They have no triceps skin fold thickness or serum insulin level, but their plasma glucose concentration is at a healthy level of 111. With a body mass index of 26.2 and a low diabetes pedigree function of 0.343, the individual appears to be at low risk for developing diabetes.###\nHence this label was No."
"A 30-year-old woman, who has been pregnant once, with normal diastolic blood pressure and low triceps skin fold thickness. She has a normal glucose concentration after a glucose tolerance test, low insulin levels, but a high body mass index. Her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a young adult female who has been pregnant once. She has a low diastolic blood pressure, normal triceps skin fold thickness, and slightly elevated plasma glucose concentration after a glucose tolerance test. Her insulin levels are within normal range. She has a healthy body mass index and a moderate diabetes pedigree function score.###\nHence this label was No."
"The patient is a 41-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 74, triceps skin fold thickness of 18, and a plasma glucose concentration of 104 after a GTT. Her 2-hour serum insulin level is 156 and her body mass index is 29.9. The diabetes pedigree function indicates a moderate genetic risk of diabetes at 0.722.###\nHence this label was Yes."
"This individual is 24 years old and has been pregnant 4 times. They have a diastolic blood pressure of 64, no triceps skin fold thickness, and a plasma glucose concentration of 114 after a glucose tolerance test. Their 2-hour serum insulin level is 0, and their body mass index is 28.9. The diabetes pedigree function is 0.126.###\nHence this label was No."
"The patient is a 21-year-old female who is 1 time pregnant with a low diastolic blood pressure of 60. She has a slightly elevated triceps skin fold thickness of 32, normal plasma glucose concentration of 124, and no insulin present in her serum. Her body mass index is high at 35.8, indicating obesity. The diabetes pedigree function score is 0.514, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 25-year-old woman who has never been pregnant has normal diastolic blood pressure and high triceps skin fold thickness. Her glucose levels are elevated after a glucose tolerance test, and she has moderate insulin levels. Despite having a high body mass index, her risk of developing diabetes is relatively low based on her diabetes pedigree function.###\nHence this label was Yes."
"A 27-year-old female who has been pregnant twice, with a diastolic blood pressure of 54 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a glucose tolerance test is 120 mg/dL, and she has no detectable serum insulin after 2 hours. She has a body mass index of 26.8 and a diabetes pedigree function of 0.455.###\nHence this label was No."
"The patient is a 29-year-old female who has been pregnant 4 times. She has low diastolic blood pressure (60) and a moderately high triceps skin fold thickness (27). Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 148 mg/dL. She has high levels of 2-hour serum insulin (318 uU/mL) and a slightly elevated body mass index of 30.9. The diabetes pedigree function, which indicates genetic predisposition for diabetes, is low at 0.15. Overall, this data suggests a possible risk for developing diabetes due to high insulin levels and elevated BMI.###\nHence this label was Yes."
"This data belongs to a 24-year-old individual who has been pregnant 5 times. Their diastolic blood pressure is 68, triceps skin fold thickness is 28, and plasma glucose concentration after a glucose tolerance test is 86. They have a 2-hour serum insulin level of 71, a body mass index of 30.2, and a diabetes pedigree function of 0.364.###\nHence this label was No."
"A 32-year-old individual who has been pregnant three times with a diastolic blood pressure of 74, no triceps skinfold thickness, a plasma glucose concentration of 102 after a glucose tolerance test, zero 2-hour serum insulin, and a body mass index of 29.5. The diabetes pedigree function is 0.121.###\nHence this label was No."
"The patient is 48 years old and has been pregnant 11 times. They have a diastolic blood pressure of 80, triceps skin fold thickness of 37, and a plasma glucose concentration of 120 after a glucose tolerance test. Their 2-hour serum insulin level is 150, body mass index is 42.3, and the diabetes pedigree function is 0.785.###\nHence this label was Yes."
"A 25-year-old woman who is pregnant for the first time has a healthy diastolic blood pressure of 70. She has a moderate triceps skin fold thickness of 24, and her glucose levels appear normal at 125 after a 2-hour oral glucose tolerance test. Her insulin levels are slightly elevated at 110, and she maintains a healthy body mass index of 24.3. With a low diabetes pedigree function score of 0.221, she is at a relatively low risk of developing diabetes based on these measurements.###\nHence this label was No."
"A 34-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 64. Despite having a triceps skin fold thickness of 0 and 2-hour serum insulin level of 0, their plasma glucose concentration after a glucose tolerance test is 114. With a body mass index of 27.4 and a diabetes pedigree function of 0.732, this individual's risk for developing diabetes may be evaluated.###\nHence this label was Yes."
"The patient is 59 years old, has never been pregnant, and has a diastolic blood pressure of 84. Their triceps skin fold thickness is 27. During an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 137. They have a 2-hour serum insulin level of 0. Their body mass index is 27.3, and their diabetes pedigree function is 0.231.###\nHence this label was No."
"The data represents a 30-year-old individual who has been pregnant 5 times. They have a normal diastolic blood pressure of 74, minimal triceps skin fold thickness, and a healthy plasma glucose concentration of 116 after a glucose tolerance test. Their insulin levels are low, with a body mass index indicating they are within a healthy weight range. The individual has a low diabetes pedigree function score, suggesting a lower genetic risk of developing diabetes.###\nHence this label was No."
"This data belongs to a 33-year-old individual who is pregnant for the first time. They have a diastolic blood pressure of 98 and a triceps skin fold thickness of 41. The plasma glucose concentration 2 hours after an oral glucose tolerance test is 128, and their 2-hour serum insulin level is 58. Their body mass index is 32.0, and they have a diabetes pedigree function score of 1.321.###\nHence this label was Yes."
"This patient is a 28-year-old female who is pregnant for the first time. She has a normal diastolic blood pressure of 78. Her triceps skin fold thickness is within a healthy range. The plasma glucose concentration at 2 hours in a glucose tolerance test is 121 mg/dL. Her 2-hour serum insulin level is 74 μU/mL. She has a high body mass index of 39.0, indicating obesity. The diabetes pedigree function score is low at 0.261, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"This patient is a 22-year-old female who is pregnant for the first time. She has low diastolic blood pressure, moderate triceps skin fold thickness, low plasma glucose concentration, moderately high 2-hour serum insulin levels, and a low body mass index. Her diabetes pedigree function indicates a relatively low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 36-year-old woman who is currently not pregnant. She has a diastolic blood pressure of 82 mmHg and a body mass index of 30.8, indicating that she is overweight. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0, which may suggest lower muscle mass and insulin resistance. Despite having a relatively normal plasma glucose concentration of 102 mg/dL, her low diabetes pedigree function of 0.18 indicates a lower genetic predisposition to diabetes.###\nHence this label was Yes."
"This individual is a young, non-pregnant adult with normal diastolic blood pressure and a healthy body mass index. Their glucose levels are within a normal range, and they have a low triceps skin fold thickness. Additionally, they have a low insulin level and a relatively low diabetes pedigree function score, indicating a lower risk for developing diabetes.###\nHence this label was No."
"A 22-year-old female who has never been pregnant, with a healthy diastolic blood pressure of 64 mmHg, a moderately high triceps skin fold thickness of 41 mm, and a normal plasma glucose concentration of 105 mg/dL after a glucose tolerance test. She has an elevated 2-hour serum insulin level of 142 mu U/ml, a relatively high body mass index of 41.5, and a low diabetes pedigree function of 0.173.###\nHence this label was No."
"A 28-year-old woman, who has been pregnant 4 times, with a diastolic blood pressure of 68 mmHg, triceps skin fold thickness of 21 mm, plasma glucose concentration of 131 mg/dL 2 hours after a glucose tolerance test, 2-hour serum insulin level of 166 μU/mL, and a body mass index of 33.1 kg/m², has a diabetes pedigree function of 0.16, indicating a low risk of developing diabetes.###\nHence this label was No."
"The patient is a 25-year-old female who has never been pregnant. She has a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 19mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 128 mg/dL. She has a 2-hour serum insulin level of 180 μU/mL. Her body mass index is 30.5, indicating that she is overweight. The diabetes pedigree function value is 1.391, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"A 42-year-old woman, who has been pregnant once, has a normal diastolic blood pressure of 74. She has a very low triceps skin fold thickness of 0, indicating low body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 102, within the normal range. She has no 2-hour serum insulin detected. However, she has a high body mass index of 39.5, which may indicate obesity. Her diabetes pedigree function is relatively low at 0.293, suggesting a lower genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 26-year-old individual who has never been pregnant. They have normal diastolic blood pressure, triceps skin fold thickness, and insulin levels. Their plasma glucose concentration after a glucose tolerance test is 131, which is within the normal range. However, they have a high body mass index of 43.2, indicating obesity. Their diabetes pedigree function score is low at 0.27, suggesting a modest genetic predisposition to diabetes. Overall, the patient appears to be at risk for developing diabetes due to their high BMI despite other normal test results.###\nHence this label was Yes."
"This individual is a 46-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 72 and triceps skin fold thickness of 0, indicating low levels of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115, suggesting normal blood sugar levels. She has no serum insulin after 2 hours. Her body mass index is 28.9, indicating she is overweight. The diabetes pedigree function score is 0.376, which suggests a low genetic risk for diabetes.###\nHence this label was Yes."
"A 26-year-old woman, who is pregnant for the first time, has slightly elevated diastolic blood pressure and a moderately high triceps skin fold thickness. Her glucose levels after a glucose tolerance test are within normal range, but her insulin levels are high. She has a high body mass index and a moderately low diabetes pedigree function score.###\nHence this label was No."
"A 39-year-old woman who has been pregnant 3 times has a below-average diastolic blood pressure of 56. She has a moderate triceps skin fold thickness of 34 and her plasma glucose concentration after a glucose tolerance test is normal at 96. Her 2-hour serum insulin level is slightly elevated at 115, and she has a healthy body mass index of 24.7. Her diabetes pedigree function is 0.944, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"This data represents a 25-year-old individual who has been pregnant 5 times and has a diastolic blood pressure of 80. They have a triceps skin fold thickness of 35, a plasma glucose concentration of 139 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 160. Their body mass index is 31.6 and they have a diabetes pedigree function value of 0.361.###\nHence this label was Yes."
"The patient is a 40-year-old female who has been pregnant 10 times. She has a healthy diastolic blood pressure of 70 and a normal triceps skin fold thickness of 27. Her plasma glucose concentration after a GTT is 111, and her 2-hour serum insulin level is low at 0. The patient has a body mass index of 27.5 and a low diabetes pedigree function of 0.141. Overall, the patient appears to have relatively good health markers, but may need further monitoring due to the low insulin levels.###\nHence this label was Yes."
"A 30-year-old individual with 3 pregnancies shows low diastolic blood pressure of 56. They have a relatively high amount of triceps skin fold thickness at 39, normal glucose levels at 111, and low insulin levels at 0. Their body mass index is within the healthy range at 30.1, and they have a moderate diabetes pedigree function score of 0.557.###\nHence this label was No."
"The patient is a 50-year-old female who has been pregnant 6 times. She has normal diastolic blood pressure and zero triceps skin fold thickness. Her plasma glucose concentration after a GTT is 147, with no insulin detected after 2 hours. She has a body mass index of 29.5 and a low diabetes pedigree function of 0.178.###\nHence this label was Yes."
"The patient is a 31-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin level of 0. Her plasma glucose concentration after a glucose tolerance test is 91, and her body mass index is 29.8. The diabetes pedigree function indicates a moderately elevated risk for developing diabetes.###\nHence this label was No."
"This is a medical dataset of a 23-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 60 and a slightly high triceps skin fold thickness of 42. Her plasma glucose concentration after a glucose tolerance test is 79, with a 2-hour serum insulin level of 48. Despite having a high body mass index of 43.5, her diabetes pedigree function is relatively low at 0.678.###\nHence this label was No."
"The patient is a 55-year-old female who has been pregnant 3 times. She has a healthy diastolic blood pressure of 78. Although her triceps skin fold thickness is minimal, her plasma glucose concentration after a glucose tolerance test is normal at 128. Her 2-hour serum insulin level is low at 0, and she maintains a low body mass index of 21.1. Additionally, her diabetes pedigree function is low at 0.268, indicating a lower risk of developing diabetes.###\nHence this label was No."
"The patient is a 57-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 76, triceps skin fold thickness of 29, and a high plasma glucose concentration of 196 after a glucose tolerance test. Her 2-hour serum insulin level is elevated at 280, and she has a body mass index of 37.5. The diabetes pedigree function value is 0.605, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 32-year-old female who has been pregnant 5 times. She has a healthy diastolic blood pressure of 74 and a moderate triceps skin fold thickness of 27. Her plasma glucose level after a glucose tolerance test is within the normal range at 99. She has an insulin level of 0 after a 2-hour serum test. Her body mass index is 29.0, indicating she is overweight. The diabetes pedigree function score is low at 0.203, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"The data represents a 55-year-old individual who has been pregnant 7 times. They have normal diastolic blood pressure (70), average triceps skin fold thickness (33), high plasma glucose concentration after a GTT (195), slightly elevated 2-hour serum insulin levels (145), a healthy body mass index (25.1), and a low diabetes pedigree function score (0.163). These measurements indicate a potential risk for developing diabetes, warranting further monitoring and preventive measures.###\nHence this label was Yes."
"The patient is a 38-year-old female who has been pregnant 4 times. She has a healthy diastolic blood pressure of 78 and a slightly above average triceps skin fold thickness of 40. Her plasma glucose concentration after a GTT is 112, and she has no serum insulin after 2 hours. She has a high body mass index of 39.4 and a low diabetes pedigree function of 0.236.###\nHence this label was No."
"The patient is a 43-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 68, a triceps skin fold thickness of 49, and a plasma glucose concentration of 129 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 125, and she has a body mass index of 38.5. The Diabetes pedigree function value is 0.439.###\nHence this label was Yes."
"This patient is a 23-year-old woman who has never been pregnant. She has a diastolic blood pressure of 90, a triceps skin fold thickness of 27, and a high plasma glucose concentration of 179 after a 2-hour glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 44.1, indicating obesity. The diabetes pedigree function score is 0.686, suggesting a moderate genetic risk for diabetes.###\nHence this label was Yes."
"A 27-year-old individual, who has been pregnant 3 times, with a diastolic blood pressure of 72 and a triceps skin fold thickness of 25. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 128, with a 2-hour serum insulin level of 190. They have a body mass index of 32.4 and a diabetes pedigree function of 0.549.###\nHence this label was Yes."
"This patient is a 21-year-old female who is pregnant for the first time. She has a healthy diastolic blood pressure of 66 and a low triceps skin fold thickness of 23. Her plasma glucose concentration after a GTT is normal at 89, and her 2-hour serum insulin level is also within the healthy range at 94. With a body mass index of 28.1, she is slightly overweight but not obese. Her diabetes pedigree function value is low at 0.167, indicating a lower risk of developing diabetes.###\nHence this label was No."
"A 21-year-old individual with a low risk of diabetes has been pregnant twice. They have a normal diastolic blood pressure of 60 and a moderately low triceps skin fold thickness of 17. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range at 99. They have a high 2-hour serum insulin level of 160 and an elevated body mass index of 36.6, indicating potential weight-related health concerns. Their diabetes pedigree function score is low at 0.453, suggesting a slightly increased genetic risk for diabetes.###\nHence this label was No."
"A 31-year-old individual who has been pregnant 4 times shows normal diastolic blood pressure and no triceps skin fold thickness. They have high plasma glucose concentration after a glucose tolerance test, with no insulin levels. Despite a high body mass index, their diabetes pedigree function is relatively low.###\nHence this label was Yes."
"The patient is a 67-year-old individual who has been pregnant 8 times. They have a diastolic blood pressure of 80 and a triceps skin fold thickness of 0. In a glucose tolerance test, their plasma glucose concentration at 2 hours is 194. The 2-hour serum insulin level is 0, and their body mass index is 26.1. The diabetes pedigree function score is 0.551.###\nHence this label was No."
"A 26-year-old individual who has been pregnant 4 times and shows indicators of diabetes risk with high blood pressure and a high plasma glucose concentration. Additionally, they have a high body mass index and a somewhat elevated diabetes pedigree function score. The individual has a triceps skin fold thickness of 0 and zero serum insulin after a 2-hour oral glucose tolerance test.###\nHence this label was Yes."
"The patient is a 60-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 95 and a triceps skin fold thickness of 31. Her plasma glucose concentration after a glucose tolerance test is 179. She has no insulin present in her blood. Her body mass index is 34.2 and her diabetes pedigree function is 0.164.###\nHence this label was No."
"This data represents a 43-year-old individual who has been pregnant 6 times. They have a low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 33. Their plasma glucose concentration after a glucose tolerance test is normal at 98, while their 2-hour serum insulin level is high at 190. They have a body mass index of 34.0, indicating obesity, and a low diabetes pedigree function score of 0.43.###\nHence this label was No."
"A 22-year-old woman who has been pregnant twice has a healthy diastolic blood pressure of 70. She has a low triceps skin fold thickness of 17, a normal plasma glucose concentration of 90 after a glucose tolerance test, and no insulin present at the 2-hour mark. With a body mass index of 27.3 and a low diabetes pedigree function of 0.085, she appears to have a low risk of developing diabetes.###\nHence this label was No."
"The patient is a 34-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 80 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 107. The patient has low 2-hour serum insulin levels of 0 and a healthy body mass index of 24.6. Her diabetes pedigree function score is 0.856, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"This individual is a young adult with a low number of pregnancies. They have a low diastolic blood pressure, normal triceps skin fold thickness, and average plasma glucose concentration after a glucose tolerance test. Their insulin levels are high, indicating possible insulin resistance. They have a healthy body mass index and a moderately high diabetes pedigree function score, suggesting a moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is a 25-year-old female who has never been pregnant and shows normal blood pressure, no triceps skin fold thickness, and normal insulin levels. However, her plasma glucose concentration is slightly elevated. She has a high body mass index and a family history of diabetes as indicated by the diabetes pedigree function score.###\nHence this label was Yes."
"The patient is a 57-year-old individual who has been pregnant 13 times. They have a diastolic blood pressure of 82 mmHg and a triceps skin fold thickness of 19mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 145 mg/dL, with a 2-hour serum insulin level of 110 μU/mL. Their body mass index is 22.2 kg/m^2 and their diabetes pedigree function is 0.245.###\nHence this label was No."
"This individual is a 22-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 42. Her plasma glucose concentration after a GTT is 181, and her 2-hour serum insulin level is 293. She has a body mass index of 40.0 and a diabetes pedigree function of 1.258. The data suggests a high risk for developing diabetes.###\nHence this label was Yes."
"A 28-year-old individual who has been pregnant twice with a diastolic blood pressure of 76. They have a triceps skin fold thickness of 20 mm and a plasma glucose concentration of 92 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0 μU/ml, with a body mass index of 24.2. Their diabetes pedigree function is 1.698.###\nHence this label was No."
"A 23-year-old female who is pregnant for the first time has a relatively low diastolic blood pressure of 58. She has a moderate triceps skin fold thickness of 36 and a normal plasma glucose concentration of 118 after a glucose tolerance test. Her 2-hour serum insulin level is higher than average at 94, and she has a slightly elevated body mass index of 33.3. The diabetes pedigree function indicates a low genetic risk for diabetes at 0.261.###\nHence this label was No."
"This individual is a 51-year-old woman who has been pregnant seven times. She has a diastolic blood pressure of 86 mmHg, no triceps skin fold thickness, and a plasma glucose concentration of 125 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 0 uU/mL. With a body mass index of 37.6, she has a low diabetes pedigree function score of 0.304.###\nHence this label was No."
"This is the data of a 26-year-old individual who has never been pregnant. She has a diastolic blood pressure of 88, triceps skin fold thickness of 44, and a high plasma glucose concentration of 181 after a glucose tolerance test. Her 2-hour serum insulin level is very high at 510. She also has a high body mass index of 43.3 and a low diabetes pedigree function of 0.222.###\nHence this label was Yes."
"This individual is a 45-year-old female who has been pregnant 9 times. She has a low diastolic blood pressure of 70 and no triceps skin fold thickness, indicating a lean body composition. Her plasma glucose concentration after a GTT is 130, suggesting normal blood sugar levels. She has no 2-hour serum insulin, which may indicate good insulin sensitivity. With a body mass index of 34.2, she is classified as obese. Her diabetes pedigree function score is 0.652, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"A 42-year-old woman who has been pregnant 7 times shows normal diastolic blood pressure, no triceps skin fold thickness, and normal glucose levels after a 2-hour oral glucose tolerance test. Her insulin levels are low, and she has a slightly elevated body mass index. Additionally, her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was Yes."
"A 21-year-old female who has never been pregnant shows normal diastolic blood pressure and moderate triceps skin fold thickness. Her plasma glucose concentration is within a healthy range after a 2-hour oral glucose tolerance test. However, she has high levels of 2-hour serum insulin and a relatively high body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"This is a dataset for a 22-year-old individual who has been pregnant twice. They have low diastolic blood pressure, a moderately low triceps skin fold thickness, and normal plasma glucose concentration and insulin levels. Their body mass index indicates a healthy weight. The diabetes pedigree function score suggests a low genetic risk for diabetes.###\nHence this label was No."
"This individual is a 62-year-old who has been pregnant twice. They have a diastolic blood pressure of 70 and a high triceps skin fold thickness of 99. Their glucose levels after a 2-hour oral glucose tolerance test are elevated at 197. Despite having no insulin present in their serum, they have a body mass index of 34.7 and a moderate diabetes pedigree function of 0.575.###\nHence this label was Yes."
"A 33-year-old individual who has never been pregnant shows concerning indicators for diabetes, including extremely low diastolic blood pressure, high triceps skin fold thickness, elevated plasma glucose levels after a glucose tolerance test, high serum insulin levels, and a high body mass index. The diabetes pedigree function value suggests a genetic predisposition to the disease.###\nHence this label was Yes."
"This data describes a 21-year-old individual who has been pregnant twice. She has a diastolic blood pressure of 64, triceps skin fold thickness of 22, and a plasma glucose concentration of 115 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 30.8. The diabetes pedigree function for this individual is 0.421.###\nHence this label was No."
"A 24-year-old woman who has been pregnant three times has low diastolic blood pressure, no triceps skin fold thickness, and normal plasma glucose concentration. Her 2-hour serum insulin level is zero, and she has a slightly elevated body mass index. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"This data belongs to a 26-year-old individual who has never been pregnant. They have high diastolic blood pressure (110 mmHg) and a relatively high triceps skin fold thickness of 46mm. The individual's plasma glucose concentration after a glucose tolerance test is 129 mg/dL, and their 2-hour serum insulin level is elevated at 130 μU/mL. They have a high body mass index of 67.1 and a low diabetes pedigree function score of 0.319.###\nHence this label was Yes."
"This 30-year-old individual has been pregnant four times and has a low diastolic blood pressure of 62. Their triceps skin fold thickness is 12, indicating moderate fat accumulation. The plasma glucose concentration after a GTT is at a normal level of 117. They have low insulin levels, BMI in the overweight range at 29.7, and a relatively low diabetes pedigree function of 0.38.###\nHence this label was Yes."
"The patient is a 42-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 85, with a 2-hour serum insulin level of 0. She has a body mass index of 31.2 and a diabetes pedigree function of 0.382.###\nHence this label was No."
"This patient is a 43-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 31, and a body mass index of 44.0. Her plasma glucose concentration after a glucose tolerance test is 170, and her 2-hour serum insulin level is 0. Her diabetes pedigree function is 0.403.###\nHence this label was Yes."
"In this case study, we have a 25-year-old female who has never been pregnant. She has a diastolic blood pressure of 62 and a triceps skin fold thickness of 30. Her plasma glucose concentration during an oral glucose tolerance test is 107, and her 2-hour serum insulin level is 74. She has a body mass index of 36.6 and a diabetes pedigree function of 0.757.###\nHence this label was Yes."
"The patient is a 42-year-old woman who has been pregnant 8 times. She has a very low diastolic blood pressure of 55, normal triceps skin fold thickness of 20, and a healthy plasma glucose concentration of 85. Her 2-hour serum insulin level is at 0, indicating normal insulin production. With a body mass index of 24.4 and a low diabetes pedigree function of 0.136, she is at low risk for developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"This patient is a 41-year-old female who is currently not pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and normal 2-hour serum insulin levels. However, she has a high plasma glucose concentration after a glucose tolerance test and a high body mass index. Her diabetes pedigree function value is low, indicating a lower genetic risk for diabetes.###\nHence this label was Yes."
"This 23-year-old individual, who has been pregnant once, has a healthy diastolic blood pressure of 76 and a slightly above average triceps skin fold thickness of 34. Their plasma glucose concentration after a 2-hour GTT is normal at 89, and their 2-hour serum insulin level is typical at 37. With a body mass index of 31.2, they are considered overweight. Their diabetes pedigree function score is low at 0.192, indicating a relatively lower genetic risk for diabetes.###\nHence this label was No."
"This is a data record of a 30-year-old individual who has been pregnant once. Their diastolic blood pressure is 74, triceps skin fold thickness is 36, plasma glucose concentration is 124 after a glucose tolerance test, and 2-hour serum insulin is 0. The individual has a body mass index of 27.8 and a diabetes pedigree function of 0.1.###\nHence this label was No."
"This data is from a 21-year-old individual who is pregnant for the first time. They have a very low diastolic blood pressure of 55 and a triceps skin fold thickness of 0. Their glucose level after a 2-hour oral test is 80, with no serum insulin recorded. The individual has a low body mass index of 19.1 and a diabetes pedigree function of 0.258.###\nHence this label was No."
"The individual is a 49-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 88 mmHg. Her triceps skin fold thickness is 0 mm. After a 2-hour oral glucose tolerance test, her plasma glucose concentration is 165 mg/dL. She has no detectable serum insulin after 2 hours. Her body mass index is 30.4, indicating she is overweight. The diabetes pedigree function value is 0.302, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"This 24-year-old individual has been pregnant once, with a slightly low diastolic blood pressure of 68. Their triceps skin fold thickness is 34, indicating a moderate amount of subcutaneous fat. Their glucose concentration after a GTT is 87, which is within a healthy range. The 2-hour serum insulin level is 77, suggesting good insulin sensitivity. With a body mass index of 37.6, this individual is categorized as obese. The diabetes pedigree function value of 0.401 indicates a low genetic predisposition to diabetes.###\nHence this label was No."
"The individual is a 41-year-old female who has been pregnant twice. She has a diastolic blood pressure of 0 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 129 mg/dL, and her 2-hour serum insulin level is 0 μU/mL. She has a body mass index of 38.5, indicating obesity. The diabetes pedigree function score is 0.304, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 41-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122 mg/dL, with a 2-hour serum insulin level of 0 μU/mL. She has a body mass index of 31.2 and a diabetes pedigree function value of 0.258.###\nHence this label was No."
"The patient is a 28-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 62, a triceps skin fold thickness of 31, and a plasma glucose concentration of 151 after a GTT. Her 2-hour serum insulin level is 120, and her body mass index is 35.5. The diabetes pedigree function for this patient is 0.692.###\nHence this label was No."
"This individual is 30 years old and has never been pregnant. Their diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin levels are all at 0. However, their plasma glucose concentration at 2 hours is 167, indicating a high level. They have a body mass index of 32.3, suggesting overweight. The diabetes pedigree function value is 0.839, indicating a moderate genetic risk for diabetes.###\nHence this label was Yes."
"A 34-year-old woman who has been pregnant twice shows normal diastolic blood pressure and moderate triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within a healthy range. Despite having slightly elevated levels of 2-hour serum insulin, her body mass index is in the overweight category. She has a moderately high diabetes pedigree function score, indicating a potential genetic predisposition to diabetes.###\nHence this label was No."
"This individual is 36 years old and has been pregnant 9 times. They have a diastolic blood pressure of 82, triceps skin fold thickness of 32, and a plasma glucose concentration of 112 after a glucose tolerance test. Their 2-hour serum insulin level is 175, and they have a body mass index of 34.2. The diabetes pedigree function, indicating genetic predisposition to diabetes, is 0.26.###\nHence this label was Yes."
"The patient is a 22-year-old individual who is pregnant for the first time. They have normal diastolic blood pressure and a low triceps skin fold thickness. Their glucose concentration after a meal is below average, and they have low insulin levels. Despite having a slightly elevated body mass index, their risk of developing diabetes is relatively low based on their family history.###\nHence this label was No."
"A 34-year-old woman who has been pregnant three times with a normal diastolic blood pressure and a healthy BMI of 28.4. She has a moderate level of triceps skinfold thickness and her plasma glucose concentration after a 2-hour glucose tolerance test is 130. Her 2-hour serum insulin level is 79, and her diabetes pedigree function score is 0.323, indicating a relatively low risk of developing diabetes.###\nHence this label was Yes."
"This is a record of a 27-year-old individual who has been pregnant 5 times. Their diastolic blood pressure is 76 and triceps skin fold thickness is 0. During an oral glucose tolerance test, their plasma glucose concentration at 2 hours was 166. The 2-hour serum insulin level is 0, and their body mass index is 45.7. The diabetes pedigree function is 0.34.###\nHence this label was Yes."
"The patient is a 65-year-old woman who has been pregnant 5 times. She has a normal diastolic blood pressure of 78 mmHg and a low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 147 mg/dL, with no detectable serum insulin. Despite having a body mass index indicating obesity, her diabetes pedigree function is low at 0.218.###\nHence this label was No."
"This patient is a 22-year-old who has never been pregnant and has low diastolic blood pressure of 50. They have a moderately high triceps skin fold thickness of 36, a high plasma glucose concentration of 179 after a glucose tolerance test, and elevated 2-hour serum insulin levels of 159. Their body mass index is 37.8, indicating obesity, and their diabetes pedigree function is relatively low at 0.455.###\nHence this label was Yes."
"A 25-year-old woman, who has been pregnant three times, exhibits relatively normal health indicators: her diastolic blood pressure and triceps skinfold thickness are within healthy ranges. Her glucose levels after a glucose tolerance test are also normal. However, she has a slightly elevated body mass index and a moderate level of insulin in her blood. Additionally, her diabetes pedigree function score suggests a low to moderate genetic risk of developing diabetes.###\nHence this label was No."
"A 58-year-old individual, who has been pregnant 5 times, with a diastolic blood pressure of 82, a triceps skin fold thickness of 26, a plasma glucose concentration of 144 after a glucose tolerance test, a 2-hour serum insulin level of 285, a body mass index of 32.0, and a diabetes pedigree function of 0.452.###\nHence this label was Yes."
"This is a dataset of a 28-year-old individual who has been pregnant 4 times. She has a healthy diastolic blood pressure of 72 and a normal triceps skin fold thickness of 17. Her glucose level after a GTT is 99, with normal 2-hour serum insulin levels of 0. With a body mass index of 25.6 and a low diabetes pedigree function of 0.294, she appears to have a low risk of developing diabetes.###\nHence this label was No."
"The patient is a 28-year-old woman who has been pregnant 2 times. She has a diastolic blood pressure of 66 and a triceps skin fold thickness of 20. Her plasma glucose concentration after a glucose tolerance test is 100, and her 2-hour serum insulin level is 90. With a body mass index of 32.9, she has a diabetes pedigree function of 0.867.###\nHence this label was Yes."
"A 60-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 75. They have a triceps skin fold thickness of 26, a plasma glucose concentration of 109 after a 2-hour oral glucose tolerance test, and a 2-hour serum insulin level of 0. Their body mass index is 36.0 and their diabetes pedigree function is 0.546.###\nHence this label was No."
"The patient, a 41-year-old female, has been pregnant 8 times. She has a low diastolic blood pressure of 66 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 143 mg/dL, with a 2-hour serum insulin level of 0 μU/mL. She has a body mass index of 34.9, indicating obesity. Her diabetes pedigree function is 0.129, suggesting a low genetic risk for diabetes.###\nHence this label was Yes."
"A 38-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 82, triceps skin fold thickness of 30, and a plasma glucose concentration of 106 after a glucose tolerance test. Their 2-hour serum insulin level is 0, with a body mass index of 39.5 and a low diabetes pedigree function of 0.286. This person may have some risk factors for diabetes but their insulin level is currently normal.###\nHence this label was No."
"This individual is 22 years old and has never been pregnant. They have a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 38 mm.  Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 137 mg/dL, and they have a 2-hour serum insulin level of 0 uU/mL. Their body mass index is 33.2 kg/m², and their diabetes pedigree function score is 0.17.###\nHence this label was No."
"A 37-year-old woman who has been pregnant four times with low diastolic blood pressure, no triceps skin fold thickness, and low 2-hour serum insulin level. She has a normal plasma glucose concentration, low body mass index, and a moderately low diabetes pedigree function score.###\nHence this label was No."
"A 52-year-old individual, who has been pregnant 3 times, with diastolic blood pressure of 86. Their triceps skin fold thickness is 27, plasma glucose concentration at 176 after a glucose tolerance test, and 2-hour serum insulin level of 156. They have a body mass index of 33.3 and a diabetes pedigree function of 1.154.###\nHence this label was Yes."
"A 35-year-old individual who has been pregnant 5 times has a diastolic blood pressure of 74. Their triceps skin fold thickness is 29, plasma glucose concentration after a GTT is 116, and 2-hour serum insulin level is 0. With a body mass index of 32.3 and a diabetes pedigree function of 0.66, this person's risk for developing diabetes can be assessed.###\nHence this label was Yes."
"The patient, a 52-year-old female, has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is zero, indicating potential insulin resistance. With a high body mass index and a low diabetes pedigree function, she may have an increased risk of developing diabetes in the future.###\nHence this label was Yes."
"The patient is a 33-year-old female who has been pregnant twice. She has a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 24 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 75 mg/dL, and she has a 2-hour serum insulin level of 55 μU/mL. Her body mass index is 29.7, and her diabetes pedigree function is 0.37.###\nHence this label was No."
"This 29-year-old individual has been pregnant 4 times and shows normal diastolic blood pressure. They have a triceps skin fold thickness of 0, indicating lower body fat percentage. Their plasma glucose concentration after a 2-hour GTT is 92, which is within the normal range. With a 2-hour serum insulin level of 0, this person may have lower insulin sensitivity. However, their body mass index is relatively high at 42.2, suggesting they may be overweight. The diabetes pedigree function value of 0.237 indicates a low genetic predisposition to diabetes.###\nHence this label was No."
"This data describes a 26-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 64, a triceps skin fold thickness of 35, and a plasma glucose concentration of 139 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 140, their body mass index is 28.6, and their diabetes pedigree function is 0.411.###\nHence this label was No."
"A 28-year-old woman, who has been pregnant once, has a diastolic blood pressure of 82. Her triceps skin fold thickness is 40mm, and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 144mg/dL. She has no insulin in her serum after 2 hours. With a body mass index of 41.3, she has a low diabetes pedigree function score of 0.607.###\nHence this label was No."
"The patient is a 25-year-old woman who has been pregnant 3 times. She has low diastolic blood pressure (52 mmHg) and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 121 mg/dL. She has no 2-hour serum insulin and a high body mass index of 36.0. Her diabetes pedigree function is low at 0.127.###\nHence this label was Yes."
"A 25-year-old, non-pregnant individual with normal blood pressure and insulin levels, but with high glucose concentration and a high body mass index. They have a moderately high triceps skin fold thickness and a relatively high diabetes pedigree function score, indicating a potential genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 22-year-old female who is 1 time pregnant. She has a healthy diastolic blood pressure of 74 and a low triceps skin fold thickness of 11. Her blood glucose levels are normal at 80, but her insulin levels are elevated at 60. She has a high body mass index of 30.0, indicating potential overweight. The diabetes pedigree function score is 0.527, suggesting a moderate genetic predisposition to diabetes. Overall, this patient may have an increased risk of developing diabetes due to her insulin levels and BMI.###\nHence this label was No."
"A 24-year-old individual who has been pregnant 2 times, with a diastolic blood pressure of 66. Their triceps skin fold thickness is 22, plasma glucose concentration after a glucose tolerance test is 112, and 2-hour serum insulin level is 0. They have a body mass index of 25.0 and a diabetes pedigree function of 0.307.###\nHence this label was No."
