"This is a dataset of a 21-year-old individual who has been pregnant twice. They have normal diastolic blood pressure, a moderate triceps skin fold thickness, and average plasma glucose concentration after a 2-hour oral glucose tolerance test. Their insulin level is low, but their body mass index is in the obese range. The individual has a low diabetes pedigree function score, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"This individual is a 22-year-old female who has been pregnant twice. She has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. Her plasma glucose concentration after a glucose tolerance test is 74. Additionally, she has a body mass index of 0.0 and a diabetes pedigree function of 0.102.###\nHence this label was No."
"The patient is a 25-year-old who has been pregnant 3 times. She has a diastolic blood pressure of 82, triceps skin fold thickness of 48, and a high plasma glucose concentration of 173 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is high at 465, and she has a body mass index of 38.4. Additionally, her diabetes pedigree function is elevated at 2.137, indicating a potential risk for developing diabetes.###\nHence this label was Yes."
"This data represents a young adult female, aged 21, who is pregnant for the first time. She has a low diastolic blood pressure of 70 and a relatively low triceps skin fold thickness of 15. Her plasma glucose concentration after a glucose tolerance test is 97, and she has no insulin in her serum after 2 hours. With a body mass index of 18.2 and a low diabetes pedigree function of 0.147, this individual appears to be at low risk for developing diabetes.###\nHence this label was No."
"This is a 53-year-old individual who has been pregnant 9 times. Their diastolic blood pressure is 86, triceps skin fold thickness is 0, and plasma glucose concentration after a glucose tolerance test is 156. They have no 2-hour serum insulin. Their body mass index is 24.8 and diabetes pedigree function is 0.23.###\nHence this label was Yes."
"A 42-year-old individual, who has been pregnant 8 times, with normal diastolic blood pressure and no triceps skin fold thickness measured. Their plasma glucose concentration after a glucose tolerance test is at a normal level of 100. They have no insulin in their serum after 2 hours, but have a high body mass index of 38.7. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 81-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 33, and a plasma glucose concentration of 134 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 60, and she has a body mass index of 25.9. The diabetes pedigree function for this patient is 0.46.###\nHence this label was No."
"This data represents a 22-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 84, triceps skin fold thickness of 33, and a plasma glucose concentration of 173 after a glucose tolerance test. Their 2-hour serum insulin level is 474, and they have a body mass index of 35.7. The diabetes pedigree function score is 0.258.###\nHence this label was Yes."
"The patient is a 24-year-old female who has been pregnant 5 times. She has a healthy diastolic blood pressure of 68 and a normal triceps skin fold thickness of 28. Her plasma glucose concentration after a glucose tolerance test is 86, and her 2-hour serum insulin level is 71. With a body mass index of 30.2, she is considered overweight. Her diabetes pedigree function score is 0.364, indicating a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 39-year-old woman who has been pregnant 3 times. She has a low diastolic blood pressure of 56 and a triceps skin fold thickness of 34, indicating a healthy level of body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 96, which is within the normal range. She also has a relatively high 2-hour serum insulin level of 115. With a body mass index of 24.7 and a diabetes pedigree function of 0.944, she may have a moderate risk of developing diabetes in the future.###\nHence this label was No."
"This patient is a 39-year-old female who has been pregnant 7 times. She has a unusually low diastolic blood pressure of 54 and a triceps skin fold thickness of 32, indicating low subcutaneous fat levels. Her plasma glucose concentration after a glucose tolerance test is elevated at 160, and she has a high level of 2-hour serum insulin at 175. Despite having a body mass index of 30.5, she has a relatively low diabetes pedigree function score of 0.588.###\nHence this label was Yes."
"A 24-year-old individual who has been pregnant once, with relatively low diastolic blood pressure and triceps skin fold thickness. Their glucose levels after a 2-hour oral glucose tolerance test are on the lower side, but they have higher levels of serum insulin. Despite a slightly elevated body mass index, their diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"This 25-year-old patient has been pregnant twice and shows a normal diastolic blood pressure of 72. Their triceps skin fold thickness is 15, indicating a healthy amount of subcutaneous fat. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 81, a good sign of blood sugar control. A 2-hour serum insulin level of 76 suggests normal insulin production. With a body mass index of 30.1, they are considered overweight but not obese. The diabetes pedigree function score of 0.547 indicates a moderate genetic risk for diabetes.###\nHence this label was No."
"A 29-year-old woman, who is pregnant for the first time, with a diastolic blood pressure of 66 and a triceps skin fold thickness of 52. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 86, and her 2-hour serum insulin level is 65. She has a body mass index of 41.3 and a diabetes pedigree function of 0.917.###\nHence this label was No."
"A 28-year-old woman, who has been pregnant twice, with a diastolic blood pressure of 86 mmHg, a triceps skin fold thickness of 42 mm, a plasma glucose concentration of 112 mg/dL after a glucose tolerance test, 2-hour serum insulin level of 160 μU/ml, a body mass index of 38.4, and a low diabetes pedigree function of 0.246.###\nHence this label was No."
"The patient is a 29-year-old female who has been pregnant twice. She has a diastolic blood pressure of 76 mmHg and a triceps skin fold thickness of 37 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 120 mg/dL, and her 2-hour serum insulin level is 105 mu U/ml. She has a body mass index of 39.7 and a diabetes pedigree function value of 0.215.###\nHence this label was No."
"A 43-year-old individual who has been pregnant 5 times with a diastolic blood pressure of 74. They have a triceps skin fold thickness of 18mm and a plasma glucose concentration of 96mg/dL after a GTT. Their 2-hour serum insulin level is 67mu U/ml and their body mass index is 33.6. Additionally, their diabetes pedigree function is 0.997, indicating a high genetic risk of developing diabetes.###\nHence this label was No."
"This is a dataset of a 27-year-old individual who has been pregnant twice. They have a relatively low diastolic blood pressure of 68 and a moderate triceps skin fold thickness of 42. Their plasma glucose concentration is at a normal level of 90 after a 2-hour oral glucose tolerance test. They have no detectable serum insulin after 2 hours. Despite having a higher body mass index of 38.2, their diabetes pedigree function is low at 0.503.###\nHence this label was Yes."
"This is a data entry of a 27-year-old individual with 5 pregnancies. They have a low diastolic blood pressure of 60 and zero triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 73, and they have zero 2-hour serum insulin. The individual has a body mass index of 26.8 and a diabetes pedigree function of 0.268.###\nHence this label was No."
"This individual is a 40-year-old female who has been pregnant 7 times. She has a normal diastolic blood pressure of 64 and minimal triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 159, indicating a moderate level of glucose in the blood. She has no insulin present after 2 hours. Her body mass index is 27.4, which is within the overweight range. The diabetes pedigree function score is 0.294, suggesting a moderate genetic risk for diabetes.###\nHence this label was No."
"A 21-year-old individual who has never been pregnant shows normal diastolic blood pressure and no triceps skin fold thickness. Their glucose level after a 2-hour oral test is within a healthy range. Insulin level is normal. Body mass index indicates that they are slightly overweight. The diabetes pedigree function suggests a low risk of developing diabetes.###\nHence this label was No."
"The patient is a 60-year-old female who has been pregnant 4 times. She has a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 0. Her glucose levels are slightly elevated at 134, with no insulin present in her blood. She has a healthy body mass index of 23.8 and a low diabetes pedigree function of 0.277.###\nHence this label was Yes."
"This individual is a 42-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 40. Her plasma glucose concentration after a glucose tolerance test is 103, and her 2-hour serum insulin level is 0. She has a body mass index of 46.2 and a diabetes pedigree function of 0.126.###\nHence this label was No."
"The patient is a 30-year-old individual who has been pregnant 6 times. Their diastolic blood pressure is 96, and their triceps skin fold thickness is 0. The plasma glucose concentration at 2 hours in an oral glucose tolerance test is 117, with a 2-hour serum insulin level of 0. The patient has a body mass index of 28.7 and a diabetes pedigree function of 0.157.###\nHence this label was No."
"A 54-year-old individual, who has been pregnant twice, with normal diastolic blood pressure and very low triceps skin fold thickness. Their glucose levels after a glucose tolerance test are within normal range. They have no insulin present in their bloodstream. Despite having a high body mass index, their diabetes pedigree function is relatively low.###\nHence this label was No."
"A 22-year-old woman who is one-time pregnant has a low diastolic blood pressure of 70. She has a moderately low triceps skin fold thickness of 13, likely indicating a normal amount of body fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 130, which is within the normal range. She has a relatively high 2-hour serum insulin level of 105, suggesting good insulin production. With a body mass index of 25.9, she is considered to be in the overweight category. Her diabetes pedigree function score is 0.472, indicating a moderate genetic risk for diabetes. Overall, she presents with a few concerning factors but also several positive indicators for her health.###\nHence this label was No."
"A 26-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 64 and a triceps skin fold thickness of 44. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 109, with a 2-hour serum insulin level of 99. Their body mass index is 34.8 and their diabetes pedigree function is 0.905.###\nHence this label was Yes."
"The patient is a 32-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 92 and a triceps skin fold thickness of 49. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 129. Her 2-hour serum insulin levels are at 155. She has a body mass index of 36.4 and a diabetes pedigree function of 0.968.###\nHence this label was Yes."
"A 25-year-old individual who has been pregnant twice exhibits low diastolic blood pressure and a moderately high triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is within normal range, and they have normal 2-hour serum insulin levels. Despite a slightly higher body mass index, their diabetes pedigree function suggests a low genetic risk of developing diabetes.###\nHence this label was No."
"This individual is a 31-year-old woman who has been pregnant 10 times. She has a low diastolic blood pressure of 62 and no triceps skin fold thickness, indicating a lean body composition. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 92, which is within the normal range. She has very low 2-hour serum insulin levels and a healthy body mass index of 25.9. Additionally, her diabetes pedigree function score is low at 0.167, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"A 26-year-old female who has never been pregnant and shows healthy diastolic blood pressure, but has slightly elevated triceps skin fold thickness. Her glucose levels after a 2-hour oral glucose tolerance test are within normal range, while her insulin levels are slightly high. She has a slightly elevated body mass index and a low diabetes pedigree function score, indicating a relatively low risk of developing diabetes.###\nHence this label was No."
"The patient is a 27-year-old female who has never been pregnant. She has a normal diastolic blood pressure of 80 and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 91, and her 2-hour serum insulin is zero. Despite having a slightly elevated body mass index of 32.4, her diabetes pedigree function is low at 0.601.###\nHence this label was No."
"This individual, aged 28, has been pregnant 3 times and has a diastolic blood pressure of 76. Their triceps skin fold thickness is 36, plasma glucose concentration after a glucose tolerance test is 158, and their 2-hour serum insulin level is 245. With a body mass index of 31.6 and a diabetes pedigree function of 0.851, this person's risk for developing diabetes may be significant.###\nHence this label was Yes."
"A 42-year-old female, who has been pregnant once, shows normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is at a normal level of 102. She has no 2-hour serum insulin and a high body mass index of 39.5. Her diabetes pedigree function is low at 0.293, indicating a relatively lower risk of developing diabetes.###\nHence this label was Yes."
"A 30-year-old individual who has been pregnant 3 times with normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Their plasma glucose concentration and 2-hour serum insulin levels are within normal ranges. However, they have a high body mass index and a relatively low diabetes pedigree function score, indicating a moderate risk of developing diabetes.###\nHence this label was No."
"The individual in the data is a 21-year-old who has never been pregnant. She has a low diastolic blood pressure of 56 and a relatively low triceps skin fold thickness of 13. Her plasma glucose concentration after a glucose tolerance test is 124, and her 2-hour serum insulin level is 105. With a body mass index of 21.8 and a diabetes pedigree function value of 0.452, she appears to have a lower risk of developing diabetes.###\nHence this label was No."
"This 21-year-old individual has been pregnant once and has a relatively low diastolic blood pressure of 66. Their triceps skin fold thickness is 23, indicating a healthy amount of subcutaneous fat. With a plasma glucose concentration of 89 and 2-hour serum insulin level of 94, they appear to have normal blood sugar levels. Their body mass index is 28.1, suggesting they are slightly overweight. The diabetes pedigree function score of 0.167 indicates a low genetic risk for diabetes.###\nHence this label was No."
"This individual is a 22-year-old female who is 1-time pregnant and has a diastolic blood pressure of 84. She has a triceps skin fold thickness of 23, plasma glucose concentration of 143 after a glucose tolerance test, and a high 2-hour serum insulin level of 310. Her body mass index is 42.4, indicating obesity. Additionally, her diabetes pedigree function value is 1.076, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 60-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 36. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 181, and her 2-hour serum insulin level is 495. She has a body mass index of 30.1 and a diabetes pedigree function of 0.615.###\nHence this label was Yes."
"The patient is a 45-year-old female who is pregnant for the first time. She has a slightly elevated diastolic blood pressure of 94. Her triceps skin fold thickness is 0, indicating low levels of subcutaneous fat. Her plasma glucose concentration after a glucose tolerance test is 111, within the normal range. She has no detectable 2-hour serum insulin. Despite having a body mass index of 32.8, which is categorized as obese, her diabetes pedigree function is low at 0.265, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"This patient is a 50-year-old female who has been pregnant 6 times. She has a normal diastolic blood pressure of 80. Her triceps skin fold thickness is 0, indicating she has a lower amount of subcutaneous fat. She has a plasma glucose concentration of 147, which is slightly higher than normal. Her 2-hour serum insulin level is 0, indicating possible insulin resistance. She has a body mass index of 29.5, which falls into the overweight category. The diabetes pedigree function score is low at 0.178, suggesting a lower genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 56-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 72 and a triceps skin fold thickness of 18. Her plasma glucose concentration is 94 after a 2-hour oral glucose tolerance test, with a serum insulin level of 0. Her body mass index is 23.1 and her diabetes pedigree function is 0.595.###\nHence this label was No."
"The patient is a 44-year-old female who has never been pregnant. She has normal diastolic blood pressure and a high body mass index of 40.5, indicating obesity. Despite having a high plasma glucose concentration of 146, her 2-hour serum insulin level is at 0, suggesting insulin resistance. Additionally, her diabetes pedigree function score is 1.781.###\nHence this label was No."
"This 26-year-old individual has never been pregnant. Their diastolic blood pressure is normal at 76, with a low triceps skin fold thickness of 0. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 101. They have no 2-hour serum insulin present in their system. Despite having a high body mass index of 35.7, their diabetes pedigree function is relatively low at 0.198.###\nHence this label was No."
"A 36-year-old woman, who has been pregnant 7 times, shows normal diastolic blood pressure and a healthy body mass index. Her triceps skin fold thickness is within normal range, and her glucose and insulin levels are also at healthy levels. Despite a family history of diabetes, her diabetes pedigree function indicates a low risk of developing the disease.###\nHence this label was No."
"A 33-year-old individual with 4 pregnancies shows normal diastolic blood pressure, average triceps skin fold thickness, and slightly elevated plasma glucose concentration after a 2-hour GTT. They have higher than normal insulin levels, a slightly high body mass index, and a low diabetes pedigree function score.###\nHence this label was Yes."
"A 25-year-old woman who has been pregnant three times has a diastolic blood pressure of 70 and a body mass index of 34.9. Her triceps skin fold thickness is 31, and her plasma glucose concentration after a glucose tolerance test is 193. She has no insulin in her system and a low diabetes pedigree function of 0.241.###\nHence this label was Yes."
"The patient is a 59-year-old who has never been pregnant. She has a normal diastolic blood pressure of 84 mmHg. Her triceps skin fold thickness is 27mm, indicating a healthy amount of body fat. Her glucose level after a 2-hour oral GTT is 137 mg/dL. She has no insulin present in her serum after 2 hours. With a BMI of 27.3, she is considered overweight. Her diabetes pedigree function is 0.231, suggesting a low genetic predisposition to diabetes.###\nHence this label was No."
"This data belongs to a 22-year-old individual who has been pregnant 2 times. They have a diastolic blood pressure of 60, a triceps skin fold thickness of 17, and a plasma glucose concentration of 98 after a glucose tolerance test. Their 2-hour serum insulin level is 120, and their body mass index is 34.7. The diabetes pedigree function value for this individual is 0.198.###\nHence this label was No."
"This data belongs to a 38-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 78 and a triceps skin fold thickness of 40. Their plasma glucose concentration after a glucose tolerance test is 112, with a 2-hour serum insulin level of 0. They have a body mass index of 39.4 and a diabetes pedigree function of 0.236.###\nHence this label was No."
"This patient is a 26-year-old female who has been pregnant twice. She has a diastolic blood pressure of 68 mmHg and a triceps skin fold thickness of 25 mm. Her glucose levels are normal with a plasma glucose concentration of 100 mg/dL after a 2-hour oral glucose tolerance test. She has a moderate insulin level of 71 μU/mL. With a body mass index of 38.5, she is classified as obese. Her diabetes pedigree function score is 0.324, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This patient is a 28-year-old female who has been pregnant once. She has a diastolic blood pressure of 64 and a triceps skin fold thickness of 23. Her plasma glucose concentration after a glucose tolerance test is 84, and her 2-hour serum insulin level is 115. With a body mass index of 36.9, she has a relatively high BMI. Her diabetes pedigree function is 0.471, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 34-year-old woman who has been pregnant 10 times. She has normal diastolic blood pressure and no triceps skin fold thickness. During a glucose tolerance test, her plasma glucose concentration after 2 hours is elevated. She has normal insulin levels but a high body mass index. Despite a family history of diabetes, her diabetes pedigree function score is moderate.###\nHence this label was Yes."
"The patient is a 23-year-old individual who has been pregnant twice. They have normal diastolic blood pressure and triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 111, with no detectable serum insulin. The patient has a healthy body mass index of 26.2 and a diabetes pedigree function of 0.343.###\nHence this label was No."
"A 23-year-old individual, who has been pregnant once, with a normal diastolic blood pressure of 60, a healthy triceps skin fold thickness of 42, a low plasma glucose concentration of 79 after a glucose tolerance test, moderate 2-hour serum insulin level of 48, a high body mass index of 43.5, and a relatively low diabetes pedigree function score of 0.678.###\nHence this label was No."
"This data represents a 41-year-old individual who has been pregnant 7 times. They have a diastolic blood pressure of 78, no triceps skin fold thickness, and a low plasma glucose concentration of 62. Their 2-hour serum insulin level is 0, their body mass index is 32.6, and they have a low diabetes pedigree function of 0.391.###\nHence this label was No."
"A 28-year-old woman who has been pregnant twice has a diastolic blood pressure of 66 and triceps skin fold thickness of 20. Her plasma glucose concentration after a GTT is 100, with a 2-hour serum insulin level of 90. She has a body mass index of 32.9 and a diabetes pedigree function of 0.867.###\nHence this label was Yes."
"This data belongs to a 29-year-old individual who has been pregnant twice. They have a diastolic blood pressure of 70, triceps skin fold thickness of 38, plasma glucose concentration of 146, 2-hour serum insulin level of 360, body mass index of 28.0, and a diabetes pedigree function value of 0.337. These measurements are used to assess the risk of developing diabetes in the future.###\nHence this label was Yes."
"The patient is a 27-year-old female who has been pregnant twice. She has a diastolic blood pressure of 70 mmHg, triceps skin fold thickness of 16 mm, and a plasma glucose concentration of 99 mg/dl after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 44 μU/ml, and her body mass index is 20.4 kg/m². The diabetes pedigree function, a measure of the genetic influence of diabetes, is 0.235. Overall, these measurements suggest a relatively low risk for developing diabetes.###\nHence this label was No."
"This 29-year-old individual has been pregnant 4 times and shows normal diastolic blood pressure. They have no triceps skin fold thickness and low insulin levels. Their plasma glucose concentration after a GTT is normal at 122, but they have a high body mass index of 35.0. Despite a low diabetes pedigree function score of 0.394, this person may be at risk for developing diabetes due to their age and BMI.###\nHence this label was No."
"A 25-year-old woman who has never been pregnant shows normal diastolic blood pressure and blood glucose levels. However, she has a high amount of serum insulin and a high body mass index, indicating a potential risk for developing diabetes. Additionally, she has a moderate family history of diabetes based on her pedigree function score.###\nHence this label was No."
"The patient is a 22-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 68, triceps skin fold thickness of 35, and a body mass index of 32.0. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 0, as well as her 2-hour serum insulin level. The diabetes pedigree function for this patient is 0.389.###\nHence this label was No."
"The patient is a 52-year-old woman who has never been pregnant. \nShe has a normal diastolic blood pressure of 72 and a relatively low triceps skin fold thickness of 0. \nHer plasma glucose concentration after a GTT is 123, which is within the normal range. \nShe has a very low 2-hour serum insulin level of 0. \nDespite having a high body mass index of 36.3, her diabetes pedigree function is quite low at 0.258.###\nHence this label was Yes."
"A 38-year-old individual who has been pregnant three times, with a diastolic blood pressure of 74. Their triceps skin fold thickness is 16, plasma glucose concentration at 2 hours is 89, and 2-hour serum insulin is 85. They have a body mass index of 30.4 and a diabetes pedigree function of 0.551.###\nHence this label was No."
