"This individual has a status of existing checking account of less than 0 DM, has a credit history of paying back existing credits duly, and is looking for a new car. They are requesting a credit amount of 2249 with savings between 100 and 500 DM. This person has been employed for 4 to 7 years and has an installment rate of 4% of disposable income. They are a single male with no other debtors or guarantors and have been living in their current residence for 3 years. The individual owns their own home, is aged 30, and has no other installment plans. They have one existing credit at the bank, hold a job in management/self-employment/highly qualified employee/officer, and have 2 people liable for maintenance. Additionally, they have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM and has been paying back existing credits duly. They are taking a 15-month loan for a new car, with a credit amount of 1403. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a low installment rate of 2% on disposable income and are female, divorced/separated/married. They have no other debtors/guarantors, have been residing at their current location for 4 years, and own either a car or another type of property. At 28 years old, they have no other installment plans, live in rented housing, and have 1 existing credit at the bank. They are a skilled employee/official with 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a modest amount of money in their existing checking account and a small credit history with critical accounts. They are looking to finance furniture or equipment. The credit amount they are seeking is 1928. They have some savings but less than 100 DM and have been in their current employment for less than a year. Their personal status is single and they are a young male of 31 years. They have no other debtors or guarantors and own their own home. They have two existing credits with the bank and work as an unskilled resident. They have one dependent. They do not have a telephone but are employed as a foreign worker.###\nHence this label was No."
"This individual is a 28-year-old single male, working as a skilled employee/official for at least 7 years at their current job. They have no other debtors or guarantors and own their own home. They have been living at their current residence for 4 years and have no telephone. They have a savings account with less than 100 DM and have no other installment plans. They have one existing credit at the bank and are responsible for providing maintenance for 2 people. They have a good credit history with existing credits paid back duly. Their purpose for the credit amount of 1068 is for radio/television. They have no other debts and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a loan of 5324 DM for a new car, with savings between 500 and 1000 DM. They have been employed for at least 7 years as a skilled employee/official, with a low installment rate relative to their income. They are a divorced/separated/married female, with no other debtors or guarantors. They have been residing for 4 years in a free housing arrangement, with no other significant assets or debts. At 35 years old, they have no other installment plans, one existing credit at the bank, and are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with less than 0 DM in their checking account and savings of less than 100 DM. They have been employed for 4 to 7 years, have paid back existing credits on time, and have a good credit history. The purpose of the credit is for a radio/television. They have a moderate credit amount of 6999 and a low installment rate. The individual is a married/widowed male, with a guarantor and owns real estate. They have been living at their current residence for 1 year, are 34 years old, and have no other installment plans. They have two existing credits at the bank, work as a skilled employee/official, and have one person dependent on them. They own a telephone and are a registered foreign worker.###\nHence this label was No."
"This individual has a checking account balance of at least 200 DM and has been repaying existing credits on time. They are seeking a loan for furniture/equipment, with a credit amount of 3049. Their savings are below 100 DM and they have been employed for less than 1 year. The installment rate is 1% of disposable income. The applicant is a 45-year-old divorced/separated/married female. They have no other debtors or guarantors and have been residing at their current residence for 1 year. Their property includes a building society savings agreement/life insurance. They have one existing credit at this bank and work as an unskilled resident. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history with existing credits paid back duly. They have a stable income, have been living at their current residence for 4 years, and have a long-standing employment of at least 7 years. The purpose of the credit is for furniture/equipment, and the credit amount is 7865. They have savings of less than 100 DM and no other debts or guarantors. The individual is a 53-year-old single male in a management/self-employed position. They have no other installment plans, live in housing for free, and have a telephone registered under their name. Additionally, they are a foreign worker and only one person is liable for providing maintenance.###\nHence this label was No."
"This individual has a stable financial standing with a moderate amount of credit in their checking account. They have a good credit history, a small credit amount for a radio/television, and some savings. They have been employed for 1-4 years and have a low installment rate. The individual is a divorced/separated/married female with a guarantor, living in their own real estate property. They are middle-aged, have no other installment plans, and have been at their current residence for 4 years. They have a steady job, one dependent, a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a credit history with a critical account/other credits existing. They are seeking a loan for furniture/equipment, with a credit amount of 2028. Their savings amount is less than 100 DM, and they have been employed for 4 to 7 years. With an installment rate of 2% of disposable income, this single male has no other debtors or guarantors. They have been living in their current residence for 2 years and own their housing. At 30 years old, they have no other installment plans and work an unskilled-resident job. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a good credit history of repaying existing credits on time. They are seeking a business loan of 3448 DM, have savings below 100 DM, and have been employed for 4 to 7 years. They have a low installment rate relative to their disposable income and are a 74-year-old single male with no other debtors or guarantors. They have been living in their own real estate for 4 years and have no other ongoing installment plans. Their job is unskilled-resident, and they are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old unemployed female who is divorced/separated/married. She has a checking account with less than 0 DM, a credit history of paying back existing credits duly, and is looking to buy a used car. She has savings between 500 and 1000 DM and has been residing in her current location for 2 years. She has no other debtors/guarantors, no other installment plans, and resides in a rented house. She has one existing credit at the bank and works as an unemployed/unskilled non-resident. She has one dependent and owns a telephone registered under her name. She is a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account, a good credit history of timely repayments, and has been employed for at least 7 years. They are taking out a new car loan of 1287 credits and have no savings account. The applicant is a 45-year-old single male, with a co-applicant. They have been residing in their current home for 2 years, own their own house, and have one existing credit at the bank. The individual has no other installment plans, works as an unskilled resident, and is responsible for providing maintenance for one person. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced, separated, or married. She has been employed for 1 to 4 years as a skilled employee/official. She owns a car or another type of property not specified in the data. She has no savings account and no other debtors or guarantors. She lives in her own residence with one other person and has been at the current residence for 1 year. She has one existing credit at the bank and no other installment plans. At 26 years old, she has a good credit history of paying back existing credits duly. She does not have a telephone but is a foreign worker. She is applying for a credit amount of 1715 DM for the purpose of radio/television.###\nHence this label was Yes."
"The individual has a status of existing checking account with a balance between 0 and 200 DM. They have a good credit history with existing credits paid back duly. The purpose of the credit is for business. The credit amount is 3915 DM. They have savings of less than 100 DM and have been employed for 1 to 4 years. The installment rate is 4% of disposable income. The individual is a single male, with no other debtors or guarantors. They have been living at their current residence for 2 years and own a car or other property. The individual is 36 years old, with no other installment plans and no other credits at the bank. They are a skilled employee and have 2 dependents. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a single male, aged 47, working as a skilled employee with over 1 year of steady employment. He has a good credit history with existing credits paid back duly. Currently, he has no other debts or guarantors and resides in a free housing arrangement. He has a savings account with a balance between 100 and 500 DM and a moderate credit amount of 12612 DM. He has been living at his current residence for 4 years and has one existing credit at the bank. He has no other installment plans and no property ownership. Additionally, he has a telephone registered under his name and is a foreign worker. He is liable to provide maintenance for 2 people.###\nHence this label was No."
"This individual is a 23-year-old female who is divorced/separated/married. She does not have a checking account and has been in her current employment for less than a year. She lives in a rented house with two dependents. Her credit history shows that she has been repaying existing credits on time. She is looking to finance furniture/equipment through a small loan of 601 DM. She has savings of less than 100 DM and no other debts. She resides in a real estate property and has one existing credit at the bank. She has a low installment rate and no other installment plans. She works as an unskilled resident. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had existing credits paid back on time. They are looking to purchase a new car with a credit amount of 1546. Their savings account holds less than 100 DM and they have been employed for 1 to less than 4 years. They have a low installment rate of 3% of their disposable income. The individual is a 31-year-old single male, with no other debtors or guarantors. They have been living in their own real estate property for 2 years. They have one existing credit at this bank and work as an unskilled resident. There are two people dependent on them for maintenance. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual is a skilled, divorced/separated/married female, aged 39, with a stable job held for over 7 years. She has a good credit history with existing credits paid back duly. She has one existing credit at the bank, a moderate credit amount of 1188 DM, and savings of less than 100 DM. She owns a building society savings agreement/life insurance property and lives in her own home with a 4-year residence history. She has no other debts or installment plans, no other debtors/guarantors, and no telephone. She has an installment rate of 2% and is liable for providing maintenance for 2 people. Additionally, she is a foreign worker.###\nHence this label was No."
"The individual has a checking account with less than 0 DM, has paid back existing credits on time, and has been employed for 1 to 4 years. They are borrowing 2600 DM for a radio/television, with savings of less than 100 DM. Their monthly installment rate is 4% of disposable income. They are a 65-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 4 years, own no property, and live for free. They have 2 existing credits at the bank and work as a skilled employee/official. They are responsible for 1 person's maintenance, do not have a telephone, but are a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old unemployed female, who is divorced/separated/married. She has been living in a rented house for 4 years. She has no existing debts or guarantors. She has one existing credit at the bank and no other installment plans. She is responsible for providing maintenance for one person. She does not have a telephone but is a foreign worker. Her credit history shows that she has paid back all existing credits on time. Her purpose for the credit amount of 3758 DM is for a radio/television. She has some savings between 500 and 1000 DM. She has no property and her job status is unemployed/unskilled - non-resident.###\nHence this label was Yes."
"This individual has a stable financial status with existing credits paid back on time. They are looking to purchase a radio or television, with a moderate credit amount. They have been employed for 4-7 years and have no savings account. They are a single male with no other debtors or guarantors. They own their own home, have two existing credits, and are responsible for providing maintenance for two people. They are a skilled employee, aged 41, and have a registered telephone line. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a credit history of delaying payments in the past. They are seeking a new car with a credit amount of 2538. They have savings of less than 100 DM and have been employed for at least 7 years. The installment rate is 4% of disposable income. They are a 47-year-old single male. There are no other debtors or guarantors involved. They have been residing in their own home for 4 years. They own a car or other property not specified. The individual has no other installment plans and no telephone. They have 2 existing credits at the bank and work as an unskilled resident. They are responsible for providing maintenance for 2 people. The individual is a foreign worker.###\nHence this label was No."
"This individual has no checking account, has existing credits paid back duly till now, and has been employed for at least 7 years. They are looking to finance a radio or television purchase, with a credit amount of 3235. They have savings between 500 and 1000 DM, own a car or other property not specified, and have been living in their current residence for 2 years. The individual is a 26-year-old divorced/separated male, with no other debtors or guarantors. They have no other installment plans, own their house, and have one existing credit at the bank. Their occupation is in management, self-employment, or a highly qualified position, and they are responsible for one person's maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 47-year-old female who is divorced/separated/married. She has been employed for at least 7 years as a skilled employee/official. She has a checking account with a balance of at least 200 DM and savings of 100 to less than 500 DM. She has no other debtors or guarantors and resides in a free housing. She has one existing credit at the bank and no other installment plans. She has a telephone registered under her name, and she is a foreign worker. Her credit history shows existing credits paid back duly till now. She is looking to borrow 1377 DM for the purpose of radio/television, with an installment rate of 4% of her disposable income. She has been living at her current residence for 2 years and is responsible for one person's maintenance.###\nHence this label was Yes."
"The individual has no checking account and has been with their current employer for at least 7 years. They are a single male, 52 years old, and own real estate as their housing. Their credit history shows critical accounts and other existing credits. The purpose of the credit is for a radio/television. They have savings of less than 100 DM and a credit amount of 717. They have no other debtors/guarantors or other installment plans. Their installment rate is 4% of disposable income and they have 3 existing credits at this bank. They have been residing at their current residence for 4 years and have 1 person liable for maintenance. They work as a skilled employee/official and are a foreign worker with no telephone.###\nHence this label was Yes."
"This individual has no checking account and unknown savings, with a credit history of paying back existing credits on time. They are looking for a loan for education purposes, with a credit amount of 9055 over a duration of 36 months. They have been employed for 1 to less than 4 years and have a low installment rate on disposable income. The individual is a 35-year-old single male, with no other debtors or guarantors, living in a free housing for the past 4 years. They have no property, no other installment plans, and work in an unskilled-resident job. They have one existing credit at the bank and two dependents to support. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM, with a credit history of repaying existing credits on time. They are borrowing 1881 DM for the purpose of buying a radio/television. Their savings account holds less than 100 DM, and they have been employed for 1 to 4 years. They have no other debtors or guarantors. The individual is a divorced/separated/married female, aged 44, with no other installment plans and residing in a rented house. They have one existing credit at the bank, work as an unskilled resident, and are responsible for one person. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"The individual is a 50-year-old divorced or separated or married female, who has been employed for 1 to 4 years as a skilled employee or official. They have one existing credit at the bank and no other installment plans. They do not own any property, live in a free housing arrangement, and have been at their current residence for 4 years. The individual has no telephone, one co-applicant, and is a foreign worker. Their existing checking account balance is between 0 and 200 DM, with savings of 100 to 500 DM. They have paid back previous credits on time. The purpose of their credit is for a radio or television, with a credit amount of 2671 and an installment rate of 4%. They are liable to provide maintenance for one person.###\nHence this label was No."
"This individual has no checking account and a history of delayed payments. They took a loan for a radio/television, amounting to 1478. Their savings are less than 100 DM, and they have been employed for 1 to 4 years. The installment rate is 4% of their disposable income. They are a married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 3 years and own real estate. At 33 years old, they have two existing credits at the bank and work as a skilled employee/official. They are responsible for one person's maintenance and do not have a telephone. Despite being a foreign worker, they have a stable financial profile.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee, having worked for 4 to 7 years. He has a good credit history with existing credits paid back duly. He lives in his own home, which is a real estate property that he has owned for 4 years. He has savings of less than 100 DM and a moderate credit amount of 3060. He has no other debtors or guarantors, and no other installment plans. At 28 years old, he has 2 existing credits at the bank and is liable to provide maintenance for one person. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual is a 22-year-old female who is divorced/separated/married. She has a good credit history with existing credits paid back duly. She has a small amount of savings (< 100 DM) and a low installment rate of 4%. She has been employed for less than a year as a skilled employee/official. She resides in a rented property with one other person. She has no other debtors/guarantors, installment plans, or telephone. She has one existing credit at the bank and is a foreign worker. The purpose of the credit is for furniture/equipment.###\nHence this label was Yes."
"This individual has less than 0 DM in their checking account, a credit history of critical accounts/other credits, and has been employed for 7 or more years. They are seeking a loan for furniture/equipment, have a credit amount of 1478 DM, and have savings of less than 100 DM. They are a single male, 44 years old, with no other debtors or guarantors. They own their own home, have 2 existing credits at the bank, and work as a skilled employee/official. They have 2 people they are financially responsible for, a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and an unknown/savings account. They have been repaying existing credits on time. They are looking to finance a new car and have a stable employment history of 1 to less than 4 years. Their disposable income has a 4% installment rate. They are a 34-year-old single male with no other debtors or guarantors. They reside for free in a property of unknown ownership. They have one existing credit at this bank and work as a skilled employee/official. They are liable for maintaining two people and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been paying existing credits on time. They took a loan of 2301 DM for furniture/equipment and have savings between 100 and 500 DM. Their employment is less than a year, with an installment rate of 2%. They are a divorced/separated/married female, living in rented housing. They have no other debtors/guarantors and no other installment plans. With one existing credit, they have been living in their current residence for 4 years. A skilled employee, aged 22, with one dependent, they have a building society savings agreement/life insurance and no telephone. Despite being a foreign worker, they have a good credit history.###\nHence this label was Yes."
"The individual has no checking account and is unemployed. They have a good credit history with existing credits paid back duly. The purpose of the credit is for furniture/equipment. They have savings of less than 100 DM and own a car or other property. The credit amount is 10974 and the installment rate is 4% of disposable income. The person is a 26-year-old divorced/separated/married female. They have no other debtors or guarantors and reside in their own housing for the past 2 years. The individual has 2 existing credits at the bank and holds a management/self-employed/highly qualified employee/officer position. They have no other installment plans and are liable to provide maintenance for one person. Additionally, they have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"The individual in this example has a checking account with balance less than 0 DM, has a good credit history, and has been paying back existing credits on time. They intend to use the credit for purchasing a radio/television. The credit amount requested is 1282. They have savings between 100 and 500 DM, have been employed for 1 to 4 years, and have a low installment rate of 4% of disposable income. The individual is female, divorced or separated, owns a car or other property, and is 32 years old. They have no other debtors or guarantors, live in their own home, and have no other installment plans. The individual has been living at their current residence for 2 years, has 1 existing credit at the bank, and works in an unskilled resident job. They have one person dependent on them for maintenance, do not have a telephone, and are a foreign worker.###\nHence this label was No."
"This individual has no current checking account and has a good credit history with existing credits paid back on time. They are looking to finance furniture or equipment with a credit amount of 1574. Their savings account/bonds hold less than 100 DM. They have been employed for 1 to less than 4 years and have a low installment rate on their disposable income. The individual is a 50-year-old single male with no other debtors or guarantors. They have resided in their current home for 2 years and own real estate. They have no other installment plans, one existing credit at this bank, and work as a skilled employee or official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has no existing checking account and unknown savings. They have been employed for 1 to less than 4 years as a skilled employee/official. Their credit history shows a delay in paying off debts in the past. The purpose of the credit is for business, with a credit amount of 2978. They are single male, 32 years old, owning a real estate property, living in their own house for 4 years. They have no other debtors/guarantors or other installment plans. Their disposable income installment rate is 4%, with 2 existing credits at the bank. They have a telephone registered under their name and are a foreign worker. They are responsible for providing maintenance for 2 people.###\nHence this label was Yes."
"This individual has no checking account and a credit history of critical account/other credits existing. They took a loan for a radio/television, amounting to 1503. Their savings are less than 100 DM, and they have been employed for 4 to less than 7 years. With an installment rate of 2%, this male is single and has no other debtors/guarantors. They have been residing in real estate for 1 year, are 42 years old, and have no other installment plans. They own their own house, have 2 existing credits at the bank, and work as an unskilled resident. They are liable for providing maintenance for 2 people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 33-year-old divorced or separated or married female skilled employee, who has been living in their own residence for 2 years. They have a good credit history with existing credits paid back duly till now. They have a stable present employment since 1 to less than 4 years and a moderate installment rate in percentage of disposable income. Their credit amount is 1042 DM for a new car purpose. They have one existing credit at the bank and no savings account. They have a building society savings agreement or life insurance as property. They have no other debtors or guarantors, installment plans, telephone, or savings account. They are a foreign worker with one person being liable to provide maintenance for.###\nHence this label was No."
"This individual has a checking account balance of at least 200 DM and has a credit history of paying back existing credits on time. They are taking out a new car loan for a duration of 24 months with a credit amount of 947. Their savings are less than 100 DM and they have been employed for 4 to 7 years. The installment rate for the loan is 4% of their disposable income. The person is a 38-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 3 years and have unknown/no property. The individual has one existing credit at this bank, a skilled job, and two dependents. They have no telephone and are a foreign worker.###\nHence this label was No."
"The individual is a 55-year-old single male, currently unemployed. He has all his credits at the bank paid back duly and is considered a good credit risk. He is looking to purchase a used car and has a duration of 42 months to repay a credit amount of 9283 DM. His existing checking account holds between 0 and 200 DM, with savings of less than 100 DM. He has no other debtors or guarantors and no property. He has been living rent-free for 2 years and has one existing credit at the bank. He works in a management or self-employed position and has one person dependent on him for maintenance. He has a telephone registered in his name and is a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old divorced/separated/married female who has no checking account and unknown/no savings account. She has been employed for less than a year as a skilled employee/official. She owns a real estate property and has been living at the current residence for 1 year. She has one existing credit at the bank with a credit amount of 874 for domestic appliances. She has no other installment plans or debtors/guarantors. The installment rate in percentage of disposable income is 4, and she has no telephone. She is a foreign worker with one person to provide maintenance for.###\nHence this label was Yes."
"The individual is a 31-year-old single male, working as a skilled employee/official for at least 7 years. He has an existing checking account with a balance of less than 0 DM and no savings account. He has one ongoing credit, which he has been repaying duly. The purpose of his credit is to purchase furniture/equipment, and the credit amount is 6350. He has no other debtors or guarantors, no other installment plans, and no telephone. He lives in his own house, has been residing there for 4 years, and has a building society savings agreement/life insurance. He has a 4% installment rate based on his disposable income. Additionally, he is a foreign worker and is liable to provide maintenance for one person.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a good credit history with existing credits paid back on time. They are taking a loan of 7882 for furniture/equipment. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their monthly installment rate is 2% of disposable income. The person is a 45-year-old single male with a guarantor for debts. They have been living in their current residence for 4 years and have a building society savings agreement/life insurance. They have one existing credit at the bank and work as a skilled employee/official. They provide maintenance for 2 people and have no other installment plans. They live in a free housing arrangement and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for at least 7 years and have a good credit history with existing credits. They are taking a loan for a radio/television, with a credit amount of 976. The person is a 35-year-old single male, living in their own home for 4 years. They have no other debtors or guarantors and no other installment plans. Their job is a skilled employee/official and they are a foreign worker with no telephone. They have 2 credits at the bank and are liable to provide maintenance for 1 person.###\nHence this label was Yes."
"This individual is a single male with a stable job and no dependents. He has a small amount of savings and a modest credit amount. He has had existing credits at a bank for 2 years and has been living in his current residence for 4 years. Despite having a lower income and no telephone, he is a good credit risk as he is a skilled employee with a steady income.###\nHence this label was No."
"This individual has a status of existing checking account as less than 0 DM, with a credit history of critical account/other credits existing. They are looking to finance a new car with a credit amount of 1602 DM. Their savings amount is less than 100 DM and they have been employed for at least 7 years. They have a low installment rate of 4% of disposable income. The individual is a married/widowed male, has no other debtors/guarantors, and has been residing at their current residence for 3 years. They own a car or other property, are 30 years old, and have no other installment plans. They live in their own home, have 2 existing credits at this bank, and work as a skilled employee/official. They are responsible for providing maintenance for 1 person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, aged 48, who has been in her current job as an unskilled resident for over 7 years. She has a good credit history with no critical accounts and currently has 2 existing credits at the bank. She lives in a rented house with one dependent and has been at her current residence for 4 years. She has a savings account with less than 100 DM and a checking account with a balance between 0 and 200 DM. She has a radio/television loan and another installment plan at the bank. With a credit amount of 1795 and an installment rate of 3%, she satisfies her financial obligations responsibly. She has a guarantor for other debts and is registered for telephone services under her name. As a foreign worker, she is considered a good credit risk.###\nHence this label was Yes."
"This individual has no checking account and has existing credits paid back duly. They are looking to purchase a new car with a credit amount of 2390. Their savings account status is unknown. They have been employed for at least 7 years and have a low installment rate. The individual is a 50-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 3 years and own a car or other property. They have no other installment plans, own their own home, and have a skilled job. Additionally, they have one existing credit at the bank and are responsible for one person's maintenance. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has been in their current employment for 4 to 7 years. They have a critical credit history with other existing credits, and they are seeking a loan for a used car. The credit amount requested is 6187 DM. They have savings between 100 and 500 DM, no other debtors or guarantors, and they live in a rented property. The individual is a 24-year-old married or widowed male, with no other installment plans and no telephone. They have two existing credits at the bank, a stable job as a skilled employee or official, and one person dependent on them for maintenance. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female in their mid-thirties, working in a managerial or self-employed position. They have a good credit history, with existing credits paid back duly. They reside in a rented house and have been living in the current residence for one year. The individual has one existing credit at the bank and no other installment plans. They have a moderate installment rate and a moderate credit amount for the purpose of furniture or equipment. They have a small amount of savings in their account and maintain a checking account with a balance between 0 and 200 DM. They have no other debtors or guarantors and no telephone. They are a foreign worker with one dependent.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history. They are requesting a loan for a radio/television. The credit amount is 9566, with savings of less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate. The individual is female, divorced/separated/married, with no other debtors/guarantors. They have been living at their current residence for 2 years and own a car or other property. At 31 years old, they have existing credits at the bank, a stable job, and are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had credit issues in the past. They are borrowing money for educational purposes and have a small credit amount of 1597. They have less than 100 DM in savings and have been employed for over 7 years. With a moderate installment rate, this single male has no other debtors or guarantors. They have been residing at their current address for 4 years and have no property. At 54 years old, they have no other installment plans and live in free housing. They have two existing credits at this bank and work as a skilled employee. They are responsible for providing maintenance for two individuals and do not have a telephone. Despite being a foreign worker, they are seeking a loan with the hope of improving their financial situation.###\nHence this label was Yes."
"The individual is a divorced or separated woman in her early 60s, who has been employed for 4 to 7 years as a skilled employee. She has no checking or savings account, owns a car or other property, and lives in her own home. She has one existing credit at the bank and no other installment plans. She is responsible for providing maintenance for one person. She has no other debtors or guarantors, no telephone, and is a foreign worker. The purpose of the credit is for education, with a duration of 12 months and a credit amount of 2012.###\nHence this label was Yes."
"This individual is a 66-year-old divorced/separated/married female, with a stable job as an unskilled resident. She has no other debtors/guarantors and owns her own home. She has one existing credit at the bank and has been living at her current residence for 3 years. The individual has a savings account/bonds with a balance between 500 and 1000 DM and a checking account with a balance between 0 and 200 DM. She has no other installment plans or telephone. She is a foreign worker and has demonstrated a good credit history by paying back existing credits duly. The credit amount she is applying for is 790 DM, and she has one person liable to provide maintenance for.###\nHence this label was Yes."
"This individual has a stable financial standing with a moderate credit amount. They have a history of delayed payments but currently hold a good job with long-term employment. They have savings and own a car or other property. Despite having existing credits and people to provide for, they manage their finances well. Overall, they appear to be a reliable and responsible individual with potential for good credit risk.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with all existing credits paid back on time. They are looking to make a purchase related to radio/television. The credit amount requested is 1595. Their savings amount is less than 100 DM and they have been employed for 4 to 7 years. They have a low installment rate in relation to their disposable income. The individual is a single male, debt-free with no other debtors or guarantors. They have been residing in their current residence for 2 years and own their own home. With one existing credit at the bank, they are a skilled employee/official and have two dependents. They do not have any other installment plans in place. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female, aged 21, who has been employed for 1 to less than 4 years as a skilled employee/official. She has no checking account, unknown/no savings account, and no other debtors/guarantors. She has one existing credit at the bank and has been residing in her own home for 2 years. The purpose of her credit is for a radio/television, and the credit amount is 886. She has no other installment plans, no telephone, and no foreign worker status. Her installment rate is 4% of disposable income, and she is liable to provide maintenance for one person.###\nHence this label was Yes."
"The individual does not have an existing checking account and has a good credit history. They are taking a loan for a used car with a credit amount of 2569. They have savings between 500 and 1000 DM and have been employed for 1 to 4 years. Their disposable income installment rate is 4%. The individual is a single male, has no other debtors or guarantors, and has lived at their current residence for 4 years. They own a car or other property, are 24 years old, and have no other installment plans. They own their own home, have one existing credit at the bank, and work as a skilled employee/official. They are single and liable for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual in this example has a status of existing checking account less than 0 DM, has a credit history of paying back all credits at the bank duly, and is seeking credit for business purposes. They have a credit amount of 7685 and savings of less than 100 DM. The individual has been employed for 4 to 7 years, with an installment rate of 2% of disposable income. They are female, divorced/separated/married, with a guarantor for other debtors. They have been residing at their current residence for 4 years and own a car or other property not specified. The individual is 37 years old, with no other installment plans, living in a rental property. They have one existing credit at this bank and are a skilled employee/official. They have one person liable for maintenance, no telephone, and are a foreign worker.###\nHence this label was No."
"This individual is a 22-year-old female who is divorced/separated/married and is a skilled employee/official. She has a stable job, owns her own house, and has a telephone registered under her name. She has a good credit history with existing credits paid back duly till now. She has a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and has no other debtors/guarantors. Her credit amount is 1567, and she is looking to use it for a radio/television purchase. She has been at her current employment for 1-4 years, has a low installment rate in percentage of disposable income, and no other installment plans. She has been living at her current residence for 1 year and is the sole provider for maintenance. Additionally, she is a foreign worker.###\nHence this label was Yes."
"The individual is a 27-year-old single male who is unemployed but a skilled employee or official. He has a good credit history with no other debts or guarantors, owning his own home with a car or other property. He has a stable residence for 4 years with 1 existing credit at the bank. He is financially responsible, with a moderate credit amount, savings, and installment rate. He has no other installment plans, but is liable to provide maintenance for one person. He does not have a telephone, but is a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has been in their current job for over 7 years. They took a 16-month loan for a new car, with a credit amount of 2625. Their savings account holds less than 100 DM and they have a building society savings agreement/life insurance. The person is a 43-year-old single male, with one existing credit at the bank. They have a guarantor and live in a rented house. The individual works as a skilled employee/official, has one dependent, a registered telephone, and is a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old divorced/separated/married female with a stable job as a skilled employee/official. She has been living in her current residence for 4 years and has a checking account balance of less than 0 DM. Despite having no savings account, she has managed to pay back her existing credits duly. She is looking for a loan of 1200 for education purposes and has no other debtors/guarantors. Her income allows her to afford a 4% installment rate. She has one existing credit at the bank and is the sole provider for one person. She has a telephone registered under her name, lives in a rented house, and has a building society savings agreement/life insurance as a property. In addition, she has a bank installment plan and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has been employed for at least 7 years, and is looking to finance a used car. They have a good credit history with existing credits at another institution. With a moderate installment rate and a decent credit amount, they have managed to save some money, although not a significant amount. Despite not owning any property, they live in a free housing arrangement. At 38 years old, they are a single, male in a managerial or highly qualified position. They have three existing credits at this bank and are responsible for providing maintenance for two people. Additionally, they have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with a moderate credit amount and a good credit history. They have been employed for a long time and have a low installment rate. Their personal status is male and divorced, with no other debtors or guarantors. They own real estate and have a few existing credits. They are a skilled employee with one dependent, owning their own home. They have a telephone registered in their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has not taken any credits previously, but has paid back all credits duly. They are looking to purchase furniture/equipment and require a credit amount of 2759. They have savings of less than 100 DM and have been employed for at least 7 years. The individual's disposable income installment rate is 2, and they are a single male aged 34. They have no other debtors or guarantors and have been residing in their own property for 4 years. They have a building society savings agreement/life insurance. The individual has no other installment plans, 2 existing credits at the bank, and is a skilled employee/official with one person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old female who is divorced/separated/married. She has no checking account and unknown/no savings account. She has been employed for 1 to less than 4 years as a skilled employee/official. She has one existing credit at the bank and has been living in her current residence for 4 years. She owns a car or other property not specified in the attributes. She has no other debtors/guarantors, no other installment plans, and no telephone. She does not have any dependents and is a foreign worker. Additionally, her credit history shows that she has paid back existing credits duly up to now. She is looking to borrow 2394 currency units for the purpose of radio/television, with an installment rate of 4% of disposable income.###\nHence this label was Yes."
"This individual is a female, divorced or separated or married, aged 29, who has been employed for 1 to less than 4 years as a skilled employee/official. She has a good credit history with a critical account/other credits existing elsewhere and a stable financial situation with a savings account below 100 DM. She is looking to finance a new car with a credit amount of 3499 and has no other installment plans. She lives in her own real estate property with one co-applicant. She has been residing at the current address for 2 years and has two existing credits at this bank. She has no telephone but is a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a credit history of timely payments, and is looking to finance a new car. They have a credit amount of 4817 and savings of less than 100 DM. Currently employed for 4 to 7 years, they have a low installment rate and are a single male. There is a co-applicant as another debtor, and they have been living in their current residence for 3 years. Their property includes a building society savings agreement or life insurance. At 31 years old, they have no other installment plans and own their own home. They have one existing credit at the bank, a skilled job, and are liable for providing maintenance to one person. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"This individual has a stable financial situation with less than 0 DM in their checking account, a credit history of paying back existing credits on time, and a long-standing employment of at least 7 years. They are looking to finance furniture/equipment with a credit amount of 2712. Their savings are less than 100 DM and they have a low installment rate of 2% of disposable income. They are a 41-year-old single male, with no other debtors or guarantors. They have been residing in their current place for 2 years and own their housing. Their job is a skilled employee/official and they have one existing credit at the bank. They are responsible for providing maintenance for 2 people and are a foreign worker without a telephone.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM and has not taken any credits or has paid them all back on time. They are seeking credit for a business purpose, with a credit amount of 6289. Their savings are below 100 DM and they have been employed for less than a year. The individual has a low installment rate, is a divorced or separated male, and has no other debtors or guarantors. They have been living in their current residence for 1 year, own a building society savings agreement or life insurance, and are 33 years old. They have no other installment plans, own their own home, have 2 existing credits at the bank, and work as a skilled employee or official. They have 1 person to provide maintenance for, no telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown/no savings account. They have been repaying existing credits in a timely manner. The purpose of the loan is to purchase a used car. They have been employed for at least 7 years, with a stable job in management/self-employment/highly qualified position. The individual is a 46-year-old single male, owning a real estate property and living in their own house for 4 years. They have no other debtors or guarantors and no other installment plans. The installment rate for the loan is 4% of their disposable income. This individual has one existing credit at the bank and is responsible for one dependent. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a history of delayed payments. They are seeking credit for a business purpose and require a loan for 36 months. Their credit amount is 7980. They have no savings account and have been employed for less than a year. Their personal status is a single male, aged 27, with no other debtors or guarantors. They have been living in their current residence for 4 years, and their housing situation is rent. They have no other installment plans and two existing credits at the bank. The individual is a skilled employee, with one person dependent on them. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a critical credit history with existing credits at another bank. They are borrowing money for a radio/television, with a credit amount of 618 and savings below 100 DM. Presently employed for at least 7 years, with a low installment rate. A 56-year-old single male, living in their own real estate property for 4 years. They have no other debtors or guarantors, no other installment plans, and no telephone. They have a skilled job, one existing credit at this bank, and are the sole provider for one person. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a single male, aged 24, with a good credit history of repaying all credits at the bank duly. He has a checking account with less than 0 DM, savings of less than 100 DM, and has been employed for 4-7 years. He took a credit amount of 1546 for the purpose of buying a radio/television. He has a guarantor for other debts, lives in a rented house, and has one existing credit at the bank. He works as an unskilled resident and is responsible for providing maintenance for one person. He has no telephone but is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been in their current employment for over 7 years. They have a good credit history with existing credits paid back on time. The purpose of the loan is for a radio/television. They have savings between 500 and 1000 DM and own a building society savings agreement/life insurance. The individual is a 47-year-old single male, with one existing credit at the bank. They work as a skilled employee/official and have one person dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with balance less than 0 DM and a good credit history. They are taking a loan for a radio/television, with a credit amount of 1345. Their savings account holds less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate. The individual is a married or widowed male, has no other debtors or guarantors, and has been residing in their current location for 3 years. They own real estate, are 26 years old, and have other installment plans with a bank. The individual is a skilled employee/official with one existing credit at the bank. They are liable for one person's maintenance, do not have a telephone, and are a foreign worker.###\nHence this label was No."
"This individual is a 22-year-old female who is divorced or separated or married. She has no existing checking account and is currently unemployed. She has paid back her existing credits duly till now and is looking to borrow a credit amount of 433 for the purpose of purchasing a radio/television. Her savings amount is less than 100 DM and she has no other installment plans. She has a co-applicant as another debtor/guarantor. She resides in a rented house, has been at her current residence for 4 years, and has one existing credit at the bank. She works as a skilled employee/official and is responsible for providing maintenance for one person. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM and has been employed for 1 to less than 4 years. They have paid back existing credits on time and are looking to borrow 2100 for a radio/television. Their savings are less than 100 DM and they have a single co-applicant. They have been living in their current residence for 2 years, own real estate, and have a stable job as a skilled employee/official. At 37 years old, they have no other significant debts or financial obligations. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a modest amount of money in their checking account, a short credit history with previous credits paid back on time. They are taking out a small loan for a business purpose and have significant savings. They have been employed for less than a year and have a low installment rate. The individual is a married or widowed male, with no other debtors or guarantors. They own real estate and have been living at their current residence for 3 years. At 36 years old, they have a bank installment plan, own their own home, and hold a skilled job. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for at least 7 years. They have paid back all credits at a bank duly and are looking to finance a radio/television purchase. They have savings between 100 and 500 DM, own a car or other property, and reside in their own home. With a credit amount of 1569 and an installment rate of 4%, they have one existing credit at this bank and no other debtors or guarantors. They are a 34-year-old single male with a bank installment plan, working as an unskilled resident with 2 people to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM and has a good credit history. They are looking to use a loan of 3509 for a radio or television purchase. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their disposable income installment rate is 4%, and they are a divorced/separated/married female with a guarantor. They have been living in their current residence for 1 year and own real estate. At 25 years old, they have no other installment plans, a skilled job, and no phone. Additionally, they have one existing credit at the bank and one dependent for maintenance, and they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a critical credit history with existing credits elsewhere. They are seeking a loan for a radio/television. With a credit amount of 2743 and savings less than 100 DM, they have been employed for over 7 years. Their personal status is a single male, with no other debtors or guarantors. They have been residing in their current home for 2 years and own a car or other property. At 29 years old, they have no other installment plans and no telephone. As a skilled employee, they have 2 existing credits at this bank and one person to provide maintenance for. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account with 0 to less than 200 DM balance. They have a credit history of a critical account or other credits existing outside of this bank. The purpose of their credit is for a new car. They are borrowing 884 DM. Their savings account/bonds have less than 100 DM. They have been employed for at least 7 years. The installment rate is 4% of disposable income. The individual is a single male, with no other debtors or guarantors. They have been residing in their current residence for 4 years. Their property includes a car or other assets not mentioned in the attributes. At 36 years old, they have another installment plan with a bank. They own their own home and have one existing credit at this bank. This individual is a skilled employee/official with two people relying on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a 58-year-old divorced/separated/married female who has been in her current employment for at least 7 years. She has a good credit history with no other debts or guarantors. She has been living in her current residence for 4 years, in a property with unknown/no ownership. She has 2 existing credits at the bank and is currently paying off a car loan of 6143 DM with an installment rate of 4%. She has savings of less than 100 DM and no other significant assets. She works in an unskilled resident job, has no telephone, and lives in a free housing arrangement. She is responsible for providing maintenance for one person and is a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM and has had existing credits paid back duly. They are looking to finance a new car, with a credit amount of 1330. Their savings account holds less than 100 DM and they have been employed for less than a year. They have no other debtors or guarantors. The individual lives in their own real estate property and is a single 26-year-old male. They have a low installment rate of 4% of disposable income, one existing credit at this bank, and no other installment plans. They have been residing at their current residence for 1 year, and have a skilled job as an employee or official. They have no telephone but are a foreign worker. Additionally, they are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual is a 25-year-old single male with no checking or savings account. He has been employed for less than a year as a skilled employee, and has been living in his own residence for 2 years. He has no other debtors or guarantors, and no other installment plans. His credit history shows that he has been repaying existing credits on time. The purpose of his credit application is for a radio/television, with a credit amount of 3105. He has 2 existing credits at this bank and no telephone. He is a foreign worker and is responsible for providing maintenance for one person.###\nHence this label was Yes."
"The individual is a single male, aged 48, who has been employed for over 7 years. He has a good credit history with no other existing debts. He has a savings account with less than 100 DM and owns a property. The purpose of the credit is for a radio/television, and the credit amount is 1743. He has no other installment plans and no telephone. He has 2 existing credits at the bank and is liable for providing maintenance for 1 person. He is an unskilled resident with a foreign worker status.###\nHence this label was Yes."
"The individual has no checking account and has been employed for 4 to 7 years. They took a loan for a radio/television and the credit amount is 1554. Their savings amount is less than 100 DM and they have no other debts or guarantors. The individual is a divorced/separated/married female, 24 years old, with no other installment plans. They live in a rented house and have 2 existing credits at the bank. The individual is a skilled employee/official with one dependent. They have a telephone and are a registered foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has no history of taking credits. They are looking to buy a new car with a credit amount of 5003. Their savings account status is unknown. They have been employed for 1 to less than 4 years and have a low installment rate. The individual is a female who is divorced, separated, or married. They have no other debtors or guarantors. Their current residence has been for 4 years, and they have a property under a building society savings agreement or life insurance. At 29 years old, they have one existing credit at the bank and work as a skilled employee or official. They have one person they provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has had critical accounts or other existing credits in the past. They are looking to purchase a used car with a credit amount of 3850. Their savings amount is less than 100 DM and they have been employed for 4 to 7 years. They have a moderate installment rate and are a single male. There are no other debtors or guarantors involved. They have been living in their current residence for 1 year and own a car or other property. At 27 years old, they have no other installment plans and live in their own home. They have 2 existing credits at this bank and work as a skilled employee. They are responsible for providing maintenance to one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this data is a single male, aged 30, who has been employed for 1 to 4 years as a skilled employee/official. He has a good credit history with existing credits paid back duly. His existing checking account balance is between 0 and 200 DM, and he has savings between 100 and 500 DM. He is looking to borrow 5866 DM for a new car, and has no other debtors/guarantors. He has been residing in his current residence for 2 years, owns his own home, and has a telephone registered under his name. Additionally, he has 2 existing credits at the bank, an installment rate of 2% of disposable income, and no other installment plans. He is the sole provider for 1 person and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a credit history of critical account/other credits existing. They are looking to borrow a relatively small amount for a new car. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their personal status is a divorced, separated, or married female. They have no other debtors or guarantors and have been living in their current residence for 1 year. They own real estate and are 37 years old. They have no other installment plans, one existing credit at this bank, and work as a skilled employee/official. They are responsible for providing maintenance for 2 people and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, a credit history of delayed payments, and a credit amount of 4370. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their disposable income installment rate is 3, and they are a single male. They have no other debtors or guarantors, own their housing, and have 2 existing credits at the bank. The individual is a skilled employee, aged 26, with 2 dependents. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual does not have an existing checking account and has been employed for 1 to less than 4 years. They are looking to finance a new car with a credit amount of 1163. Their savings amount falls between 500 and less than 1000 DM. They have no other existing credits at this bank and own real estate. The individual is a 44-year-old single male, working as a skilled employee or official. They have been residing at their current residence for 4 years and have no other debtors or guarantors. Additionally, they have no other installment plans, no other people to provide maintenance for, own a telephone under their name, and are a registered foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown or no savings account. They have been repaying existing credits on time, have been employed for 4 to 7 years, and have a low installment rate. The purpose of the credit is for furniture/equipment. They have no other debtors or guarantors, reside in rented housing, and own real estate. This person is a 33-year-old divorced/separated/married female with one existing credit at the bank. They work as an unskilled resident and have no telephone. Overall, they are considered a good credit risk and are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and a credit history with critical accounts/other credits at different banks. They are requesting a loan for furniture/equipment, amounting to 4042 credits. Their savings range from 500 to less than 1000 DM, and they have been employed for 1 to less than 4 years. With a 4% installment rate, they are a single male with no other debtors/guarantors. They have been residing in their current location for 4 years, owning real estate. At the age of 36, they have no other installment plans and their housing status is 'own'. They have 2 existing credits at this bank and work as a skilled employee/official. Responsible for providing maintenance for one person, they have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance less than 0 DM and has a good credit history. They took a 15-month loan to buy a new car, amounting to 1721 DM. They have savings of less than 100 DM and have been employed for less than a year. Their monthly installment rate is 2% of their disposable income. They are a 36-year-old single male, with no other debtors or guarantors. They have been living in their own real estate property for 3 years. They have a skilled job and one existing credit at the bank. They are responsible for providing maintenance for one person and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unspecified amount of savings. They have been paying back existing credits on time. The purpose of this credit is for business. They have been employed for 1 to less than 4 years. The credit amount is 3914. They are male, divorced/separated, and own real estate. Their age is 38 years and they have one existing credit at this bank. They work as a skilled employee/official. There is nobody else responsible for providing maintenance. They have a telephone and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been employed for over 7 years. They took a 18-month credit for a radio/television, amounting to 629 DM. Their savings fall between 500 to 1000 DM and they have a stable income, with a low installment rate of 4%. They are a single male, aged 32, with no other debtors or guarantors. They have a property in the form of a building society savings agreement/life insurance and own their own home. Additionally, they have 2 existing credits at the bank, work in a management role, and have one dependent. They have a registered telephone line and are a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old single male with no foreign worker status. He has a checking account with less than 0 DM, a credit history of paying back existing credits duly, and a credit amount of 1747. His savings account/bonds hold less than 100 DM, and he has been employed for less than a year. The purpose of his credit is for furniture/equipment. He has no other installment plans and owns his own home. He has one co-applicant and one existing credit at the bank. His installment rate is 4% of disposable income, and he has been living in his current residence for 1 year. His job is unskilled-resident, and he is responsible for providing maintenance to one person. He does not have a telephone.###\nHence this label was Yes."
"The individual is a single male in his 30s, working as a skilled employee with over 7 years of employment history. He has a good credit history with two existing credits at a bank. His current residence is owned real estate where he has been living for 3 years. He has a guarantor and no telephone. He is financially stable with savings below 100 DM and has a small credit amount for a new car. Additionally, he has no other debts, a moderate disposable income, and is responsible for providing maintenance for one person. He is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history of repaying existing credits on time. They took a loan of 1505 credits for the purpose of purchasing a radio/television. They have savings of less than 100 DM, have been employed for 1 to less than 4 years, and have a moderate installment rate. This person is a 32-year-old single male in a management or self-employed position. They have no other debtors or guarantors, live in a free housing situation, and have unknown or no property. They have no other installment plans, one existing credit at the bank, and one person to provide maintenance for. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a large amount of money in their checking account (>= 200 DM) and has been employed for at least 7 years. They have a good credit history with critical accounts but have other existing credits. The purpose of their credit is to buy a new car. They have a modest credit amount of 781 DM and some savings (< 100 DM). They have been living in their current residence for 4 years and do not own any property. At 63 years old, they are a single male, skilled employee with no other installment plans or debtors/guarantors. They live for free and have a telephone registered under their name. They have 2 existing credits at the bank and are liable to provide maintenance for 1 person. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history of paying back existing credits on time. They took a loan of 2507 credits for a new car, and have savings between 500 and 1000 DM. The person has been employed for over 7 years, is single, and a male. They have no other debtors or guarantors, and have been residing at their current residence for 4 years. Their property status is unknown/no property, and they are 51 years old. They have no other installment plans, live in a house for free, and have one existing credit at the bank. The individual has an unskilled-resident job, is responsible for one person's maintenance, does not have a telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has been with their current employer for 4 to less than 7 years. They have paid back all credits at this bank on time. The purpose of the credit is for a radio/television. They do not have any savings in their account. The individual's monthly installment rate is 4% of their disposable income. They are male, single, and have no other debtors or guarantors. They have been residing in their current residence for 4 years and own a car or other property. At 49 years old, they have one existing credit at this bank and work as an unskilled resident. They have no telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM and a credit history of paying back existing credits. They are seeking a loan for furniture or equipment, with a credit amount of 2659 DM. They have savings of at least 1000 DM and have been employed for 1 to less than 4 years. The installment rate for the loan is 4% of their disposable income. The individual is a 28-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. They have one existing credit at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been paying back existing credits on time. They are looking to finance furniture/equipment with a credit amount of 2708. Their savings are less than 100 DM and they have been employed for less than a year. They have a low installment rate relative to their disposable income. This 27-year-old male, who is single, has no other debtors or guarantors. They have been residing in their own home for 3 years and have a building society savings agreement/life insurance. They have two existing credits at this bank and work as an unskilled resident. They are liable to provide maintenance for one person and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual is a married/widowed male, unemployed, aged 40, with 3 existing credits at the bank and 2 people to provide maintenance for. They have a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and own their house. They have a critical credit history, have taken a business loan of 3590 DM, and are unemployed/unskilled with no other installment plans. They have been living at their current residence for 3 years, have a car or other property, and a telephone registered under their name. They have a foreign worker status and no other debtors/guarantors.###\nHence this label was Yes."
"The individual has a current checking account with less than 0 DM balance. They have a good credit history with existing credits being paid back on time. The purpose of the credit is for a new car. The credit amount is 1442. They have savings of less than 100 DM and have been employed for 4 to less than 7 years. The installment rate is 4% of disposable income. The individual is a female who is divorced, separated, or married. There are no other debtors or guarantors. They have been living at their current residence for 4 years. They own a car or another type of property not specified. The individual is 23 years old with no other installment plans. They rent their housing and have 2 existing credits at the bank. Their occupation is a skilled employee or official. They are responsible for providing maintenance for 1 person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a checking account balance of less than 0 DM and has a good credit history with existing credits paid back on time. They are seeking a loan for education purposes. They have unknown or no savings, but a stable job for at least seven years. The credit amount requested is 1977 DM with a low installment rate. They are a 40-year-old single male with no other debtors or guarantors. They have been residing in their own home for four years and have no other installment plans. The individual has one existing credit at the bank and is a highly qualified employee. They are responsible for providing maintenance for one person, have a telephone, and are a registered foreign worker.###\nHence this label was No."
"The individual has no checking account and has been in their current employment for 4 to 7 years. They are seeking credit for furniture or equipment, with a credit amount of 1585. Their savings are less than 100 DM and they have no other installment plans. They are a 40-year-old single male, living in their own home for the past 3 years. They have 2 existing credits at this bank and work as a skilled employee. They have no other debtors or guarantors and no telephone. Additionally, they have a building society savings agreement or life insurance, and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with less than 0 DM in their checking account. They have a good credit history with existing credits paid back on time. The purpose of their credit is for education, with a relatively small amount of 684 DM. Their savings are also modest, being less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate in percentage of disposable income. The individual is a single male, without any other debtors or guarantors. They have been residing at their current residence for 4 years and own a car or other property. At 40 years old, they have no other installment plans and live in a rented house. They have one existing credit at the bank and work as an unskilled resident. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a married/widowed male, aged 20, with a stable job as a skilled employee/official. He has been living in his own home for 1 year and has been with the same employer for 4-7 years. He has a good credit history with existing credits paid back diligently. His existing checking account has less than 0 DM balance and he has savings between 100 and 500 DM. He is looking for a loan of 674 DM for the purpose of purchasing a radio/television. He has no other installment plans or debtors/guarantors. He has 1 existing credit at the bank and is responsible for providing maintenance for 1 person. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual does not have a checking account and has a good credit history of repaying existing credits. They are taking a 36-month loan for a new car, with a credit amount of 3079. Their savings account status is unknown. They have been employed for 1 to less than 4 years and have a low installment rate on disposable income. This person is a 36-year-old single male, with no other debtors or guarantors. They have been residing in their own real estate property for 4 years. With one existing credit at the bank, they are a skilled employee with no other installment plans. They have 1 dependent and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has no current savings account. They have been employed for over 7 years and have a stable income. They are a single male, own their own home, and have no other debtors or guarantors. They have two existing credits at the bank and have been living at their current residence for 4 years. They are a skilled employee, aged 38, with no other installment plans. They do not have a telephone but are a foreign worker. Their credit history shows that they have paid back existing credits on time. They are looking to retrain and require a credit amount of 754 for this purpose.###\nHence this label was Yes."
"This individual is a female who is divorced/separated/married. She does not have a checking account and is unemployed. She has been living in her own home for 2 years. The purpose of her credit is to buy a new car. She has no other existing credits at this bank and has a small credit amount of 926 DM. She has savings of less than 100 DM and has a building society savings agreement/life insurance. She is 38 years old and has 1 person she is responsible for providing maintenance for. She has no other debtors/guarantors, no other installment plans, and no telephone. She is a foreign worker but is currently unemployed and unskilled.###\nHence this label was Yes."
"This individual is a 25-year-old divorced/separated/married female with a stable job as a skilled employee/official. She has been living in her current residence for 4 years and has 2 existing credits at the bank. She has no other debtors/guarantors, no telephone, and no savings above 100 DM. Her existing checking account has less than 0 DM, and she has been repaying her credits promptly. She took a credit amount of 1882 for the purpose of buying a radio/television. She has a moderate installment rate in percentage of disposable income and no other installment plans. She lives in a rented house, does not have a car, and is a foreign worker. She is responsible for providing maintenance for one person.###\nHence this label was No."
"The individual has a checking account balance of at least 200 DM and has a good credit history with existing credits paid back on time. They are looking to finance furniture/equipment with a credit amount of 1925. Their savings are less than 100 DM and have been employed for 1 to less than 4 years. They have a low installment rate relative to their disposable income. The individual is a single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. At 26 years old, they have no other installment plans, one existing credit at the bank, and work as a skilled employee or official. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a 22-year-old divorced/separated/married female who has been living in rented accommodation for 4 years. She has a stable job as a skilled employee/official and has been at her current job for less than a year. She has no other debtors/guarantors and no other installment plans. She has one existing credit at the bank and is responsible for providing maintenance for one person. She has a small amount of savings (< 100 DM) and has been able to pay back existing credits duly. She is looking to use a credit amount of 1366 for the purpose of purchasing a radio/television. Despite not having a telephone, she is considered a good credit risk and is a foreign worker.###\nHence this label was No."
"This individual is a 25-year-old divorced/separated/married female with a stable job as a skilled employee/official. She has been at her current job for over 7 years and has been living in her own home for 2 years. She has one existing credit at the bank and no other debts or guarantors. She has a good credit history of paying back existing credits duly. She has a moderate credit amount of 2762 DM and a low installment rate in percentage of disposable income. She has no savings account but owns a building society savings agreement/life insurance. She has a bank installment plan and a telephone registered under her name. She is also a foreign worker.###\nHence this label was No."
"This individual has a checking account with balance less than 0 DM and a good credit history. They are looking to borrow a small amount of money for a new car. They have some savings, have been employed for 1 to 4 years, and have a low installment rate for repaying the loan. The person is a 28-year-old single male with no other debtors or guarantors. They have been living in their current residence for 3 years and own their own home. The individual has a stable job as an unskilled resident and is responsible for one dependent. They do not have any other installment plans or a telephone, but they are a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of less than 0 DM and a good credit history. They are looking to borrow 900 credits for a new car. They do not have any savings. The individual has been employed for 1 to 4 years and has a moderate installment rate. They are a married or widowed male, with no other debtors or guarantors. They have been living at their current residence for 2 years and own their own home. The individual is 23 years old, with no other installment plans, and holds a skilled job. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been paying back existing credits on time. They took a loan for a radio/television, amounting to 3160 credits, with unknown savings. Employed for over 7 years, they have a 4% installment rate and live in their own house. A single male, 41 years old, with no other debtors, they have a building society savings agreement. They have one credit at the bank, no other installment plans, and one person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 20-year-old female who is divorced/separated/married. She has been employed for over 7 years as a skilled employee/official. She owns a car or other property and has been living in her current residence for 4 years. She has no other debtors or guarantors, no other installment plans, and no one else to provide maintenance for. She has one existing credit at the bank and has paid back all existing credits duly till now. She has a telephone registered under her name, savings of less than 100 DM, and a good credit history. Her purpose for the credit is for a radio/television, and the credit amount is 1967. She is a foreign worker and is considered a good credit risk based on these attributes.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 33, with no checking account but a credit history showing critical accounts/other credits. She has been employed for 7 years or more and has no savings account. The purpose of her credit is for a radio/television, with a credit amount of 797 and an installment rate of 4% of disposable income. She resides in her own property, has one existing credit at a bank, and has a building society savings agreement/life insurance as property. She has 2 people for whom she is liable to provide maintenance. She has a bank installment plan, an unskilled-resident job, no telephone, and is a foreign worker.###\nHence this label was No."
"This individual has a good credit risk based on the following attributes:\n- Has between 0 and 200 DM in their existing checking account\n- Has a credit history of delayed payments in the past\n- Wants the credit for business purposes\n- Is looking to borrow 9857 DM\n- Has between 100 and 500 DM in savings account/bonds\n- Has been employed for 4 to 7 years\n- Has a low installment rate in percentage of disposable income\n- Personal status is a single male\n- Has no other debtors or guarantors\n- Has been living at the current residence for 3 years\n- Has a building society savings agreement/life insurance\n- Is 31 years old\n- Has no other installment plans\n- Owns a house\n- Has 2 existing credits at the bank\n- Is an unskilled resident\n- Has 2 people that they are liable to provide maintenance for\n- Has a telephone registered under their name\n- Is a foreign worker###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for less than a year as a skilled employee, currently renting a home. They have one existing credit and have been living at their current residence for 4 years. At 31 years old, they are a divorced/separated/married female. They have no other debtors or guarantors, no other installment plans, and no telephone. They are a foreign worker with good credit history, seeking a car loan of 2901 over 10 months, with a low installment rate.###\nHence this label was Yes."
"This individual has a checking account balance of >= 200 DM and a credit history of delaying payments in the past. They are taking out a loan for the purpose of purchasing a radio/television. The credit amount is 683 DM. They have savings of less than 100 DM and have been employed for less than 1 year. Their installment rate is 2% of disposable income. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 1 year and own property in the form of a building society savings agreement/life insurance. The individual is 29 years old and has another installment plan with a bank. They live in their own home and have one existing credit at the bank. The individual is a skilled employee/official and is responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has had a critical credit history in the past, and is looking to finance a radio/television. They are applying for a credit amount of 338 DM with savings between 500 and 1000 DM. The individual has been employed for over 7 years, has a moderate installment rate, and is a single male in their 50s. They have no other debtors or guarantors, own their own home, and have two existing credits with the bank. The individual is a skilled employee with one dependent, no telephone, and is a foreign worker.###\nHence this label was Yes."
"The individual is a 23-year-old divorced or separated married female, working as a skilled employee or official for 4 to 7 years. She has no checking or savings account, owns real estate, and has no other installment plans. She has been residing at her current residence for 4 years, has 2 existing credits at the bank, and has no other debtors or guarantors. She is financially responsible, as she has no telephone or other people relying on her for maintenance. She has a good credit history and needs a loan of 996 credits for repairs. Additionally, she is a foreign worker.###\nHence this label was Yes."
"The individual is a 27-year-old single male with a stable job in management. He has no other debtors or guarantors and has been living in his current residence for 2 years. His existing checking account has less than 0 DM, and he has a small credit of 1422 for a new car. He has some savings below 100 DM and no other significant assets. He has a good credit history of paying back existing credits on time. He has a low installment rate and no other installment plans. He lives in a free housing and has one existing credit at the bank. He is responsible for providing maintenance for one person and has a registered telephone under his name. He is also a foreign worker.###\nHence this label was No."
"This individual is a 32-year-old single male with a stable job as a skilled employee, having been employed for 4 to 7 years. He has a good credit history with existing credits paid back duly. His current checking account balance is between 0 and 200 DM, and he has savings of less than 100 DM. The purpose of his credit is for a new car, with a credit amount of 6078. He has no other debtors or guarantors, no other installment plans, and owns his own house. He has been living at his current residence for 2 years and has one existing credit at the bank. He has no telephone, but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a loan for domestic appliances, and the credit amount is 1338. They have savings between 500 and 1000 DM and have been in their current employment for 1 to 4 years. The installment rate is 1% of disposable income. The individual is a male, divorced/separated, aged 62, with no other debtors or guarantors. They have been residing in their current place for 4 years and own real estate. They have no other installment plans and their housing status is own. With one existing credit at the bank, the individual is a skilled employee/official with one person to provide maintenance for. They do not have a telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job, residing in his own property. He has a good credit history with existing credits paid back on time. He has a moderate amount of savings and a small existing credit at the bank. With no other installment plans or telephone, he is looking to borrow a moderate amount for a radio/television. Being a guarantor for someone, he has no foreign worker status and no dependents. At 33 years old, he has been at his current job for 1-4 years and has been living in his current residence for 2 years.###\nHence this label was Yes."
"The individual in this dataset has a checking account balance of at least 200 DM. They have a credit history with critical accounts or other existing credits. The purpose of the credit is for a radio/television. The credit amount is 1347. They have an unknown or no savings account. Their employment has been ongoing for 4 to less than 7 years. The installment rate is 4% of disposable income. The individual is a single male. They have no other debtors or guarantors. They have lived at their current residence for 2 years. Their property includes a building society savings agreement or life insurance. The individual is 27 years old with no other installment plans. They own their own housing. They have 2 existing credits at this bank and work as a skilled employee/official. They are liable for providing maintenance for 1 person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 27-year-old female who is divorced/separated/married. She has a good credit history with a credit amount of 2132 for the purpose of furniture/equipment. She has a checking account with less than 0 DM and no savings account. She has been employed for less than 1 year as a skilled employee/official. She has a co-applicant and currently rents a property. She has 2 existing credits at the bank and has been living at her current residence for 3 years. She has no other installment plans, no telephone, and no foreign worker status. She has an installment rate of 2% of disposable income and one person liable for maintenance.###\nHence this label was Yes."
"This individual has a stable financial status with less than 0 DM in their existing checking account and a savings account balance between 500 and 1000 DM. They have been employed for over 7 years as a skilled employee/official and have a good credit history. The purpose of the credit is for a radio/television. They own real estate where they have been living for 1 year. With no other debts or dependents, this married/widowed male, aged 35, appears to be a reliable credit risk.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for 4 to 7 years, have a stable residence for 3 years, and own a car or other property. They are a single male, aged 37, with no other debtors or guarantors. They have one existing credit at the bank and work as a skilled employee. Their credit history shows existing credits paid back duly. The purpose of the credit is for a radio or television, with a credit amount of 10222. They have a 4% installment rate, utilize stores for other installment plans, and have a telephone registered under their name. Additionally, they have no one else to provide maintenance for and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has experienced delays in paying off debts in the past. They are seeking credit for a business purpose and require a relatively small amount of 2169 credits. Their savings are less than 100 DM, and they have been employed for 1 to 4 years. They have a moderate installment rate and are a married, 28-year-old male. They have no other debtors or guarantors and own their own home. They have one existing credit at the bank and work as a skilled employee. They have one person dependent on them for maintenance and have a telephone registered in their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a credit history of a critical account or other credits existing elsewhere, and is seeking credit for repairs. They have savings between 100 and 500 DM, have been employed for at least 7 years, and have a manageable installment rate. The person is a 48-year-old single male with a guarantor, living in their own real estate. They have no other debt or installment plans, two existing credits at the bank, and are a skilled employee. They have been residing at their current address for 4 years, have 2 people to support financially, do not have a telephone, and are not a foreign worker.###\nHence this label was Yes."
"The individual is a single male with a stable income for 1-4 years, owning a house and having a savings account with a balance of at least 1000 DM. They have a good credit history, no other debts or guarantors, and one existing credit. The purpose of the credit is for business, with a duration of 18 months and an amount of 1941 DM. They have no other installment plans, are unskilled but a resident worker, and responsible for one person's maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a female, divorced or separated, married, aged 30, with a stable job in management/self-employment/highly qualified employee/officer. She has a good credit history with critical accounts/other credits existing. She has a moderate credit amount of 5096 DM for furniture/equipment. She has a savings account with less than 100 DM and a stable income with 1-4 years in present employment. She owns a property, resides in her own home for 3 years, has no other debtors/guarantors, and no other installment plans. She has one existing credit at the bank, a telephone registered under her name, and is a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account of less than 0 DM and has had existing credits paid back duly till now. They are borrowing credit for the purpose of purchasing a radio/television. The credit amount is 6758 DM and they have savings of less than 100 DM. They have been employed for 1 to less than 4 years and have an installment rate of 3% of disposable income. The individual is a divorced/separated/married female. They have no other debtors/guarantors and have been residing at their current residence for 2 years. They own a car or other property not specified. Their age is 31 and they have no other installment plans. They own their own home and have one existing credit at this bank. The individual is a skilled employee/official and has one person they are financially responsible for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has a good credit history with a stable income and savings. They took out a moderate-sized loan for a new car and are financially responsible with no other ongoing debts. They are a divorced or separated male in their mid-thirties, with a secure job and ownership of their residence. They have a limited number of existing credits and are the sole provider for one person. Additionally, they have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 31, with no checking account but a car. He has been employed for 1 to less than 4 years as a skilled employee. He has no savings account, but owns a house and has a building society savings agreement/life insurance. He has one existing credit at the bank and no other installment plans. He has one person he is responsible for providing maintenance for. His credit history shows that he has paid back existing credits duly. He has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 44-year-old single male with no checking account. He has been employed for at least 7 years as a skilled employee or official. He does not have any other installment plans or debts with other debtors. He lives in a free housing arrangement and has been at his current residence for 4 years. His credit history shows critical accounts or other existing credits. The purpose of his credit is for repairs, with a credit amount of 5507. He has savings of less than 100 DM and no property under his name. He has 2 existing credits at the bank, with an installment rate of 3% of his disposable income. He is the sole provider for one person and does not have a telephone. Additionally, he is a foreign worker.###\nHence this label was Yes."
"The individual is a female in her thirties, divorced or separated, with a stable job in management or a similar position. She has been living in her own house for three years and has one existing credit at the bank. Despite not having significant savings, she has a good credit history of repaying previous loans on time. She is looking to purchase a radio or television and needs a credit amount of 7174 to do so. She has a moderate income, with an installment rate of 4%, and no other significant financial obligations. The individual has a registered telephone line and is a foreign worker. Overall, she appears to be a reliable credit risk based on the provided data.###\nHence this label was No."
"This individual has a status of existing checking account of less than 0 DM, with a credit history showing delays in past payments. They are borrowing for education, with a credit amount of 6887 DM. Their savings account/bonds hold less than 100 DM, and they have been employed for 1 to 4 years. With an installment rate of 4% of disposable income, they are a single male, aged 29, with no other debtors or guarantors. They have resided in their current residence for 3 years and own property under a building society savings agreement/life insurance. They have other installment plans at stores and own their housing. This individual has one existing credit at the bank and is a skilled employee/official. They are liable to provide maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a 25-year-old single male with a stable job as a skilled employee/official. He has been living in his own home for three years and has no other debts or guarantors. He has a checking account balance of less than 0 DM and no savings. His credit history shows that he has not taken any credits or has paid back all credits duly. He is looking to borrow money for a business purpose and has an existing installment plan with a bank. The credit amount he is seeking is 8072, and he has three existing credits at this bank. He has a low installment rate and one person dependent on him for maintenance. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has a credit history of paying back existing credits on time. They are borrowing money for furniture/equipment, with a credit amount of 1282. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have a moderate installment rate as a percentage of their disposable income. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 4 years and own a car or another type of property not specified in the data. At the age of 20, they have no other installment plans and rent their housing. They have one existing credit at their current bank and work as a skilled employee/official. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a credit history of critical account/other credits existing. They are taking a loan for repairs, amounting to 2058. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. The installment rate is 4% of disposable income. The individual is a male, divorced/separated, with no other debtors or guarantors. They have been residing in their current home for 2 years, which is owned and classified as real estate. At the age of 33, they have no other installment plans and no previous credits at this bank. The individual is a skilled employee/official with one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a single male, a skilled employee, aged 42, who has been at his current job for 1 to 4 years. He has a checking account with less than 0 DM, some savings (less than 100 DM), and no other installment plans. He has paid back previous credits on time, currently has one existing credit, and has been living in his own residence for 3 years. His credit is for furniture/equipment, totaling 4153 DM, with an installment rate of 2% of his disposable income. He has a co-applicant and no other debtors or guarantors. He has no telephone, but is a foreign worker, and is responsible for one person's maintenance.###\nHence this label was No."
"The individual has less than 0 DM in their existing checking account and has a credit history of paying back existing credits on time. They are taking a loan of 2996 for furniture/equipment and have unknown/no savings account. The individual has been employed for 1 to less than 4 years and has a moderate installment rate. They are a married/widowed male in their 20s with no other debtors/guarantors. The individual has been residing in their current home for 4 years and owns a car or other property. They have no other installment plans and own their own home. The individual is a skilled employee/official, with one existing credit at the bank. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and unknown/no savings account. They have been employed for at least 7 years and have paid back existing credits duly. The purpose of the credit is for a radio/television. They have a real estate property, own their housing, and have been living at their current residence for 4 years. This person is a 45-year-old divorced/separated/married female, with one existing credit at the bank and no other installment plans. They work as an unskilled resident with one person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset does not have a checking account and has a good credit history. They are seeking a loan for furniture or equipment and the credit amount requested is 1736. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their disposable income installment rate is 3 and their personal status is female, divorced/separated/married. They do not have any other debtors or guarantors. The individual has been residing in their current residence for 4 years and owns real estate. They are 31 years old, have no other installment plans, and live in their own housing. They have one existing credit at the bank, work as an unskilled resident, and have one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial position with less than 0 DM in their existing checking account. They have a good credit history of paying back all credits at the bank duly. The purpose of their credit is for a radio/television. With a credit amount of 2149 DM and savings under 100 DM, they have been employed for 1 to 4 years. They have no other debts or guarantors and have been living in their current residence for 1 year. Their property status is unknown/no property and they are a 29-year-old divorced/separated male. They have no other installment plans, live in a free housing situation, and have a skilled job position. They are responsible for one dependent and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual has no checking account and a good credit history with existing credits paid back on time. They are seeking a loan for a business purpose and have a credit amount of 1950. Their savings amount is less than 100 DM, and they have been employed for 4 to 7 years. Their disposable income installment rate is 4%. The individual is a single male, without any other debtors or guarantors. They have been living at their current residence for 1 year and own a car or other property. At 34 years old, they have existing credits at the bank and work as a skilled employee or official. They are responsible for one person and have a registered telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual, a 34-year-old single male, has a good credit history with all previous credits at the bank being paid back on time. Despite being currently unemployed, he has a steady savings account balance between 100 and 500 DM. He is looking to borrow 6850 DM for a new car and owns his own home. With a high level job as a management/ self-employed/ highly qualified employee/ officer, he has one existing credit at the bank and two dependents. He has been living at his current residence for 2 years, has a telephone registered under his name, and is a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM and has been employed for 1 to 4 years. They took a loan amount of 2360 DM for a used car, with a duration of 15 months to repay. Their credit history is considered critical, and they have no other outstanding debts at this bank. The individual is a 36-year-old single male, living in their own house for 2 years. They have one existing credit at the bank and work as a skilled employee. Additionally, they have no other installment plans, no other debtors or guarantors, and no outstanding debts in any other savings accounts. They have a landline telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown or no savings account. They have been employed for at least 7 years and have a stable residence of 4 years. The credit history is of critical nature with existing credits elsewhere. The purpose of the credit is for a radio/television. The individual is a 65-year-old single male, owning real estate. They have no other debtors or guarantors and no other installment plans. With a moderate credit amount of 930, the individual is a skilled employee with 4 existing credits at this bank. They have one dependent for maintenance and are a foreign worker with no telephone.###\nHence this label was Yes."
"The individual has no checking account and a good credit history with a delay in payment in the past. They are seeking a loan for a radio/television, with a credit amount of 12749. They have savings between 500 and 1000 DM, and have been employed for 4-7 years. Their installment rate is 4% of disposable income. The individual is a 37-year-old single male with no other debtors or guarantors. They have been residing in their current residence for 1 year, own a car or other property, and have no other installment plans. They have one existing credit at the bank and work in a management/highly qualified position. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM, with a credit duration of 27 months. Their credit history shows a critical account with other credits existing. The purpose of the credit is for business. The credit amount is 2442 DM. They have savings of less than 100 DM. The individual has been employed for at least 7 years. They have a low installment rate of 4% of disposable income. Personal status and sex indicate a single male. There are no other debtors or guarantors. They have been residing at their current residence for 4 years, owning a car or other property not specified. The individual is 43 years old and has other installment plans at stores. They own their housing and have 4 existing credits at this bank. Their job is in management/self-employment/highly qualified employee/officer category. They have 2 people liable for maintenance. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual is a 32-year-old divorced/separated/married female who has been in her current job for less than a year. She has a good credit history with existing credits paid back duly. The purpose of her credit is for business, and she has a modest credit amount of 2528 DM. She holds a savings account with less than 100 DM and has no other installment plans or debtors/guarantors. She owns her own home and has been living at her current residence for 1 year. She is a skilled employee/official with one existing credit at the bank. She is responsible for providing maintenance for 2 people and has a telephone registered under her name. Additionally, she is a foreign worker with a stable income and a low installment rate in percentage of disposable income.###\nHence this label was Yes."
"This individual is a 26-year-old female who is divorced/separated/married. She has a good credit history with no credits taken or all credits paid back duly. She has a checking account balance of less than 0 DM and savings of less than 100 DM. Currently employed for less than 1 year as a skilled employee/official, she has been residing in the same place for 4 years. She lives in a rented housing and has no other debtors or guarantors. With a single existing credit at the bank, she has a moderate credit amount for furniture/equipment. She has no other installment plans, no telephone, and is a foreign worker. She is responsible for providing maintenance for one person.###\nHence this label was No."
"The individual in this dataset is a 37-year-old divorced/separated/married female who has been employed for at least 7 years as a skilled employee/official. She has a good credit history with a critical account/other credits existing, and has a total of 1 existing credit at the bank. She owns her own home, has no other debtors/guarantors, and has no other installment plans. \nShe has had her present residence for 4 years and has a good savings account with less than 100 DM. Her purpose for the credit is furniture/equipment, and she has a duration of 18 months to pay off the credit amount of 3612 DM, with an installment rate of 3% of her disposable income. \nShe has a telephone registered under her name, is a foreign worker, and is responsible for 1 person in terms of maintenance.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM and has a credit history of paying back existing credits duly. They are looking to purchase a new car, with a credit amount of 2579. Their savings account/bonds hold less than 100 DM, and they have been employed for less than a year. The installment rate for the loan is 4% of disposable income. The individual is a 33-year-old single male with no other debtors or guarantors. They have been living in their current residence for 1 year, which is owned real estate. They have no other installment plans and no telephone. They work as an unskilled resident and have 2 people being liable for maintenance. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual has a checking account with at least 200 DM, a credit history of critical accounts/other credits, and is looking to finance a used car. They are borrowing 4796 in credit, have savings under 100 DM, and have been employed for at least 7 years. With a 4% installment rate, the borrower is a 56-year-old single male with no other debtors. They have been living in their current residence for 4 years, have unknown property, and no other installment plans. Their housing is free, they have one existing credit at a bank, and are a skilled employee/offical. The borrower is solely responsible for one person's maintenance, does not have a telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual is a 61-year-old single male, working as a skilled employee with 1-4 years of present employment history. He has no existing savings account or property, but resides in a free housing arrangement. With a good credit history of paying back existing credits on time, he is looking for a loan of 1239 DM for education purposes. He has no other outstanding debts or guarantors, and no other installment plans. Additionally, he has been living at his current residence for 4 years and has one existing credit at the bank. He has no telephone but is able to provide maintenance for one person. As a foreign worker, he is considered a good credit risk.###\nHence this label was Yes."
"This individual has no checking account and is unemployed. They have a critical credit history with other existing credits. The purpose of the credit is for a radio/television. The credit amount is 1154. They have savings between 100 and 500 DM. They have been residing in their current residence for 4 months and own real estate. The individual is a 57-year-old divorced/separated/married female. They have no other installment plans and no other debtors/guarantors. They have 3 existing credits at the bank and work as an unskilled resident. They are liable to provide maintenance for 1 person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been in their current employment for 1 to 4 years. They have a critical credit history with existing credits elsewhere and are seeking a loan for education. The credit amount requested is 701 DM and savings are less than 100 DM. They have no other installment plans and reside in their own home. The individual is a 32-year-old single male, a skilled employee with 2 existing credits at this bank. They have no other debtors or guarantors and have been at their current residence for 2 years. Additionally, they have no telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced/separated/married and works as a skilled employee/official. She has been at her current job for 1 to 4 years and has one existing credit at the bank. Her credit history shows that she has paid back existing credits duly till now. She has a good credit rating as she has no other installment plans, owns her own home, and has real estate property. She has a savings account with less than 100 DM and has been living at her current residence for 3 years. Despite being 64 years old, she only has one person to provide maintenance for. She does not have a telephone but is a foreign worker. She is taking out a credit amount of 753 for the purpose of radio or television.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and has a credit history of paying back existing credits on time. They are looking to purchase furniture/equipment and need a credit amount of 3749. Their savings are less than 100 DM and they have been employed for less than 1 year. They have a low installment rate of 2% of disposable income and are a female who is divorced, separated, or married. There are no other debtors or guarantors involved. They have been living at their current residence for 4 years and own a car or other property. At 26 years old, they have no other installment plans and their housing is self-owned. They have one existing credit at the bank, a skilled job, and are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with a moderate credit history. They are seeking a small loan for a specific purpose related to entertainment. They have some savings and have been employed steadily for a few years. The installment rate for the loan is low, and they have a guarantor for additional security. They own their own home and have a good amount of equity in real estate. At 35 years old, they are a single male with no other significant debts. They have a stable job as a skilled worker and are responsible for one dependent. Overall, they appear to be a reliable borrower with a good chance of repaying the loan.###\nHence this label was Yes."
"This individual is a 26-year-old female, divorced or separated, with no current employment. She has no existing credits at the bank, but has two other credits elsewhere. She lives in a rented house and has been in her current residence for 1 year. She has no telephone and is not married to a foreign worker. She has a savings account with less than 100 DM and no other installment plans or debts. She is looking to finance a new car with a credit amount of 1778 over 15 months.###\nHence this label was No."
"This individual has no existing checking account and no savings account. They are currently unemployed but have a good credit history of paying back existing credits on time. The purpose of their credit is for a new car. They are a 38-year-old single male, owning their own home. They have one existing credit at the bank and no other installment plans. Their job is in management or as a highly qualified employee. They have one person they are financially responsible for and are a registered phone user. Additionally, they are a foreign worker and have been residing at their current residence for 4 years.###\nHence this label was Yes."
"This individual has a stable financial status with less than 0 DM in their existing checking account, a long-standing employment of at least 7 years, and all previous credits at the bank have been repaid on time. They have taken a credit for an unspecified purpose, with a moderate amount of 1358. They do not have any savings, but own a car or other property. The person is a 40-year-old single male with no other debtors or guarantors. They live in their own house for the past 3 years and have a good credit rating. Their job position is in management or a highly qualified field, and they have one dependent. They have a landline telephone registered in their name and are a foreign worker in the country.###\nHence this label was No."
"The individual is a 57-year-old single male with a stable job and good credit history. They have a savings account with less than 100 DM and have been at their current employment for over 7 years. They are looking to take out a new car loan for 14318 DM. The individual has no other ongoing debts, owns no property, and lives in a free housing arrangement. They have one existing credit at the bank and are responsible for providing maintenance for one person. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance between 0 and 200 DM, a credit history of repaying credits on time, and is looking to purchase furniture/equipment. They are seeking a credit amount of 9960 DM and have savings of less than 100 DM. Currently employed for less than a year, they have a low installment rate, are female and divorced/separated/married. There are no other debtors/guarantors involved. They have been residing at their current residence for 2 years and own their own home. At 26 years old, they have no other installment plans, one existing credit at the bank, and are a skilled employee/official. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a single male with a stable job and has been at his current employment for less than a year. He has no other debtors or guarantors and has been residing in his own home for one year. His credit history shows that he has paid back existing credits on time. He is responsible for providing maintenance for one person. Despite not having a telephone, he is a foreign worker. The purpose of his credit is for a radio/television, and he intends to pay back a credit amount of 2896 in 24 months with an installment rate of 2%. He has some savings between 100 and 500 DM and has one existing credit at the bank. At 29 years old, he does not have any other installment plans and possesses a car or other property.###\nHence this label was Yes."
"The individual in this example has a stable financial situation with less than 0 DM in their existing checking account. They have a good credit history but owe a moderate amount of money on a car loan. They have some savings but not a large amount. They have been employed for over 7 years and have a low percentage of their income dedicated to loan installments. They are a single male, aged 66, with no additional debtors or guarantors. They have been living in their current residence for 4 years and own no property. They have a good job position and only one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a good credit history with existing credits elsewhere. They are looking to finance a radio/television purchase with a credit amount of 1291. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a moderate installment rate and are a divorced/separated/married female. They have no other debtors or guarantors and have lived at their current residence for 2 years. Their property includes a building society savings agreement/life insurance. At 35 years old, they have no other installment plans and own their home. They have 2 existing credits at this bank and work as a skilled employee/official. They have one dependent and no telephone. They are also a foreign worker.###\nHence this label was Yes."
"This individual is a 75-year-old unemployed female who is divorced, separated, or married. She has less than 0 DM in her checking account and has no savings. She has been living in her own home for 3 years and has a good credit history with existing credits paid back on time. She is looking to borrow 1374 for a new car and has one existing credit at the bank. She has a low installment rate of 4% and no other debtors or guarantors. She is a highly qualified employee, officer, or self-employed individual with a telephone registered under her name. She is responsible for providing maintenance for one person and is a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has a credit history of repaying previous credits on time. They are looking to take a new car loan with a duration of 10 months. The credit amount requested is 1418. \nThey have savings between 100 and 500 DM and have been employed for 1 to 4 years. The installment rate for the loan is 3% of their disposable income.\nThe individual is a 35-year-old single male, residing in a rented house with no other debtors or guarantors. They have no other installment plans and their property is in real estate.\nThey have one existing credit at the bank and work in an unskilled resident job. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"The individual has a status of existing checking account with less than 0 DM, and has a good credit history. They are looking to use the credit for furniture/equipment, with a credit amount of 3446. Their savings account/bonds are less than 100 DM, and they have been employed for more than 7 years. The individual's installment rate is 4% of their disposable income. They are a 42-year-old single male, with no other debtors/guarantors. They have lived at their current residence for 2 years and own their own home. The individual has one existing credit at the bank and works as a skilled employee/official. They are liable for providing maintenance for two people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual in this example has a checking account with a balance between 0 and 200 DM, has been employed for 4 to 7 years, and has a good credit history with other existing credits. They are seeking a loan for furniture/equipment, amounting to 2745 DM. They have significant savings of at least 1000 DM and own a car or other property not specified. The individual is male, single, 32 years old, with no other debtors or guarantors. They have been living at their current residence for 2 years, have no other installment plans, and own their own home. They work as a skilled employee/official, have 2 existing credits at the bank, and have 1 person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been repaying existing credits on time. They are looking to take out a new car loan, totaling 640 credits. They have less than 100 credits in their savings account. They have been employed for 1 to 4 years and have a low installment rate relative to their disposable income. The individual is a 49-year-old divorced/separated male, with no other debtors or guarantors. They have been residing in their own real estate for 2 years and have no other installment plans. They have a single existing credit at the bank and work as an unskilled resident. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 60-year-old divorced/separated/ married female, with a stable job in management/self-employment/highly qualified employee/officer, and has been at her current employment for at least 7 years. She has no other debtors or guarantors and lives in a property for free. She has a good credit history of paying back all credits at the bank duly. She has 2 existing credits at the bank, and her existing checking account balance is between 0 and 200 DM. She has savings between 100 and 500 DM and a credit amount of 14782. She has been residing at her current residence for 4 years and has no other properties. She has a telephone registered under her name and is a foreign worker. She has no other installment plans and has an installment rate of 3% of disposable income. She is liable to provide maintenance for 1 person.###\nHence this label was No."
"The individual has a small amount of money in their checking account, has had critical credit history in the past, and is looking to finance a new car. They have a modest credit amount of 2171, with some savings below 100 DM. The individual has been employed for 1 to 4 years and has a low installment rate. They are a single male with no other debtors, have been living in their current residence for 4 years, and have some investments in building society savings. At 38 years old, they have two existing credits at this bank and work in an unskilled job. They have one dependent and do not have a telephone or foreign worker status.###\nHence this label was Yes."
"This individual is a 25-year-old divorced female with a stable job as an unskilled resident. She has been living in her own home for 3 years and has one existing credit at the bank. Despite having a low income, she has managed to pay back her previous credits on time. She is looking to finance a radio/television purchase with a credit amount of 2327 DM. Her expenses are well managed as she has savings of less than 100 DM and no other debts or loans. The individual does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a stable credit history with existing credits paid back on time. They are seeking a loan for furniture/equipment, with a credit amount of 2835. Their savings range from 500 to less than 1000 DM, and they have been employed for over 7 years. They have a low installment rate on disposable income and are a single male. There are no other debtors/guarantors involved. They have been residing in their current home for 4 years and own the property. With a stable job as a skilled employee/official, they have one existing credit at the bank. They are 53 years old, have no other installment plans, and do not have a telephone. They are a foreign worker and are solely responsible for providing maintenance.###\nHence this label was Yes."
"This individual is a female who is divorced/separated/married, aged 23, working as a skilled employee/official with 4-7 years of employment history. She has a good credit history with existing credits paid back duly, and currently has less than 100 DM in her savings account. She is looking to finance furniture/equipment with a credit amount of 2406 over a 30-month duration. She has no other debtors/guarantors, no other installment plans, and no telephone. She lives in rented housing with 1 person to provide maintenance for, and has been at her current residence for 4 years. She owns real estate and is a foreign worker.###\nHence this label was No."
"This individual is a single male in their late twenties, with a stable job and personal residence. They have a good credit history, with a low credit amount and sufficient savings. They have no other debts or dependents, and own a car or other property. They manage their finances responsibly, with a modest disposable income and no other installment plans. Although they do not have a telephone, they have a positive credit outlook as a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown/saving account. They have been employed for 1 to 4 years and have a stable income. The purpose of the credit is for a radio/television. They have no other debts or guarantors. The individual is a 29-year-old single male with 1 dependent. They own a property and have been living in the same residence for 3 years. They have 2 existing credits at this bank and work as a skilled employee/official. The individual has a telephone registered in their name and is a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old single male, employed in a skilled position for over 7 years. He has a checking account balance of less than 0 DM and has no existing credits. He is looking to finance furniture/equipment with a credit amount of 4110 DM and has savings of less than 100 DM. He has been living in his current residence for 4 years and has no other significant assets or debts. He has two existing credits at the bank, pays a 3% installment rate, and has two dependents. He uses a bank for installment plans and rents his housing. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a stable financial standing with less than 0 DM in the existing checking account and less than 100 DM in savings. They have a good credit history with no outstanding loans. The credit is being used for furniture/equipment, with a sizeable amount of 7119 DM being borrowed. The individual has been employed for 1 to 4 years as a skilled employee/official. They have no other debtors or guarantors. The person is a 53-year-old single male, living in a residence for free. They have been at their current residence for 4 years and have 2 existing credits at the bank. There are 2 dependents for whom they are liable for maintenance. Additionally, they do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a stable financial standing with a moderate amount in their existing checking account. They have a good credit history with other institutions and are looking to purchase furniture/equipment. The credit amount they are seeking is relatively high. They have some savings, have been employed for over 7 years, and have a low installment rate. The individual is a single male, has no other debtors or guarantors, and has been residing in their current residence for 1 year. They own their housing and have no other significant assets. At 41 years old, they have no other installment plans and hold a skilled job position. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a good credit history, and has been making timely repayments on existing credits. They are borrowing 708 DM for furniture/equipment and have savings of less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate of 2% on disposable income. The individual is a single male with a guarantor and has been living in their current residence for 3 years. They have a building society savings agreement/life insurance, are 38 years old, and have no other installment plans. They own their own home and have one existing credit at the bank. The individual has an unskilled-resident job, is liable to provide maintenance for 2 people, does not have a telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM balance, has existing credits paid back on time, and is looking to finance furniture/equipment. They are employed for 1 to 4 years, have a steady income, and pay 1% of their disposable income towards installments. The individual is a 37-year-old single male, with a guarantor for other debts. They have been living in their current residence for 2 years and own their own home. This person has one existing credit at the bank, a stable job as a skilled employee/official, and two dependents. They do not have any other installment plans, own a building society savings agreement/life insurance, and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM and has been employed for 1 to 4 years. They have no savings and are paying for a radio/television. They have a credit history with critical accounts, no other existing credits, and unknown property. They are a single male with no other debtors or guarantors, living in a free housing arrangement. The individual is a skilled employee/official, aged 39, with two existing credits at the bank. They have no other installment plans, one person to provide for, and a registered telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM and has had it for 6 months. Their credit history is classified as critical, and they have other existing credits elsewhere. The purpose of their current credit request is to buy a new car. The credit amount they are requesting is 1299. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. Their installment rate is 1% of their disposable income. They are a single male, aged 74, with no other debtors or guarantors. They have been living in their current residence for 1 year and own real estate. They have no other installment plans and their housing status is own. They have 3 existing credits at the bank and are currently unemployed or working in an unskilled, non-resident job. They have 2 people they are liable to provide maintenance for. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and an unknown savings account. They have been employed for at least 7 years as a skilled employee/single male with no other debtors or guarantors. They have been living in their current residence for 4 years, which is rent-free. The purpose of their credit is for a used car, with a credit amount of 10477. They have no other installment plans, own no property, and have two existing credits at this bank. At 42 years old, they are responsible for providing maintenance for one person and are a foreign worker with no telephone.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history with existing credits paid back on time. They are borrowing a credit amount of 4380 for a new car. They have savings between 100 and 500 DM, have been employed for 1 to 4 years, and have a low installment rate. The person is a 35-year-old single male, with no other debtors or guarantors, owning a car or other property. They have been living at their current residence for 4 years and have no other installment plans. They own their own home and have one existing credit at the bank. The individual is in an unskilled-resident job, with 2 people to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a married/widowed male with a stable job, having been employed for over 7 years. They have a good credit history, with existing credits paid back on time. Their housing situation is owning real estate, and they have savings of less than 100 DM. The individual has no telephone and uses a bank for installment plans. They have 2 existing credits at this bank and have been living at their current residence for 3 years. With a credit amount of 1155 DM and an age of 40, this individual is an unskilled resident in terms of job status. Additionally, they have a guarantor and are a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced/separated/married. She has been employed for 1 to less than 4 years as a skilled employee/official. She has a good credit history with existing credits paid back duly. The purpose of her credit is for furniture/equipment. She has a moderate credit amount of 3441 DM and some savings between 100 to less than 500 DM. She has no other installment plans and no telephone. She has a stable living situation, residing in a rented property for 4 years. She has one co-applicant as another debtor/guarantor. She has one existing credit at the bank and is responsible for providing maintenance to one person. Additionally, she is a foreign worker and is 21 years old.###\nHence this label was No."
"This individual has no checking account and has a credit history of repaying existing credits on time. They are looking to finance a used car, with a credit amount of 7814. Their savings amount is less than 100 DM and they have been employed for 4 to 7 years. With a moderate installment rate, they are a single male with no other debtors or guarantors. They have been living in their current residence for 3 years and own a car or other property. At 38 years old, they have no other installment plans, own their home, have one existing credit at the bank, and work in a management/self-employed/highly qualified role. They are responsible for providing maintenance for one person and have a registered telephone in their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 19-year-old female who is divorced/separated/married and works as a skilled employee/official. She has no checking account but has a savings account with less than 100 DM. She has been employed for less than a year and has been living at her current residence for 2 years. She has 1 co-applicant as a guarantor and no other debtors. She has 2 existing credits at the bank and no other installment plans. She is renting a house and has no telephone. She is a foreign worker. Based on her credit history of paying back loans duly, she applied for a credit of 1980 DM to purchase furniture/equipment, with an installment rate of 2% of disposable income.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM. They have a good credit history with existing credits paid back promptly. The purpose of the credit is for business. The credit amount is 2687. They have savings of less than 100 DM and have been employed for 4 to 7 years. The installment rate is 2% of their disposable income. The individual is a 26-year-old single male. They have no other debtors or guarantors. They have been living at their current residence for 4 years and have a building society savings agreement or life insurance. They have no other installment plans, live in a rented house, and have one existing credit at the bank. The individual is a skilled employee/official and is responsible for one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history of consistently repaying existing credits. They are taking a loan for furniture/equipment, with a credit amount of 1543. They have substantial savings of at least 1000 DM and have been employed for 1 to less than 4 years. With a moderate installment rate, they are a divorced/separated male in their early thirties with no other debtors or guarantors. They have been living in their own real estate property for 2 years and have one existing credit at the bank. As a skilled employee, they have one dependent and no other installment plans. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 32-year-old divorced/separated/married female with a good credit history. She has a stable job in management/self-employment/highly qualified employee/officer, with a moderate income and one existing credit at the bank. She has a savings account with less than 100 DM, owns a property, and has been living at her current residence for 2 years. She has no other debtors or guarantors, no other installment plans, and a registered telephone. Overall, she appears to be a responsible and financially stable individual.###\nHence this label was No."
"The individual has less than 0 DM in their existing checking account, has been employed for at least 7 years, and has a critical credit history with other existing credits. They are looking to finance a used car, and have savings of less than 100 DM. Their credit amount is 2957, with an installment rate of 4% of disposable income. The individual is a 63-year-old single male, owning their own home and having a building society savings agreement/life insurance as property. They have no other debts or guarantors, no other installment plans, and have been residing at their current residence for 4 years. The individual is a skilled employee/official with two existing credits at their current bank. They have one person they provide maintenance for, have a telephone registered in their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They took a 24-month loan amounting to 2670 for a used car. Their savings account/bonds hold less than 100 DM, and they have been employed for at least 7 years. With a 4% installment rate, they are a single male, aged 35, with no other debtors or guarantors. They have been living in their current residence for 4 years and own a car or other property. This individual has no other installment plans, owns their own home, and holds a management position. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker with a positive credit outlook.###\nHence this label was Yes."
"This individual is a 24-year-old single male with a stable job as a skilled employee, having worked at the same place for 4 to 7 years. He has a good credit history with existing credits paid back duly. He is looking to finance a new car, needing 9271 DM for which he is willing to pay 2% of his disposable income as installment. He has savings of less than 100 DM and owns his own home. He has no other debts or guarantors and no other installment plans. He has one existing credit at the bank and one person who depends on him for maintenance. He has a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"This individual does not have a checking account, has had existing credits paid back on time, and has been employed for over 7 years. They borrowed 727 DM for educational purposes. Their savings amount is between 500 and 1000 DM, and they have no other debts or guarantors. They live in a residence for free, have no other installment plans, and own no property. The individual is a 46-year-old single male, working as a skilled employee/official with one dependent. They have one existing credit at the bank and a phone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 37-year-old single male, working in an unskilled resident job. He has been living in his own home for 1 year and has one existing credit at the bank. He has a guarantor and two dependents. His existing checking account balance is at least 200 DM, with savings of less than 100 DM. He has been employed for less than 1 year and has no other installment plans. The purpose of his credit is for a new car, with a credit amount of 3949. He has a building society savings agreement/life insurance for property. His credit history shows that he has paid back existing credits diligently. He has a low installment rate as a percentage of disposable income and does not have a telephone. Additionally, he is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for over 7 years. They are single, male, and own a car or other property. They have no other debtors/guarantors, no other installment plans, and live in their own home. They have 2 existing credits at the bank and a good credit history. Their purpose for the credit is for a radio/television, and the credit amount is relatively low at 1829 DM. They have some savings of less than 100 DM and have been living at their current residence for 4 years. At 46 years old, they are a skilled employee/official with one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female, aged 30, who has no existing checking account. She has been in her current employment for 1 to less than 4 years as a skilled employee or official. She has one existing credit at the bank and has been living in her current residence for 2 years. She has a savings account with less than 100 DM. The purpose of her credit is for a used car and the credit amount is 8133. She has no other debtors or guarantors, and she does not have a telephone. She has a building society savings agreement or life insurance as her property and owns her own home. She has one person to provide maintenance for and the installment rate in percentage of disposable income is 1. She has another installment plan with a bank and is a foreign worker.###\nHence this label was Yes."
"This individual is a female, divorced or separated or married, aged 34, with a stable job as an unskilled resident for 4 to 7 years. She has been living in her current residence for 4 years and has no property of her own. She has a good credit history of paying back all credits at the bank duly. The purpose of her credit is for education, and the amount is relatively low at 1837 DM. She has some savings (<100 DM) and one existing credit at the bank. She has no other debtors or guarantors and no installment plans other than with the bank. She is financially stable with no outstanding loans or debts.###\nHence this label was No."
"The individual has a moderate amount of credit in their existing checking account. They have a history of critical accounts or other existing credits. The purpose of the credit is for business. They have a modest credit amount. Their savings amount is also moderate. They have been employed for 1 to 4 years. The individual has a low installment rate in percentage of disposable income. They are a single male. They have no other debtors or guarantors. They have been residing at their current residence for 4 years. They own a car or other property. The individual is 27 years old. They have installment plans with a bank. They own their housing. They have one existing credit at their current bank. They are a skilled employee or official. They are liable to provide maintenance for one person. They do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history and currently has between 0 and 200 DM in their checking account. They have been employed for 1 to 4 years as a skilled employee. The purpose of the credit is for education, with a duration of 60 months and a credit amount of 6288 DM. They have savings of less than 100 DM and no other installment plans or debts. The individual is a 42-year-old single male, living in a free housing arrangement with no other property. They have been residing at their current residence for 4 years, have one existing credit at the bank, and are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker with no other debtors or guarantors.###\nHence this label was No."
"The individual is a 27-year-old single male with a steady job (1-4 years of employment) as an unskilled resident. They have no savings account and own their own home. They have a good credit history despite experiencing delays in the past and currently have one existing credit at the bank. The purpose of the credit is for a radio/television, amounting to 7418 DM to be repaid over 60 months with a low installment rate. There are no other installment plans, debtors/guarantors, or people dependent on them for maintenance. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has a credit history of paying back existing credits on time. They are retraining, have a credit amount of 902 DM, and savings of less than 100 DM. They have been employed for 4 to 7 years, with a 4% installment rate. The individual is a married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 4 years and have a building society savings agreement/life insurance as property. At 21 years old, they have no other installment plans and live in a rented housing. They have one existing credit at this bank, a skilled job, and are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account of less than 0 DM and has been with their current employer for 4 to 7 years. They took a 6-month loan for a new car, with a credit amount of 666 DM. Their savings are equal to or more than 1000 DM. They have no other debts or guarantors, and they own real estate for housing. This person, a 39-year-old divorced/separated/married female, has a 3% installment rate and no other installment plans. They have been living at their current residence for 4 years and have 2 existing credits at the bank. Their job is unskilled-resident, and they have 1 person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old divorced or separated or married female, working in an unskilled-resident job, with a monthly installment rate of 2% of disposable income. They have been employed in their current position for 4 to 7 years and have been living in their current residence for 4 years. With a credit amount of 841 DM, they have one existing credit at the bank and no other installment plans. They have savings between 100 and 500 DM, and own real estate for property. They do not have any other debtors or guarantors, and do not have a telephone. As a foreign worker, they have no other people to provide maintenance for.###\nHence this label was Yes."
"This individual has no existing checking account and has a good credit history with existing credits paid back on time. They are looking to finance a new car with a credit amount of 3577. They have savings between 100 and 500 DM, have been employed for 1 to 4 years, and have a low installment rate as a percentage of their disposable income. The individual is a 26-year-old single male with a guarantor, living in a rented property. They have been residing at their current residence for 2 years. They have no other debtors/guarantors, no other installment plans, and no telephone. They have a stable job as a skilled employee/official and have 2 people they are liable to provide maintenance for. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"This individual is a 20-year-old female, divorced/separated/married, who has been working for less than a year as a skilled employee/official. She has one existing credit at the bank, no other installment plans, and owns her own home. She has no other debtors or guarantors, no telephone, and no savings in her account. She has been living in her current residence for 1 year and is a foreign worker. She has a good credit history of paying back existing credits duly. This particular credit application is for furniture/equipment, with a credit amount of 1577 DM to be repaid in 11 months at an installment rate of 4% of disposable income.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has a credit history of paying back existing credits on time. They are borrowing 2302 DM for the purpose of purchasing a radio/television. Their savings are below 100 DM and they have been employed for 1 to 4 years. The individual's disposable income installment rate is 4% and they are male, divorced/separated. They have no other debtors/guarantors and have been living at their current residence for 4 years. They own a car or other property not specified. The individual is 31 years old, has no other installment plans, and lives in a rented housing. They have one existing credit at the bank, are a skilled employee/official, and are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and a history of delaying payments. They are taking a loan for a radio/television, with a credit amount of 4454. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have no other debtors or guarantors, and have been living in their current residence for 4 years. They own real estate and are a skilled employee/official, aged 34. They have 2 existing credits at the bank and are responsible for providing maintenance for one person. They do not have any other installment plans, own their own home, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM and has been in their current employment for less than 1 year. They have a credit history of critical account/other credits existing, with a purpose of the credit being for business. The credit amount is 1797 DM and their savings account/bonds are less than 100 DM. They have an installment rate of 3% of disposable income and are male, single. There are no other debtors/guarantors involved and they have been residing at their current residence for 1 year. Their property includes a building society savings agreement/life insurance and they are 28 years old. They have other installment plans at a bank and own their own home. They have 2 existing credits at this bank and work as an unskilled resident. They are liable to provide maintenance for 1 person, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and no savings account. They have been employed for 1 to less than 4 years and have one existing credit at the bank. The person is a 39-year-old single male, an unskilled resident working to provide maintenance for two people. They have taken no credits in the past and have paid back all credits duly. Their purpose for the credit is a used car, and they have a building society savings agreement or life insurance as property. They live in their own house, have no other debtors or guarantors, no other installment plans, and no telephone. Despite not having a phone, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and has paid back previous credits on time. They are borrowing 1474 DM to purchase furniture/equipment. They have savings of less than 100 DM, have been employed for less than a year, and have a low installment rate of 4%. The individual is a divorced/separated/married female, with no other debtors. They have been living at their current residence for 1 year and have a building society savings agreement/life insurance. At 33 years old, they have one credit at this bank, work in a managerial role, and are responsible for one person's maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of >= 200 DM and has had it for at least 7 years. They have a credit history of a critical account/other credits existing elsewhere. The purpose of the credit is for a radio/television. The credit amount is 3656 DM. They do not have any savings in their savings account. Their installment rate is 4% of their disposable income. The individual is a 49-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own their own home. They have a building society savings agreement/life insurance as property. The individual has other installment plans with stores. They have 2 existing credits at this bank and work in an unskilled resident job. They are liable to provide maintenance for 1 person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and is unemployed. They have a good credit history with existing credits paid back duly. The purpose of the credit is for retraining, with a relatively small amount of 1238 credits. The individual has no savings account and no other installment plans. They are a single male, 36 years old, with no other debtors or guarantors. The individual owns a house and has been residing there for 4 years. They have a management job and are responsible for providing maintenance for 2 people. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has been diligently paying back existing credits. They are looking to finance furniture/equipment with a credit amount of 2212. Their savings account status is unknown. Presently employed for 4 to less than 7 years, they have a moderate installment rate. They are a single male, have no other debtors/guarantors, and have been residing in their current home for 4 years. They own a car or another type of property not specified. At 39 years old, they have no other installment plans and own their own home. Employed as a skilled worker, they have one existing credit at the bank and are liable for one person's maintenance. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM, has had a critical account or other credits in the past, and is seeking credit for education purposes. They are borrowing 8065 DM for a duration of 36 months, with savings of less than 100 DM. They have been employed for 1 to 4 years, with a 3% installment rate. The applicant is a 25-year-old divorced, separated, or married female, with no other debtors or guarantors. They have been residing at their current residence for 2 years, own their own home, and have no other installment plans. The individual has 2 existing credits at the bank, is in a management or highly qualified job, and has 1 person they are financially responsible for. They have a telephone registered in their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and an existing credit history of paying credits back duly. They are looking to finance a radio/television purchase with a credit amount of 999. Their savings account status is unknown/no savings account. They have been employed for at least 7 years and have a low installment rate as a percentage of disposable income. The person is a 25-year-old single male with no other debtors/guarantors. They have been residing in their current home for 2 years and own a car or other property. The individual has a stable job as a skilled employee/official and is responsible for providing maintenance for one person. They do not have any other installment plans, own a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit risk. They have less than 0 DM in their existing checking account, with a credit history of no prior credits or all credits paid back on time. They are taking a new car loan for 1082 DM, with savings of less than 100 DM. They have been employed for 1 to 4 years and have a stable income. They have no other debtors or guarantors. This person is a 48-year-old single male with no dependents. They have 2 existing credits at the bank, own their own home, and work as a skilled employee. They have no telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a credit history of paying back existing credits on time. They are seeking retraining with a credit amount of 937, having savings less than 100 DM. They have been employed for less than a year and have a low installment rate on their disposable income. The person is a 27-year-old married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 3 years and own a car or other property not specified. The individual has two existing credits at the bank and works as an unskilled resident. They are liable to provide maintenance for one person, do not have any other installment plans, own their own home, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee/official. He has been living in his own home for 2 years and has one existing credit at the bank. With a monthly installment rate of 4%, he has no other installment plans or debts. He has had existing credits paid back duly till now. Although his savings account/bonds are unknown/no savings account, he has some liquid assets with 0 <= ... < 200 DM in his checking account. The purpose of his credit is for a used car, which costs 2028 DM. At 30 years old, he is responsible for providing maintenance for one person and does not have any other debtors/guarantors. He does not have a telephone, but he is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has had the current employment for 4 to 7 years. They are looking to finance a used car, and have a good credit history with other accounts. The credit amount requested is 7253 credits, and they have savings of less than 100 DM. The individual is a 35-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own their own home. The individual has 2 existing credits at this bank, a stable job in management, and is responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a divorced or separated or married female, aged 31, with no checking account. They have been employed for 4 to 7 years and have been living in their current residence for 2 years. The purpose of the credit is for a new car, with a credit amount of 2782. They have existing credits that have been paid back duly till now. Their savings account holds between 500 and less than 1000 DM. They have no other debtors or guarantors. They have a low installment rate in percentage of disposable income and their housing status is own. They have one existing credit at this bank and they work in a management/self-employed/highly qualified employee/officer position. They have one person that they are liable to provide maintenance for. They have a telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a 21-year-old female who is divorced/separated/married. She has a checking account with less than 0 DM, has been employed for less than 1 year, and resides in a rental property for 4 years. She has one existing credit at the bank and works as a skilled employee/official. The purpose of the credit is for furniture/equipment, with a credit amount of 1049 DM and a duration of 18 months. She has savings of less than 100 DM and no other debts or guarantors. She has no other installment plans, no telephone, and no foreign worker status. She has an installment rate of 4% of disposable income and is responsible for one dependent.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM, with a duration of 48 months. They have a good credit history, with existing credits paid back duly till now. The purpose of the credit is for a new car. The credit amount is 3931 DM. They have savings of less than 100 DM and have been employed for 4 to 7 years. The installment rate is 4% of disposable income. The individual is a single male, with no other debtors or guarantors. They have been residing at their current residence for 4 years and have unknown or no property. Aged 46, they have no other installment plans, live in housing for free, and have one existing credit at this bank. The individual is a skilled employee/official, with 2 people liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, a credit history of paying back existing credits on time, and is seeking credit for education purposes. They have savings of less than 100 DM and have been employed for less than 1 year. With an installment rate of 4%, they are a divorced/separated/married female aged 53. They have no other debtors or guarantors, own their own home, and have a building society savings agreement/life insurance. This individual has one existing credit at the bank, holds a skilled job, and is responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual in this example has no checking account and has been employed for 4 to 7 years. They are seeking a new car loan amounting to 3535 DM with a 36-month duration. Their credit history is classified as critical, and they have savings of less than 100 DM. They are a 37-year-old single male with no other debtors or guarantors. They currently reside in their own home and have two existing credits at the bank. The individual holds a skilled job, has no other installment plans, and has a registered telephone under their name. Additionally, they are a foreign worker and have one person dependent on them for maintenance.###\nHence this label was Yes."
"This individual is a 40-year-old single male who is currently unemployed. He has a good credit history with critical accounts and other existing credits. His purpose for the credit is furniture/equipment, for which he requires 7374 DM. He has savings of less than 100 DM and owns his own house. Additionally, he has a building society savings agreement/life insurance as property. He has been residing at his current residence for 4 years and has 2 existing credits at this bank. His job is in management/self-employment/highly qualified employee/officer. He has no other debtors or guarantors, but is liable to provide maintenance for one person. He has a registered telephone and is a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced/separated/married, employed in a skilled position for over 7 years, and owns her own home. She has been residing at her current residence for 4 years and has a good credit history with no other existing debts or guarantors. She has a small credit amount of 860 for a new car and has less than 100 DM in savings. At 39 years old, she has no other installment plans, two existing credits at the bank, and one dependent. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"This individual is a male who is divorced or separated, aged 47, and has been working in the same position for 1 to 4 years. He has a good credit history with a slight delay in past payments. His existing checking account balance is between 0 and 200 DM, with savings less than 100 DM. He has no other debtors or guarantors, owns his own home, and has a building society savings agreement. He has two existing credits at the bank, with an installment rate of 1% of his disposable income. He has no other installment plans and no telephone. He has been living at his current residence for 4 years and is a skilled employee or official. He is responsible for providing maintenance for one person and is a foreign worker. His credit amount is 2353 DM, and the purpose of the loan is to buy a new car.###\nHence this label was Yes."
"This individual has a stable financial standing with savings of less than 100 DM and a credit history of paying back existing loans on time. They are seeking a new car loan of 14027 DM and have been employed for 4 to 7 years as a single male. With no other debtors or guarantors, they own their own home and have been at their current residence for 2 years. Aged 27, they have no other installment plans and work in a management or highly qualified position. They have a single credit at the bank and are liable for one person's maintenance. They have a registered telephone and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a critical credit history with other existing credits. They are borrowing 2288 for furniture/equipment with savings of less than 100 DM. Their employment duration is less than 1 year, with a low installment rate. They are a divorced/separated/married female, age 23, with no other debtors/guarantors. They have been residing in their current place for 4 years, owning a building society savings agreement/life insurance. They have no other installment plans, own their own home, and have one existing credit at this bank. Their job is a skilled employee/official, responsible for one dependent, and have a registered telephone in their name. They are also a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced/separated/married and has been employed for over 7 years in a management/self-employed/highly qualified employee/officer role. She has no existing debtors or guarantors and has been living in her current residence for 4 years. She has 2 existing credits at the bank and no other installment plans. She has a good credit history with no previous credits taken or unpaid. She has a checking account balance between 0 and 200 DM and savings of less than 100 DM. She has a credit amount of 8318 and pays a low installment rate of 2% of her disposable income. She is 42 years old, lives in a free housing, and has one person dependent on her for maintenance. She has a telephone registered under her name and is a foreign worker.###\nHence this label was No."
"The individual has a stable credit history with a critical account and other existing credits. They are looking to purchase a radio/television and have a moderate credit amount of 1245 DM. They have some savings in their account and have been employed for 1 to 4 years. Their personal status is a married/widowed male with no other debtors or guarantors. They have been residing in their current location for 2 years and own their housing. The individual is a skilled employee/official, with one existing credit at the bank. They have no other installment plans, no telephone, and are a foreign worker. They are responsible for providing maintenance for one person.###\nHence this label was No."
"This individual is a 22-year-old divorced/separated/married female, working as a skilled employee/official. She has a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and has been employed for less than a year. She has paid back existing credits on time, and is looking for a loan for a radio/television. She owns a car or other property, lives in her own house, and has no other debtors or guarantors. She has one existing credit at the bank, with an installment rate of 4% of disposable income. She has been living at her current residence for 2 years, with a telephone registered under her name. She is the sole provider for one person and is a foreign worker.###\nHence this label was No."
