"The individual is a single male, aged 27, with a skilled job and has been employed for 1 to 4 years. He has a checking account balance between 0 and 200 DM, with savings between 500 and 1000 DM. The purpose of the credit is for business, with a credit amount of 2326 DM. He has no other debts or guarantors and has been living in his current residence for 4 years. He has one existing credit at the bank and no other installment plans. He owns his own house, has no telephone, and is a foreign worker.###\nHence this label was Yes."
"The individual has a moderate amount of cash in their checking account, a short credit history with critical accounts, and is looking to purchase a radio/television. They are employed for 1-4 years, have a stable income, and a low installment rate. The person is a married or widowed male with no other debtors or guarantors. They have been living at their current residence for 2 years, own a car or other property, and are 33 years old. The individual has no other installment plans, owns their own home, has one existing credit at the bank, and is a skilled employee. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, the individual is a foreign worker.###\nHence this label was No."
"The individual in the dataset is a 28-year-old single male, employed for more than 7 years as a skilled employee. He has a good credit history with existing credits paid back duly. He has a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and owns a car or other property. He has no other debtors or guarantors, no other installment plans, and lives in his own home for 4 years. He has taken a credit amount of 1068 for the purpose of buying a radio/television. He has an installment rate of 4% of disposable income, one existing credit at the bank, and is liable to provide maintenance for 2 people. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual is a female who is divorced or separated or married, aged 27 years. She has been living in her current residence for 4 years and has a savings account/bonds with a balance between 100 and 500 DM. She has a job as a skilled employee/official and has been employed for less than 1 year. She has no other debtors or guarantors and no telephone. The individual does not have any other installment plans but has 4 existing credits at the bank. She has 1 person relying on her for maintenance. The purpose of the credit is for furniture/equipment, and the credit amount is 951 DM. The individual is a foreign worker and has a good credit history of paying back existing credits duly.###\nHence this label was No."
"This individual has no checking account and an existing credit history with all credits paid back on time. They are looking to finance a new car with a credit amount of 3079. They have no savings account and have been employed for 1 to less than 4 years. The installment rate for disposable income is 4%. The individual is a single male, has no other debtors or guarantors, and has been living in their current residence for 4 years. They own real estate and are 36 years old. They have no other installment plans, their housing status is owned, and they have one existing credit at this bank. The individual is a skilled employee/official and is responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a 22-year-old divorced/separated/married female with less than 1 year of current employment. They have a checking account with a balance of less than 0 DM and savings of less than 100 DM. The purpose of the credit is for a radio/television. The credit amount is 1366, with an installment rate of 3% of disposable income. They have no other debtors/guarantors and no other installment plans. The individual resides in a rented housing, with 4 years at their current residence. They have a building society savings agreement/life insurance as property. They have one existing credit at the bank, and are a skilled employee/official. They have no telephone but are a foreign worker. They are responsible for providing maintenance for 1 person.###\nHence this label was No."
"This individual has no checking account and is unemployed. They have existing credits paid back on time, a car loan amounting to 672 DM, and savings of less than 100 DM. At 54 years old, they are divorced/separated/married, own real estate, and have lived at their current residence for 4 years. With an installment rate of 1% and no other debts or guarantors, they have a single existing credit at the bank. The person is unemployed/unskilled, non-resident, with one dependent. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female, working as a skilled employee/official. She has no existing checking account but has a savings account/bonds with a balance between 100 and 500 DM. Her current employment tenure is less than 1 year. She owns a car, lives in her own house, and has been at her current residence for 4 years. She is responsible for providing maintenance for one person. The purpose of her credit is for a used car, with a credit amount of 3812. She has a good credit history of repaying existing credits duly. She has one existing credit at the bank and has no other debtors/guarantors. She has no other installment plans and a low installment rate in percentage of disposable income. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"This individual is unemployed and does not have a checking account. They have a critical credit history with other existing credits, want to purchase a radio/television, and have a small amount of savings. Despite being unemployed, they own a house and have 2 existing credits at a bank. At 65 years old, they are female, divorced/separated/married, with no other debtors or guarantors. They have no other installment plans and no telephone. They have been residing in their current place for 4 years and have one person to provide maintenance for. As a foreign worker, they are classified as a bad credit risk.###\nHence this label was Yes."
"This individual is a 26-year-old female who is divorced/separated/married and unemployed/unskilled. She has no existing credits at this bank and has been living in a rented property for 1 year. She does not have a telephone and is a foreign worker. She has no other debtors/guarantors and no other installment plans. She has a savings account with less than 100 DM and has a credit amount of 1778 for a new car. She has been in her current employment for less than 1 year and has an installment rate of 2% of disposable income. She has one person to provide maintenance for and has real estate as her property. Her credit history shows that she has not taken any credits before and has paid back all dues duly.###\nHence this label was No."
"This individual has a checking account balance of at least 200 DM and has a credit history of promptly repaying existing credits. They are taking a loan to purchase furniture or equipment, with a credit amount of 3049. Their savings are less than 100 DM and they have been employed for less than a year. The installment rate on their disposable income is 1%. They are a divorced, separated, or married female. There are no other debtors or guarantors involved. They have been living at their current residence for 1 year and have a building society savings agreement or life insurance. At 45 years old, they have other installment plans at stores and own their house. They have one existing credit at this bank and work as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM, with a credit history of always paying back existing loans on time. They are taking out a 1168 DM loan for a new car, with savings of less than 100 DM. Currently employed for 1 to 4 years, they have a moderate installment rate of 4% of their disposable income. A married/widowed male, they have no other debtors or guarantors. They have been living in their current residence for 3 years, own real estate, and are 27 years old. With no other installment plans, they live in their own home and have one existing credit at the bank. Their job is classified as unskilled-resident, and they are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 34-year-old divorced/separated/married female who has been working at her current job for 4 to 7 years. She has one existing credit at the bank and her credit history with the bank shows that all credits have been paid back duly. She is looking to borrow 1837 DM for education purposes and has a savings account with less than 100 DM. She has no other debtors or guarantors, and she does not have a telephone. She lives in a free housing and has been at her current residence for 4 years. Her installment rate is 4% of her disposable income and she has one person for whom she provides maintenance. She has no property, and her job is categorized as unskilled-resident. She also has a bank installment plan and is a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account of less than 0 DM, with a credit history showing critical account/other credits existing elsewhere. The purpose of the credit is for furniture/equipment, with a credit amount of 1478. They have savings of less than 100 DM, and have been employed for at least 7 years. They have an installment rate of 4% of disposable income, and are male and single. There are no other debtors/guarantors involved. They have been residing at their current residence for 4 years, and own a car or other property not specified. At 44 years old, they have 2 existing credits with the bank and work as a skilled employee/official. They are responsible for providing maintenance for 2 people. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and is unemployed. They have a good credit history of paying back all credits at a bank duly. The purpose of their credit is for a used car. They do not have any savings account and no other debtors or guarantors. They have been living in their current residence for 1 year and own real estate. Their job is in management or self-employment. The individual is a divorced, separated, or married female, aged 53, with one dependent. They have one existing credit at the bank and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been paying back existing credits on time. They took a loan of 1236 for a used car. They have savings between 500 and 1000 DM and have been employed for 1 to 4 years. Their monthly installment rate is 2% of their disposable income. The individual is a 50-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and have a building society savings agreement/ life insurance. They have no other installment plans, live in a rented house, and have one existing credit at this bank. They are a skilled employee/offficial with one person dependent on them. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a 29-year-old divorced/separated/married female, who has been in her current job for at least 7 years as a skilled employee/official. She has been living in her current residence for 2 years and owns her house. She has no savings account, but has an existing checking account with less than 0 DM. She has one existing credit at the bank and pays her installments at a rate of 4% of her disposable income. The purpose of her credit is for a new car, with a credit amount of 915. She has no other debtors/guarantors, and no other people depend on her for maintenance. She has a bank installment plan and doesn't have a telephone. As a foreign worker, she is considered a good credit risk.###\nHence this label was No."
"The individual has less than 0 DM in their checking account and has a credit history of paying back existing credits on time. They are borrowing 1403 DM to buy a new car, with savings of less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate of 2% of their disposable income. The individual is a divorced, separated, or married female, with no other debtors or guarantors. They have been living at their current residence for 4 years and own a car or other property. At 28 years old, they have no other installment plans and live in rented housing. They have one existing credit at the bank and are a skilled employee or official. They have one dependent and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are looking to purchase furniture/equipment with a credit amount of 2515. Their savings are less than 100 DM and they have been employed for 1 to 4 years. With a 3% installment rate, the individual is a single male with no other debtors or guarantors. They have lived in their current residence for 4 years and own real estate. At the age of 43, they have no other installment plans and no other existing credits at this bank. As a skilled employee/official, they are responsible for one person's maintenance. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of a critical account/other credits existing elsewhere. They are taking a 24-month loan for a business purpose. The credit amount is 4139, and they have savings between 100 and 500 DM. They have been employed for 1 to 4 years and have an installment rate of 3% of disposable income. The applicant is a 27-year-old single male, with no other debtors/guarantors, living in their own property. They have been at their current residence for 3 years. They have a building society savings agreement/life insurance as property. The individual has no other installment plans, 2 existing credits at the bank, and is unskilled-resident employed. They have 1 person liable for maintenance, a registered telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a credit history showing critical accounts or other existing credits. The purpose of the credit is for a radio/television. They have savings of less than 100 DM, have been employed for 4 to less than 7 years, and have a manageable installment rate. The individual is a married or widowed male, with no other debtors or guarantors. They have been residing in their current residence for 1 year and own property in the form of a building society savings agreement or life insurance. At 32 years old, they have no other installment plans, own their own home, and have 2 existing credits at the bank. The individual has a job in management, is responsible for providing maintenance for one person, has a registered telephone under their name, and is a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account between 0 and 200 DM, with a credit history of existing credits paid back duly till now. They are seeking a new car with a credit amount of 1318 DM and have savings of at least 1000 DM. Present employment has been held for over 7 years, and the individual has a 4% installment rate in percentage of disposable income. They are a single male, with no other debtors/guarantors, owning real estate, and residing at the current location for 4 years. At the age of 54, the individual has no other installment plans, owns their own home, and has one existing credit at this bank. They are a skilled employee/official with one person to provide maintenance for. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"The individual is a female, divorced/separated/married, aged 24, with no existing checking account. She has been employed for 1 to 4 years, has no other debtors/guarantors, and lives in a rented housing. She has one existing credit at the bank, with a duration of 18 months and a credit amount of 1568 DM. She has savings between 100 and 500 DM, and an installment rate of 3% of disposable income. Her property includes a building society savings agreement/life insurance. She has no other installment plans, no telephone, and is a foreign worker. She is in an unskilled-resident job and is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has a credit history of paying back existing credits on time. They are borrowing 7882 DM for the purpose of purchasing furniture/equipment. Their savings amount is less than 100 DM and they have been employed for 4 to less than 7 years. They have a low installment rate of 2% of disposable income and are a single male. They have a guarantor for other debtors and have been residing in their current residence for 4 years. Their property includes building society savings agreement/life insurance. At 45 years old, they have no other installment plans and live in housing provided for free. They have one existing credit at the bank, are a skilled employee/official, and provide maintenance for 2 people. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a critical credit history with other existing credits. They are seeking a new car loan with a credit amount of 3380. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their installment rate is 1% of disposable income. The individual is a divorced/separated/married female, owning real estate, with one existing credit at the bank. They are a skilled employee/officer, aged 37, with no other installment plans. They live in their own home with 2 dependents, have been at their current residence for 1 year, and have no other debtors/guarantors. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and currently holds a job as a skilled employee or official. They have been in their present employment for 1 to 4 years. The person is a 31-year-old single male, living in their own house for the past year. They have one existing credit at the bank and no other installment plans or debtors/guarantors. The purpose of their credit is for a used car, with a credit amount of 3378. They have no savings account and have a building society savings agreement or life insurance as their property. The individual has a good credit history, with existing credits paid back duly till now. They have an installment rate of 2% of their disposable income. They are also registered for a telephone under their name, and although their savings account is unknown, they are a foreign worker with a positive credit outlook.###\nHence this label was Yes."
"This individual has no existing checking account and has been employed for 1 to 4 years. They took a 15-month credit for a radio/television, with a credit amount of 1360. Their savings account holds less than 100 DM. They are a single male, aged 31, with no other debtors or guarantors. They have been residing in their own property for 2 years and have a building society savings agreement/life insurance. They have 2 existing credits at the bank and work as a skilled employee/official. They are liable for providing maintenance for one individual and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been repaying existing credits on time. They took a loan of 3577 DM for a new car. They have savings between 100 and 500 DM and have been employed for 1 to 4 years. With a low installment rate, they are a single male with a guarantor. They have been living at their current residence for 2 years and own real estate. At 26 years old, they have no other installment plans and live in a rental property. They have one existing credit at the bank and work as a skilled employee. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"This individual is a 44-year-old single male with a stable job, owning real estate and having a good credit history with a minor delay in payments. He has a moderate credit amount, a savings account, and a short credit history. He has no other debtors or guarantors and no other installment plans. He has been living in his current residence for 4 years, has one existing credit at the bank, and two people for whom he provides maintenance. He has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"The individual is a 23-year-old divorced/separated/married female, working in an unskilled-resident job for less than a year. She has a savings account with less than 100 DM, has been living in a rented place for 4 years, and has a co-applicant for other debts/guarantors. She has 2 existing credits at the bank, pays 4% of her disposable income as installment rate, and has no other installment plans. She has a good credit history but is in a critical account with other existing credits. The purpose of her loan (credit amount: 6229 DM) is for furniture/equipment. She has one dependent and a telephone registered in her name. Additionally, she is a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has had credit history with critical accounts or other existing credits, and is seeking a loan for furniture/equipment. They are looking to borrow 3384 DM for a duration of 6 months. They have savings of less than 100 DM, have been employed for 1 to 4 years, and have a low installment rate as a percentage of their disposable income. The individual is a 44-year-old male who is divorced/separated, has no other debtors or guarantors, and has been living in their current residence for 4 years. They own real estate, have no other installment plans, and rent their housing. They have one existing credit at the bank, are in a management/self-employed/highly qualified job, and have one person dependent on them for maintenance. They have a registered telephone under their name and are a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of less than 0 DM and has had no previous credit history. They are borrowing money for repairs, with a credit amount of 1108. Their savings account/bonds hold less than 100 DM. They have been employed for 4 to 7 years and their disposable income installment rate is 4%. The individual is a 28-year-old single male with no other debtors or guarantors. They have been living in their current residence for 3 years and own real estate. The individual has no other installment plans or telephone, and is a skilled employee/official. They are responsible for one person's maintenance and are a foreign worker.###\nHence this label was No."
