"The individual has a checking account with a balance of at least 200 DM and has been employed for less than a year. Their credit history shows a critical account or other existing credits. The purpose of the credit is for education, with a credit amount of 2319. They have savings of less than 100 DM and a low installment rate. The person is a 33-year-old divorced/separated male, with no other debtors or guarantors. They have been residing in their current residence for 1 year, renting a property. The individual has one existing credit at the bank and works as a skilled employee/official. They have no other installment plans, no telephone, and are a foreign worker.###\nHence this label was No."
"The individual in this dataset is a 65-year-old single male with no checking account and an unknown or no savings account. He has been employed for at least 7 years as a skilled employee/official. His credit history shows critical accounts/other credits existing elsewhere. He is looking to borrow money for a radio/television. He owns a real estate property and has been living at his current residence for 4 years. He has no other installment plans, no other debtors/guarantors, and no telephone. He has 4 existing credits at the bank and is liable to provide maintenance for one person. He is a foreign worker and has a moderate installment rate in percentage of disposable income.###\nHence this label was Yes."
"This individual is a 22-year-old female who is divorced or separated, currently employed for 1 to 4 years as a skilled employee, and owns a real estate property. She has a good credit history with existing credits paid back duly, and a stable financial situation with a moderate credit amount of 5951 DM. She has a savings account with less than 100 DM, no other debtors or guarantors, and no other installment plans. She has been residing at her current residence for 2 years, has one existing credit at the bank, and is responsible for providing maintenance for one person. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual has less than 0 DM in their existing checking account, has had credit for 12 months, and has a critical credit history with other credits at different banks. They are seeking a new car loan with a credit amount of 2171. Their savings are less than 100 DM, and they have been employed for 1 to less than 4 years. The individual's personal status is a single male, with no other debtors or guarantors. They have been living at their current residence for 4 years and have a building society savings agreement or life insurance. The individual is 38 years old, has installment plans with a bank, and owns their own home. They have 2 existing credits at this bank and work in an unskilled resident job. They are responsible for providing maintenance for one person, do not have a telephone, and are not a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and an unknown or non-existent savings account. They have been employed for at least 7 years in a management or self-employed role. They are single, male, and 41 years old. The purpose of the credit is for a used car, with a duration of 24 months and a credit amount of 6313. They have no other installment plans, no other debtors or guarantors, and own their own home. They have been residing at their current residence for 4 years. They have one existing credit at the bank and are responsible for providing maintenance for two people. They have a telephone registered under their name, and they are a foreign worker.###\nHence this label was Yes."
"This individual is a 26-year-old female who is divorced/separated/married. She has a good credit history with no previous credits taken and has always paid back duly. She currently has a small credit amount for furniture/equipment and has a stable income with less than 1 year of employment. She lives in a rented house and has been at her current residence for 4 years. She has no other debts or loans, no other installment plans, and no other people to provide maintenance for. She has a single existing credit at the bank and has savings of less than 100 DM. She works as a skilled employee/official and is a foreign worker. She does not have a telephone.###\nHence this label was No."
"This individual is a 25-year-old divorced/separated/married female, who has been employed for at least 7 years as a skilled employee/official. She has no existing debtors/guarantors, owns her own home, and has been residing at the same place for 4 years. She has one ongoing credit at the bank, with no other installment plans. Although she has no savings account, she is a responsible credit user with a good credit history. She is seeking a loan amount of 2991 DM for the purpose of purchasing a radio/television. Additionally, she does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of critical account/other credits existing. They are borrowing money to purchase a radio/television, with a credit amount of 9566. Their savings are less than 100 DM. They have been employed for 1 to less than 4 years and the installment rate is 2% of their disposable income. The individual is a female who is divorced, separated, or married. They have no other debtors/guarantors and have been residing at their current place for 2 years. Their property is a car or other, not specified in attribute 6. At 31 years old, they have other installment plans at stores and own their own home. They have 2 existing credits at this bank and work as a skilled employee/official. They have 1 person they are financially responsible for and do not have a telephone. Despite being a foreign worker, they are classified as a good credit risk.###\nHence this label was Yes."
"This individual has no checking account and a credit history of delayed payments in the past. They are looking to purchase a radio/television and require a credit amount of 12749. They have savings between 500 and 1000 DM, have been employed for 4 to 7 years, and have a 4% installment rate. The person is a single male in their late thirties with no other debtors/guarantors. They have been residing in their current home for 1 year, own a car or other property, and have no other installment plans. The individual works in a management/self-employed/highly qualified role and is responsible for one person's maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has no existing checking account and has a good credit history with existing credits paid back on time. They are taking a 24-month loan for the purpose of purchasing a radio or television. They have between 100 and 500 DM in savings and have been employed for 1 to 4 years. With an installment rate of 4%, they are a single male in their late 20s with no other debtors or guarantors. They have been living in their current residence for 4 years and their property includes a car. The individual has no other installment plans, rents their housing, and holds a management/ self-employed job. They are responsible for one person and have a telephone registered in their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has not taken any credits or has paid all credits back duly in the past, and is seeking credit for repairs. They have a credit amount of 1108 and savings of less than 100 DM. They have been employed for 4 to 7 years and their disposable income installment rate is 4. The individual is a 28-year-old single male, has no other debtors or guarantors, and has been residing in their current residence for 3 years. They own real estate, have no other installment plans, and their housing situation is owned. They have 2 existing credits at the bank, are a skilled employee/official, and have 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no existing checking account and an unknown or nonexistent savings account. They have been employed for 1 to 4 years and have a low installment rate in percentage of disposable income. The credit history is considered critical with other credits existing elsewhere. The purpose of the credit is for furniture or equipment. They are a 27-year-old married or widowed male who owns their own home. They have no other debtors or guarantors, no other installment plans, and no telephone. They have two existing credits at this bank and are a skilled employee or official. They have been residing at their current residence for 2 years and have 1 person they are liable to provide maintenance for. They have a building society savings agreement or life insurance and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a history of delays in paying off debts, and is currently unemployed. They are looking to finance a new car with a credit amount of 1333. With savings less than 100 DM, they have been residing in a real estate property for 2 years. Being a single male at the age of 43, they have no other debtors or guarantors. They have a job as a skilled employee / official and are responsible for providing maintenance for 2 people. The individual has no other installment plans, no telephone, and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has had a critical account/other credits existing in the past. They are taking a loan to purchase furniture/equipment, with a credit amount of 5150. Their savings are less than 100 DM and have been employed for at least 7 years. They have no other installment plans, own their own home, and have one existing credit at this bank. The individual is a 33-year-old single male, a skilled employee, with no other debtors/guarantors. They have been living at their current residence for 4 years, with no other people to provide maintenance for. They have a telephone registered under their name, are a foreign worker, and have a car or other property not specified in the data.###\nHence this label was Yes."
"This individual is a young, single male with a stable job and no outstanding debt. He has been living in his own home for a year and has a good credit history of paying back loans on time. He is looking to finance furniture/equipment for an installment rate that is manageable based on his disposable income. Despite not having any savings, he has a steady income and is financially responsible. He has a positive credit outlook and is considered a good credit risk.###\nHence this label was Yes."
"This individual is a 45-year-old single male with no checking account, who has been employed for more than 7 years in a skilled position. They are seeking a new car with a credit amount of 10875. They have savings of less than 100 DM, own their own home, and have been living at their current residence for 2 years. They have two existing credits at the bank and two people they are financially responsible for. They have no other debtors or guarantors, installment plans, or significant other property. They have a low installment rate of 2% and possess a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 27-year-old unemployed divorced/separated/married female, with no existing checking account balance. She has paid back existing credits on time, and is seeking a loan of 750 DM for education purposes. She has savings of less than 100 DM and owns real estate. With an installment rate of 4%, she has no other debts or guarantors. She has been living in her current residence for 1 year and has 1 existing credit at the bank. She has no other installment plans, and her housing status is own. She is unemployed/ unskilled - non-resident, with 1 person dependent on her for maintenance. She does not have a telephone, but is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has never taken any credit or has always paid back credits on time. They are requesting a loan for a used car, amounting to 9436 credits. Their savings account status is unknown. They have been employed for 1 to less than 4 years and dedicate 2% of their disposable income to loan installments. The individual is a 39-year-old single male with no other debtors or guarantors. They have been residing in their current location for 2 years and own their own home. They have one existing credit at a bank and work as an unskilled resident with 2 dependents. The individual does not have any other installment plans and does not own a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM. They have a credit history of a critical account or other existing credits, and they are looking to finance a new car. The credit amount requested is 1299. Their savings account holds less than 100 DM, and they have been employed for 1 to less than 4 years. They have a low installment rate, are a single male, and have no other debtors or guarantors. They have been living in their current residence for 1 year and own real estate. At 74 years old, they have no other installment plans and no telephone. They have 3 existing credits at the bank and are unemployed or unskilled, non-resident. They are responsible for 2 people's maintenance and are not a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account, has a credit history of critical account/other credits existing, and is borrowing 2246 DM for furniture/equipment. They have savings of less than 100 DM, have been employed for at least 7 years, and have a 3% installment rate. The individual is a 60-year-old single male, has no other debtors/guarantors, and has been living in their current residence for 3 years. They have a building society savings agreement/life insurance, no other installment plans, and own their own home. The individual has 2 existing credits at their bank, is a skilled employee/official, and is liable to provide maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual in this example has a checking account balance of at least 200 DM. They have a credit history of a critical account or other existing credits, not with this bank. The purpose of the credit is for a new car. The credit amount is 1344. Their savings account status is unknown or they have no savings. They have been employed for 4 to less than 7 years. The installment rate as a percentage of disposable income is 4. The individual is a single male. They have no other debtors or guarantors. They have been living at their current residence for 2 years. They own real estate. The individual is 37 years old. They have another installment plan with a bank. They own their housing. They have 2 existing credits at this bank. Their job is unskilled and they are a resident. They have 2 people they are financially responsible for. They do not have a telephone. They are a foreign worker.###\nHence this label was No."
"This individual is a 25-year-old divorced/separated/married female, working as a skilled employee/official. She has no checking account, unknown/no savings account, and has been employed for 1 to less than 4 years. Currently, she resides in her own home for the past 4 years. She has no other debtors/guarantors or other installment plans. The purpose of her credit is for a radio/television, with a credit amount of 2394 lasting for 36 months. She has a single existing credit at this bank, an installment rate of 4%, and no telephone. Additionally, she has no one else dependent on her for maintenance. Being a foreign worker, she is deemed a good credit risk based on her timely credit repayments.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, no previous credit history, and is currently unemployed. They are seeking a business loan of 5293 DM for a duration of 27 months. They have savings of less than 100 DM and own property in the form of a building society savings agreement/life insurance. At 50 years old, they are a single male with a stable residence of 4 years. They have two existing credits at the bank, work as a skilled employee/official, and have one dependent. Their housing status is owned, they have a telephone registered in their name, and they are a foreign worker.###\nHence this label was No."
"The individual is a 25-year-old married/widowed male, working as a skilled employee/official for 1-4 years, residing in a rented house for 2 years. They have a good credit history of promptly repaying all credits at the bank, with a current credit amount of 1264 DM for a new car. They have savings between 100 and 500 DM, no other installment plans or debtors/guarantors, and no telephone. The individual has 1 existing credit at the bank, with a moderate installment rate of 2% of disposable income. Additionally, they have a building society savings agreement/life insurance, with no other people dependent on them for maintenance. They are a foreign worker and have no other credits or financial obligations.###\nHence this label was No."
"This individual has less than 0 DM in their existing checking account and has had their current employment for at least 7 years. They are looking to purchase a new car and have a credit history of critical accounts or other existing credits. Their credit amount is 691 DM and their savings amount is less than 100 DM. They are a single male, 35 years old, with no other debtors or guarantors. They have been living in their own residence for 3 years and have a building society savings agreement/life insurance as their property. They have two existing credits at this bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a good credit risk as they have a stable financial situation with a checking account balance of less than 0 DM, long term employment of at least 7 years, and a low installment rate. They are borrowing a moderate amount for a new car and have some savings. The person is a 60-year-old single male, owning their own home with no other significant debts. They have a good credit history with two existing credits at the bank and appear financially responsible.###\nHence this label was No."
"This individual has no checking account and is unemployed. They have a good credit history with existing credits paid back duly. The purpose of the credit is for a new car. They have savings of less than 100 DM and own real estate. With a credit amount of 672 and an installment rate of 1%, this person, a 54-year-old divorced/separated/married female, has been residing at their current residence for 4 years. They have no other installment plans, no other debtors or guarantors, and no current job. The individual has one existing credit at the bank and one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with balance less than 0 DM and has been employed for over 7 years. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a used car. They do not have any savings account and own no property. The individual is a 49-year-old single male, working as a skilled employee/offcial, with 2 dependents. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single, 53-year-old male with a stable job and a good credit history. They have a checking account with less than 0 DM, savings of less than 100 DM, and have been employed for more than 7 years. The purpose of their credit is for furniture/equipment, and they have no other debts or guarantors. They live in a residence for free and have been at the current address for 4 years. They have one existing credit at the bank and no other installment plans. The individual has a telephone registered under their name, and they are a foreign worker.###\nHence this label was No."
"This individual is a 47-year-old single male with a steady job (4-7 years) as an unskilled resident. He has a good credit history with no other debts at this bank. His existing checking account balance is between 0 and 200 DM, and he has some savings (<100 DM). The purpose of his credit is for a new car, with a credit amount of 958. He has been living in his own real estate property for 3 years and has two existing credits at this bank. He has no other installment plans and no phone. He is responsible for providing maintenance for 2 people and is a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a stable employment history of over 7 years. They have paid existing credits on time. The purpose of the credit is for a new car, and the amount is 2507 DM. They have savings between 500 and 1000 DM and no other significant assets. The individual is a 51-year-old single male with no other debtors or guarantors. They live in a residence for free and have been at their current address for 4 years. The individual has a low installment rate and no other significant installment plans. They have an unskilled job and are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old unemployed female, divorced/separated/married, with no other debtors or guarantors. They have a good credit history with existing credits paid back duly. Their current housing situation is renting, and they have been living at their present residence for 4 years. They have no savings or property, and their existing checking account balance is between 0 and 200 DM. The purpose of their credit is for a radio/television, with a credit amount of 3758 DM. They have no other installment plans and no telephone. They have one existing credit at this bank, with an installment rate of 1% of disposable income. They are unemployed/unskilled - non-resident, and responsible for providing maintenance for one person. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 27-year-old single male with a stable job, owning real estate as his place of residence. He has a moderate credit amount of 7418 DM and has been timely with his payments. He has no savings account but a good credit history, with only one existing credit at the bank. He has no other significant debts or liabilities, and is a responsible borrower.###\nHence this label was Yes."
"This individual is a 43-year-old divorced/separated male with a stable job as a skilled employee/official. He has been living in his own home for 3 years, owns a car or another type of property, and has a good credit history with existing credits paid back duly. His existing checking account holds between 0 and 200 DM, with savings of less than 100 DM. He has no other debtors or guarantors, no other installment plans, and a telephone registered under his name. The purpose of his credit is for furniture/equipment, with a duration of 24 months and a credit amount of 4057. He has a low installment rate in percentage of disposable income, one existing credit at the bank, and is liable for providing maintenance for one person. He is also a foreign worker.###\nHence this label was No."
"The individual has no checking account and unknown savings. They have been employed for less than a year and have a stable income. They are using the credit to buy a new car, and have a good credit history. The individual is male, divorced/separated, owns real estate, and lives alone. They have two existing credits, no other installment plans, and a low installment rate. At 44 years old, the individual is a skilled employee with a positive credit rating. They have one dependent, a telephone, and are a registered foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has a credit history of a critical account/other credits existing elsewhere. They are looking to secure a new car with a credit amount of 2775. Their savings account holds less than 100 DM, and they have been employed for 4 to less than 7 years. With an installment rate of 2% of disposable income, this single male individual has no other debtors or guarantors. They have been residing in their current location for 2 years and own their housing. Aged 31, they have a building society savings agreement/life insurance and one existing credit at the bank. Their job is as a skilled employee/official and have one person relying on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no existing checking account and unknown savings. They have been repaying existing credits diligently and have been employed for 1 to 4 years in a business-related field. With a credit amount of 3914 and owning real estate, they have a moderate installment rate and reside in their own home. They are a 38-year-old divorced/separated male, with no other debtors or guarantors. Their job is that of a skilled employee/official, with one existing credit at the bank. They have no telephone but are a foreign worker, liable for providing maintenance to one person.###\nHence this label was No."
"The individual in this data is a 38-year-old single male, working as a skilled employee or official for more than 7 years. He has no existing debtors or guarantors, owns his own house, and has 1 existing credit at the bank. He has been living at his current residence for 4 years. He has no savings account but has paid back existing credits duly till now. He is not enrolled in any other installment plans and does not have a telephone. He is a foreign worker with no other people reliant on him for maintenance. The purpose of the credit is for a radio/television, with a credit amount of 368 DM and an installment rate of 4%.###\nHence this label was Yes."
"This individual has no checking account and an existing credit history of a critical account/ other credits. They are looking to finance a used car for a duration of 30 months with a credit amount of 7596. Their savings account status is unknown/no savings account. They have been employed for at least 7 years and have a low installment rate. The individual is a single male, 63 years old, with no other debtors or guarantors. They have been residing in their current residence for 4 years and own a car or other property. They have no other installment plans, own their own home, and have 2 existing credits at their bank. The individual is a skilled employee/official with 1 dependent and no telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has a credit history of repaying existing credits on time. They are taking a loan of 1372 DM to purchase a new car. Their savings are less than 100 DM and they have been employed for 4 to 7 years. They have no other debtors or guarantors and have been living at their current residence for 3 years. The individual is a 36-year-old divorced/separated male with no other installment plans, owning their own house. They have one existing credit at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a single male, aged 42, working as a skilled employee or official for 1 to less than 4 years. He has existing credits paid back duly, no other debtors or guarantors, and one existing credit at the bank. He has been residing in his current residence for 4 years, owns no property, and lives in a house for free. His savings amount is less than 100 DM, with a checking account balance between 0 and less than 200 DM. He has no other installment plans, no telephone, and is a foreign worker. He took a credit for education purposes, amounting to 6288 DM, with an installment rate of 4% of his disposable income. He is the sole provider for 1 person.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, with a credit history of critical account/other credits existing. They are taking a loan of 1361 DM to purchase a new car. Their savings amount is less than 100 DM, and they have been employed for less than a year. The installment rate for the loan is 2% of their disposable income.\n\nThe individual is a 40-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and own real estate. They have no other installment plans or telephone. They have one existing credit at the bank and work as an unskilled resident.\n\nAdditionally, they are responsible for providing maintenance for 2 people and are not a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their checking account and has paid back existing credits on time. They are looking to purchase a radio/television. With a credit amount of 2606, they have savings of less than 100 DM. They have been employed for less than 1 year and their disposable income installment rate is 4%. The individual is a 28-year-old divorced/separated/married female with no other debtors. They have been living in their current residence for 4 years and their property includes a building society savings agreement or life insurance. They have no other installment plans and live in rented housing. Additionally, they have one existing credit at the bank and work in a high-level job. They are responsible for providing maintenance for one person and have a telephone registered under their name. Finally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a single male, aged 48, with a stable job held for at least 7 years as an unskilled resident. He has no other debtors or guarantors, no existing telephone, and owns his own home. He has a moderate credit amount of 1743 DM, with a short credit history and two existing credits at the bank. He has been living at his current residence for 2 years and has no other installment plans or savings above 100 DM. He has one dependent and is a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old divorced/separated/married female, who has been employed for less than 1 year in an unskilled-resident job. She has no other debtors/guarantors and no telephone. She has a checking account balance between 0 and 200 DM, with savings of less than 100 DM. She has been living in her current residence for 4 years and owns her own home. She has one existing credit at a bank and is responsible for providing maintenance for one person. She is a foreign worker with good credit history, seeking a loan for furniture/equipment with a credit amount of 4736 DM. She has a low installment rate and has chosen a bank for other installment plans.###\nHence this label was No."
"The individual has no checking account and has a good credit history with existing credits paid back duly. They took a loan for education amounting to 4623 DM and have savings between 100 to 500 DM. Currently employed for 1 to 4 years, with a moderate installment rate. The individual is a 40-year-old single male, with no other debtors or guarantors. They have been living in their own property for 2 years and have a building society savings agreement/life insurance. The individual has a management/self-employed job and is responsible for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has less than 0 DM in their existing checking account. They have a good credit history with no previous credits outstanding. The purpose of the credit is for business. They are looking to borrow 3104 DM for a duration of 18 months. They have savings of less than 100 DM and have been in their current employment for 4 to 7 years. Their disposable income installment rate is 3%. The individual is a 31-year-old single male with no other debtors or guarantors. They have been living at their current residence for 1 year and own their own home. They have one existing credit at this bank and work as a skilled employee. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account balance of less than 0 DM, with a credit history of repaying all credits at the bank on time. They are seeking a loan for a radio/television. The amount requested is 1940 DM, with savings of less than 100 DM. They have been employed for less than 1 year and have an installment rate of 3% of disposable income. The individual is a 36-year-old single male, with a co-applicant as a debtor/guarantor. They have been living at their current residence for 4 years and have unknown/no property. The individual has one existing credit at the bank, works in a managerial or self-employed position, and has one person dependent on them for maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a 24-year-old female, divorced/separated/married, with no checking account. She has been employed for 4-7 years as a skilled employee/official. She lives in a rented house with one dependent. She has two existing credits at the bank and a credit history of critical accounts/other credits. The purpose of the credit is for a radio/television. She has a credit amount of 1554, savings less than 100 DM, and no other installment plans. She has no other debtors/guarantors and resides at her current residence for 2 years. She has a 1% installment rate on disposable income and a registered telephone under her name. She owns a car or other property not specified. Additionally, she is a foreign worker.###\nHence this label was Yes."
"This individual has a good credit risk based on the following attributes:\n- They have between 0 and 200 DM in their existing checking account.\n- The credit history shows critical accounts/other credits existing.\n- The purpose of the credit is for a new car.\n- They have an installment rate of 4% of disposable income.\n- They are a single male with over 7 years of employment.\n- There are no other debtors/guarantors involved.\n- They have been living at their current residence for 4 years.\n- They own real estate as property.\n- The individual is a skilled employee/official with 2 existing credits at this bank.\n- They are responsible for providing maintenance for 1 person.\n- They do not have a telephone but are a foreign worker.\nOverall, this individual appears to be financially stable with a solid credit history and a steady job, making them a good credit risk.###\nHence this label was Yes."
"This individual does not have a checking account and has been in their current employment for less than 1 year. They have taken a loan for furniture/equipment amounting to 2146 credits. Their savings are less than 100 DM. They are a divorced/separated/married female, with no other debtors or guarantors. They have been living in their current residence for 3 years and own real estate. At 23 years old, they have no other installment plans and live in a rental property. They are a skilled employee/official with 2 existing credits at the bank. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM and has been paying back existing credits on time. They took a loan for a radio/television and borrowed 1881 DM. They have savings of less than 100 DM and have been employed for 1-4 years. Their disposable income installment rate is 2% and they are a divorced/separated/married female. They have no other debtors/guarantors and have been living in their current residence for 2 years. They own a car or other property not specified. At 44 years old, they have no other installment plans, rent their housing, have one existing credit at the bank, and work as an unskilled resident. They are responsible for providing maintenance for one person. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has been in their current employment for 4 to 7 years. They have paid back existing credits duly, are seeking a new car loan amounting to 3249 DM. They have savings of less than 100 DM and no other debtors or guarantors. The individual is a 39-year-old single male in a management position, living in a property for free. They have one existing credit at this bank, no other installment plans, and a telephone registered under their name. Additionally, they have been residing at their current residence for 4 years, have an installment rate of 2% of disposable income, and two people dependent on them for maintenance. They are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are looking to purchase domestic appliances and need a credit amount of 1262. Their savings range from 500 to less than 1000 DM and they have been employed for 4 to less than 7 years. The installment rate of their disposable income is 4%. The individual is a 36-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 3 years and have a building society savings agreement or life insurance. They have no other installment plans, own their own home, and have two existing credits at the bank. The individual is a skilled employee or official, with one person liable for maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and a credit history with critical accounts/other credits. They are seeking a loan for a radio/television. The credit amount requested is 1800 with savings less than 100 DM. They have been employed for 1 to less than 4 years and have a 4% installment rate. The individual is a 24-year-old single male with no other debtors or guarantors. They have been living at their current residence for 2 years and own a car or another property. The individual has no other installment plans, no telephone, is a skilled employee/official, and is responsible for one person's maintenance. They are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 41-year-old divorced/separated/married female with a stable job of 4-7 years. She has a good credit history with some existing credits and savings. She is looking for a business loan and owns real estate. She has 2 existing credits at a bank, no other debtors, and no telephone. She has a low installment rate and one dependent. Additionally, she is a foreign worker with no other installment plans and does not have a telephone.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history of paying back existing credits on time. They are seeking a loan for furniture/equipment, with a credit amount of 1533. Their savings account holds less than 100 DM. They have been employed for less than a year and have a low installment rate. The individual is a married or widowed male, with a co-applicant as a debtor/guarantor. They have been residing in their own property for 1 year. At 43 years old, they have no other installment plans, one existing credit at the bank, and work as an unskilled resident with two dependents. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM and has been in their current employment for less than a year. They have paid back existing credits on time and are looking to purchase furniture/equipment using a credit amount of 3749. They have savings of less than 100 DM and no other installment plans. Living in their own home for 4 years, they are a 26-year-old female who is divorced/separated/married. They have no other debtors/guarantors and no telephone. With a stable job as a skilled employee/official, they are responsible for one dependent and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a 24-month loan to buy a new car, with a credit amount of 7393. Their savings account/bonds hold less than 100 DM. They have been employed for 1 to less than 4 years and have a low installment rate in percentage of disposable income. The individual is a 43-year-old single male, with no other debtors or guarantors. They have been residing in their current home for 4 years, which they own. Their property includes a building society savings agreement/life insurance. The individual has no other installment plans, one existing credit at the bank, and holds an unskilled-resident job. They have 2 dependents and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account balance of at least 200 DM and has been repaying existing credits on time. They are looking to make a purchase related to radio/television and need a credit amount of 3913. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a low installment rate, are male and single, and have no other debtors or guarantors. They have been residing at their current place for 2 years and own real estate. At 23 years old, they have no other installment plans, 1 existing credit at the bank, and work as a skilled employee or official. They are solely responsible for providing maintenance for 1 person. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an existing good credit history. They are looking to finance a new car with a credit amount of 3079 over a 36-month period. Their savings account status is unknown. They have been employed for 1 to less than 4 years and have a low installment rate in percentage of disposable income. The individual is a 36-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and own real estate. They have no other installment plans and no telephone. The individual is a skilled employee/official with one existing credit at the bank. They are the sole provider for themselves and have confirmed they are a foreign worker.###\nHence this label was Yes."
"This individual is a 38-year-old divorced or separated or married female, unemployed but with a high-ranking job. She has no existing credits except one at the bank, and has been living for four years in a free housing. She has a good credit history of paying back existing credits duly. She has a savings account with less than 100 DM, and no other debts or guarantors. She is responsible for providing maintenance to one person. Additionally, she has a telephone registered under her name and is a foreign worker. She is looking to use a car and has taken a credit amount of 12976 for a duration of 18 months with an installment rate of 3%.###\nHence this label was No."
"This individual has no checking account and has a credit history of paying back existing credits on time. They took a loan for a new car amounting to 1418 credits. Their savings fall in the range of 100 to less than 500 DM. They have been employed for 1 to less than 4 years and their disposable income has an installment rate of 3%. The person is a 35-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years, which is a rented property. They have one existing credit at the bank and work as an unskilled resident. They are liable to provide maintenance for one person and do not have a telephone. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"The individual is a single male, aged 23, with no existing credits at the bank, working as a skilled employee/official for over 7 years. He has a stable present residence of 4 years in a rented house. His existing checking account has less than 0 DM, and savings of less than 100 DM, with no other property. He has no other debtors/guarantors, no telephone, but has a foreign worker status. The individual has taken no credits previously and has always paid back duly. He is looking to purchase furniture/equipment with a credit amount of 4110, with an installment rate of 3% of disposable income. Additionally, he has two people dependent on him for maintenance, and has another installment plan with a bank.###\nHence this label was No."
"This individual has no checking account and has a credit history of delay in paying off in the past. They are seeking a loan for business purposes, amounting to 9572. Their savings account/bonds hold less than 100 DM. They have been employed for less than a year and have a low installment rate in percentage of disposable income. The individual is a 28-year-old divorced/separated male, with no other debtors or guarantors. They have been residing in their own home for 1 year and possess a car or other property not included in their assets. They have no other installment plans, no telephone, and are a skilled employee/official. They have 2 existing credits at the bank and are liable to provide maintenance for one person. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a 60-year-old unemployed divorced/separated male with good credit history. They have no savings and own a real estate property. They have one existing credit at the bank and are liable for one person's maintenance. Their loan duration is 20 months with a credit amount of 6468 DM for a used car. They have a low installment rate and no other debts or guarantors. They have a management job and a telephone registered in their name. Additionally, they are a foreign worker and have been living in their own home for 4 years.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, a credit history of delayed payments, and has been in their current job for at least 7 years. They are looking for a business loan with a credit amount of 6836 DM. They have savings of less than 100 DM and own a house. The individual is a 63-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and have no other installment plans. They have 2 existing credits at the bank and work as a skilled employee or official. They have 1 person liable for maintenance, a registered telephone, and are a foreign worker.###\nHence this label was No."
"This individual has a stable credit history with existing credits paid back duly. They have a moderate credit amount of 12612 DM, with savings of 100 <= ... < 500 DM. They have been employed for 1 <= ... < 4 years and have a low installment rate. Their personal status is male and single. They have no other debtors or guarantors, and have been living at their current residence for 4 years. They have unknown or no property, are aged 47, and have no other installment plans. Their housing is for free and they have one existing credit at the bank. They are a skilled employee/official with two people liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account between 0 and 200 DM with a credit history of paying back existing credits duly. The purpose of the credit is for repairs, with a credit amount of 2384 DM. They have savings of less than 100 DM and have been employed for less than 1 year. The installment rate is 4% of disposable income. The individual is a 33-year-old single male, with no other debtors or guarantors. They have been residing at their current residence for 1 year and have unknown/no property. They have no other installment plans, live in a rented house, and have one existing credit at the bank. Their job is unskilled and they are a resident. They have one person liable for maintenance and do not have a telephone. They are a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old single male, working as a skilled employee with 1-4 years of employment history. He has a checking account with less than 0 DM, savings of less than 100 DM, and no existing debts with other parties. He has been living in his current residence for 4 years, with no property ownership. His credit history shows that he has been paying back existing credits on time. The purpose of his credit application is for a radio/television, with a credit amount of 1845. He has no other installment plans, but his disposable income installment rate is 4%. He has a phone registered in his name and is a foreign worker. Overall, he appears to be a responsible individual seeking credit for a specific purchase.###\nHence this label was No."
"This individual has less than 0 DM in their existing checking account. They have a credit history of delayed payments in the past and are looking to finance a radio/television. With a credit amount of 4370 and savings of less than 100 DM, they have been employed for 4 to 7 years. Their disposable income installment rate is 3, and they are a 26-year-old single male. They have no other debtors or guarantors and have been living in their current residence for 2 years. Their property includes a building society savings agreement/life insurance, and they have other installment plans with a bank. They own their own house and have 2 existing credits at this bank. As a skilled employee/official, they are responsible for providing maintenance for 2 people. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a 35-year-old single male with no savings account, currently unemployed or in an unskilled non-resident job. He has a checking account balance between 0 and 200 DM, has been living in his current residence for 2 years, and owns his house. He has one existing credit at the bank and no other installment plans. He is responsible for providing maintenance for one person. He has no other debtors or guarantors and does not have a telephone. He is a foreign worker and has a good credit history of paying back existing credits duly. He is seeking a new car loan of 1549 DM and has an installment rate of 4% based on his disposable income.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has a good credit history with existing credits paid back duly. They are taking a 12-month loan for furniture/equipment, amounting to 708 DM. Their savings are below 100 DM and they have been employed for 1 to 4 years. They have a low installment rate, are male and single, with a guarantor for other debtors. They have been living in their current residence for 3 years and own a building society savings agreement/life insurance property. At 38 years old, they have no other installment plans and own their own home. They have one existing credit at the bank, an unskilled-resident job, and 2 people to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They took a loan for a radio/television, amounting to 2753 DM. Their savings are between 100 and 500 DM, and they have been employed for over 7 years. The installment rate is 3% of their disposable income. The individual is a single male, with a co-applicant as other debtors/guarantors. They have been residing in their current residence for 4 years and own a car or other property. At 35 years old, they have no other installment plans and live in their own house. They have one existing credit at the bank and work as a skilled employee/official. They are liable for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a small amount of money in their existing checking account. They have a credit history of repaying loans on time. The purpose of the loan is to buy a used car. The amount of credit requested is moderate. They have some savings. They have been employed for 1 to 4 years. The percentage of their disposable income used for loan installments is low. The individual is a single, male guarantor. They have been living at their current residence for 4 years. They have no property of their own. At 63 years old, they are an older applicant. They have another loan with a bank. They own their own home. They have one other credit at the bank. They are a skilled employee or official. They are responsible for providing maintenance for two people. They have a telephone registered under their own name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old female who is divorced/separated/married. She has been employed for 1 to 4 years as a skilled employee/official. She has existing credit with less than 0 DM in her checking account and savings of less than 100 DM. Her credit history shows a critical account/other credits existing elsewhere. The purpose of her credit is for furniture/equipment. She currently resides in a rented property with a 4-year history at that residence. She has 2 existing credits at the bank and no other installment plans. She has no other debtors or guarantors, and no telephone. She is a foreign worker and is responsible for one dependent.###\nHence this label was No."
"This individual is a single male, aged 28, with no existing checking account. They have been employed for 1 to 4 years and live in their own home. Their credit history shows a delay in paying off debts in the past. The purpose of the loan is for a used car and the credit amount is 2993. They have savings of less than 100 DM and no other debtors or guarantors. They have been residing at their current address for 2 years and have 2 existing credits at this bank. Their property is real estate and they have another installment plan at stores. They work as an unskilled resident with one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has a credit history of paying back existing credits on time. They are seeking a new car loan, with a credit amount of 709 DM. Their savings account/bonds balance is at least 1000 DM. They have been at their current job for less than a year and have a low installment rate relative to their disposable income. The person is a 27-year-old married/widowed male, residing in their own real estate property. They have no other installment plans, no other debtors or guarantors, and no telephone. The individual is unemployed or working in an unskilled non-resident job and is not a foreign worker. They have been living at their current residence for 2 years and have one existing credit at the bank. Additionally, they are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual, a 27-year-old divorced/separated/married female, has been in their current job as a skilled employee/official for 4 to less than 7 years. They have no other debtors/guarantors, no other installment plans, and own their own home. With a duration of 12 months, they have a good credit history of paying back existing credits duly. They are looking to use a credit amount of 2930 DM for the purpose of radio/television. Their existing checking account holds between 0 to less than 200 DM, while their savings account/bonds hold less than 100 DM. They have been living in their current residence for 1 year and have 1 existing credit at the bank. Additionally, they have no telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a credit history with critical accounts/other credits. They are seeking a loan for furniture/equipment, with a credit amount of 2028 and savings of less than 100 DM. They have been employed for 4 to 7 years and have a low installment rate percentage. The person is a 30-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own their housing. The individual has 2 existing credits at this bank, an unskilled-resident job, and 1 person to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been employed for less than a year. They have paid back all credits at this bank duly. The purpose of the credit is for a used car. They do not have savings account or bonds, and their housing situation is renting. They have a guarantor for other debtors and their property is real estate. The individual is a single male, 40 years old, with a job as a skilled employee/official. They have two existing credits at this bank, with an installment rate of 3% of disposable income. They have a phone registered in their name and are a foreign worker. Additionally, they have two people liable for maintenance.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has had existing credits paid back on time. They are seeking a car loan of 8335 DM and have no savings account. They have been employed for at least 7 years and have a low installment rate. The applicant is a 47-year-old single male with no additional debtors or guarantors. They have been living at their current residence for 4 years with no property ownership. The individual is a skilled employee, living in a house for free, with one existing credit at the bank. They have no other installment plans, no telephone, and are a foreign worker. They are the sole provider for one person.###\nHence this label was No."
"The individual is a 25-year-old divorced/separated/married female, working as a skilled employee/official, with a stable job for less than a year. She has a good credit history with existing credits paid back duly. She is looking to take a new car loan amounting to 1295 DM for a duration of 12 months. She has savings of less than 100 DM and no other installment plans or debtors. She lives in a rented house and has been a resident at the same place for 1 year. She has one existing credit at the bank and is responsible for providing maintenance for one person. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM and a credit history of paying back existing credits on time. They are taking a loan for a radio/television, with a credit amount of 5152 DM. Their savings are less than 100 DM and have been employed for 4 to 7 years. They have no other debtors or guarantors, and have been living at their current residence for 2 years. The individual is a 25-year-old single male, with no dependents. They have one existing credit at the bank and work as a skilled employee/official. They have no telephone and own their own home. Overall, they seem to be a responsible borrower with a stable financial and employment situation.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They took a 10-month loan of 1597 credits to buy a new car. They have savings between 500 and 1000 DM, have been employed for 1 to 4 years, and have a low installment rate. The individual is a 40-year-old single male, has no other debtors or guarantors, and has been living at their current residence for 2 years. They have unknown or no property, no other installment plans, and live in a rented house. The individual has one existing credit at the bank, works as an unskilled resident, and has 2 dependents. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM and has been paying existing credits back on time. They took a loan for furniture/equipment worth 2116 DM. Their savings are below 100 DM and they have been employed for 1 to 4 years. They have a moderate installment rate and are a single male. They have no other debtors or guarantors and have been living in their current residence for 2 years. They own real estate, are 41 years old, and have no other installment plans. They have a skilled job and are responsible for one person's maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had delays in paying off debts in the past. They took a loan for a radio/television worth 1478 DM and have savings of less than 100 DM. They have been employed for 1 to less than 4 years and allocate 4% of their disposable income towards installments. The individual, a 33-year-old married/widowed male, has no other debtors or guarantors. They have been residing in their own real estate for 3 years. The individual has two existing credits at the bank, works as a skilled employee/official, and is responsible for providing maintenance for one person. They have a landline and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of delayed payments. They are borrowing for a business purpose with a credit amount of 4272. Their savings range from 100 to less than 500 DM. They have been employed for 1 to less than 4 years and have a low installment rate. The individual is a 26-year-old single male with no other debtors or guarantors. They have been residing in their current location for 2 years and own their own home. The individual has two existing credits at the bank and works as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this data has no checking account and has had a critical account or other credits existing elsewhere. They took a loan for a radio/television, amounting to 1459 credits, with savings of less than 100 DM. They have been employed for 1 to less than 4 years and have a 4% installment rate. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been residing at their current place for 2 years, own a car or another type of property not specified. The individual is 43 years old, has no other installment plans, and lives in their own house. They have one existing credit at the bank and work as an unskilled resident. They are liable for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been in their current employment for 1 to less than 4 years as a skilled employee or official. They are single, male, and own their own home. They have one existing credit at the bank and have paid back all existing credits promptly. The purpose of their credit is for a used car, with a credit amount of 3378. They have no other debtors or guarantors, and no other installment plans. They have been residing at their current residence for 1 year, are 31 years old, and have one person they are financially responsible for. They have a building society savings agreement/life insurance as property, an installment rate of 2% of disposable income, and a telephone registered under their name. Additionally, they are a foreign worker who is considered a good credit risk.###\nHence this label was Yes."
"This individual has a checking account with balance less than 0 DM and has a good credit history with existing credits paid back on time. They are taking a 24-month loan for a new car, with a credit amount of 1371. They have no savings account, have been employed for 1 to 4 years, and have a moderate installment rate. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living in their current residence for 4 years, own real estate, and are 25 years old. They have no other installment plans, live in a rented house, and have one existing credit at the bank. The individual is a skilled employee/official, with one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a stable credit history of repaying existing credits on time. They are seeking a loan for furniture/equipment, with a credit amount of 2708. Their savings are below 100 DM and they have been employed for less than a year. They have a low installment rate, indicating they have disposable income. The individual is a 27-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 3 years and have a building society savings agreement/life insurance. Their other installment plan is through a bank and they own their own home. They have two existing credits at this bank and work as an unskilled resident. The individual is responsible for providing maintenance for one person and does not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and is applying for a car loan. They have a good credit history, with existing credits paid back on time. They do not have a savings account but have been at their current job for less than a year. Their monthly installment rate is low, showing they can manage their disposable income well. They are a divorced, separated, or married female, living in a rented house with one dependent. They have one existing credit at the bank and work as a skilled employee or official. With no other debtors or guarantors, they own real estate and have been at their current residence for 4 years. At 31 years old, they have a credit amount of 2901 and no other installment plans. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of less than 0 DM and has a good credit history with existing credits paid back duly. They are looking to finance a used car for 36 months with a credit amount of 5493. Their savings amount is less than 100 DM, and they have been employed for at least 7 years. They have a low installment rate of 2% of disposable income. The individual is a 42-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years with unknown or no property. There are no other installment plans, and they live in a housing for free. The individual has one existing credit at the bank and works as a skilled employee/official. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old, single male who is a skilled employee. He has been at his current job for 1 to 4 years and owns real estate for housing. He has a good credit history with existing credits paid back duly. His current checking account balance is between 0 and 200 DM, and he has savings between 100 and 500 DM. He is taking a loan for repairs, with a credit amount of 1514 DM. He has no other installment plans and no telephone. He has a guarantor and is a foreign worker. He has been living at his current residence for 2 years, with a 4% installment rate in percentage of disposable income. He has one existing credit at the bank and is responsible for providing maintenance for himself only.###\nHence this label was Yes."
"This individual is a single male, aged 27, who has been employed for 4 to 7 years as a skilled employee/official. They have a good credit history with existing credits, and their current checking account balance ranges from 0 to 200 DM. The purpose of their credit is for business, with a credit amount of 3652 DM. They have savings of less than 100 DM and own their own home. They have no other debtors or guarantors, and no other installment plans. They have been living at their current residence for 3 years and have 2 existing credits at the bank. Additionally, they have no telephone but are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset has a status of existing checking account of less than 0 DM and has been with their current employer for at least 7 years. They have paid back all credits at this bank duly and are seeking retraining. With a credit amount of 339 DM and savings of less than 100 DM, they have a low installment rate of 4% of disposable income. The individual is a 45-year-old married or widowed male, with no other debtors or guarantors. They have been residing in their current residence for 1 year and own a car or other property not listed. They have one existing credit at this bank and work as an unskilled resident. With one person dependent on them, they do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old married/widowed male, who has been employed for less than a year in an unskilled-resident job. He has no other debtors or guarantors, no other installment plans, and does not own a telephone. He has been living in his own residence for 1 year and has one existing credit at the bank. He has a savings account with less than 100 DM, and his property includes a building society savings agreement/life insurance. The individual has a good credit history with existing credits paid back duly till now. He is looking to borrow 454 DM for the purpose of repairs, with a duration of 6 months to repay.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history with existing credits paid back on time, and wants a loan for a radio/television. They are looking to borrow 674 DM and have savings between 100 and 500 DM. They have been employed for 4 to 7 years and have a low installment rate. The individual is a married or widowed male, with no other debtors or guarantors. They have been living at their current residence for 1 year and own property through a building society savings agreement or life insurance. At 20 years old, they have no other installment plans, own their own home, and have one existing credit at the bank. They are a skilled employee or official and have one person they are financially responsible for. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 34-year-old divorced or separated female, employed for less than a year in a management or self-employed position. She has no other debtors or guarantors and currently resides in a rented property. She has one existing credit at the bank, with a credit amount of 3017 DM to be paid back over 12 months at an installment rate of 3%. She has savings of less than 100 DM and no other installment plans. She is responsible for one person's maintenance, does not have a telephone, and is a foreign worker. Based on her credit history of paying back existing credits duly, she is classified as a good credit risk.###\nHence this label was Yes."
"The individual is a divorced/separated/married female in her late twenties with a stable job as a skilled employee/official. She has been living in her own home for the past 4 years. She has a small amount of savings, less than 100 DM, and has no other debtors or guarantors. She has one existing credit at the bank and has been handling her credits responsibly so far. The purpose of her current credit application is for a radio/television, and the credit amount requested is 3660. She has been in her current employment for 1 to less than 4 years. She has no other installment plans or telephone. She is a foreign worker and has one person she is liable to provide maintenance for.###\nHence this label was Yes."
"This individual is a 27-year-old divorced/separated/married female with less than 1 year of employment. She has a checking account balance of less than 0 DM and a credit history of paying back existing credits duly. The purpose of her credit is for a radio/television, with a credit amount of 2389. She has savings of less than 100 DM and no other debtors or guarantors. She has been living in her current residence for 1 year, owns a car or other property, and has a skilled job as a skilled employee/official. She has no telephone but is a foreign worker and has no other installment plans.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying back existing credits on time. They are looking to purchase furniture/equipment with a credit amount of 2978. They have savings between 500 and 1000 DM and have been employed for 1 to 4 years. Their installment rate is 1% of disposable income. A 32-year-old single male, they have no other debtors or guarantors. They have been residing in their current home for 2 years, own a car or another property, and have no other installment plans. As a skilled employee/official, they have one existing credit at the bank and are liable for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old divorced/separated/married female who has been in her current employment for less than a year. She has a good credit history with all credits at the bank being paid back duly. The purpose of the credit is for education, and the amount requested is 433 DM. She has savings of at least 1000 DM and has a building society savings agreement/life insurance as her property. She has one existing credit at the bank and a good job as a skilled employee/official. She has no other debtors/guarantors and no other installment plans. She lives in a rented house with a 2-year residence history. She has 2 people for whom she is liable to provide maintenance. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual in this dataset has no current checking account and has a credit history showing critical accounts or other existing credits. The purpose of the credit is for a new car, and the credit amount is 1480. They have savings between 500 and 1000 DM. The individual is currently unemployed and has been residing at their present residence for 4 years. They have unknown or no property and are 66 years old. They have no other debtors or guarantors and are single. The individual has 3 existing credits at the bank and works as an unemployed/unskilled non-resident. They are responsible for providing maintenance for one person and do not have a telephone. The individual is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a critical credit history with other credits existing elsewhere. They are borrowing money for education purposes, with a credit amount of 701. Their savings are below 100 DM, and they have been employed for 1 to 4 years. They have a low installment rate of 4% of disposable income. The individual is a 32-year-old single male, with no other debtors or guarantors. They have resided in their current location for 2 years and own their own housing. They have 2 existing credits at their bank and work as a skilled employee/official. There is one person liable for maintenance in their household, and they do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a credit history of previous payment delays, and is seeking credit for education purposes. They are requesting a credit amount of 6887, with savings of less than 100 DM. They have been employed for 1 to 4 years, with a manageable installment rate on their disposable income. The individual is a 29-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 3 years and own their own home. The individual has one existing credit with the bank, works as a skilled employee/official, and has one person they are responsible for providing maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"The individual is a female, divorced/separated/married, with a stable job as a skilled employee/official. She has been living in a rented house for 4 years and has a good credit history with existing accounts. She has a small existing debt and a medium amount of savings. She has been employed for at least 7 years and has a reliable income. She is looking to purchase a new car with a moderate loan amount. Additionally, she has some assets in the form of real estate. She is responsible for one dependent and has a telephone registered in her name. She is a foreign worker with a positive credit history and multiple existing credit accounts.###\nHence this label was No."
"The individual is a single male, 22 years old, working as a skilled employee/official with a stable job for 1 to 4 years. He has a checking account balance of less than 0 DM and a moderate credit amount of 2462 for furniture/equipment. His credit history shows that he has paid back existing credits on time. He has savings of less than 100 DM, no other debtors/guarantors, and no other installment plans. He lives in his own house with a 2-year residence. He has one existing credit at the bank and no telephone. He is a foreign worker and is responsible for one dependent.###\nHence this label was No."
"This individual is a divorced/separated/married female, aged 35, with no checking account. She has been employed for over 7 years as a skilled employee/official. She has one existing credit at the bank and no other debts or guarantors. She has been living in her current residence for 4 years, which is housing for free. She has no savings account but has a credit history of paying back existing credits duly. She is looking to borrow 5324 DM for a new car and has no other installment plans. She has no telephone but is a foreign worker. Overall, she appears to be a responsible individual with a stable financial and employment background.###\nHence this label was Yes."
"The individual in this data set is a 26-year-old female who is divorced/separated/married. She has a good credit history with no previous credits taken or any defaults. She has been employed for 1-4 years and has a monthly installment rate of 4% of her disposable income. Her current residence has been for 4 years and she lives in a rented house. She has 2 existing credits at the bank and no other installment plans or debtors/guarantors. She is in an unskilled-resident job and is responsible for providing maintenance for one person. She does not have a telephone but is a foreign worker. Her credit amount is 4280 DM and she has savings between 100 to 500 DM.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a good credit history with existing credits paid back on time. They are taking a loan for a used car, with a credit amount of 3386 DM. They have savings of less than 100 DM and have been employed for at least 7 years. Their expenses are manageable with an installment rate of 3% of disposable income. They are a 35-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 4 years and have unknown/no property. They have no other installment plans, live in housing for free, and hold a skilled job. They are responsible for providing maintenance for one person and have a registered telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM and has been employed for at least 7 years. They have paid back their existing credits on time, and are looking to borrow money for a radio/television. Their credit amount is 1377 and they have savings between 100 and 500 DM. They are a 47-year-old divorced/separated/married female, with no other debtors or guarantors. They have been living in their current residence for 2 years, have no property, and live in a free housing situation. They have a stable job as a skilled employee/official, with one existing credit at the bank. They have no other installment plans, one dependent, a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of $200 or more. They have a good credit history with existing credits paid back on time. They are taking a loan for a new car, with a credit amount of $2923. They have savings between $100 and $500. They have been employed for 1 to 4 years. Their installment rate is 1%, and they are female, divorced/separated/married. They have no other debtors or guarantors. They have been living in their current residence for 1 year and own a car or other property. At 28 years old, they have a bank installment plan, own their own home, and have one existing credit at the bank. They have a managerial or highly qualified job, with one person dependent on them. They have a registered telephone in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 53-year-old divorced/separated/married female who has been working at their current job for less than 1 year. They have a good credit history with existing credits paid back duly till now. The purpose of their credit is for education, and they have a small credit amount of 795 DM. They have savings of less than 100 DM and no other debts or guarantors. They have been living in their own residence for 4 years and have one existing credit at the bank. As a skilled employee/official, they have a low installment rate in percentage of disposable income. They have no other installment plans, no telephone, but are a foreign worker. They are responsible for providing maintenance for one person.###\nHence this label was No."
"This individual is a single male, 27 years old, who has no checking account and a credit history with critical accounts or other existing credits. He has been employed for 4 to 7 years as a skilled employee/official. His purpose for a credit loan is a used car, and the amount requested is 3850 DM. He has savings of less than 100 DM and owns a property, with a present residence of 1 year. He has no other debtors or guarantors, no other installment plans, and owns his own home. He has 2 existing credits at this bank, an installment rate of 3%, and no telephone. He is a foreign worker and has 1 person liable to provide maintenance for.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM. They have a credit history involving a critical account or other credits outside of this bank. The purpose of their credit is for furniture/equipment, with a credit amount of 2348 DM. Their savings account holds less than 100 DM. They have been employed for 1 to less than 4 years. The installment rate for their disposable income is 3%. The individual is a married or widowed male, aged 46 years. They have no other debtors or guarantors. They have been residing in their current residence for 2 years and own their own home. They have a building society savings agreement or life insurance as property. They have no other installment plans, two existing credits at this bank, and are a skilled employee/official. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 27-year-old single male with a good credit history. They have a checking account with less than 0 DM, a savings account with less than 100 DM, and have been employed for less than a year. The purpose of their credit is to buy a new car, and they have no other existing debts. They live in a residence for free and have no property. Their job is in management or a highly qualified position, and they have one existing credit at the bank. They have a low installment rate and one person depending on them for financial support. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual, a 24-year-old single male, has a good credit history with no previous credits. He has a stable job as a skilled employee with over 7 years of employment. He has been living in his current residence for 4 years, and has no existing debts or other installment plans. He has a modest credit amount and some savings. He lives in a free housing arrangement and does not have a telephone. Additionally, he has 2 existing credits at the bank and is responsible for providing maintenance for 2 people. Despite having no property, his good financial habits and stable income make him a potentially low credit risk.###\nHence this label was No."
"This individual has a status of existing checking account less than 0 DM. They have a credit history of critical account/other credits existing (not at this bank) and are looking to finance furniture/equipment. The credit amount requested is 1478 with savings of less than 100 DM. They have been employed for at least 7 years and have a low installment rate in percentage of disposable income. The applicant is a 44-year-old single male, residing in their own home for 4 years. They have no other debtors/guarantors or other installment plans. The individual has 2 existing credits at this bank and is a skilled employee/official. They have 2 people to provide maintenance for, own a car or other property not specified, and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 33-year-old divorced/separated/married female who is currently unemployed. She has a good credit history with existing credits paid back duly till now. The purpose of her loan is for furniture/equipment. She has no other debtors or guarantors and no other installment plans. She has been residing in her own property for 2 years. The individual is a skilled employee/official with one existing credit at the bank. She is the sole provider for one person. She does not have a telephone but is a foreign worker. With a credit amount of 1131 DM and savings of less than 100 DM, she falls under the category of < 0 DM in the status of existing checking account.###\nHence this label was No."
"This individual has no checking account and no savings account. They have been repaying existing credits on time. They have a steady job, have been living in their current residence for 4 years, and are single. They are responsible for providing maintenance for one person. The purpose of their credit is for a radio/television. They have a good credit amount of 2279. Their age is 37 years old and they have no other debts or guarantors. They have no other installment plans and live in housing for free. They have one existing credit at the bank and work as a skilled employee. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has critical accounts or other credits existing elsewhere. They took a 12-month loan for furniture or equipment amounting to 1258. Their savings are less than 100 DM, and they have been employed for less than a year. With an installment rate of 2%, they are a divorced/separated/married female in their early 20s. They have no other debtors or guarantors and have been residing at their current place for 4 years. Their property includes building society savings agreement/life insurance, and they have no other installment plans. They live in a rented house, have 2 existing credits at the bank, and work as an unskilled resident. They have one person to provide maintenance for, no telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has had critical credit history with other institutions, and is seeking a new car. They are requesting a credit amount of 2122. Their savings are below 100 DM and they have been employed for 1 to less than 4 years. With an installment rate of 3%, the individual is male and single, with no other debtors or guarantors. They have been residing in their current residence for 2 years and own real estate. At 39 years old, they do not have any other installment plans and live in a rental property. They have 2 existing credits at their bank, work an unskilled resident job, and are responsible for providing maintenance for 2 people. The individual does not have a telephone and is not a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM and has a credit history of paying back existing credits on time. They are seeking a loan for education purposes, with a credit amount of 1905. Their savings account balance is less than 100 DM and they have been employed for at least 7 years. The individual is a single male, 40 years old, with no other debtors or guarantors. They have been living in their current residence for 4 years and own a car or other property. They have no other installment plans and rent their housing. The individual has one existing credit at the bank and holds a management position. They are responsible for one dependent and have a registered telephone in their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with other existing credits. They are taking a 36-month loan to purchase a new car, amounting to 6614. They have savings of less than 100 DM and have been employed for over 7 years. With a low installment rate, they are a 34-year-old single male with no other debtors or guarantors. They have been residing in their own house for 4 years and have no other installment plans. Currently, they have 2 existing credits at this bank and work in a high-level job. They are responsible for one person's maintenance and own a car or other property not specified. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 32, with a stable job as a skilled employee and has been employed for 4-7 years. He has no other debtors or guarantors, owns his own home, and has been living at his current residence for 2 years. He has one existing credit at the bank and no other installment plans. He has a moderate credit amount of 6078 DM for a new car, with savings of less than 100 DM. He has a good credit history of paying back existing credits duly. He has no telephone, but he is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for at least 7 years as a skilled employee. Their credit history shows critical accounts and existing credits elsewhere. The purpose of their credit is for a radio/television. They have one existing credit at the bank and own real estate. The individual is a 49-year-old single male with a co-applicant. They have been residing at their current residence for 4 years and have one person they are financially responsible for. They have no other installment plans, and their telephone is registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
