"This individual has a checking account balance of at least 200 DM, with a credit history of consistently paying back existing credits on time. They are borrowing 1905 DM for education purposes and have savings of less than 100 DM. They have been employed for at least 7 years and have a low installment rate. The individual is a 40-year-old single male in management or a highly qualified position. They have no other debtors, live in a rented house, and have one existing credit at the bank. The individual has been residing at their current address for 4 years and has no other installment plans. They have a telephone registered under their name, are a foreign worker, and are solely responsible for providing maintenance.###\nHence this label was Yes."
"This individual does not have a checking account and has a good credit history of repaying existing credits on time. They are seeking a loan for a radio/television, with a credit amount of 4594. They have savings of less than 100 DM and have been employed for less than a year. Their installment rate is 3% of disposable income. The individual is a 32-year-old single male with no other debtors or guarantors. They have lived at their current residence for 2 years, own a car or other property, and have no other installment plans. They work as a skilled employee/official and are liable for one person's maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a credit history showing critical accounts or other existing credits, and is looking to use a loan for a radio/television. They have savings of less than 100 DM, have been employed for 4 to 7 years, and have a moderate installment rate. The person is a married or widowed male, with no other debtors or guarantors. They have been living in the current residence for 1 year, own a property through a building society savings agreement or life insurance, and are 32 years old. They have no other installment plans, own their own home, and have 2 existing credits at the bank. The individual has a job in management or is self-employed and has 1 person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has been employed for over 7 years. They have a good credit history with existing credits paid back duly. The purpose of the credit is for a radio/television. The credit amount is 3595. They have savings of less than 100 DM and own a car or other property. They are a 28-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and have no other installment plans. They are a skilled employee/official with one existing credit at the bank. They have no telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old divorced/separated/married female who has been employed for 1 to 4 years. She has a good credit history with all credits paid back duly and has a checking account balance of less than 0 DM. She is looking to finance a radio/television purchase with a credit amount of 626. She has savings of less than 100 DM and owns real estate. She has one existing credit at the bank, no other debtors/guarantors, and no other installment plans. She lives in her own house with 1 person dependent on her and has been a resident in her current residence for 4 years. She has an unskilled-resident job and is a foreign worker with no telephone.###\nHence this label was No."
"This individual has a current account balance of less than 0 DM, has a credit history of repaying existing credits on time, and is seeking a loan for a radio/television. They are looking to borrow 674 DM and have savings between 100 and 500 DM. They have been employed for 4 to 7 years and have a low installment rate relative to their disposable income. The individual is a married or widowed male, has no other debtors or guarantors, and has been residing at their current residence for 1 year. They have a building society savings agreement or life insurance as a property asset. Additionally, they are a skilled employee or official, have one existing credit at the bank, and are responsible for providing maintenance for one person. They own their own home, do not have any other installment plans, do not have a telephone, and are a foreign worker.###\nHence this label was No."
"This individual is unemployed and does not have a checking account or savings. They have a good credit history with all credits at the bank paid back duly. The purpose of the loan is for a used car. They have a real estate property, are female and divorced/separated/married, and aged 53. They have one existing credit at the bank, a low installment rate, and work in management/self-employment. They have one person to provide maintenance for, own their own home, have a telephone registered under their name, and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and an unknown or non-existent savings account. They have been employed for at least 7 years and have a stable living situation, residing in a rented property for 4 years. Their credit history is considered critical with other existing credits. The purpose of the credit is for education, with a relatively low credit amount of 1244. They are female, divorced/separated/married, aged 41, with no other debtors or guarantors. They have no other installment plans or telephone, but are a foreign worker. With two existing credits at this bank, they are classified as an unskilled resident with one person to provide maintenance for.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are borrowing for furniture/equipment, with a credit amount of 3972. Their savings are below 100 DM and they have been employed for 4 to 7 years. The installment rate is 2% of disposable income. The person is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 4 years and have a building society savings agreement/life insurance. At 25 years old, this individual has no other installment plans, lives in a rented house, and holds a skilled job. They are responsible for one person's maintenance and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 59-year-old single male, working as a skilled employee/official for 4-7 years. He owns a real estate property and has been residing in the same place for 4 years. He has a good credit history with existing credits paid back duly. His existing checking account balance is less than 0 DM, with savings of less than 100 DM. He is looking to borrow 1364 for radio/television purposes. He has no other debtors/guarantors, no other installment plans, and no telephone. He has one existing credit at the bank and is responsible for providing maintenance for one person. Additionally, he is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been paying existing credits on time. They are looking to purchase a new car with a credit amount of 1884. They have savings of less than 100 DM and have been employed for over 7 years. With a low installment rate, they are a single male with no other debtors or guarantors. They have been living in their current residence for 4 years and own a car or other property. At 39 years old, they have no other installment plans and live in their own home. They have one existing credit at the bank and work in a high-level job. They are responsible for providing maintenance for one person, have a registered telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual is a 25-year-old single male with a stable job as a skilled employee. He has been living in his own home for three years and has no other debts or guarantors. He has three existing credits at this bank and no savings account. Despite having no credits in the past, he is looking to take out a loan for business purposes. He has been at his current job for less than a year and has no telephone. The individual does not have any other people depending on him for financial support. Additionally, he has a foreign worker status and no specified property except for a car or other assets not accounted for.###\nHence this label was Yes."
"This individual is a 22-year-old married/widowed male with a stable job, residing in a rented house for the past 4 years. He has a good credit history with existing credits paid back duly. His existing checking account balance is between 0 to 200 DM, and he has savings of less than 100 DM. The purpose of his credit is for a new car, and the credit amount is 276. He has no other debtors or guarantors, no other installment plans, and no telephone. He has one existing credit at this bank, and he is an unskilled resident with one dependent. He owns real estate property and is a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female, working as a skilled employee/official with 1-4 years of employment history. She has a checking account with less than 0 DM, no savings account, and a credit history of paying back existing credits on time. Her current credit amount is 1200 for an educational purpose. She has been residing in the same place for 4 years, living in a rented house with one dependent. She has one existing credit at the bank, with an installment rate of 4% of disposable income. Her property includes a building society savings agreement/life insurance, and she has no other debtors or guarantors. Additionally, she has a telephone registered under her name, uses other installment plans through a bank, and is a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account. They have a history of delaying payments in the past and are looking to purchase furniture or equipment. The credit amount they are seeking is 3643. They have savings of less than 100 DM. They have been employed for at least 7 years. Their monthly installment rate is 1% of their disposable income. They are a female who is divorced, separated, or married. They have no other debtors or guarantors. They have been living in their current residence for 4 years and own their own home. They are 27 years old and have no other installment plans. They have 2 existing credits at this bank and work as an unskilled resident. They are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been repaying existing credits on time and have a stable job for 1 to 4 years. The purpose of the credit is for a radio/television. They are single, male, and living in a free housing arrangement. With a credit amount of 2279, they have an installment rate of 4% of disposable income. They have no other debtors or guarantors and no other installment plans. Being a skilled employee, they have one existing credit at the bank and are responsible for one person's maintenance. At 37 years old, they have been living in their current residence for 4 years. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account. They have a credit history with a critical account or other credits at a different bank. The purpose of their credit is for a radio/television. They are seeking a relatively small credit amount. They have an unknown or no savings account. The individual has been employed for 4-7 years and has a moderate installment rate as a percentage of their disposable income. They are a single male with a guarantor. They have been living in their current residence for 2 years and own real estate. The individual is 35 years old and has other installment plans with a bank. They have 3 existing credits at this bank and work as a skilled employee or official. They are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a young, single male with a stable job and no other debts or guarantors. He has been living in his current residence for a year and has a good credit history of paying back existing credits on time. He is responsible with his finances, as indicated by his installment rate and savings account balance. He is looking to purchase furniture/equipment with a credit amount of 3149. Overall, he seems to be a reliable and financially cautious person.###\nHence this label was Yes."
"This individual has no checking account and has a history of delay in paying off debts. They are looking to purchase a radio/television and require a credit amount of 15653. Their savings are below 100 DM and they have been employed for 4 to 7 years. They have a low installment rate as a percentage of their disposable income. The individual is a 21-year-old single male with no other debtors or guarantors. They have been residing in their current location for 4 years and own the housing. The individual has 2 existing credits at the bank, holds a skilled job, and is the sole provider for 1 person. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old divorced or separated or married female, who has been employed for at least 7 years as a skilled employee or official. She owns a real estate property and has been living in her current residence for 4 years. She has one existing credit at the bank and no other installment plans. With a good credit history of paying back existing credits duly, she is looking to borrow 1206 DM for the purpose of purchasing a radio or television. She has savings of less than 100 DM and no other debtors or guarantors. Her monthly installment rate is 4% of her disposable income and she is the sole provider for herself. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, a credit history of critical account/other credits existing, and seeks a loan for furniture/equipment. They are looking to borrow 4281 DM and have savings between 500 and 1000 DM. Currently employed for 1 to 4 years, their disposable income installment rate is 1. The applicant is a divorced/separated/married female, with no other debtors/guarantors, and has been residing at their current residence for 4 years. They own a car or other property, are 23 years old, and have no other installment plans. The individual has two existing credits at the bank, a skilled job, one dependent, no telephone, and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a critical credit history with other existing credits. They intend to use the credit for purchasing a radio/television. The credit amount requested is 5103 with savings below 100 DM. They have been employed for less than a year, with a low installment rate. The individual is a married/widowed male, with no other debtors or guarantors. They have been residing in their current residence for 3 years and have unknown/no property. At the age of 47, they have no other installment plans and live in a free housing situation. They have 3 existing credits at this bank and work as a skilled employee/official. They are responsible for providing maintenance for one person. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and unknown savings. They have been employed for 1 to less than 4 years and have a credit history of critical accounts. The purpose of the credit is for a used car, with a duration of 36 months. The credit amount is 11054 with a 4% installment rate. The individual is a 30-year-old single male, with no other debtors or guarantors. They have been residing in their current property for 2 years and own their own home. They have one existing credit at the bank and work in a management/self-employed position. They have no other installment plans, 1 person to provide for, and a registered telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM. They have a credit history of repaying existing credits on time. The purpose of their credit is for a radio/television. The credit amount is 6999. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their installment rate is 1% of disposable income. The individual is a married/widowed male. They have a guarantor for other debtors. They have been residing at their current residence for 1 year and own real estate property. Their age is 34 and they have no other installment plans. They have 2 existing credits at the bank and work as a skilled employee/official. They are liable for providing maintenance for 1 person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and no savings account. They have been employed for at least 7 years as a skilled employee or official. They have a delay in paying off credit history, with a credit amount of 846 for the purpose of radio/television. They are a 36-year-old single male, living in a residence for free. They have no other debtors or guarantors, no other installment plans, and no telephone. They have one existing credit at this bank and have been residing at their current residence for 4 years. They are responsible for providing maintenance for one person and are a foreign worker.###\nHence this label was Yes."
"The individual in this data has a good credit risk. She is a female, divorced/separated/married, aged 29, with a stable job as a skilled employee/official and has been employed for over 7 years. She has no other debtors or guarantors, resides in a rented property, and has been living at her current residence for 4 years. She has no other installment plans, no telephone, but is a foreign worker. She has one existing credit at the bank, no savings in her account, and a credit amount of 7758 DM for a used car, with an installment rate of 2%. Additionally, she is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual is a divorced/separated male, aged 40, with a stable job and a good credit history. He has a checking account with a balance between 0 and 200 DM, some savings, and no other ongoing debts. He has been living in his own home for 3 years and has been employed for over 7 years. He is looking to borrow money for furniture/equipment, with a credit amount of 4297 DM to be repaid in 18 months. He has no other installment plans, one existing credit at the bank, and is financially responsible for one other person. He has a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"This individual is currently unemployed with no existing checking account. They have a history of delays in paying off debts. The purpose of the credit is for a radio/television. They have savings of less than 100 DM and own real estate. The credit amount is 2320 with an installment rate of 2%. The individual is a 34-year-old married/widowed male, with two existing credits at the bank and one dependent. They are a skilled employee/official with no other debtors or guarantors. They have been residing in their current home for 3 years and do not have any other installment plans or a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of always paying back existing credits on time. They are looking for a new car loan, with a credit amount of 7393. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have a low installment rate in terms of disposable income. The individual is a single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own their own home. They have one existing credit at this bank and work as an unskilled resident. They have 2 dependents and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They took a loan for a radio/television, amounting to 2697 credits. Their savings are less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate. The person is a 32-year-old single male, with no other debtors or guarantors. They have been living in their own real estate for 2 years. The individual has one existing credit at the bank, is a skilled employee, and has 2 dependents. They do not have other installment plans, own a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an existing good credit history. They are seeking a loan for repairs, amounting to 5190. They do not have any savings account but have been employed for at least 7 years. With a low installment rate, they are a 48-year-old single male. They have no other debtors or guarantors, own their own home, and have multiple existing credits at the bank. Their job is a skilled employee/official, and they are responsible for providing maintenance for 2 people. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has been employed for less than a year. They have a good credit history of paying back all credits at a bank duly. The purpose of their credit is for a used car. They do not have any savings account or bonds. They have a moderate installment rate in percentage of disposable income. The individual is a single 40-year-old male with a guarantor. They have been residing in their current location for 4 years and own real estate. They have two existing credits at a bank and work as a skilled employee/official. The individual is liable to provide maintenance for two people. They have a landline telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old married/widowed male, working as a skilled employee/official for 1-4 years. He has a good credit history with existing credits paid back duly. His existing checking account balance is between 0 and 200 DM, with a credit amount of 1007 DM. He has savings of at least 1000 DM and owns real estate for housing. He has no other debtors/guarantors or other installment plans. Presently, he has been living in his own residence for 1 year. He has one existing credit at the bank and no telephone. He is a foreign worker with no other people liable for maintenance.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for 1 to 4 years, with a good credit history of paying back existing credits on time. The credit is for educational purposes, amounting to 9055. They are a single male, aged 35, living in a residence for free with 2 people liable for maintenance. They have no other debtors or guarantors and no other installment plans. Their job is unskilled, and they have one existing credit at the bank. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old divorced/separated/married female, employed for 1 to less than 4 years as a skilled employee/official. She has a checking account with less than 0 DM, savings of less than 100 DM, and owns real estate. Her credit history shows existing credits paid back promptly. She applied for a credit amount of 3190 for the purpose of radio/television. She has no other debtors/guarantors, no other installment plans, and no telephone. She has been living at her current residence for 2 years and is the sole provider for one person. Additionally, she does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM and has been repaying existing credits on time. They are borrowing 392 DM for education purposes and have savings of less than 100 DM. Present employment is less than 1 year and their disposable income installment rate is 4%. The applicant is a divorced/separated/married female, residing in a rented house with 1 dependent. They have a building society savings agreement, are 23 years old, and work as a skilled employee/official. There are no other debtors/guarantors or existing credits at this bank. They have been living at their current residence for 4 years, do not have other installment plans or debts, own a telephone registered in their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a history of delayed payments. They are seeking a loan for repair purposes and have a credit amount of 1555. They have savings of at least 1000 DM and have been employed for at least 7 years. Their disposable income installment rate is 4% and they are a single male. They have no other debtors or guarantors, have been residing in their current residence for 4 years, and have unknown or no property. They are 55 years old with no other installment plans, living in a free housing situation. They have 2 existing credits at the bank, are a skilled employee, and have 2 people dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 25-year-old female who is divorced/separated/married. She has a good credit history with no previous credits taken or all credits paid back duly. Currently, she has an existing checking account with a balance between 0 and 200 DM, and savings of less than 100 DM.\nShe has been employed for less than a year as a skilled employee/official and resides in a rental property for the past 3 years. \nHer credit application is for furniture/equipment, and she has no other installment plans or debtors/guarantors. She has two existing credits at this bank and has one person dependent on her for maintenance. \nShe does not have a telephone but is a foreign worker and has a credit amount of 2969 DM to repay over 12 months with a 4% installment rate based on her disposable income.###\nHence this label was No."
"This individual is a female, divorced/separated/married, with no checking account. She has been employed for 1 to 4 years as a skilled employee/official. She owns her own home and has been living at her current residence for 2 years. She has no other debtors or guarantors and no other installment plans. She has less than 100 DM in her savings account. She has 2 existing credits at the bank and is responsible for providing maintenance for 1 person. She is 28 years old and has a foreign worker status. Her credit history is marked as critical account/other credits existing. The purpose of her credit is for furniture/equipment, with a credit amount of 1817. Her installment rate in percentage of disposable income is 4. She has no property and no telephone.###\nHence this label was Yes."
"The individual has no checking account and has been repaying existing credits on time. They are looking to purchase a radio/television and require a credit amount of 2284. Their savings are less than 100 DM and they have been employed for 4 to 7 years. They have no other debtors or guarantors, own a car or other property, and their current residence is 2 years. The individual is a 28-year-old single male, with no other installment plans, living in their own house. They have one existing credit at the bank, work as a skilled employee/official, and have one dependent. Additionally, they have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a female who is divorced, separated, or married. She has no checking account and has been employed for 4 to 7 years. She is looking to finance a radio/television purchase with a credit amount of 4530. Her savings are less than 100 DM, and she has no other debts or guarantors. She has been living in her current residence for 4 years and is renting a property. She is 26 years old, with no other installment plans and one existing credit at the bank. She works in a management/self-employed/highly qualified position and has one person dependent on her for maintenance. She has a registered telephone and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had their current employment for over 7 years. They are seeking a loan for furniture/equipment, with a credit amount of 5150. Their savings amount is less than 100 DM and they have no other existing debts. They are a 33-year-old single male with one existing credit at the bank, living in their own residence for 4 years. They work as a skilled employee/official and have one person dependent on them. They own a car or other property, have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of a critical account with other existing credits. They are taking out a loan for a used car for a duration of 24 months. They have savings of less than 100 DM and have been employed for 4 to 7 years. With a credit amount of 2346, their installment rate is 4% of disposable income. A 35-year-old single male, they have no other debtors or guarantors. They have been living in their current residence for 3 years and own a car or other property. They have no other installment plans, own their home, and have two existing credits at their bank. As a skilled employee, they are liable for one person's maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a loan for a radio/television, amounting to 3235 DM. They have saved between 500 and 1000 DM in their savings account. Currently employed for over 7 years, they have a low installment rate of 3% on disposable income. A 26-year-old divorced/separated male, they have no other debtors or guarantors. They have been living in their own residence for 2 years and own a car or other property not specified. With no other installment plans, they have a management/self-employed job. Responsible for providing maintenance for one person, they have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has a stable financial status with no existing checking account balance and a savings account of less than 100 DM. They have been employed for at least 7 years and have a good credit history, but with a critical account or other existing credits. The purpose of the credit is for furniture or equipment. They have a moderate credit amount of 3617 and a low installment rate. The individual is a 28-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and have a car or other property. They have no other installment plans, housing is rented, and have 3 existing credits at the bank. The individual is a skilled employee/official with one person liable for maintenance. They own a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male in his thirties who is currently unemployed. He has a good credit history with one existing credit, and his existing checking account balance is less than 0 DM. He is looking for a loan to purchase furniture or equipment, for which he needs 3959 DM. He has some savings of less than 100 DM and owns his own home. He has been living at his current residence for 3 years and has no other debts or guarantors. He has a management job and no other installment plans. He is responsible for one dependent and has a telephone registered under his name. Additionally, he is a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job, owning a real estate property. He has a good credit history with existing credits paid back on time. He has a moderate amount of savings and a small checking account balance. He is looking to purchase a radio/television with a credit amount of 766. He has been living at his current residence for 3 years and has no other installment plans or debtors/guarantors. Despite being an unskilled resident, he has a single existing credit at the bank. At 66 years old, he has 1 person dependent on him for maintenance. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a loan for furniture/equipment, amounting to 2515. Their savings are less than 100 DM and have been employed for 1 to 4 years. With a stable income, they have a low installment rate. A single male, 43 years old, with no other debtors or guarantors, residing in their own real estate. They have no other installment plans and own a telephone. As a skilled employee, they have one existing credit at this bank and are responsible for one person's maintenance. Additionally, they are a foreign worker with a good credit standing.###\nHence this label was Yes."
"The individual is a single male, aged 37, with a stable job as an unskilled resident. He has been living in his own house for 2 years. His existing checking account balance is between 0 and 200 DM, and he has a savings account with less than 100 DM. He has one existing credit at the bank and has been paying back his credits diligently. His credit amount is 1922 DM, which he intends to use for furniture/equipment. He has no other debtors or guarantors, no other installment plans, and no telephone. He is a foreign worker and is responsible for providing maintenance for one person.###\nHence this label was No."
"This individual is a female who is divorced/separated/married, aged 48, with a stable job as an unskilled resident. She has a good credit history, no other debtors/guarantors, and one existing credit at the bank. She has been living in her own home for 4 years and has no other installment plans. She has a telephone registered under her name and is a foreign worker. She has a moderate amount of credit amounting to 4351 DM, with unknown/no savings account. Her existing checking account balance is between 0 and 200 DM, and she has been employed for 1 to 4 years. She has been saving in a building society savings agreement/life insurance. She has a low installment rate in percentage of disposable income and is responsible for providing maintenance for one individual. The purpose of her credit is for furniture/equipment.###\nHence this label was Yes."
"This individual is a 52-year-old unemployed single male, with no savings account, owning a property and having one existing credit. He has a good credit history, is responsible with his finances, and has a large credit amount for a radio/television. He has a stable living situation and is financially independent. He has no other debts or dependents, and is a registered telephone user and foreign worker.###\nHence this label was No."
"The individual has a checking account with less than 0 DM balance, has been repaying existing credits on time, and has been employed for 4 to 7 years. They are applying for a new car loan amounting to 4817 DM. Their savings are less than 100 DM and they have no other installment plans. They are a single male with a co-applicant, living in their own home. They have one existing credit at the bank and are a skilled employee/official. The individual is 31 years old, has been residing at their current address for 3 years, and has a telephone registered under their name. They are a foreign worker with one person to provide maintenance for.###\nHence this label was No."
"This individual does not have a checking account and has a critical credit history with other existing credits. They took a loan for a radio/television, amounting to 1898. Their savings account status is unknown, and they have been employed for 1 to less than 4 years. With an installment rate of 1%, they are a single male, not having any other debtors or guarantors. They have been residing in their own real estate for 2 years and are 34 years old. There are no other installment plans, and they have 2 existing credits at this bank. Their job is classified as unskilled - resident, and they are responsible for providing maintenance for 2 individuals. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has maintained existing credits diligently. They are looking for a loan to purchase a radio or television, with a credit amount of 2051. Their savings are less than 100 DM, and they have been employed for less than a year. The individual is a 33-year-old single male, living in their own home. They have no other debts or guarantors, and their only existing credit at this bank is their current one. They are a skilled employee or official with one person dependent on them for maintenance. They do not have any other installment plans or a telephone, but they are a foreign worker.###\nHence this label was Yes."
"This individual is a male, single skilled employee, aged 41, with a stable job held for at least 7 years. He owns a house, has no other debts or guarantors, and has been living at his current residence for 1 year. He has one existing credit at the bank and no other installment plans. His existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. The purpose of the credit is for furniture/equipment, with a duration of 18 months and a credit amount of 6361. He has no property and no other people to provide maintenance for. He has a telephone registered in his name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for over 7 years. They have a good credit history with existing credits paid back duly. The purpose of the credit is for a radio/television. Their credit amount is 3568 with savings of less than 100 DM. They have been living at their current residence for 2 years and are a divorced/separated/married female. They have no other debtors or guarantors. Their age is 54 and they work in a management/self-employed/highly qualified role. They have one existing credit at this bank and one person reliant on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee, having worked at the same place for 4 to 7 years. He has no other debtors or guarantors and owns his own home. He has one existing credit at the bank, with a medium credit amount of 1437 DM. His credit history at the bank has been impeccable, always paying back his credits on time. He has a modest amount of savings between 100 and 500 DM, and no other installment plans. He has been living in his current residence for 3 years and is responsible for providing maintenance for one person. At 29 years old, he has no telephone but is confirmed as a foreign worker.###\nHence this label was No."
"This individual has a checking account balance of at least 200 DM and has been employed for 1 to less than 4 years. They have no savings account but are looking to finance a radio/television. With a credit amount of 1271, they have a good credit history with other creditors. They are a 39-year-old single male, living in a residence for 4 years with no existing property. As a skilled employee, they have 2 existing credits at the bank and one dependent. They have no other installment plans, no other debtors/guarantors, and reside in housing for free. Additionally, they have a registered telephone and are a foreign worker.###\nHence this label was No."
"The individual is a 22-year-old single male with a skilled job and no other debtors or guarantors. He has a checking account with less than 200 DM, savings of less than 100 DM, and has been employed for less than a year. He has paid back existing credits on time and has one current credit at the bank. His credit application is for a radio/television, with a credit amount of 1331 DM. He lives in his own house, has been at his current residence for 1 year, has no telephone, and no other installment plans. He is a foreign worker with no one dependent on him financially.###\nHence this label was No."
"This individual has no checking account and has been diligently repaying existing credits. They are looking to purchase a radio/television, with a credit amount of 1473. They have savings of less than 100 DM and have been employed for less than a year. Their personal status is male and married/widowed. They have no other debtors or guarantors and have been residing in their current home for 4 years. They own real estate and are 39 years old. They have no other installment plans, one existing credit at the bank, and work as a skilled employee/official. They are responsible for one person's maintenance and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a good credit history with no previous credits taken or unpaid. They are taking a loan of 426 credits for the purpose of purchasing a radio/television. Their savings amount is less than 100 DM, and they have been employed for over 7 years. With a low installment rate and no other debts or guarantors, they have been residing in their own home for 4 years. They are a married/widowed male, aged 39, with no other installment plans, one existing credit at the bank, and work as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history of repaying existing credits on time. They are seeking a new car loan amounting to 1469 units of currency. Their savings fall within the range of 100 to less than 500 DM. They have been employed for at least 7 years and have a low installment rate. The person is a 41-year-old married/widowed male with no other debtors or guarantors. They have been living in their current residence for 4 years, which is a rented property. The individual holds real estate as property and has no other installment plans. They have one existing credit at the bank and work as an unskilled resident. They are responsible for providing maintenance to one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has been employed for at least 7 years. They took a loan for a new car, with a credit amount of 731 DM to be repaid in 8 months. Their savings are less than 100 DM and they live in their own real estate property. They are a 47-year-old single male with no other debts or guarantors. They have 2 existing credits at this bank and work as an unskilled resident. They have been living at their current residence for 4 years and have 1 person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has had their current employment for at least 7 years. They have a credit history of a critical account with other credits existing, and their purpose for the credit is categorized as \"others.\" With a credit amount of 1164 DM and savings of less than 100 DM, they have a moderate installment rate of 3% of disposable income. The individual is a 51-year-old single male in a management position, living in a residence for free for the past 4 years. They have no other debtors or guarantors and no specified property. Additionally, they have 2 existing credits at this bank, and 2 people liable to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history. They are taking a loan for repairs, amounting to 660 credits. They have savings between 500 and 1000 DM and have been employed for 4 to 7 years. Their installment rate is 2% of disposable income. The person is a married/widowed male, with no other debtors or guarantors. They have been residing in their current residence for 4 years and own real estate. At 23 years old, they have no other installment plans and live in a rented house. They have one existing credit at the bank, work as an unskilled resident, and are responsible for one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account with less than 0 DM, has had existing credits paid back duly until now, and is looking to purchase domestic appliances. They have a credit amount of 3051 DM and savings of less than 100 DM. Present employment has been held for 1 to less than 4 years, and the installment rate is 3% of disposable income. The individual is a 54-year-old single male, with no other debtors or guarantors. They have been residing at their current residence for 4 years and own a car or other property. They have one existing credit at the bank and are a skilled employee/official. The individual is responsible for providing maintenance to one person and does not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a 26-year-old divorced or separated or married female with no checking account. She has been employed for 1 to 4 years as a skilled employee or official. She has no other debtors or guarantors and owns her own house. She has 2 existing credits at the bank and has no other installment plans. She has a radio/television as the purpose for the credit amount of 2404. She has less than 100 DM in her savings account and her present residence is 2 years. She has an installment rate of 2% of disposable income and no telephone. She is a foreign worker and is liable to provide maintenance for 1 person.###\nHence this label was Yes."
"This individual has no checking account and has a stable credit history with existing credits paid back on time. They are looking to finance a radio/television purchase with a credit amount of 1213. They have between 500 and 1000 DM in a savings account and have been employed for at least 7 years. Their disposable income installment rate is 4%, and they are a single male with no other debtors or guarantors. They have been residing in their current home for 3 years and have a building society savings agreement or life insurance. At 47 years old, they have one existing credit at a bank and work as a skilled employee or official. They are responsible for providing maintenance for one person and own their housing. They have installment plans at stores, a registered telephone under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual is a 26-year-old unemployed female who is divorced/separated/married. She does not have a checking account or savings account. She is looking to borrow a credit amount of 5433 for a used car. She has been living in a rented house for 4 years and has no other installment plans. She has one existing credit at the bank and works as a management/self-employed/highly qualified employee/officer. She is the sole provider for one person and has a telephone registered under her name. Additionally, she has a good credit history of paying back existing credits duly. She holds a building society savings agreement/life insurance property and is a foreign worker.###\nHence this label was Yes."
"This individual is a 19-year-old female who is divorced/separated/married and has no checking account. She has been employed for less than a year as a skilled employee/official. She has two existing credits at the bank and has paid back all existing credits on time. The purpose of the credit is for furniture/equipment, with a credit amount of 1980. She has savings of less than 100 DM and no other installment plans. She lives in a rented property with a co-applicant and has been at her current residence for 2 years. She has one person liable for maintenance. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual is a 25-year-old divorced/separated/married female with 1 existing credit, a good credit history, and a stable job as an unskilled resident. She has been living in her own real estate property for 2 years and has no other debts or guarantors. With a moderate credit amount of 2631 DM, she has some savings between 100 and 500 DM and a monthly installment rate of 3% of her disposable income. She has no other installment plans or telephone, but she is a foreign worker. Overall, she appears to be a responsible credit risk with a steady financial background.###\nHence this label was Yes."
"This individual has no checking account and a critical credit history with other existing credits. They are seeking a loan for a radio/television. The credit amount requested is 1291. Their savings account holds less than 100 DM, and they have been employed for 1 to less than 4 years. With an installment rate of 4% of disposable income, they are a divorced/separated/married female. There are no other debtors/guarantors involved, and they have been residing at their current residence for 2 years. Their property includes a building society savings agreement/life insurance. At 35 years old, they have no other installment plans, own their housing, and have 2 existing credits at the bank. Being a skilled employee/official, they have 1 person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and an unknown or non-existent savings account. They have been employed for at least 7 years as a skilled employee or official. The purpose of their credit is for a radio/television. They have one existing credit at the bank, with an installment rate of 4% of their disposable income. They are a 51-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own their own home. There are no other installment plans, and they have a telephone registered under their name. They are a foreign worker and have one person they are liable to provide maintenance for.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, and has a good credit history with existing credits paid back on time. They are seeking a loan for education, with a credit amount of 795 DM. They have savings of less than 100 DM and have been employed for less than a year. Their disposable income installment rate is 4%. The individual is a 53-year-old divorced/separated/married female, with no other debtors or guarantors. They have been living in their current residence for 4 years and own property. The individual has no other installment plans, one existing credit at the bank, and is a skilled employee/official. They have one dependent and no telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM, has a good credit history, and has been employed for at least 7 years. They are taking out a loan for a radio/television, with a credit amount of 4473. Their savings are below 100 DM, and they have no other outstanding debts. They are a 31-year-old single male with one dependent, owning their own home. They have one existing credit at the bank and work as a skilled employee or official. They do not have any other installment plans or a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual is a skilled female employee, divorced/separated/married, aged 28, with a stable job held for 1-4 years. She has a good credit history with no previous credits, and currently has no debts or guarantors. She owns her own house and has savings below 100 DM. She has 2 existing credits at the bank and no other installment plans. She has been living at her current residence for 1 year, with one person dependent on her for maintenance. She does not have a telephone but is a foreign worker. The purpose of her credit application is for business, with a credit amount of 4221 and a manageable installment rate of 2%.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, aged 27, working as a skilled employee/official. She has been living in a rented house for 3 years and has no savings account. She has a small existing checking account balance of 0 <= ... < 200 DM. She has one existing credit, which she has been repaying duly till now. The purpose of the credit is for furniture/equipment, with a credit amount of 1924 DM. She has no other debtors/guarantors, no other installment plans, and no telephone. She has been employed for less than 1 year and has a 4% installment rate in percentage of disposable income. She owns real estate as property and is a foreign worker. She is responsible for providing maintenance for 1 person.###\nHence this label was No."
"This individual is a 26-year-old female who is divorced/separated/married. She has a good credit history with existing credits paid back duly till now. She has a checking account with less than 0 DM, savings of less than 100 DM, and has been employed for 4 to less than 7 years. The purpose of the credit is for furniture/equipment. She has no other debtors/guarantors, no other installment plans, and no telephone. She currently resides in a rented property with a 4-year history. She has 1 existing credit at this bank and works as an unskilled resident. Additionally, she is the sole provider for one person and is a foreign worker.###\nHence this label was Yes."
"This individual is a 28-year-old single male with a stable job, having worked for 4 to 7 years. He has one existing credit at the bank and pays his credits back on time. His current residence is in a rented house, which he has been living in for 3 years. He is responsible for providing maintenance for one person. He has no other debtors/guarantors or additional installment plans. He does not have a telephone but is open to foreign work opportunities. His credit risk is considered for a car purchase, with a credit amount of 6260 DM, and he has savings of less than 100 DM.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has a good credit history, and is looking to purchase a used car with a credit amount of 6579. Their savings account/bonds hold less than 100 DM, and they are currently unemployed. They have a low installment rate, with no other debtors or guarantors. The individual is a 29-year-old single male, has been at their current residence for 2 years, and has no property. They have no other installment plans, live in a free housing arrangement, and have one existing credit at the bank. Their occupation falls under management/self-employed/highly qualified employee/officer category, with one person depending on them for maintenance. They own a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial situation with a moderate amount in their checking account. They have a good credit history and have been diligent in paying back existing credits. The purpose of their loan is for a radio/television. They have a small amount of savings. They have been employed for 1-4 years and have a low installment rate. They are a divorced/separated/married female. They have a guarantor for other debts. They have been living at their current residence for 4 years and own real estate. They are 49 years old with no other installment plans and have no current housing expenses. They have a stable job as a skilled employee/official. They have 1 person they are financially responsible for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old female who is divorced, separated, or married. She has been at her current job as a skilled employee/official for 1 to 4 years. She has a checking account with a balance of less than 0 DM and no savings account. She has delayed in paying off debts in the past and is currently paying off an education-related credit amount of 8471. She has no other debtors or guarantors and no other installment plans. She lives in a rented property with one other person and has been at her current residence for 2 years. She has 2 existing credits at the bank and a telephone registered in her name. Additionally, she is a foreign worker with a monthly installment rate of 1% of disposable income.###\nHence this label was Yes."
"This individual has no checking account and an unknown/no savings account. They have been employed for 4 to 7 years and have a good credit history with critical accounts/other credits existing. The purpose of their credit is for a radio/television. They are a single male, 36 years old, with no other debtors or guarantors. They own their own home and have a building society savings agreement/life insurance. They have two existing credits at their bank and work as a skilled employee/official. There is one person for whom they provide maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a new car with a credit amount of 1386. They have savings between 500 and 1000 DM and have been employed for 1 to 4 years. The installment rate as a percentage of disposable income is 2. The individual is a female who is divorced/separated/married, with no other debtors or guarantors. They have been living at their current residence for 2 years and have a building society savings agreement/life insurance. At the age of 26, they have no other installment plans, own their housing, and have one existing credit at the bank. The individual is a skilled employee/official with one person to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a single male with a stable income of less than 1 year, seeking a car loan to purchase a used vehicle. He has a good credit history with existing credits paid back on time. With a moderate credit amount of 7966 DM, he has some savings and owns a car. He has no other debtors or guarantors and his housing status is own. At 30 years old, he is a skilled employee, with 2 existing credits at the bank and one person dependent on him for maintenance. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM and a good credit history. They are borrowing money for a used car, with a credit amount of 6331. Their savings account holds less than 100 DM. They have been employed for at least 7 years and have a low installment rate. The individual is a 46-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years, with unknown property status and no other installment plans. They reside in a free housing situation and have 2 existing credits at the bank. The individual works as a skilled employee or official and is liable for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been repaying existing credits on time. They are looking to finance furniture/equipment with a credit amount of 3349. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a moderate installment rate and are female, divorced/separated/married. There are no other debtors or guarantors involved. They have been living at their current residence for 2 years and own a car or other property. At 28 years old, they have no other installment plans and live in their own home. They have one existing credit at the bank and have a professional job. They are responsible for providing maintenance for one person and have a telephone registered in their name. They are a foreign worker.###\nHence this label was No."
"The individual is a divorced/separated/married female in her 30s, working as a skilled employee/official. She has no other debtors/guarantors and owns her own home. She has been at her current residence for 1 year and has 2 existing credits at the bank. She has no other installment plans or telephone. She is a foreign worker. \nHer credit history shows that she has always paid back credits duly, and she is looking to take out a new car loan worth 8358 DM. She has savings between 500 and 1000 DM and an existing checking account balance between 0 and 200 DM. Her installment rate in percentage of disposable income is 1. She is the sole provider for one person and has no other liabilities.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has had 4 to 7 years of employment, and currently has two existing credits at the bank. They have a critical credit history with other existing credits, and are seeking a new car with a credit amount of 1038. Their savings are less than 100 DM, and they have no other installment plans. They are a 49-year-old single male, residing in their own home for the past 3 years. They have a co-applicant as another debtor/guarantor, and no other people relying on them for maintenance. They work as a skilled employee/official and have a telephone registered in their name. Additionally, they have a building society savings agreement/life insurance as a property and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a single male with a stable job, owning a real estate property. He has been employed for at least 7 years and has no other debtors or guarantors. He has a good credit history with no existing credits at this bank. Despite having a short credit history and relatively low savings, he has no other installment plans and a manageable installment rate. At 67 years old, he has a high duration in month for his credit and a high credit amount. He lives in his own house, has a telephone registered under his name, and is a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 40, working as a skilled employee/official with a stable job tenure of 4 to 7 years. They have a good credit history with existing credits paid back duly. They have a moderate credit amount of 3001 DM and a savings account with less than 100 DM. They reside in a rented property for 4 years and have no other installment plans. Additionally, they have no other debtors/guarantors, no telephone, and are a foreign worker. Overall, they have a single existing credit at this bank and are responsible for one dependent.###\nHence this label was Yes."
"The individual is a 61-year-old single male with a stable job, residing in a free housing situation for the past 4 years. He has existing credits that have been paid back duly, and he is looking to take out a credit for education purposes. He has a moderate credit amount of 1239 DM and no savings in his account. His current employment has been stable for 1 to 4 years, and he has no other debtors or guarantors. He has no other installment plans, no property, and no telephone. Despite having no savings, he is classified as a good credit risk.###\nHence this label was Yes."
"This individual is a 75-year-old unemployed female who is divorced/separated/married. She has a checking account with less than 0 DM, no savings account, and has been living in her own residence for 3 years. She is seeking a new car loan of 1374 credits with an installment rate of 4% of her disposable income. She has one existing credit at the bank and no other installment plans. She works in a managerial or highly qualified position and is liable to provide maintenance for one person. She has a telephone in her name and is a foreign worker. Her credit history shows that she has paid back existing credits duly till now.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM balance and has been in current employment for 1 to less than 4 years. They are looking to take a loan for a new car, specifically with a critical credit history and other existing credits. The credit amount requested is 2235 DM, and they have savings of less than 100 DM. The person is a married/widowed male, age 33, with one guarantor. They have been living in their current residence for 2 years and have two existing credits at the bank. The individual is a skilled employee/official with a job at a bank. They have one dependent and reside in a rented housing without a telephone. Additionally, they do not have any foreign worker status.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a credit history of repaying existing credits on time, and is looking to finance a radio/television. They have savings between 100 and 500 DM, have been employed for 1 to 4 years, and allocate 4% of their disposable income to installments. The individual is a female who is divorced, separated, or married, with no other debtors or guarantors. They have lived in their current residence for 2 years and own a car or other property. At 32 years old, they have no other installment plans, own their housing, and have one existing credit at the bank. Their occupation is unskilled as a resident, with one dependent, no telephone, and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and unknown savings. They have been employed for less than a year and have a critical credit history with existing credits elsewhere. The purpose of the credit is for a new car, with an installment rate of 2%. The person is a 44-year-old divorced male with no other debtors or guarantors. They have been living in their own real estate property for 4 years and have two existing credits at this bank. As a skilled employee, they are liable for providing maintenance to one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female, aged 34, working in a managerial or self-employed role for over 7 years. She has a good credit history with no existing credits at this bank, and a stable financial status with more than 0 but less than 200 DM in her checking account and less than 100 DM in savings. She is well settled in her own home, with 2 existing credits, and has been residing at her current location for 3 years. She has no other debtors or guarantors, no other installment plans, and owns a car or other property not specified. She is financially responsible with an installment rate of 2% and a credit amount of 1501. Additionally, she has a telephone registered under her name, and is a foreign worker with 1 person to provide maintenance for.###\nHence this label was No."
"This individual is a single male, aged 35, with a stable job in management or as a self-employed highly qualified employee. He has a good credit history, with existing credits paid back duly. He has a moderate amount of credit in the range of 0 to 200 DM, and a savings account with less than 100 DM. He has been employed for 1 to 4 years and has a low installment rate on his disposable income. His current residence has been stable for 2 years, and he lives in a rented housing. He has no other debtors or guarantors, and no other installment plans. He has one existing credit at the bank and is responsible for providing maintenance for one person. He has a telephone registered under his name and is a foreign worker. The purpose of the credit is for a used car.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has been in their current employment for 1 to 4 years. They have taken a loan for furniture/equipment, with a duration of 6 months and a credit amount of 3384. Their savings account/bonds are less than 100 DM, and they have no other installment plans. They are a divorced/separated male, aged 44, with no other debtors or guarantors. They reside in a rented house and have been at their current residence for 4 years. They have a real estate property, a single existing credit at their bank, and a job as a management/self-employed/highly qualified employee/officer. They are liable for providing maintenance for one person and have a registered telephone in their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old single male with a stable job, having been employed for 1 to 4 years. He has a good credit history of paying back all credits at the bank duly. His existing checking account balance is between 0 and 200 DM, with some savings of less than 100 DM. The purpose of his credit is for a radio/television. He owns real estate and lives in his own house for the past 4 years. He has one existing credit at the bank and no other debtors or guarantors. His installment rate is 4% of his disposable income, and he has no other installment plans. He is an unskilled resident but a responsible individual as he is the sole provider for himself. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a 20-year-old single male with no checking account. They have been employed for at least 7 years as a skilled employee/official. They have one existing credit at the bank and have paid back previous credits on time. Their credit amount for furniture/equipment is 1313 DM. They have savings of less than 100 DM and own their own home. They have no other debts or guarantors, and no other installment plans. They have been living at their current residence for 4 years and have 1 person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 26, with a stable job as a skilled employee/official. She has been living in a rented house for 4 years and has no other installment plans or debtors/guarantors. She has held her current job for at least 7 years and has 1 existing credit at the bank. She does not have a telephone but is a foreign worker. She does not have any savings, but has been able to pay back existing credits duly. She is seeking credit for a used car, with a credit amount of 2812 DM to be repaid in 24 months. Her disposable income allows for a manageable installment rate of 2%. She is the sole provider for one person's maintenance.###\nHence this label was Yes."
"This individual has no checking account and has been at their current job for less than 1 year. They are looking to purchase furniture/equipment and have a credit history of critical account/other credits existing. Their credit amount is 4526 and they have savings of at least 1000 DM. They are a single male, 32 years old, with no other debtors or guarantors. They have been living in their own real estate for 2 years and have 2 existing credits at this bank. They work as an unskilled resident, have 2 people they are financially responsible for, and have a telephone registered under their name. Additionally, they have another installment plan with stores and are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has been employed for at least 7 years. They are looking to finance a radio/television, with a credit amount of 2223. Their savings fall between 100 and 500 DM. They are a single male, 52 years old, with no other debtors or guarantors. They own their own home and have been living there for 4 years. They have 2 existing credits at the bank and work as a skilled employee/official. They have one dependent and do not have a telephone. They are a foreign worker and have a building society savings agreement/life insurance.###\nHence this label was Yes."
"This individual has no checking account and an unknown or nonexistent savings account. They have been employed for at least 7 years and have a stable living situation, owning their own home and living there for 4 years. The individual is a 53-year-old single male with no other debtors or guarantors. They have taken out two previous credits at this bank and have a good credit history. Their purpose for borrowing money is for a radio/television, with a moderate credit amount and manageable installment rate. The individual works as a skilled employee or official and is a foreign worker. They have no other installment plans, no telephone, and are responsible for one dependent.###\nHence this label was Yes."
"This individual has no checking account and has existing credits paid back duly. They are looking to purchase furniture/equipment with a credit amount of 1768. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They are single, male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. At 24 years old, they have no other installment plans and rent their housing. They have one existing credit at the bank and work as an unskilled resident. They are liable to provide maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history with existing credits paid back on time. They are seeking a loan for a business purpose. The credit amount requested is 1950. They have savings of less than 100 DM and have been employed for 4 to 7 years. The installment rate is 4% of disposable income. The individual is a 34-year-old single male with no other debtors or guarantors. They have been living in their own residence for 1 year and own a car. They have two existing credits at the bank and work as a skilled employee/official. The individual is responsible for providing maintenance for one person and has a registered telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a single male, aged 35, with a stable job as a skilled employee/official. He has been living in his own home for 3 years and has been employed at the same place for 4-7 years. He has one existing credit at the bank and no other debtors or guarantors. Despite having no savings, he has a good credit history of paying back existing credits on time. He is responsible for providing maintenance for one person. With a reliable income, he is looking to purchase furniture/equipment with a credit amount of 3976 DM to be paid back in 21 months with a low installment rate. He also has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown or nonexistent savings account. They have been employed for 1 to 4 years and have a moderate installment rate in percentage of disposable income. The purpose of their credit is for a radio/television. They are a single male, 29 years old, with no other debtors or guarantors. They own their own home and have two existing credits at this bank. They work as a skilled employee/official and are the sole provider for one other person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, aged 39, with a stable job of 4-7 years, unskilled-resident. She has no existing debtors/guarantors, no installment plans, and no savings account. She owns her own house and has 2 existing credits at the bank. She has been living at her current residence for 3 years and has one dependent. She does not have a telephone but is a foreign worker. The purpose of the credit is for retraining, with a credit amount of 932 DM to be paid off in 6 months.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has a credit history of paying back existing credits on time. They are seeking a loan for furniture/equipment and require 3749 in credit. Their savings are less than 100 DM and they have been employed for less than a year. They have a low installment rate on disposable income and are a divorced/separated/married female. They have no other debtors or guarantors, have lived at their current residence for 4 years, and own a car or another type of property not specified. At 26 years old, they have no other installment plans, own their house, and have one existing credit at the bank. They are a skilled employee/official with one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female in their 60s, with a stable job in management or as a self-employed highly qualified employee or officer. They have been at their current job for over 7 years. They have no other debtors or guarantors, and live in a free housing arrangement. They have two existing credits at a bank, and have been living at their current residence for 4 years. They have a good credit history of paying back all credits at their bank duly. They have a moderate credit amount of 14782 DM and some savings between 100 and 500 DM. Their installment rate is low at 3%, and they have another installment plan with a bank. They have a telephone registered under their name and are a foreign worker. They are responsible for providing maintenance for one person.###\nHence this label was No."
"This individual has a checking account with at least 200 DM, has been employed for 1 to 4 years, and pays their existing credits on time. They took a loan for a radio/television, amounting to 1258 DM, and have savings between 500 and 1000 DM. The person is a divorced, separated, or married female, aged 57, with no other debtors or guarantors. They have been living in their current residence for 3 years, own a car or other property, and have no other installment plans. The individual has one existing credit at the bank, works as an unskilled resident, and is responsible for one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a 33-year-old divorced/separated/married female who is currently unemployed. She has a checking account with less than 0 DM and savings of less than 100 DM. She has paid back her existing credits duly till now and has a good credit history. The purpose of the credit is for furniture/equipment. She owns a car or another type of property, lives in her own house for the past 2 years, and has no other installment plans or debtors/guarantors. She is a skilled employee/official with one existing credit at the bank and one person liable for maintenance. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual is a 50-year-old single male, working as a skilled employee/official for over 7 years. He has a good credit history with a delay in paying off in the past. His existing checking account balance is between 0 and 200 DM, and he has savings of less than 100 DM. The purpose of his credit is for education, with a credit amount of 6224. He has no other debtors/guarantors, currently resides for free, and has no other installment plans. He has been living at his current residence for 4 years, has one existing credit at the bank, and is financially responsible for one other person. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual is a divorced/separated/married female, aged 33, with no checking account and unknown/no savings account. She has been employed for 4 to less than 7 years in an unskilled-resident job. She resides in a rented house with a 4-year history at the current residence. She has one existing credit at the bank for furniture/equipment, amounting to 2186 credits, with an installment rate of 1% of disposable income. She has no other debtors/guarantors and no telephone. She has real estate property and a bank installment plan. She is responsible for providing maintenance for one person and is a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with less than 0 DM in their existing checking account. They have a long credit history with critical accounts and other existing credits. The purpose of the credit is for a used car, with a moderate amount of 2957 DM. They have some savings below 100 DM and have been employed for at least 7 years. Their disposable income installment rate is 4%. The individual is a 63-year-old single male, with no other debtors or guarantors. They have been residing in their own home for 4 years and have a building society savings agreement. They have no other installment plans and no outstanding credits at this bank. The individual is a skilled employee with one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of delaying payments in the past. They took a loan for a radio/television with a credit amount of 1478 DM. Their savings account/bonds hold less than 100 DM. They have been employed for 1 to less than 4 years and their installment rate is 4% of disposable income. The person is a married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 3 years and own real estate. At the age of 33, they have two existing credits at the bank and work as a skilled employee/official. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had a critical credit history with other existing credits. The purpose of the credit is for business. They have a credit amount of 4526 with savings less than 100 DM. They have been employed for 1 to 4 years and have a 3% installment rate based on disposable income. The individual is a single male, aged 74, with no other debtors or guarantors. They have been residing in their own real estate for 2 years and have no other installment plans. The individual works in management or is self-employed with one existing credit at the bank. They are responsible for one person's maintenance and own a telephone registered in their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a 28-year-old single male, with a stable job as a skilled employee. He has been living in his own home for 4 years and has one existing credit at the bank. His existing checking account has less than 0 DM, and he has savings of less than 100 DM. He has been timely in repaying his past credits and is looking to finance furniture/equipment. The credit amount he is seeking is 4169. He has no other debtors or guarantors, no other installment plans, and no telephone. He does not have any dependents but is willing to provide maintenance for one person. Additionally, he has a building society savings agreement/life insurance and is a foreign worker.###\nHence this label was Yes."
"The individual is a 22-year-old married/widowed male, working in an unskilled-resident job. He has been living in his own house for 1 year. He has a small amount of credit in his existing checking account. His credit history shows that he has paid back existing credits duly. The purpose of his current credit is for repairs. He has a small amount of savings. He has no other debtors/guarantors, installment plans, or telephone. He has 1 existing credit at the bank. He is a foreign worker.###\nHence this label was Yes."
"The individual has a stable financial standing with less than 0 DM in their existing checking account. They have a good credit history with existing credits paid back on time. The purpose of the credit is for furniture/equipment, with a moderate amount of 2212. Their savings account status is unknown or they do not have one. The individual has been employed for 4 to less than 7 years and has a modest installment rate on their disposable income. They are a single male, debt-free, and own their own home. With a single existing credit at the bank, they are a skilled employee in their late thirties. They have no other installment plans, no other people to provide maintenance for, a registered telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has a credit history of delaying payments in the past. They took a loan for a new car for a duration of 14 months with a credit amount of 802. Their savings account/bonds hold less than 100 DM. They have been employed for 1 to less than 4 years with an installment rate of 4% of disposable income. The individual is a 27-year-old single male, with no other debtors or guarantors. They have been residing in their current home for 2 years and own it. Additionally, they have two existing credits at the bank and work in an unskilled resident job. They are liable to provide maintenance for one person and do not have any other installment plans. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has been employed for over 7 years. They are looking to finance a new car, with a credit amount of 691 and savings of less than 100 DM. They are a single male with no other debtors or guarantors, owning their own home. With a good credit history and no other installment plans, they are a skilled employee with two existing credits at the bank. At 35 years old, they have been residing in their current home for 3 years and have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual is a single male, unemployed, aged 35, with no other debtors or guarantors. He has a building society savings agreement, owns his own home, and has 2 existing credits at the bank. He works in a managerial or self-employed position and is considered highly qualified. He has 1 dependent and a telephone registered in his name. He is a foreign worker. He has a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and delay in paying off credit in the past. His purpose for the credit is furniture/equipment, with a credit amount of 1050 DM. He has been in his current residence for 1 year, with an installment rate of 4% of disposable income. He has another installment plan with stores.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a credit history of paying back existing credits duly, and is looking to finance a new car. They have a credit amount of 1893 and savings of less than 100 DM. Currently employed for 1 to 4 years, they have a moderate installment rate and are a divorced/separated/married female. They have a guarantor for other debts, have been living at their current residence for 4 years, and possess a building society savings agreement/life insurance. At 29 years old, they have no other installment plans, own their home, and have one existing credit at the bank. Employed as a skilled employee/official, they are liable for one person's maintenance and have a registered telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit risk as they have no existing credits, a stable job, have been at their current residence for 4 years, have a high credit amount of 11816, a low installment rate, and have been employed for over 7 years. They are a single male, 29 years old, with no other debtors or guarantors. They have a savings account with less than 100 DM, no other installment plans, and no telephone. Their purpose for the credit is for business, and they have a car or other property. They are a skilled employee with 2 existing credits at the bank and one dependent. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a 45-year-old divorced/separated/married female, working as a skilled employee/official and has been in their current employment for less than a year. They have a good credit history, one existing credit, and own a real estate property. The purpose of their credit is for a radio/television, with a credit amount of 2329 DM. They have savings of less than 100 DM, no other installment plans, and no telephone. They have one person dependent on them for maintenance and have been residing in their current place for 1 year. Additionally, they have a guarantor and are a foreign worker.###\nHence this label was Yes."
