"The individual in this example has a stable financial profile with existing credit paid back on time. They are looking to finance furniture or equipment for a duration of 36 months. With a credit amount of 3620 DM, they have savings of less than 100 DM. Currently employed for 1 to 4 years, the individual is a single male with a guarantor. They have been living at their current residence for 2 years and possess a building society savings agreement/life insurance. At 37 years old, they have no other installment plans, own their own home, and are a skilled employee/official. They have one existing credit at the bank and are liable for providing maintenance to two people. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old single male with a stable job as a skilled employee/official. He has a savings account with less than 100 DM and has had no previous credits. Currently, he has one existing credit at the bank and has been living in his own home for the past 2 years. He has a moderate credit amount of 14421 for business purposes and has a good standing with a duration of 48 months for repayment. He has no other debtors or guarantors and no other installment plans. Additionally, he has a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"The individual is a young, single male in his late twenties with a steady job and no outstanding debts. He has a moderate amount of money in his savings account and has been living in a rented house for a year. His credit history shows he has paid back previous credits on time. He is looking to purchase furniture or equipment and needs a loan of 9034 DM for 36 months. He has no other ongoing installment plans and has a good credit rating.###\nHence this label was No."
"The individual in this dataset is a 23-year-old divorced or separated or married female, working as a skilled employee or official. She has no checking account, less than one year of present employment, and has been living in rented housing for the past four years. She is seeking a loan for furniture or equipment, with a credit amount of 7127 and a duration of 36 months. Her savings account/bonds contain less than 100 DM, and her installment rate is 2% of disposable income. She has no other installment plans, no other debtors/guarantors, and no one else to provide maintenance for. She possesses a building society savings agreement/life insurance as property, and has a telephone registered under her name. Additionally, she is a foreign worker with two existing credits at the bank.###\nHence this label was No."
"This individual has less than 0 DM in their existing checking account. They have a good credit history with existing credits paid back duly. The purpose of their credit is categorized as \"others.\" They are borrowing a substantial amount of 15857 DM. They have savings of less than 100 DM. Currently unemployed, they have been at their present employment for a duration equivalent to 2 months of disposable income. A male who is divorced or separated, their co-applicant is a guarantor. They have been residing at their current place for 3 years and own a car or another type of property not specified. At the age of 43, they have no other installment plans and live in their own house. With only 1 existing credit at the bank, their job falls into the category of management/self-employed/highly qualified employee/officer. Additionally, they have 1 person to provide maintenance for and do not have a telephone. They are also a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 31, who has been employed for 1 to 4 years in an unskilled resident job. They have no checking account, but have existing credits paid back duly till now. The purpose of their credit is a new car, and they have a credit amount of 1546. Their savings account/bonds hold less than 100 DM, and they own real estate as their housing. They have been residing at their current residence for 2 years and have no other installment plans or debtors/guarantors. With an installment rate of 3% of disposable income, they have one existing credit at the bank. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old divorced or separated or married female, working as a skilled employee or official. She has a good credit history with all credits at the bank paid back duly. She has a checking account with a balance between 0 and 200 DM, no savings, and a credit amount of 433 DM for education purposes. She has been employed for less than a year and has a low installment rate. She lives in a rented house and has been at the current residence for 2 years. She has no other debtors or guarantors, and no telephone. She has one existing credit at the bank, with a bank installment plan, and no other significant debts. She is a foreign worker with two dependents.###\nHence this label was No."
"This individual is a single male with a stable job as a skilled employee, having been employed for 1 to 4 years. He has a good credit history, with existing credits paid back promptly. He is looking to borrow 639 DM for repairs, and has savings of less than 100 DM. His existing checking account balance is between 0 and 200 DM. He currently resides in his own home and has been at the same residence for 2 years. He has no other debtors or guarantors, and no other installment plans. With an age of 30, he has one existing credit at the bank and is responsible for one person's maintenance. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual is a single male with a stable job, having been employed for over 7 years. He has a good credit history with existing credits paid back duly. The purpose of his loan is for business, with a moderate credit amount and some savings. He owns real estate and has been living at his current residence for 1 year. He has one existing credit at the bank and no other debts besides a co-applicant. Additionally, he has a telephone registered under his name and is a foreign worker. He is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has no existing checking account and has a good credit history with existing credits paid back duly. They are seeking a loan for a business purpose. The credit amount requested is 1572 units. They have savings of at least 1000 DM and have been employed for at least 7 years. Their installment rate is 4% of disposable income. Personal status is female, divorced/separated/married. They have no other debtors or guarantors. They have been residing in their current residence for 4 years, which is a real estate property that they own. At the age of 36, they have one existing credit at this bank. Their job is classified as unskilled-resident. They have one dependent for whom they provide maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had a critical account/other credits existing in the past. They are seeking credit for a radio/television purchase, amounting to 522. They have savings between 500 and 1000 DM, have been employed for at least 7 years, and have a 4% installment rate. The individual is a 42-year-old single male, with no other debtors or guarantors. They have been residing in their current residence for 4 years and have a building society savings agreement/life insurance. They have no other installment plans, own their own home, and have 2 existing credits at this bank. The individual is a skilled employee/official and is liable for providing maintenance for 2 people. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female, employed as a skilled employee/official for less than a year. She has a checking account with less than 0 DM, with a credit history of paying back existing credits duly. The purpose of the 448 DM credit is for education. She has savings of less than 100 DM and no other debtors/guarantors. She has been residing in her own home for 4 years and has one existing credit at the bank. She has no other installment plans, no telephone, and no dependents. Her property includes a building society savings agreement/life insurance. She is a foreign worker and has an installment rate of 4% of disposable income.###\nHence this label was No."
"The individual is a 28-year-old divorced/separated/married female with a good credit history and a stable job in management/self-employment/highly qualified employee/officer. She has a small ongoing loan and has been living in a rented house for 4 years. She has no other debts or guarantors and has a savings account with less than 100 DM. She has been in her current job for less than a year and has a telephone registered under her name. She is a foreign worker and is responsible for providing maintenance for one person. She is looking to borrow a moderate amount for a radio/television.###\nHence this label was Yes."
"The individual has a status of existing checking account with less than 0 DM, has a credit history of paying back existing credits duly, and is looking to purchase a radio/television. They are seeking a credit amount of 2522 with savings of less than 100 DM. The individual has been employed for at least 7 years, has a low installment rate of 1% of disposable income, and is a single male. They have a guarantor for other debtors, have been residing at their current residence for 3 years, and have a building society savings agreement/life insurance property. The individual is 39 years old, has no other installment plans, owns a house, has one existing credit at the bank, and is a skilled employee/official. They have 2 people that they are liable to provide maintenance for, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been repaying existing credits on time. They are planning to use the credit for a radio/television. They have a savings account with a balance between 500 and 1000 DM and have been employed for at least 7 years. Their installment rate is 3% of disposable income, and they are a male who is divorced/separated. They have no other debtors or guarantors. The individual has been living in their current residence for 2 years and owns a car or other property not listed. They are 26 years old with no other installment plans and own their own home. They have one existing credit at the bank and work in a management/self-employed/highly qualified job. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for over 7 years. They are looking to finance a radio/television purchase with a credit amount of 2223. They have savings between 100 to 500 DM and no other debts or guarantors. The person is a 52-year-old single male with no dependents, owning their own home. They have 2 existing credits at the bank and work as a skilled employee/official. Their installment rate is 4% of disposable income and they have been residing at their current location for 4 years. They have a building society savings agreement/life insurance and a bank installment plan. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a loan for a radio/television. The credit amount requested is 707 units. They have savings of less than 100 DM and have been employed for 1 to 4 years. The installment rate for repayment is 4% of disposable income. The individual is a 30-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. They have two existing credits at the bank and work as a skilled employee/official. The individual is liable to provide maintenance for one person and does not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"The individual in this data does not have a checking account and has a good credit history. They are looking to purchase a radio or television. The credit amount requested is 2404. They have savings of less than 100 DM and have been employed for 1 to 4 years. Their disposable income installment rate is 2%. The individual is a divorced/separated/married female, has no other debtors or guarantors, and has been living at their current residence for 2 years. They own a car or other property, are 26 years old, and have no other installment plans. Their housing status is own, they have 2 existing credits at the bank, and work as a skilled employee/official. They are liable for providing maintenance to 1 person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM, has been employed for over 7 years, and has paid back existing credits on time. They are seeking a loan for a radio/television. The credit amount requested is 4473 DM, with savings of less than 100 DM. They have no other debtors or guarantors, and reside in their own home for 2 years. The individual is a 31-year-old single male, with a skilled job, and no other installment plans. They have one existing credit at the bank and are the sole provider for one person. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 35, with a stable job in management/self-employment/highly qualified employee/ officer. \nHe has a checking account balance between 0 and 200 DM, with a credit history of repaying existing credits on time. \nThe purpose of his loan is for a used car, with a credit amount of 6948 DM. \nHe has savings of less than 100 DM and has been employed for 1 to 4 years. \nHis installment rate is 2% of disposable income, and he has no other debtors or guarantors. \nHe has been living at his current residence for 2 years, and his housing situation is renting. \nHe has one existing credit at the bank, and no other installment plans. \nHe is the sole provider for one person and owns a telephone registered under his name. \nAdditionally, he is a foreign worker.###\nHence this label was Yes."
"This individual has a current checking account with less than 0 DM, has been employed for 1 to 4 years, and has a credit history of critical accounts/other credits existing. They are looking to purchase furniture/equipment and require a credit amount of 4281. They have savings between 500 and less than 1000 DM, with no other installment plans or debtors/guarantors. The individual is a divorced/separated/married female, owns their own home, and has been residing in their current residence for 4 years. They are a skilled employee/official, aged 23, with 2 existing credits at this bank and 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual is a 22-year-old divorced/separated/married female, working as a skilled employee/official. She has a checking account with a balance between 0 to 200 DM, savings of less than 100 DM, and has been employed for less than a year. She has no other debtors or guarantors, owns a car or other property, and lives in her own home for 2 years. She has one existing credit, no other installment plans, and a registered telephone. She has paid back her existing credits on time, has a credit amount of 1670 DM, an installment rate of 4%, and is a foreign worker.###\nHence this label was No."
"This individual is a 30-year-old divorced/separated/married female, working as a skilled employee/official with 1-4 years of employment history. She has no checking account but maintains a savings account/bonds with less than 100 DM. She has been living in her own property for 2 years. The purpose of the 8133 DM credit is for a used car, with an installment rate of 1%. She has no other debtors/guarantors, no other installment plans, no telephone, and no foreign worker status. She has one existing credit at the bank and is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has no checking account and has a history of delays in paying off debts. They are taking a 24-month loan for a business purpose, with a credit amount of 3863. Their savings account holds less than 100 DM. They have been employed for 1 to less than 4 years and have a low installment rate in terms of disposable income. The person is a single male, aged 32, with no other debtors or guarantors. They reside in a property for free with unknown or no property ownership. This individual has one existing credit at the bank, is a skilled employee, and has one person to provide maintenance for. They do not have telephone service but are a foreign worker.###\nHence this label was Yes."
"This individual has a modest amount of money in their existing checking account, with a credit history showing timely payments on previous loans. They are seeking credit for a business purpose, requiring less than 2000 DM. They have substantial savings, have been employed for 1-4 years, and have no other outstanding debts or guarantors. The individual is a single male in their mid-thirties, with no other ongoing installment plans. They own their own home and have one existing credit at their current bank. Their job is categorized as unskilled-resident, and they are responsible for providing maintenance to one person. They have a telephone and are a registered foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a stable credit history with existing credits paid back duly. They took a loan for a radio/television, amounting to 1346 DM. Their savings account holds between 100 and 500 DM. They have been employed for over 7 years and have a low installment rate of 2%. The person is a single male, with no other debtors or guarantors. They have been living at their current residence for 4 years and have unknown property. At 42 years old, they have a bank installment plan and live in a free housing situation. The individual is a skilled employee/official with one existing credit at the bank. They are liable to provide maintenance for 2 people and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and is seeking a car loan for a new car. They have a critical credit history with other existing credits outside of this bank. Their credit amount is 3485, and they have unknown savings. They have been employed for less than a year and have a low installment rate. The person is a 44-year-old divorced/separated male, with no other debtors or guarantors. They have been living in their own real estate property for 4 years and have no other installment plans. The individual is a skilled employee/official with 2 existing credits at this bank. They are liable for providing maintenance for one person and have a registered telephone in their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this data is a 58-year-old single male who has been employed for less than a year as a skilled employee/official. He has no existing credits at the bank and has one person he is financially responsible for. His current residence has been stable for 4 years, and he rents his housing. He has no debts or guarantors, and no other installment plans. His credit history shows that he has never taken any credits and has always paid back any dues on time. He has a checking account with a balance between 0 and 200 DM, and a savings account/bonds with less than 100 DM. He is looking for a loan for business purposes, with a credit amount of 15945 DM. He has a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of less than 0 DM and has been employed for 4 to 7 years. They have no savings account but own property and reside in their own home. The person is a single male, aged 30, and works in a high-level job. They have two existing credits at the bank and pay 4% of their disposable income as installment rate. They have no other debtors or guarantors, no other installment plans, and one dependent. The purpose of the credit is for furniture or equipment, with a duration of 39 months and a credit amount of 14179. They have lived at their current residence for 4 years, have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance between 0 and 200 DM, has a credit history of critical account/other credits existing, and is looking to finance a new car. They are borrowing an amount of 1995 DM and have savings between 100 and 500 DM. The individual has been employed for less than a year, has a low installment rate of 4% of disposable income, and is a single male. They have no other debtors/guarantors and have been living in their current residence for 1 year. The individual owns a car or other property, is 27 years old, and has no other installment plans. They reside in their own home, have one existing credit at the bank, and work as a skilled employee/official. The individual is responsible for providing maintenance for one person and does not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a credit history of critical account/other credits existing. They are looking to finance a radio/television purchase with a credit amount of 9566. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. The installment rate for their disposable income is 2%. They are female, divorced/separated/married, with no other debtors/guarantors. They have been living at their current residence for 2 years and own a car or other property not specified. At 31 years old, they have other installment plans at stores and their housing status is 'own'. They have 2 existing credits at this bank and work as a skilled employee/official. They are responsible for providing maintenance for 1 person and do not have a telephone. Lastly, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a stable employment history of at least 7 years. They are married or widowed, residing in a rented house with real estate property. With a credit duration of 6 months, the purpose of the credit is for a radio/television. The credit amount is 1740, with savings of less than 100 DM. They have no other debts or guarantors, no other installment plans, and no telephone. Being a skilled employee, they have 2 existing credits at the bank and provide maintenance for one person. At 30 years old, they are a foreign worker with no other people liable for maintenance.###\nHence this label was Yes."
