"The individual has no checking account and has a critical credit history with existing credits elsewhere. They are looking to finance a new car, requiring a credit amount of 6614. Their savings are below 100 DM, and they have been employed for at least 7 years. With a low installment rate, they are a single male, without any other debtors or guarantors. They have been residing in their current home for 4 years, own a car or other property, and are 34 years old. They have no other installment plans, own their housing, and have 2 existing credits at this bank. The individual is a highly qualified employee in management, with 1 person depending on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown or nonexistent savings account. They have been employed for at least 7 years as a skilled employee or official. The purpose of their credit is for a used car, with a credit amount of 10477. They have no other debts or guarantors and have been living in their current residence for 4 years. Despite having no property of their own, they reside in a free housing arrangement. Additionally, they have no other installment plans, no telephone, and are a foreign worker. At 42 years old and single, this individual has a good credit history and a low installment rate, making them a potentially good credit risk.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female who has been employed for 1 to 4 years as a skilled employee/official. She has a checking account with less than 0 DM, a savings account with 500 to less than 1000 DM, and owns a car or other property not specified. She has had 2 existing credits at this bank and has been residing at her current address for 4 years. She is not responsible for providing maintenance for anyone else, does not have any other debtors/guarantors, and does not have a telephone. She does not have any other installment plans and does not have any foreign worker status. The purpose of her credit is for furniture/equipment, with a credit amount of 4281 over a duration of 33 months. Her installment rate in percentage of disposable income is 1.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, a credit history showing critical accounts/other credits, and wants a new car. They are borrowing 1038 DM with savings of less than 100 DM. They have been employed for 4-7 years, have a single status, and a co-applicant for debts. They have been living in their current residence for 3 years and own their housing. They are a 49-year-old skilled male employee with no other installment plans, 2 existing credits, and one dependent. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a single male, aged 35, with a stable job as a skilled employee. He has been residing in his own home for 3 years and has a good credit history, paying back existing credits duly. His current checking account balance is between 0 and 200 DM, and he has no savings. He has had his present employment for 4 to 7 years and has one existing credit at the bank. The purpose of his credit is for furniture/equipment, with a credit amount of 3976 DM. He has no other debtors or guarantors, and no other installment plans. His installment rate is 2% of his disposable income. He is responsible for providing maintenance for one person and has a registered telephone. Additionally, he is a foreign worker.###\nHence this label was Yes."
"The individual has a stable credit history with existing credits paid back on time. They are seeking a loan for furniture/equipment, with a moderate credit amount. They have a small savings balance and are in a relatively new job. Despite being divorced or separated, they own their own home and have no other debts or guarantors. The individual is in their early 30s, has no other installment plans, and has been living at their current residence for a few years. They have a simple job and are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM and has been employed for at least 7 years. They have paid back existing credits on time and are looking to borrow 1905 DM for education. They have savings of less than 100 DM and no other debtors or guarantors. The individual is a 40-year-old single male in a management position, living in a rented house for 4 years. They have no other installment plans and one existing credit at the bank. Additionally, they have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history of repaying existing credits promptly. They are taking a 15-month loan for education, amounting to 4623 DM. They have savings between 100 and 500 DM, and have been employed for 1 to 4 years. Their current installment rate is 3% of their disposable income. The individual is a 40-year-old single male, with no other debtors or guarantors. They have been living in their own residence for 2 years. Their property includes a building society savings agreement/life insurance. They have no other installment plans and no outstanding credits at this bank. The individual is a management/self-employed/highly qualified employee/officer with one person dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"The individual is a young single male with a short employment history. They have a good credit history, one existing credit at a bank, and no other installment plans. They live in a rented house and have a co-applicant on their loan. Their savings amount is moderate, and they have no property. They have a steady job in a high-ranking position and can be contacted by phone. Overall, they seem financially stable with a reasonable credit amount and a positive attitude towards repaying debts on time.###\nHence this label was No."
"This individual is a 74-year-old divorced or separated or married female with a stable job in management, self-employment, or as a highly qualified employee or officer. She has been at her current employment for at least 7 years and has no other debtors or guarantors. She has one existing credit at this bank and has been living in her current residence for 4 years. She has two people who are dependent on her for maintenance. She has a good credit history with all credits at the bank paid back duly. Her credit amount is 5129 DM for the purpose of a used car. She has savings of less than 100 DM and no property. She has a telephone registered under her name and is a foreign worker. She lives in housing for free and has a moderate installment rate in percentage of disposable income. She also has another installment plan with the bank.###\nHence this label was No."
"This individual is a skilled female employee, divorced/separated/married, aged 30, residing in their own home for 1 year. They have had no previous credits but have a good credit history. Their existing checking account balance is between 0 and 200 DM, with savings between 500 and 1000 DM. They have a car (new) and other property. Their credit amount is 8358 DM with an installment rate of 1%. They have no other debtors or guarantors, installment plans, or telephone. They have 2 existing credits at their current bank and 1 person to provide maintenance for. They are a foreign worker with less than 1 year of employment at their current job.###\nHence this label was Yes."
"This individual has a stable financial situation with a moderate credit amount. They have a long-standing employment and a good credit history. Their savings are relatively low, and they are single. They own a home and have no other major debts or dependents. At 48 years old, they have a few existing credits and work in an unskilled resident job. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a critical credit history with other existing credits. They are looking to finance a new car with a credit amount of 1055. Their savings are below 100 DM and they have been employed for less than a year. They have a 4% installment rate based on disposable income. The individual is a 30-year-old divorced, separated, or married female. They have no other debtors/guarantors and have been living in their current residence for 1 year. Their property includes a building society savings agreement or life insurance. They have no other installment plans, own their own home, and have 2 existing credits at this bank. The individual is a skilled employee/official with 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a divorced/separated male, aged 31, with a stable job as a skilled employee/official. He has been living in his own home for 2 years and has no other debtors or guarantors. He has 2 existing credits at the bank and 2 people he is liable to provide maintenance for. His credit history shows a delay in paying off debts in the past. The purpose of his current credit application is for business, and he needs a credit amount of 1449 DM for this. His savings range from 100 to 500 DM, and he has been employed at his current job for over 7 years. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance between 0 and 200 DM, has had credit in critical condition elsewhere in the past, and is looking to finance a new car. They are borrowing 1995 DM with savings between 100 and 500 DM. They have been employed for less than a year and pay 4% of their disposable income in installments. The applicant is a 27-year-old single male with no other debtors or guarantors. They have lived in their current residence for a year and own a car or other property. They have no other installment plans, own their own home, and have one existing credit at a bank. The individual is a skilled employee, responsible for one person's maintenance, does not have a telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated female, aged 57, with no checking account. She has been employed for more than 7 years and is considered unskilled in her job as a resident. She has 3 existing credits at a bank and currently resides for free. Her credit history is critical with other existing credits, and her purpose for the credit is education. She has savings of less than 100 DM and an installment rate of 2% of her disposable income. She has no other debtors or guarantors and no property. She has a telephone, no other installment plans, and no other people to provide maintenance for. She is a foreign worker with a credit amount of 2748.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM and has a good credit history. They are looking to take out a new car loan, amounting to 2579 DM. They have savings of less than 100 DM and have been employed in their current job for less than a year. With a low installment rate of 4%, they are a single male living in their own property. They have no other significant debts or loans, and no other individuals depending on them for financial support. Aged 33, they have been residing in their current home for 1 year. Their job is categorized as unskilled-resident and they do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual, a divorced/separated/married female, has no checking account and has been employed for 1 to less than 4 years. She lives in her own home, which is a real estate property. She has one existing credit at the bank and no other debtors or guarantors. She has been living in her current residence for 2 years, is 24 years old, and has no other installment plans. She has a small credit amount of 932, with savings less than 100 DM. Her purpose for the credit is radio/television, and she has a good credit history despite previous delays in payment. She has a moderate installment rate in percentage of disposable income and a single dependent. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a young, single male with a stable job as a skilled employee. He has had his current checking account for over 7 years and has no savings. He is looking to purchase furniture or equipment and is renting his current residence. Despite having no previous credit history with this bank, he has successfully managed two existing credits. He has a co-applicant and no other debtors or guarantors. With a good credit amount and a low installment rate, he seems financially responsible. At the age of 20, he is relatively young and has no other significant financial obligations.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of a critical account/other credits existing elsewhere. They took a loan for a radio/television, amounting to 717 units. Their savings account/bonds hold less than 100 DM. Employed for over 7 years, they have a low installment rate. A 52-year-old single male, they own real estate and have no other debtors/guarantors. They have been living at their current residence for 4 years and have 3 existing credits at this bank. A skilled employee/official, they have no other installment plans and no telephone. They provide maintenance for one person and are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has had their current employment for at least 7 years. They are a single male, 52 years old, with no other debtors or guarantors. They have a good credit history with critical accounts, and have taken a credit amount of 338 for the purpose of buying a radio/television. They have savings between 500 and 1000 DM and own their housing. Additionally, they have 2 existing credits at this bank, a stable job as a skilled employee/official, and 1 person they are financially responsible for. They do not have any other installment plans, own a car or other property not specified, and are a foreign worker. They have been residing at their present residence for 4 years and do not have a telephone.###\nHence this label was Yes."
"The individual is a 46-year-old divorced or separated or married female, working for less than 1 year in an unskilled resident job. She has no checking account, less than 100 DM in savings, and has been living in her own house for 2 years. She has 2 existing credits at the bank and is responsible for providing maintenance for one person. She has a history of delay in paying off debts and is looking to finance a used car with a credit amount of 3594. She has no other debtors or guarantors, no other installment plans, and no telephone. She holds a building society savings agreement or life insurance as property and is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a credit history with critical accounts/other credits. They are looking to purchase a radio or television, with a credit amount of 1800. Their savings amount is less than 100 DM. They have been employed for 1 to 4 years and have a 4% installment rate based on disposable income. The person is a 24-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property not specified. The individual has no other installment plans, owns their own home, and holds a skilled job. They have 2 existing credits at the bank and are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a 22-year-old married/widowed male, working as a skilled employee/official for 1-4 years. He has a good credit history with existing credits paid back duly. He has a savings account or bonds with a balance of at least 1000 DM. The individual is looking to take a new car loan of 1007 DM and has been living in his own real estate property for 1 year. He has no other debtors/guarantors and no other installment plans. He has one existing credit at the bank and is responsible for providing maintenance for one person. He has no telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a business loan of 1076 DM and have savings of less than 100 DM. Currently, they have been employed for 1 to less than 4 years and have a manageable installment rate. The individual is a married/widowed male, owns real estate for housing, and is a skilled employee or official. They have no other debtors/guarantors or installment plans, and they have a telephone registered under their name. With only one existing credit at the bank, they have been living in their current residence for 2 years and are responsible for one dependent.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, aged 30, working as a skilled employee/official. She has been in her current job for 1 to 4 years and has been living in her own house for 1 year. She has no other debtors/guarantors or other installment plans. She has 1 existing credit at the bank and no telephone. She is a foreign worker. She has a good credit history, with existing credits paid back duly till now. She has a status of existing checking account with 0 to less than 200 DM, savings of less than 100 DM, and a credit amount of 918 DM for the purpose of furniture/equipment. She has a 4% installment rate in percentage of disposable income and a building society savings agreement/life insurance property. She is responsible for providing maintenance for 1 person.###\nHence this label was No."
"The individual has no checking account and an unknown or no savings account. They have been employed for less than a year and have delayed in paying off credit in the past. The purpose of the credit is for a business. The credit amount is 7980 with an installment rate of 4% of disposable income. The individual is a 27-year-old single male, living in a rented house. They have no other debtors or guarantors and no other installment plans. They have two existing credits at the bank and have been living in their current residence for 4 years. They are a skilled employee/official, with one person liable for maintenance. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"This individual has a checking account balance of at least 200 DM and has had it for over 7 years. They have a credit history with critical accounts/other existing credits elsewhere. The purpose of their credit is for a radio/television. They have savings of less than 100 DM and a credit amount of 3017. They are a single male, 47 years old, with no other debtors or guarantors. They have been living in their own residence for 4 years and have a building society savings agreement/life insurance. They have a stable job as a skilled employee/official, with one existing credit at the bank. They are responsible for one person's maintenance and are a foreign worker without a telephone.###\nHence this label was Yes."
"The individual is a single male, aged 32, with a stable job as a skilled employee/official. He has been living in his own residence for 1 year and has been employed for 4-7 years. He has no other debtors/guarantors or other installment plans. He has 2 existing credits at the bank and pays his installments on time, with an installment rate of 3%. His savings amount is less than 100 DM and he has 0-200 DM in his checking account. He has a credit history of paying back credits duly. The purpose of his credit is for education, and the credit amount is 2273. He has a car or other property, but no telephone. He is a foreign worker and has 2 people who rely on him for maintenance.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of critical account/other credits existing. They are borrowing for the purpose of buying a radio/television. The credit amount is 1471 units. They have savings of less than 100 DM and have been employed for 1 to 4 years. The installment rate is 4% of disposable income. The person is a single male, with no other debtors or guarantors. They have been living at their current residence for 4 years and have unknown/no property. The individual is 35 years old, with no other installment plans, living for free. They have 2 existing credits at the bank, are a skilled employee/official, and have 1 person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a 23-year-old female who is divorced/separated/married. She has been employed for 4-7 years and resides in a rental property. She has no other debtors/guarantors or installment plans. She has one existing credit at the bank and is classified as an unskilled resident. She has been living at her current residence for 4 years and has no telephone. She is a foreign worker with no other people dependent on her for maintenance. Based on her credit history of existing credits paid back duly, she is considered a good credit risk.###\nHence this label was Yes."
"This individual has no checking account and an existing critical account/other credits. They are looking to finance a used car with a credit amount of 8858. Their savings account status is unknown. They have been employed for 4 to 7 years and have a low installment rate. The individual is a 35-year-old single male, with no other debtors or guarantors. They have lived in their current residence for 1 year and have unknown property status. They have no other installment plans, live in a free housing situation, and have 2 existing credits at this bank. The individual is a skilled employee/official with 1 person being liable for maintenance. They own a telephone registered under their name and are a registered foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an established credit history of paying back loans on time. They are seeking a loan for a radio/television, with a credit amount of 3835. Their savings account status is unknown. They have been employed for at least 7 years and have a low installment rate as a percentage of disposable income. The individual is a 45-year-old divorced/separated/married female, with no other debtors or guarantors. They have been residing in their own real estate property for 4 years. They have no other installment plans, one existing credit at the bank, and work as an unskilled resident. They have one person they provide maintenance for, own a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account and has been employed for at least 7 years. They are seeking a loan for furniture/equipment, with a credit amount of 5150. Their savings are less than 100 DM. They are a 33-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years, own a car or another property, and have no other installment plans. They have one existing credit at the bank, work as a skilled employee/official, and are responsible for providing maintenance for one person. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and no savings account. They have been repaying their existing credits on time. The purpose of the new credit is to buy a car. They have been employed for 4 to less than 7 years as a single male. They have no other debtors or guarantors. The individual resides in their own home and has a building society savings agreement/life insurance. They are a skilled employee/official, aged 32, with no other installment plans and no telephone. They have one existing credit at the bank and one person to provide maintenance for. They are not a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced/separated/married and unemployed. She has been residing in her current place for 4 years, renting her house. She has 2 existing credits at the bank, with a credit history of paying back all credits at this bank duly. Her purpose for a new credit is to buy a car, and the credit amount is 1193. She has a savings account of less than 100 DM and has no property. She is 29 years old, with an installment rate of 1% of disposable income. She has a co-applicant as another debtor/guarantor, and no other installment plans. She works as an unemployed/unskilled non-resident. She is liable to provide maintenance for 1 person and does not have a telephone. She is a foreign worker.###\nHence this label was No."
"The individual has a moderate amount of money in their existing checking account. They have a good credit history with existing credits paid back on time. The purpose of the credit is for business. The credit amount is relatively low. They have some savings but not a significant amount. They have been employed for 4-7 years. Their disposable income allows for a moderate installment rate. The individual is a single male with no other debtors or guarantors. They have been living in their current residence for 4 years and own real estate. The individual is 39 years old with no other installment plans. They have one existing credit at this bank and work as an unskilled resident. They have one person to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a moderate amount of money in their existing checking account. They have a good credit history with all previous credits being paid back on time. The purpose of the credit is for a new car. They do not have any savings in their account. They have been employed for 1 to 4 years. The installment rate for the credit is low. The individual is a single male. They do not have any other debtors or guarantors. They have been living at their current residence for 4 years. The individual's property ownership is unknown. They are 37 years old and have no other installment plans. They live in a free housing situation. They have one existing credit at the bank. The individual is a skilled employee or official. They are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"The individual in this example has no existing checking account and has been employed for 4 to 7 years. They are looking to borrow a credit amount of 1402 for the purpose of furniture/equipment. Their savings amount is between 500 and 1000 DM, and they have been living at their current residence for 4 years. The individual is a divorced/separated/married female, with no other debtors or guarantors. They do not have any other installment plans and live in a rented house. Their job is a skilled employee/official, and they have one existing credit at this bank. The individual is 37 years old, with a 3% installment rate in percentage of disposable income. They have one person they are liable to provide maintenance for and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account and has been employed for 1 to 4 years. They are looking to finance a new car and have a good credit history. Their credit amount is 1163 and they have savings between 500 and 1000 DM. The individual is a 44-year-old single male with no other debtors or guarantors. They own real estate and have been living at their current residence for 4 years. The individual has a stable job as a skilled employee/official and has one existing credit at the bank. They have no other installment plans, own their own home, and have a telephone registered in their name. Additionally, they have one person to provide maintenance for and are a foreign worker.###\nHence this label was Yes."
"The individual in this example has a modest amount of money in their checking account, a long credit duration of 72 months, a good credit history, and is intending to purchase a radio or television. They have some savings, have been employed for 1-4 years, and a low installment rate. The person is a married or widowed male, has no other debtors or guarantors, and has been residing at their current place for 2 years. They own a car or other property, are a skilled employee or official, and have one existing credit at the bank. They are responsible for providing maintenance to one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old unemployed divorced/separated/married female. She has a good credit history with existing credits paid back duly. Her existing checking account has less than 0 DM. She is looking to use a car (used) and needs a credit amount of 1352. She has savings between 500 and 1000 DM and has been unemployed for some time. She has no other debtors or guarantors and has been residing in her current location for 2 years. She has a building society savings agreement/life insurance as property and rents her housing. She has one existing credit at this bank and is unemployed/unskilled. She has one dependent and has a telephone registered under her name. She is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a history of delays in paying off debts. They are taking a 36-month loan for furniture/equipment, with a credit amount of 7678. They have savings between 500 and 1000 DM and have been employed for 4 to 7 years. The installment rate is 2% of disposable income. The individual is a 40-year-old divorced/separated/married female with no other debtors or guarantors. They have owned their own home for 4 years and have 2 existing credits at the bank. The individual is a skilled employee/official with one dependent and has a telephone registered under their name. They are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and an established credit history with other institutions. They are seeking a loan for a radio/television, with an amount of 2424. Their savings account status is unknown. They have been employed for at least 7 years and have a low installment rate. The individual is a 53-year-old single male, with no other debtors or guarantors. They have been residing at their current residence for 4 years, own property, and have no other installment plans. The individual is a skilled employee with 2 existing credits at their bank, liable for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old single male, working in an unskilled resident job. He has been living in his own home for 2 years and has a checking account balance between 0 and 200 DM. He has a credit history of critical accounts and other existing credits, and has a credit amount of 2520 DM for the purpose of radio/television. He has savings between 500 and 1000 DM, and has been employed for 1 to 4 years. His installment rate is 4% of his disposable income, and he has no other installment plans or debtors/guarantors. He has two existing credits at the bank and one person to support. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual in this dataset is a divorced or separated or married female, aged 31, with no checking account. She has been employed for 1 to less than 4 years as a skilled employee/official. She has no other debtors/guarantors, owns a car or other property, and lives in her own home for 2 years. She has 2 existing credits at the bank and her credit history is critical with other existing credits. The purpose of her credit is for a radio/television, and she has a credit amount of 9566 DM. She has savings of less than 100 DM, an installment rate of 2%, and another installment plan in stores. She is responsible for providing maintenance for 1 person, does not have a telephone, and is a foreign worker.###\nHence this label was Yes."
"The individual in this data does not have a checking account and their credit history shows critical accounts/other existing credits. They are taking a 24-month loan for education, amounting to 1927 credits. They do not have any savings account and have been employed for 1 to 4 years. Their personal status is female, divorced/separated/married. They have no other debtors or guarantors and have owned their residence for 2 years. They own a car or other property not specified. At 33 years old, they have no other installment plans and live in their own house. They have 2 existing credits at their bank and are a skilled employee/official. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, a credit history showing critical accounts with other credits existing, and is seeking a loan for furniture/equipment. They are requesting a credit amount of 975 DM and have savings of less than 100 DM. The individual has been employed for 1 to less than 4 years, has a low installment rate relative to disposable income, and is a male who is divorced/separated. They have no other debtors or guarantors, have been residing at their current residence for 3 years, and have a property agreement related to building society savings or life insurance. The individual is 25 years old, has no other installment plans, and owns their own home. They have 2 existing credits at the bank, are a skilled employee/official, and have 1 person they are financially responsible for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a 37-year-old single male with no checking account, unknown savings, and no debts to other parties. He has been employed for at least 7 years as a skilled employee, and has been living in his current residence for 2 years. His credit history shows that he has paid back all existing credits on time. The purpose of his current credit application is for a business venture, with a credit amount of 7409. He has no other installment plans and owns his own home. He has 2 existing credits at the bank and is the sole provider for one person. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 23-year-old divorced/separated/married female, who has been employed for at least 7 years in a management/self-employed/highly qualified employee/officer position. She has a good credit history with existing credits paid back duly till now. She is looking to borrow credit for a new car, with a credit amount of 1961 DM. She has savings of less than 100 DM and owns her own house. She has no other debtors/guarantors or other installment plans. She has been residing at her current residence for 2 years and has one existing credit at the bank. She does not have a telephone but is a foreign worker. Overall, she appears to be a responsible individual with stable finances.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history, and has paid existing credits back duly. They took a loan for a radio/television, amounting to 2600 DM. Their savings are less than 100 DM, and they have been employed for 1 to 4 years. They have a low installment rate, are a single male, and have no other debtors or guarantors. They have been living at their current residence for 4 years, have unknown or no property, and are 65 years old. They have no other installment plans, live in a free housing situation, and have 2 existing credits at the bank. They work as a skilled employee or official, have 1 person dependent on them for maintenance, do not have a telephone, and are a foreign worker.###\nHence this label was No."
"This individual has:\n- A status of existing checking account with 0 to 200 DM\n- 12 months duration in credit history with existing credits paid back duly till now\n- Taken a credit amount of 766 for the purpose of radio/television\n- Savings account/bonds between 500 and 1000 DM\n- Been employed for 1 to 4 years\n- An installment rate of 4% of disposable income\n- Personal status as a single male\n- No other debtors/guarantors\n- Lived in their current residence for 3 years\n- Real estate property\n- Age of 66 years\n- No other installment plans\n- Owns their housing\n- 1 existing credit at the bank\n- Job as an unskilled resident\n- 1 person liable for maintenance\n- No telephone\n- Yes as a foreign worker###\nHence this label was No."
"This individual has no existing checking account and has had a critical account or other credits at a different bank in the past. They are seeking a new car loan for a duration of 24 months, with a credit amount of 2022. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a moderate installment rate and are a divorced/separated/married female. They have no other debtors or guarantors, and have been residing in their current home for 4 years. They own a car or other property, and are 37 years old with no other installment plans. They have one existing credit at this bank, are a skilled employee/official, and have one dependent. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and unknown/no savings account. They have been paying existing credits back duly and have been employed for less than a year. The purpose of the credit is for a radio/television. They have a manageable installment rate and own a car or other property. The individual is a 25-year-old single male with no other debtors or guarantors. They have no other installment plans, own their own home, and have two existing credits at the bank. The individual is a skilled employee/official with one person to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are taking a 24-month loan for a new car, with a credit amount of 7393. Their savings are below 100 DM and have been employed for 1 to less than 4 years. They have a low installment rate and are a single male. They have no other debtors or guarantors, and have been living at their current residence for 4 years. Their property includes a building society savings agreement or life insurance. At 43 years old, they have no other installment plans, own their own home, and have one existing credit at the bank. Their job is unskilled, they have 2 dependents, no telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown/savings account. They have been employed for at least 7 years as a skilled employee/official. With a stable living situation owning their home for 4 years, they are a single 63-year-old male. Their credit history shows existing critical accounts/other credits. The purpose of their credit is for a used car, with a credit amount of 7596. They have no other debtors/guarantors or installment plans, and no telephone. They have 2 existing credits at the bank and are the sole provider for one person. Additionally, they are a foreign worker with no other significant financial obligations.###\nHence this label was Yes."
"This individual has no checking account and an existing credit history of paying back credits duly. They are looking to finance a radio/television, with a credit amount of 2279. They have no savings account, have been employed for 1 to 4 years, and have a 4% installment rate. The individual is a single male, with no other debtors or guarantors, and has been residing at their current residence for 4 years. They have unknown property, are 37 years old, and have no other installment plans. They live in a free housing arrangement, have one existing credit at the bank, and work as a skilled employee/official. They are liable to provide maintenance for one person, own a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual is a married/widowed male, aged 25, with a job as an unskilled resident. He has been working at his current job for 4-7 years and has been living in his current residence for 3 years. He has one existing credit at the bank and no other debtors/guarantors. This person does not have a telephone but is a foreign worker. He has no other installment plans, a car or other property, and owns his own home. He has a savings account with less than 100 DM and a checking account with 0-200 DM. His credit history shows that he has paid back existing credits duly till now. The purpose of his credit application is for a new car, with a credit amount of 685 DM. He has an installment rate of 2% of disposable income and is responsible for providing maintenance for one person.###\nHence this label was No."
"This individual is a 29-year-old divorced/separated/married female who has been employed for at least 7 years as a skilled employee/official. She lives in a rented house with one dependent and no other debtors/guarantors. She has one existing credit at the bank and no other installment plans. Her credit history shows a critical account/other credits existing elsewhere. She has no telephone but is a foreign worker. Despite having no specified property, she has been residing at her current residence for 4 years. She has savings of at least 1000 DM and a credit amount of 7758 DM for a used car, with a duration of 24 months. Her installment rate is 2, indicating a moderate percentage of disposable income relative to her credit amount.###\nHence this label was Yes."
"The individual in this dataset is a single male, 32 years old, who has been employed for over 7 years as a skilled employee/official. He has no existing debts or other debtors, and lives in a free housing arrangement for 3 years. He has no telephone but is a foreign worker. He has savings of at least 1000 DM, with 2 existing credits at this bank. The purpose of his credit is for education, with a credit amount of 1136 DM. Additionally, he has no other installment plans, no property, and no other people to provide maintenance for.###\nHence this label was No."
"This individual is a 24-year-old single male, working as a skilled employee or official with 4 to 7 years of employment history. He has a good credit history with existing credits paid back duly till now. His existing checking account balance is between 0 and 200 DM, with a savings account/bonds balance between 100 and 500 DM. The purpose behind his credit application is for a new car, with a credit amount of 6560 DM. He has no other installment plans or debtors/guarantors, and he resides in his own home. He has been living at his current residence for 2 years and has one existing credit at the bank. He has no telephone but is a foreign worker.###\nHence this label was No."
"The individual has less than 0 DM in their existing checking account and has paid back existing credits on time. They are looking to buy furniture/equipment with a credit amount of 3021. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a low installment rate, are a divorced/separated male, and have no other debtors/guarantors. They have been living in their current residence for 2 years and own real estate. At 24 years old, they have no other installment plans, rent their housing, have one existing credit at the bank, and work as an unskilled resident. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial profile with existing checking account balance less than 0 DM and long-term employment of over 7 years. They have a good credit history of timely repayments for all credits at this bank. The purpose of the credit is for furniture/equipment, with a moderate credit amount of 2746 DM. They have some savings, own their own home, and have been residing at the current residence for 4 years. The individual is a 31-year-old single male with no other debtors or guarantors. They have a car or other property not included in the attributes and work as a skilled employee/official. The installment rate is 4% of disposable income, and they have one existing credit at the bank. Overall, they seem financially responsible and reliable with a good credit risk.###\nHence this label was No."
"The individual has a stable checking account with 0 to 200 DM balance. They have a history of delayed payments. The purpose of the credit is for business. The credit amount is 4455 DM. They have savings of less than 100 DM and have been employed for 1 to 4 years. The installment rate is 2% of disposable income. The individual is a male who is divorced or separated. They have no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. The individual is 30 years old and has other installment plans through stores. They have 2 existing credits at the bank and have a management/self-employed job. They are liable for providing maintenance for 1 person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a 26-year-old female who is divorced/separated/married. She has no existing checking account but has a savings account with less than 100 DM. She has been employed for less than a year as a skilled employee/official. Currently, she owns her own home and has been living there for 1 year. She has one existing credit at the bank and has paid back her existing credits duly till now. The purpose of her credit is for a radio/television, with a credit amount of 1453. She has no other debtors/guarantors or other installment plans. Her installment rate is 3% of her disposable income. She is a foreign worker with no telephone and is responsible for one person's maintenance.###\nHence this label was Yes."
"This individual has no checking account and is currently unemployed. They have a good credit history with existing credits paid back duly. The purpose of the credit is for retraining. They do not have any savings account and own their own home. The individual is a 36-year-old single male, with 2 people being liable for maintenance. They have one existing credit at the bank and work in a high-level job such as management or self-employment. The installment rate for disposable income is 4%, and they have a building society savings agreement/life insurance as property. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 37-year-old single male with a stable job, having been employed for at least 7 years. He owns real estate and has been living in the same residence for 4 years. He has a moderate credit history with existing credits at the bank and a good credit score. His purpose for the credit is to purchase a radio/television, and he has a modest credit amount of 1154 DM. He has some savings in the bank and few financial obligations, with no other installment plans or debtors. He does not have a telephone but is a foreign worker. Overall, he appears to be a responsible individual with a conservative approach to finances.###\nHence this label was Yes."
"This individual does not have a checking account and has been employed for over 7 years. They are looking to purchase a radio/television with a credit amount of 1655. They have savings of less than 100 DM and reside in their own real estate. At the age of 63, they are single and have 1 dependent. They have 2 existing credits at the bank, no other debtors or guarantors, and no other installment plans. Their job is classified as unskilled-resident. They have had the same residence for 4 years, with a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old single male with a stable job as a skilled employee/official. He has a good credit history, no other debtors or guarantors, and owns his own home. He has a moderate amount of credit in the range of 0 to 200 DM, a substantial amount of savings, and a loan for business purposes. He has been employed at his current job for 1 to 4 years and has one existing credit at the bank. He has a low installment rate in percentage of disposable income, no other installment plans, and no dependents. He has been living at his current residence for 2 years and has a telephone registered under his name. Additionally, he is a foreign worker with a positive credit outlook.###\nHence this label was No."
"The individual is a female, divorced/separated/married, aged 35, who has no existing checking account. She has been employed for 4 to 7 years as a skilled employee/official and has one existing credit at the bank. She owns a property and has a building society savings agreement/life insurance. She has no other debtors/guarantors and no other installment plans. She has been living in her current residence for 2 years and has no telephone. She does not have a foreign worker status. The purpose of the credit is for furniture/equipment, with a credit amount of 1592 and a duration of 12 months. She has savings of at least 1000 DM and an installment rate of 3% of disposable income. She is responsible for providing maintenance for one person.###\nHence this label was Yes."
"The individual has no checking account and no savings account. They have been employed for at least 7 years and have a stable income. They took a loan for a radio/television, amounting to 976 credits, with an installment rate of 4%. The individual is a 35-year-old single male, living in their own house. They have 2 credits at the bank and one person to provide maintenance for. Their job is a skilled employee/official, and they do not have any other installment plans. They do not have any other debtors or guarantors and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a credit history of delaying payments in the past. They are looking to purchase a used car with a credit amount of 8947 over a duration of 36 months. They do not have any savings and have been employed for 4 to 7 years. The installment rate is 3% of disposable income. The individual is a 31-year-old single male with no other debtors or guarantors. They have been living at their current residence for 2 years and own their own home. The individual works in a management or self-employed position and has 2 people they are liable to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced/separated/married, with a stable job as a skilled employee/official. She has a checking account with a balance of less than 0 DM and has been at her current job for 1 to 4 years. She has paid back all existing credits duly, owns a car, and lives in her own home. She has a credit amount of 3959 DM and savings of less than 100 DM. She has no other debtors or guarantors, no other installment plans, and has been residing at her current residence for 2 years. She is 29 years old, with an installment rate of 3% of disposable income. She has one existing credit at the bank and is responsible for one person's maintenance. She has a telephone registered under her name and is a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of less than 0 DM and has had it for over 7 years. They have a good credit history with only one other existing credit. The purpose of the credit is for a new car, with a relatively low credit amount of 860 DM. They have savings of less than 100 DM and own their own house. The individual is a 39-year-old divorced/separated/married female, employed as a skilled employee/official. They have no other debtors or guarantors, no other installment plans, and no other property. They have been living at their current residence for 4 years and have one person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of repaying existing credits on time. They are looking to borrow money for a new car. With a credit amount of 1364, they have savings of less than 100 DM. Currently employed for 1 to 4 years, they have a low installment rate on disposable income. A 64-year-old female who is divorced, separated, or married, they have no other debtors or guarantors. They have been living at their current residence for 4 years and own a car or another property. They do not have any other installment plans and live in their own house. Employed as a skilled worker or official, they are responsible for one person's maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 20-year-old female who is divorced/separated/married. She has been in her current employment for at least 7 years as a skilled employee/official. She owns a car or another type of property not specified. She has no other debtors/guarantors and no other installment plans. She has one existing credit at the bank and no other liabilities. She has been living in her current residence for 4 years, pays her bills on time, and has her telephone registered under her name. She is a foreign worker with good credit standing, with savings less than 100 DM and a checking account balance between 0 and 200 DM. She is taking a loan of 1967 DM for the purpose of radio/television, with a 24-month duration and an installment rate of 4% of her disposable income.###\nHence this label was Yes."
"A 30-year-old single male, with no checking account, has been employed for over 7 years working in management/self-employed/highly qualified employee/officer role. He currently resides in his own house, owning a car, without any other debts or guarantors. His credit history shows responsible behavior in repaying existing credits. He is looking to borrow 2333 DM for a radio/television, having savings between 500-1000 DM and an installment rate of 4% of his disposable income. He has one existing credit at the bank, no other installment plans, and no telephone. He is a foreign worker with no dependents.###\nHence this label was Yes."
"The individual is a skilled female worker, divorced or separated, currently owning a car. She has been employed for over 7 years and has no savings account. She has one existing credit at the bank, with a good credit history of promptly repaying previous credits. She lives in her own home with one dependent, aged 29. The purpose of the credit is for a new car, with a relatively low installment rate and a moderate credit amount. She has no other debtors or guarantors, and her only other installment plan is with the bank. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account less than 0 DM and has a credit history of delay in paying off in the past. They are taking a loan for a business purpose with a credit amount of 6836 DM. Their savings account/bonds are less than 100 DM and they have been employed for at least 7 years. Their installment rate is 3% of disposable income and they are a single male. There are no other debtors/guarantors involved. They have been living at their current residence for 4 years and own their house. At 63 years old, they have no other installment plans and their property status is unknown/no property. They have 2 existing credits at the bank and work as a skilled employee/official. They have 1 person to provide maintenance for and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a single male with a steady job, owning a car or other property. They have a savings account with an amount between 100 and 500 DM. They have paid back existing credits duly and have only one existing credit at the bank. The individual has been living in their current residence for 1 year, is 29 years old, and has no other debtors or guarantors. They do not have any other installment plans or a telephone. The individual does not have anyone else to provide maintenance for and is a foreign worker. The purpose of the credit is for a radio/television, and the credit amount is 2896 DM with a duration of 24 months and an installment rate of 2%.###\nHence this label was Yes."
"The individual in this example has no checking account and unknown/no savings account. They have been repaying their existing credits on time. The purpose of the credit is for a radio/television. They have been employed for less than a year and have a low installment rate. The individual is a divorced/separated/married female, 44 years old, and owns their own home. They have two existing credits at the bank and are a skilled employee/official. They have one person they are liable to provide maintenance for, own a car or other property not specified, and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a female, divorced/separated/married, aged 28, with no checking account and savings of less than 100 DM. They have been employed for 1 to less than 4 years as a skilled employee/official. The purpose of their credit is for furniture/equipment, with a credit amount of 1817 and an installment rate of 4%. They have no other debtors/guarantors, no other installment plans, and own their housing. They have been residing at their current residence for 2 years and have 2 existing credits at this bank. They are responsible for providing maintenance for one person and are a foreign worker with no telephone.###\nHence this label was Yes."
"This individual is a financially responsible female, who has been paying back existing credits on time. She has been employed for 1 to 4 years as a skilled employee/offcial, and owns a car or other property. She has no savings account, no other debtors/guarantors, and no other installment plans. She lives in her own home with one dependent, is 26 years old, and has been at her current residence for 1 year. She does not have a telephone but is a foreign worker. Her credit risk is classified as good based on these attributes.###\nHence this label was Yes."
"This individual has no checking account and has a credit history with critical accounts or other existing credits. They are seeking a loan for a radio/television. The credit amount requested is 1934. They have savings of less than 100 DM and have been employed for at least 7 years. The installment rate is 2% of their disposable income. The individual is a 26-year-old single male. They have no other debtors or guarantors. They have been residing in their own property for 2 years. They have no other installment plans and no telephone. They are a skilled employee or official with 2 existing credits at the bank. They are responsible for providing maintenance for one person and are a foreign worker.###\nHence this label was Yes."
"This individual is a 41-year-old divorced/separated/married female, with a good credit history and a stable job of 4-7 years. She has a moderate credit amount of 5954 DM for a business purpose. She has some savings, owns real estate, and lives in her own home. She has 2 existing credits at the bank and no other debtors or guarantors. She has been residing at her current residence for 1 year and has one person dependent on her for maintenance. She has no telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance below 0 DM and has paid back previous credits on time. They are looking to use a loan of 6758 DM for a radio or television. They have savings below 100 DM and have been employed for 1 to 4 years. Their disposable income installment rate is 3%. The individual is a female who is divorced, separated, or married. They have no other debtors or guarantors and have lived in their current residence for 2 years. They own a car or another property not specified. The individual is 31 years old, has no other installment plans, and owns their own home. They have one existing credit at their bank, hold a skilled job, and have one person they are financially responsible for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"The individual has no checking account and has been repaying existing credits on time. They are looking to finance a used car with a credit amount of 2445. Their savings account status is unknown. They have been employed for less than a year and have a low installment rate. The individual is a married/widowed male, residing in rented housing. They have no other debtors or guarantors, no other installment plans, and one existing credit at the bank. The individual is a skilled employee, 26 years old, with 1 dependent. They have had the same residence for 4 years and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial situation with existing checking account balance less than 0 DM and savings of less than 100 DM. They have a good credit history of paying back previous credits on time. The purpose of the current credit is for furniture/equipment. The individual has been employed for over 7 years in a management/self-employed/highly qualified position. They have no other debts or guarantors and live in rented housing. With a credit amount of 3345, an installment rate of 4%, and a single status, this 39-year-old male is considered a good credit risk.###\nHence this label was No."
"The individual is a 22-year-old single male, employed for less than a year as a skilled employee. He has a good credit history with existing credits paid back duly. He has a small credit amount of 3149 DM for the purpose of furniture/equipment. His savings are less than 100 DM, and he has no other debts or guarantors. He has been residing at his current place for 1 year without paying rent. He has one existing credit at the bank and no other installment plans. He has no telephone but is a foreign worker. Overall, he seems to be a responsible borrower with a stable financial situation.###\nHence this label was Yes."
"This individual is a 38-year-old unemployed divorced/separated/married female. They have existing credits paid back duly, with one credit at the bank and a car as their purpose for a credit amount of 12976 DM. They have no savings but own no property, living in a free housing arrangement for the past 4 years. Their installment rate is 3%, and they have no other debtors or guarantors. They have no other installment plans, are registered with a telephone, and are a foreign worker. Additionally, they are a highly qualified employee or officer with one person dependent on them for maintenance.###\nHence this label was No."
"The individual has a low checking account balance, has had a critical credit history in the past, and wants to finance a new car. They have a moderate credit amount and savings, and have been employed for 1 to 4 years. Their personal status is a single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. At 40 years old, they have no other installment plans, but have 2 existing credits at a bank. Their job is unskilled resident, and they are responsible for providing maintenance for 2 people. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying back existing credits on time. They are taking out a loan for a new car, with a credit amount of 1101. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. Their disposable income installment rate is 3%. The individual is a married/widowed male, with no other debtors or guarantors. They have been residing in their current home for 2 years, which they own as real estate. At 27 years old, they have no other installment plans and no other people relying on them for maintenance. They have a skilled job and a registered telephone under their name. They are also a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a critical credit history with other existing credits. They are taking a 12-month loan for education, with a credit amount of 701. Their savings are less than 100 DM, and they have been employed for 1 to less than 4 years. The installment rate is 4% of disposable income. They are a 32-year-old single male, with no other debtors or guarantors. They have lived in their current residence for 2 years and own a car or other property not specified. They have no other installment plans, own their housing, and have 2 existing credits at the bank. The individual is a skilled employee/official, with one person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has a good credit history with existing credits paid back duly. They are taking a 24-month loan for a new car, amounting to 1381. They have no savings account, have been employed for 1 to 4 years, and have a 4% installment rate. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living in their current residence for 2 years and have a building society savings agreement/life insurance. At the age of 35, they have no other installment plans, own their own home, and have one existing credit at the bank. The individual is a skilled employee/official, with one person being liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of less than 0 DM and has a good credit history. They are taking a loan for furniture/equipment, with a credit amount of 6350. They have no savings account and have been employed for at least 7 years. Their monthly installment rate is 4% of their disposable income. The individual is a single male, aged 31, with no other debtors or guarantors. They have been living in their current residence for 4 years and own their own home. They have one existing credit at the bank and work as a skilled employee/official. The individual is responsible for providing maintenance for one person and does not have a telephone. They are a foreign worker.###\nHence this label was No."
"The individual does not have a checking account and has been present in their current employment for 1 to less than 4 years. They are looking to purchase a new car with a credit amount of 2134, having savings of less than 100 DM. Their credit history shows critical accounts or other existing credits not from this bank. The individual is a 48-year-old single male, living in their own house for the past 4 years. They have no other debtors or guarantors, no other installment plans, and own a car or other property not specified. They are a skilled employee/official with 3 existing credits at the bank and one person dependent on them for maintenance. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with a checking account balance of less than 0 DM and a long-standing employment of at least 7 years. They have a good credit history, no other debtors or guarantors, and own a property. The purpose of the credit is for a new car, and the credit amount is 8978. They have savings of less than 100 DM, a low installment rate, and no other installment plans. The individual is a 45-year-old divorced/separated male in a management position, with one existing credit at the bank. They have been living at their current residence for 4 years, with one person dependent on them for maintenance. They have a telephone registered under their name and are not a foreign worker.###\nHence this label was No."
"This individual has a checking account balance of at least 200 DM and has been employed for 4 to less than 7 years. They are looking to take out a loan for a new car, with a credit amount of 1344. They do not have any savings, but own real estate. The installment rate is 4% of their disposable income. They are a 37-year-old single male with no other debtors or guarantors. They have been living at their current residence for 2 years and have 2 existing credits at this bank. They work in an unskilled resident job and have 2 dependents. They have a telephone and are a foreign worker.###\nHence this label was No."
"This individual is a 61-year-old divorced/separated male who has been employed for over 7 years. They have a good credit history with existing credits paid back duly. The purpose of their credit is for business, and they have a moderate credit amount of 2767 DM. They have some savings and no other debtors or guarantors. They live in a rented house with 2 existing credits at the bank. Their job is unskilled-resident, and they have 1 person dependent on them for maintenance. They have no telephone and are a foreign worker.###\nHence this label was No."
"The individual is a single male, aged 35, with a good credit history of paying back existing credits. He has a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and has been employed for 1 to 4 years in a management or highly qualified position. The purpose of the credit is for a used car, with a credit amount of 6948 and an installment rate of 2%. He has no other debtors or guarantors, no other installment plans, and resides in a rented housing. He has been living at his current residence for 2 years and has one existing credit at the bank. He is the sole provider for maintenance and has a registered telephone under his name. Additionally, he is a foreign worker with a valid permit.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has not taken any credits previously or has repaid all credits on time. They are looking to borrow money for a new car, specifically 1082 DM. They have savings of less than 100 DM and have been employed for 1 to 4 years. The installment rate is 4% of their disposable income. The person is a 48-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 4 years and own a car or another property not specified. They have two existing credits at this bank and work as a skilled employee or official. They are responsible for one person's maintenance and do not have a telephone. Additionally, they have a foreign worker status.###\nHence this label was No."
"This individual is a 33-year-old single male, working as a skilled employee or official. He has a stable job for less than a year and owns a car or other property. He has a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and no other installment plans or debtors/guarantors. He has been living at his current residence for 2 years and has one existing credit at the bank. The purpose of his credit is for a radio/television, with a credit amount of 6403 DM. He has no telephone and is a foreign worker. Overall, he has a good credit history with a slight delay in paying off in the past.###\nHence this label was Yes."
"This individual has no checking account and an unknown savings account. They have been employed for at least 7 years as a skilled employee or official. They are single, male, and 38 years old. They have 2 existing credits at the bank and have been living in their current residence for 3 years. Their credit history shows critical accounts with other creditors. The purpose of their loan is for a used car, with a credit amount of 2751. They have no other debtors or guarantors, no other installment plans, and own their own home. Their installment rate is 4% of disposable income, and they have 2 people they are liable to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old single male with less than 4 years of employment. He has a good credit history and a checking account balance of less than 0 DM. His purpose for taking credit is for a radio/television. He has savings of less than 100 DM and owns real estate. He has no other debtors or installment plans, and he resides in his own home. He has 2 existing credits at the bank and works as an unskilled resident. He has been living at his current residence for 4 years and has 1 other person dependent on him. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has been employed for over 7 years. They have taken a credit of 1288 for the purpose of repairs and have savings between 100 and 500 DM. They have a good credit history with critical accounts at other banks. The person is a 48-year-old single male with a guarantor and owns real estate for housing. They have 2 existing credits at the bank, a stable job as a skilled employee, and 2 dependents. They do not have any other installment plans, own a telephone, and are not a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial background with no delays in paying off credit history. They are looking to finance a new car with a credit amount of 8086 DM. They have moderate savings between 100 and 500 DM and have been employed for over 7 years. Their personal status is male and single. They have no other debtors or guarantors. The individual has been living at their current residence for 4 years and owns a car or another type of property. At 42 years old, they have no other installment plans and reside in their own home. They hold management or self-employed position and have 4 existing credits at the bank. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a 20-year-old married/widowed male, working as a skilled employee/official for 1-4 years. He has a good credit history with a slight delay in payments in the past. He has a moderate amount of credit amounting to 585 DM for the purpose of radio/television. His savings are less than 100 DM, and he resides in a rented house with his co-applicant. He has 2 existing credits at the bank and has been in his current residence for 4 years. He has no other installment plans, no telephone, and he is a foreign worker. He is responsible for providing maintenance for one person.###\nHence this label was Yes."
"The individual is a 24-year-old female, divorced/separated/married, who has been employed for at least 7 years as a skilled employee/official. She has a good credit history with existing credits paid back duly, and currently has a small credit amount of 652 for furniture/equipment. She has no other debtors/guarantors and no other installment plans. Her living situation involves renting a property, where she has been residing for 4 years. She has a savings account with less than 100 DM and no existing telephone connection. Additionally, she is a foreign worker with no other people depending on her financially.###\nHence this label was Yes."
"This individual is a married/widowed male, who has been employed for at least 7 years and resides in their own real estate property. They have a good credit history with existing credits paid back duly. The purpose of their credit is for a radio/television, with a credit amount of 1301 DM to be paid back over 18 months. They have savings of less than 100 DM and no other installment plans or telephone. Additionally, they have a guarantor, one existing credit at the bank, and are an unskilled resident with one dependent. They are a foreign worker in Germany at the age of 32.###\nHence this label was Yes."
"The individual has no checking account and has a history of delayed payments. They are seeking credit for a business purpose, with a credit amount of 8648. Their savings amount is less than 100 DM, and they have been employed for less than a year. They have a low installment rate and are a single male. There are no other debtors or guarantors involved. The individual has been living at their current residence for 2 years and owns a car or other property. They are 27 years old and have installment plans with a bank. They reside in their own home and have 2 existing credits at this bank. The individual is a skilled employee/official with 1 dependent. They have a registered telephone and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and an unknown or no savings account. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a used car. They have been employed for at least 7 years and have a stable income. They are a 46-year-old single male, residing in their own real estate property for the past 4 years. They have no other debtors or guarantors. The individual has no other installment plans, one existing credit at the bank, and a job in management or a highly qualified position. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this example has a status of existing checking account with 0 to less than 200 DM. They have a good credit history with existing credits paid back duly. The purpose of the credit is for repairs, with a credit amount of 1308. They have savings of less than 100 DM and have been employed for at least 7 years. The installment rate is 4% of disposable income. The individual is a single male, with no other debtors or guarantors. They have been residing at their current residence for 4 years and own a car or other property. At 38 years old, they have no other installment plans, own their own home, and have 2 existing credits at the bank. The individual holds an unskilled resident job and is liable to provide maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a single male, aged 61, who has been working in a skilled position for 1 to 4 years. He has no existing debts or other people dependent on him financially. He has been living in his current residence for 4 years, where he resides for free. Despite having no savings, he has a good credit history of paying back loans on time. He is looking to borrow a relatively small amount of money for education purposes and has no other ongoing installment plans. He does not own any property and does not have a telephone. As a foreign worker, he is considered a good credit risk.###\nHence this label was Yes."
"This individual has a checking account balance between 0 and 200 DM, with a credit history of paying back existing credits on time. They are seeking a new car with a credit amount of 5866 DM. Their savings range from 100 to 500 DM, and they have been employed for 1 to 4 years. The individual is a single male, with no other debtors or guarantors. They have lived at their current residence for 2 years, own a car or other property, and are 30 years old. There are no other installment plans, they own their housing, and have 2 existing credits at the bank. The individual is a skilled employee or official, with 1 person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, aged 23, who has been employed for 1-4 years in an unskilled-resident job. She has a good credit history with a critical account/other credits existing elsewhere. She has a small credit amount of 3573 DM, with some savings of less than 100 DM. She owns real estate, has no other debtors/guarantors, and no other installment plans. She has been living at her current residence for 1 year and has 1 existing credit at the bank. She is responsible for providing maintenance for 1 person, does not have a telephone, but is a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a credit history described as critical account/other credits existing. The purpose of the credit is for furniture/equipment, with a credit amount of 4042. They have savings between 500 and 1000 DM, have been employed for 1 to 4 years, and have a 4% installment rate in relation to disposable income. The individual is a single male, has no other debtors/guarantors, and has been residing in their current residence for 4 years. They own real estate, are 36 years old, and have no other installment plans. The individual has two existing credits at this bank, is a skilled employee/official, and has one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history with all credits paid back duly. They are taking a loan for furniture/equipment for a duration of 48 months, amounting to 7119. Their savings are below 100 DM and have been employed for 1 to less than 4 years. They have no other debts or guarantors and have been living in the current residence for 4 years. This male individual is single, 53 years old, with no other installment plans, living in a free housing. They have 2 existing credits at the bank, work as a skilled employee/official, and have 2 people liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual is a 22-year-old married/widowed male, working in a skilled position for less than a year, with a credit amount of 3092 DM. He has no other debtors/guarantors, no other installment plans, and lives in a rented house with one dependent. He has a checking account with a balance between 0 and 200 DM, savings between 100 and 500 DM, and a telephone registered under his name. He has paid back existing credits duly, has one existing credit at the bank, and has been living at his current residence for 2 years. Additionally, he has a 3% installment rate, no additional property, and is a foreign worker.###\nHence this label was No."
"This individual is a 20-year-old divorced/separated/married female with a good credit history. She has been employed for 1 to 4 years, lives in rented accommodation, and has one existing credit at the bank. She has no other debtors or guarantors, no other installment plans, and no savings over 100 DM. She has a telephone registered under her name and is a foreign worker. She is an unskilled resident with a monthly installment rate of 3% of her disposable income. Her credit amount is 2718 DM, and she has been living at her current residence for 4 years. She is solely responsible for providing maintenance for one person. Her purpose for the credit is a new car, and she has a building society savings agreement/life insurance as her property.###\nHence this label was No."
"The individual has no checking account and has been at their current employment for 1 to 4 years. They took a loan for business purposes amounting to 4139. They have savings between 100 and 500 DM and no other ongoing credits at this bank. Their living situation is in their own home, and they have been residing there for 3 years. The individual is a 27-year-old single male, with no other debtors or guarantors. They have no other installment plans and work as an unskilled resident. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are looking to finance a used car with a credit amount of 4657. They have savings of less than 100 DM and have been employed for 1 to 4 years. Their installment rate is 3% of disposable income. The individual is a 30-year-old single male with no other debtors or guarantors. They have been living at their current residence for 2 years and own their own home. They have one existing credit at this bank and work as a skilled employee/official. The individual is responsible for providing maintenance for one person and has a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job, having been employed for 1 to 4 years. He has a good credit history, with existing credits paid back on time. His current residence is owned, and he has a building society savings agreement. With a moderate credit amount of 1922 DM, he has savings of less than 100 DM and a monthly installment rate of 4%. He is 37 years old, unskilled but a resident in his job, with no other installment plans or debtors/guarantors. He has no telephone but is a foreign worker. This individual is responsible for one person's maintenance and has one existing credit at the bank.###\nHence this label was No."
"This individual is a divorced or separated or married female, aged 35, who has been employed for at least 7 years as a skilled employee. She has no other debtors or guarantors, no other installment plans, and owns no property. She has been living in her current residence for 4 years, which is rent-free. She has a savings account with less than 100 DM, and a checking account with less than 0 DM. She has paid back all credits at this bank duly, and her credit amount is 1198. She has one existing credit at this bank and has 1 person to provide maintenance for. She has no telephone but is a foreign worker.###\nHence this label was No."
"The individual has no checking account and has a history of delaying payments in the past. The purpose of the credit is for a business endeavor. The credit amount is 9572 with savings of less than 100 DM. They have been employed for less than a year and have a low installment rate. The individual is a divorced/separated male, living in their own home with one other person dependent on them. They have two existing credits at the bank and work as a skilled employee/official. The individual does not have any other debtors or guarantors, installment plans, or a telephone. They have resided in their current location for 1 year, own a car or other property, and are a foreign worker.###\nHence this label was No."
"This individual is a 27-year-old single male with a stable job as a skilled employee. He has been employed for 4 to 7 years and has been living in his own residence for 3 years. He has a moderate credit amount of 3652 DM and two existing credits at his current bank. His existing checking account balance ranges from 0 to less than 200 DM, and he has savings of less than 100 DM. He has no other debts or guarantors, and no other installment plans. He has no telephone but is a foreign worker. His credit history shows a critical account with other existing credits elsewhere, and he has a building society savings agreement/life insurance as property. He has no dependents and no other significant financial obligations.###\nHence this label was Yes."
"The individual in this example has a checking account balance of at least 200 DM and has had the account for over 7 years. They have no other existing credits at this bank and have a credit history of a critical account or other existing credits (not at this bank). The purpose of the credit is for a used car, with a credit amount of 4796. Their savings account/bonds hold less than 100 DM. They have been residing in their current residence for 4 years, which is for free housing. The individual is a 56-year-old single male, employed as a skilled employee/official, with no other debtors/guarantors. They have no other installment plans, no telephone, and are a foreign worker. They are solely responsible for providing maintenance for themselves.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has had existing credits paid back duly, and is seeking a loan for a radio/television. They are looking to borrow 3357 DM and have savings of at least 1000 DM. They have been employed for less than a year and their disposable income installment rate is 4. This individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 2 years and own a car or other property. At 29 years old, they have a bank installment plan, own their own home, and have one existing credit at the bank. They work as a skilled employee/official and are responsible for one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with existing checking account balance between 0 and 200 DM. They have a good credit history, currently employed for 4 to 7 years in a skilled position, and have no other debtors or guarantors. The purpose of their loan is for a new car, with a credit amount of 2002 DM. They have savings of less than 100 DM, and have been living at their current residence for 4 years. They are a 30-year-old single male, with no other installment plans, renting their housing. They have one existing credit at the bank, and are responsible for providing maintenance for 2 people. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a credit history of a critical account/other credits existing, and is looking to purchase a new car. They are seeking a credit amount of 3966, with savings of less than 100 DM. They have been employed for over 7 years, have a low installment rate, and are female, divorced/separated/married. They have no other debtors or guarantors, have been living at their current residence for 4 years, and own real estate. At 33 years old, they have other installment plans through a bank, rent their housing, and have 3 existing credits at their bank. They are a skilled employee/official, with one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a 25-year-old divorced/separated/married female, working as an unskilled resident for 1 to 4 years. She has no other debtors or guarantors and owns her own home. She has been living at her current residence for 2 years and has one existing credit at the bank. She does not have a telephone but is a foreign worker. She has a good credit history with existing credits paid back duly. She is looking to borrow 2631 DM for the purpose of repairs, with a duration of 15 months. Her existing checking account balance is between 0 and 200 DM, with savings between 100 and 500 DM. Her installment rate is 3% of disposable income and she has no other installment plans. She is the sole provider of maintenance for one person.###\nHence this label was Yes."
"This individual has no existing checking account and has been repaying existing credits on time. They are looking to borrow money for furniture/equipment, with a credit amount of 1123. They have savings between 500 and 1000 DM and have been employed for 1 to 4 years. Their disposable income installment rate is 4% and they are female, divorced/separated/married. They have no other debtors/guarantors and have been living at their current residence for 4 years. They own a car or other property not specified. At 29 years old, they have no other installment plans, rent their housing, and have one existing credit at this bank. They work in an unskilled resident job and have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and a credit history of critical account/other credits existing. They are seeking a loan for furniture/equipment, with a credit amount of 3777. They have savings of >= 1000 DM and have been employed for 1 to < 4 years. Their installment rate is 4% of disposable income. The individual is a 50-year-old single male, with no other debtors or guarantors. They have been residing in their current place for 4 years and own real estate. They have no other installment plans, one existing credit at the bank, and work as a skilled employee/official. They have 1 person they are liable to provide maintenance for. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"The individual is a 36-year-old single male, unemployed but with a management/self-employed/highly qualified employee/officer job. They have a status of existing checking account with less than 0 DM, with 3 existing credits at this bank. Their credit history shows a critical account/other credits existing elsewhere. The purpose of the credit is for furniture/equipment, with a credit amount of 1872. Their savings account/bonds hold less than 100 DM, and they have no other installment plans. They have been residing in their current residence for 4 years, living for free. There are no other debtors/guarantors, and only one person is liable to provide maintenance for. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 28-year-old single male with a stable job as a skilled employee/official. He has been living in his own real estate property for 4 years and has two existing credits at the bank. He has no other debtors/guarantors and is financially responsible, with existing credits paid back duly till now. He holds a moderate amount of money in his savings account (<100 DM) and has a moderate credit amount of 3060. His monthly installment rate is 4% of his disposable income. He has no other installment plans, no telephone, and is a foreign worker. Overall, he appears to be a reliable individual with a good credit history.###\nHence this label was No."
"The individual is a 22-year-old divorced/separated/married female, working as a skilled employee/official with less than 1 year of present employment. She has a good credit history with existing credits paid back duly till now. The purpose of the credit is for furniture/equipment, with a credit amount of 3650 DM. She has savings of less than 100 DM and has been residing at her present residence for 4 years. She has no other debtors/guarantors or other installment plans. The individual lives in a rented housing, has one existing credit at the bank, and is liable to provide maintenance for one person. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 29, with no checking account and less than 100 DM in savings. She has been employed for 1 to 4 years as a skilled employee/official. Living in her own real estate property for 1 year, she has one existing credit at the bank and no other installment plans. She has no other debtors/guarantors, no telephone, and is responsible for one person's maintenance. With a good credit history of promptly repaying existing credits, she took out a small loan of 518 DM for a radio/television, with an installment rate of 3% of her disposable income. Additionally, she is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with balance less than 0 DM and a history of delayed payments. They are looking for a loan to purchase a radio/television, with a credit amount of 1024. Their savings are less than 100 DM and they have been employed for less than a year. They have a low installment rate of 4% and are a married/widowed male. They have no other debtors or guarantors and have been living in their current residence for 4 years. They own real estate and are 48 years old, with installment plans at stores. They have one existing credit at the bank, are a skilled employee/official, and have one person to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual in this data has a moderate amount of money in their existing checking account, has been employed for 4-7 years, and is single. They are looking to purchase domestic appliances and have a good credit history. They have a small savings account, own their own home, and have one other credit at the bank. The individual is a skilled employee, in their mid-twenties, and has no other debtors. They have been living at their current residence for 3 years and have no other installment plans. They have no phone and are a foreign worker.###\nHence this label was Yes."
"This individual is a 28-year-old divorced/separated/married female, working as a skilled employee/official with less than 1 year of present employment. She has no other debtors/guarantors, no other installment plans, and owns her own home. She has 2 existing credits at the bank and has been residing at her current residence for 3 years. She has a good credit history with no previous credits taken or all credits paid back duly. She is looking to finance a new car with a credit amount of 2278 DM and has savings between 100 and 500 DM. Her installment rate in percentage of disposable income is 3, and she is responsible for providing maintenance for 1 person. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM and a credit history of repaying existing credits on time. They are taking out a loan for a radio/television, amounting to 4210 DM. Their savings are less than 100 DM, and they have been employed for 1 to less than 4 years. They have no other debtors or guarantors and have been living in their current residence for 2 years. They own a car or other property not specified. This individual is a 26-year-old single male, with no other installment plans, owning their own home. They have one existing credit at their bank and work as a skilled employee/official. They are financially responsible for one person and do not have a telephone. They are a foreign worker.###\nHence this label was No."
"The individual has a checking account with less than 0 DM and has a history of delayed payments. They are looking to finance a new car with a credit amount of 1344. Their savings account holds less than 100 DM and they have been employed for 1 to 4 years. The installment rate is 4% of their disposable income. The individual, a 43-year-old single male, has no other debtors or guarantors. They have been residing in their current home for 2 years, which is owned and classified as real estate. The individual has 2 existing credits at the bank and works as an unskilled resident. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a stable credit history with existing credits paid back on time. They are seeking a loan for furniture/equipment and have a low credit amount of 1533. Their savings are less than 100 DM and they have been employed for less than a year. They have a co-applicant as a guarantor and have been living in their current residence for 1 year. Their property includes a building society savings agreement/life insurance. They are a married/widowed male, 43 years old, with no other installment plans and own their home. They have one existing credit at the bank, work as an unskilled resident, and have 2 people dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and an unknown savings account. They have been employed for at least 7 years and have a stable residence of 3 years. The credit history is marked as critical, and the purpose of the credit is for a radio/television. This person is a divorced/separated/married female, aged 33, with 2 dependents. They have one existing credit at the bank and work as an unskilled resident. They have no other debtors or guarantors, own their own home, and have a building society savings agreement/life insurance as property. Their installment rate is 4% of disposable income, and they have an installment plan with a bank. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old female who is divorced/separated/married, working as a skilled employee/official. She has been at her current job for less than a year and has been living in her own home for 4 years. She has no other debtors or guarantors and no other installment plans. She has a savings account with less than 100 DM and an existing checking account with a balance of less than 0 DM. She has one existing credit at the bank and has paid back all existing credits duly till now. She is looking for credit for education purposes, with a duration of 6 months and a credit amount of 448. Her installment rate is 4% of her disposable income. She has a building society savings agreement/life insurance as property. She is the only person liable for maintenance and does not have a telephone. She is a foreign worker.###\nHence this label was No."
"This individual has no existing checking account and has been with their current employer for over 7 years. They have a good credit history, with all previous credits at this bank being paid back on time. The purpose of their current credit is for a radio/television. They have savings between 500 and 1000 DM and own a building society savings agreement/life insurance. With a credit amount of 1750 and an installment rate of 2%, they reside in their own home with a duration of 4 years. The individual is a 45-year-old single male, unskilled resident, with two dependents. They have one existing credit at this bank and no other debtors or guarantors. Their other installment plans are with a bank, and they do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been employed for 4 to 7 years. They are seeking a loan for furniture/equipment, with a credit amount of 2028. Their savings are less than 100 DM and they have no other debts or guarantors. They are a single male, age 30, with no other installment plans. They own their own home and have 2 existing credits at this bank. Their job is unskilled-resident and they have one person they are financially responsible for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM, a credit history of paying existing credits back duly, and has been employed for over 7 years. They are seeking a loan for a new car, with a credit amount of 1203 and savings between 100 and 500 DM. The person is a 43-year-old single male, with no other debtors or guarantors. They own their own home and have one existing credit at this bank. The individual is a skilled employee/offical, with one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated male, aged 46, who has been employed for at least 7 years as a skilled employee/official. He has a good credit history with existing credits paid back duly, and currently has 2 existing credits at the bank. The purpose of his credit application is for a new car, with a credit amount of 1223 DM. He has no other debtors or guarantors, no other installment plans, and no telephone. He lives in a rented house with 1 other person for whom he provides maintenance. He has real estate property, savings of less than 100 DM, and has been residing at his current residence for 1 year. Additionally, he is a foreign worker and has no telephone.###\nHence this label was No."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are seeking a loan for a radio/television, with a credit amount of 4594. Their savings are less than 100 DM and they have been employed for less than a year. They have a low installment rate of 3% and are a single male. There are no other debtors or guarantors involved. They have been living at their current residence for 2 years and own a car or other property. At 32 years old, they have no other installment plans and no dependents. They work as a skilled employee or official and have a registered telephone. Additionally, they are a foreign worker with a good job stability.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been responsibly paying back existing credits, are employed for 1 to less than 4 years, and have a moderate installment rate. Their purpose for the credit is for a radio/television. They are a married/widowed male, aged 40, with no other debtors or guarantors. They reside in a rented house, own real estate, and have no other installment plans. They have one existing credit at the bank and one dependent. They work as a skilled employee/official and have a registered telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 Deutsche Mark, a credit history of repaying existing credits on time, and has been employed for 1 to 4 years. They are seeking a loan for furniture or equipment, with a credit amount of 1374 DM. Their savings amount is below 100 DM and they have no other debtors or guarantors. They have been living in real estate for 2 years, are a 36-year-old single male with a job as an unskilled resident. They have one existing credit at the bank, no other installment plans, and own their own home. They have a telephone in their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a critical credit history with other existing credits. They took a loan for a radio/television, amounting to 1291. Their savings are less than 100 DM, and they have been employed for 1 to 4 years. They have a 4% installment rate, are a divorced/separated/married female, and have no other debtors/guarantors. They have resided in their current place for 2 years and have a building society savings agreement/life insurance. At 35 years old, they have no other installment plans, own their house, and have 2 existing credits at the bank. They are a skilled employee/official with 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 56-year-old divorced/separated/married female, who has no checking account and has been at her present employment for less than 1 year. She has one existing credit at the bank and owns her own house. She has no other debtors/guarantors and no other installment plans. The purpose of her credit is for education, with a credit amount of 1538. Her savings are less than 100 DM and she has been living at her current residence for 2 years. She is a skilled employee/official and has 1 person for whom she provides maintenance. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female with a stable job as an unskilled resident. She has been living in her own home for 4 years and has one existing credit at the bank. She has no other installment plans and no telephone. She is a foreign worker with a good credit history of paying back loans on time. She has a small amount of savings, no other debtors/guarantors, and owns a building society savings agreement or life insurance. She is looking to borrow 2101 DM for the purpose of purchasing a radio/television and has a monthly installment rate of 2%. She is the sole provider for one individual and does not have a high disposable income.###\nHence this label was Yes."
"This individual has no checking account and has been employed for over 7 years. They are looking to finance a used car with a credit amount of 5842. They have savings of less than 100 DM and own a building society savings agreement/life insurance. The person is a 35-year-old single male, has no other installment plans, and owns their own home. They have two existing credits at the bank and are a skilled employee/official. They are responsible for providing maintenance for two people and have a registered telephone in their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been with their current employer for at least 7 years. They have paid back all credits at this bank duly and are looking to take out a new car loan. The credit amount requested is 6458. Their savings amount is less than 100 DM and they have no other property. They are a 39-year-old single male with two existing credits at this bank. They have two people they are liable to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a credit history of a critical account/other credits existing. The purpose of the credit is for repairs, with a credit amount of 5507. They have savings of less than 100 DM and have been employed for at least 7 years. The installment rate is 3% of disposable income. The individual is a 44-year-old single male, with no other debtors/guarantors. They have been living at their current residence for 4 years, with unknown/no property. They have no other installment plans and live in housing for free. They have 2 existing credits at this bank and work as a skilled employee/official. They are liable to provide maintenance for 1 person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a young single male with a stable but short-term employment history. He has no other debtors or dependents and owns his own home. He has a small amount in savings and a low credit amount for furniture/equipment. Despite being unskilled, he has a good credit history and has been responsible in repaying existing credits. He does not have any other installment plans or a telephone, and is not a foreign worker. Overall, he appears to be a low risk for credit lending based on the information provided.###\nHence this label was Yes."
"The individual has a checking account with balance less than 0 DM, has a good credit history, and wants a new car. They are borrowing 1893 DM for a duration of 12 months, with savings below 100 DM. Their current employment has been between 1 to 4 years. They have a guarantor for other debts, own a property, and live in their own house. As a divorced/separated/married female, they are 29 years old, with no other installment plans. They are a skilled employee and have one existing credit at the bank. They have been living at their current residence for 4 years, with one person dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account < 0 DM and has been paying existing credits back duly. They are looking to finance furniture/equipment with a credit amount of 3234. Their savings are less than 100 DM and they have been employed for less than a year. With a low installment rate, they are a divorced/separated/married female residing in a rented property. They have no other debtors/guarantors and no other installment plans. With one existing credit at the bank, they work as an unskilled resident and have one person they are liable to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM and has not taken any credits or has paid them all back on time. They are seeking a loan for a radio/television, with a credit amount of 1337. Their savings are less than 100 DM and they have been employed for less than a year. Their installment rate is 4% of their disposable income. The individual is a 34-year-old single male, with no other debtors or guarantors. They have resided at their current residence for 2 years and own a car or other property. They have no other installment plans and their housing status is 'own'. They have 2 existing credits at this bank and work in a management/self-employed/highly qualified employee/officer role. They have 1 person dependent on them for maintenance. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"This individual does not have a checking account and has a credit history of critical account/other credits existing. They are taking a loan of 2058 for the purpose of repairs. Their savings are less than 100 DM and have been employed for 1-4 years. They have a moderate installment rate, are a divorced/separated male, and have no other debtors/guarantors. They have been residing at their current location for 2 years and own real estate. At the age of 33, they have no other installment plans, 2 existing credits at this bank, and work as a skilled employee/official. They are responsible for 1 person's maintenance and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a married/widowed male, aged 28, working as a skilled employee/official for 1-4 years. He has no savings account, owns real estate, and has been living at his current residence for 4 years. With a credit amount of 1887 DM and a duration of 18 months, he is classified as a good credit risk. He has 2 existing credits at the bank, no other debtors/guarantors, and no telephone. Despite having no foreign worker status, he has a stable financial status with an installment rate of 4% and a manageable number of people (1) to provide maintenance for.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a credit history of repaying existing credits on time, and is seeking a business loan. They are looking to borrow 806 DM and have savings of less than 100 DM. Currently employed for 1 to 4 years, they have no other debtors or guarantors. Living in their own home for the past 4 years, they have a building society savings agreement. At 22 years old, they have no other installment plans and work as an unskilled resident. They are divorced/separated/married, with one dependent. They do not have a telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has critical credit history with other existing credits, and is looking to buy a new car with a credit amount of 2241. They have savings of less than 100 DM and have been employed for less than a year. The installment rate is 1% of disposable income, and they are a single male with no other debtors or guarantors. They have been living in their current residence for 3 years and own real estate. At 48 years old, they have no other installment plans, live in a rented house, have 2 existing credits at the bank, and work as an unskilled resident. They are liable for providing maintenance for 2 people, do not have a telephone, and are not a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial background with existing credits paid back on time. They are looking to purchase a radio/television and have a moderate credit amount. They have some savings and have been employed for 1 to 4 years. Their disposable income allows for a fourth of it to be used for installment payments. The individual is a married or widowed male, with no other debtors or guarantors. They have been living in their current residence for 3 years and own real estate. At 26 years old, they have a skilled job and one existing credit. They are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and an unknown or nonexistent savings account. They have been employed for at least 4 years but less than 7 years and have a good credit history with other existing credits. The purpose of the credit is for a radio or television. They have a moderate installment rate and own their own home. With two existing credits at this bank, they are a skilled employee or official with no other installment plans. They are a single male, 36 years old, with no other debtors or guarantors. They have been residing at their current residence for 3 years and have one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account balance between 0 and 200 DM, has a credit history of always paying back credits on time, and is looking to use the credit for a radio/television purchase. They have savings of less than 100 DM, been employed for 1 to 4 years, and have a low installment rate of 2%. The person is a female who is divorced/separated/married, has no other debtors or guarantors, and has been living at their current residence for 2 years. They own real estate, are 22 years old, have no other installment plans, and live in their own home. The individual is a skilled employee/official with one existing credit at the bank and one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has had existing credits paid back on time, and is looking to finance a radio or television. They have a credit amount of 1938, savings of less than 100 DM, and have been employed for less than a year. Their disposable income installment rate is 4%, and they are a divorced/separated male. They have no other debtors/guarantors, have lived in their current residence for 3 years, and own a property through a building society savings agreement/life insurance. At 32 years old, they have no other installment plans, own their housing, have one existing credit at the bank, and work as a skilled employee/official. They have 1 person they are financially responsible for and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a married/widowed male, aged 28, with a stable job and a good credit history. He has a moderate amount of credit in the form of a loan for a radio/television, and savings of less than 100 DM. He owns real estate, has been living at his current residence for 3 years, and has one existing credit at the bank. He has a guarantor for other debts, no telephone, and no other installment plans. He is an unskilled resident with one person dependent on him for maintenance. He is a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a divorced/separated/married female, aged 36, who has been employed for 1 to less than 4 years as a skilled employee/official. She has no checking account but has a credit history of critical account/other credits existing elsewhere. The purpose of her credit is for a new car, with a credit amount of 1028. She has savings of less than 100 DM, owns real estate, and has been living in her current residence for 3 years. She has no other debtors/guarantors, no other installment plans, and no telephone. She has a 4% installment rate in percentage of disposable income and 2 existing credits at this bank. She is the only person liable to provide maintenance for and she is a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account, has a critical credit history with other existing credits, is seeking retraining, and requires a relatively small credit amount. They have an unknown or no savings account, have been employed for 4 to 7 years, and have a low installment rate in relation to their disposable income. The person is a divorced, separated, or married female, with no other debtors or guarantors. They have been living at their current residence for 3 years, have property in building society savings or life insurance, and are 39 years old. They have no other installment plans, own their own home, and have 2 existing credits at the bank. The individual has an unskilled-resident job, one person to provide maintenance for, no telephone, and is a foreign worker.###\nHence this label was Yes."
"The individual in this example has a moderate amount of money in their existing checking account and a moderate credit amount for the purpose of furniture/equipment. They have a savings account with a decent balance and have been employed for 1-4 years. Their installment rate is low, and they are female, divorced/separated/married. They have a co-applicant for other debts/guarantees and have been living at their current residence for 4 years. They own a car or another type of property, not specified in the data. At 21 years old, they have no other installment plans, rent their housing, and have one existing credit at their bank. They are a skilled employee/official and have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual has a stable income with a checking account balance between 0 and 200 DM. They have a history of delayed payments but are looking to take out a new car loan for 36 months. The credit amount requested is 2225 DM and they have savings of less than 100 DM. The individual has been employed for over 7 years and their disposable income allows them to make 4% installment payments. They are a 57-year-old single male with no other debtors or guarantors. They have lived in their current residence for 4 years and own no property. Their housing is free and they have one existing credit at the bank. The individual works as a skilled employee, has one dependent, a registered telephone, and is a foreign worker.###\nHence this label was No."
"This individual is a 22-year-old female, divorced/separated/married, working as a skilled employee/official. She has been living in a rented house for 4 years and has been employed for less than a year. She has a good credit history with existing credits paid back duly. She has a small credit amount of 1366 DM and savings of less than 100 DM. She has no other installment plans or debtors/guarantors. She has one existing credit at the bank and no telephone. She is a foreign worker and is responsible for providing maintenance for one person.###\nHence this label was No."
"This individual has no checking account and has been paying back existing credits on time. They took a loan of 2301 DM for furniture/equipment, with savings between 100 and 500 DM. They have been employed for less than a year and have a low installment rate. The person is a 22-year-old divorced/separated/married female, with no other debtors/guarantors, living in rented accommodation. They have one existing credit, a building society savings agreement/life insurance property, and no other installment plans. They have been living at their current residence for 4 years and work as a skilled employee/official. They have one person to provide for and are a foreign worker with no telephone.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account, has been at their current employment for 1 to 4 years, and pays their existing credits promptly. They are applying for a new car loan, with a credit amount of 1168 DM. They have savings of less than 100 DM and own real estate. The individual is a married or widowed male, 27 years old, with no other debtors or guarantors. They have been living at their current residence for 3 years and have one existing credit at the bank. They have no other installment plans, own their own home, and work as an unskilled resident. They are responsible for providing maintenance for one person and are a foreign worker with no telephone.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM, with a credit history of critical account/other credits existing. The purpose of the credit is for furniture/equipment, with a credit amount of 1478 DM. They have savings of less than 100 DM and have been employed for at least 7 years. The installment rate is 4% of disposable income. The individual is a 44-year-old single male, with no other debtors or guarantors. They have been residing in their own home for 4 years and have 2 existing credits at this bank. The individual is a skilled employee/official, with 2 people liable for maintenance. They own a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a 23-year-old married/widowed male, who has been employed for 1 to 4 years as a skilled employee/official. He has a good credit history, with existing credits paid back duly. His current checking account balance is equal to or more than 200 DM, while his savings are less than 100 DM. He lives in a rented house with a 4-year residence history. The purpose of his credit is for a radio/television, and the amount is 1297. He has no other debtors or guarantors, and no other installment plans. He has one existing credit at the bank and is responsible for providing maintenance for one person. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been paying existing credits back duly. They are looking to purchase a radio/television and need a credit amount of 3621. Their savings range from 100 to 500 DM and they have been employed for at least 7 years. The installment rate for their disposable income is 2%. The individual is a single, male skilled employee with no other debtors/guarantors. They have been living in their current residence for 4 years and own a car or other property. At the age of 31, they have no other installment plans, own their housing, and have two existing credits at the bank. They are the sole provider for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a 66-year-old unemployed male, single and has been residing for 4 years in a house for free. He has more than 200 DM in his existing checking account and has a credit history of critical accounts with other credits existing elsewhere. He is looking to take a new car loan worth 1480 DM. His savings account holds between 500 to less than 1000 DM. He has no other debtors or guarantors and possesses unknown/no property. He has 3 existing credits at this bank and is unemployed with unskilled job as a non-resident. He has one person to provide maintenance for and does not have a telephone. He is a foreign worker.###\nHence this label was Yes."
"The individual in this data is a 26-year-old divorced/separated/married female with no checking account. She has been employed for 4 to 7 years, holds a management position, and is a foreign worker. She has one existing credit at the bank and lives in a rented property with a residence history of 4 years. She is financially stable with savings of less than 100 DM and a credit amount of 4530. She has no other debtors/guarantors, no other installment plans, and no one else to provide maintenance for. She has a telephone registered under her name and is classified as a good credit risk.###\nHence this label was Yes."
"This individual has no checking account and has been making timely payments on existing credits. They took a loan for a radio/television for 15 months, amounting to 3568 credits. Their savings are below 100 DM and they have been employed for at least 7 years. With a disposable income installment rate of 4%, they are a divorced/separated/married female in their 50s. They have no other debtors or guarantors, residing in a rented accommodation for 2 years. They have a car or other property not listed, with a single existing credit at the bank. Employed in a high-ranking position, they have one dependent and a registered telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old female who is divorced/separated/married. She has a good credit history with existing credits paid back duly. She has a status of existing checking account with 0 <= ... < 200 DM balance. The purpose of the credit is for a radio/television. She has savings of ... < 100 DM and has been employed for less than a year. The credit amount is 1670 with an installment rate in percentage of disposable income at 4. She does not have any other debtors/guarantors or other installment plans. She resides in her own home, has one existing credit at the bank, and is a skilled employee/official. She has been residing at her current residence for 2 years and is responsible for providing maintenance for one person. She has a telephone registered under her name and is a foreign worker.###\nHence this label was No."
"This individual is a divorced or separated or married female in her late 20s, with no existing checking account and an unknown savings account. She has been employed for 1 to 4 years as a skilled employee or official, with two existing credits at her bank. She lives in her own home with 4 years of residence, and has a life insurance or building society savings agreement as property. She is looking to finance a new car with a credit amount of 5003 over a 21-month duration. She has no other debtors or guarantors, but has a bank installment plan and a registered telephone. Additionally, she is a foreign worker and has one person to provide maintenance for.###\nHence this label was No."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are borrowing money for education, with a credit amount of 1393. Their savings are less than 100 DM, and they have been employed for at least 7 years. With a low installment rate of 4%, they are a single male aged 47. There are no other debtors or guarantors involved. They have been living in their current residence for 4 years and have a building society savings agreement/life insurance. The individual has 3 existing credits at the bank, a skilled job, and 2 people to provide maintenance for. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable credit history with existing credits paid back on time. They have a moderate amount of credit in the range of 0 to 200 DM and a small savings account. Their employment history is between 1 to 4 years, and they have a low installment rate relative to their disposable income. The purpose of their credit is for a radio/television. They are a single male with a guarantor for other debts. They own real estate for housing, are a skilled employee, and have been at their current residence for 2 years. This individual is 34 years old and has no other installment plans. They have one existing credit at their bank and are the sole provider for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with at least 200 DM, has been employed for less than 1 year, and has paid existing credits on time. They are looking to purchase a new car with a credit amount of 3949. They have savings of less than 100 DM and no other installment plans. The individual is a 37-year-old single male, with a guarantor and owns their own house. They have one existing credit at the bank, are unskilled but a resident, and have two people dependent on them. They have been living in their current residence for 1 year and do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a single male in his late twenties with a stable job and a good credit history. He has a moderate amount of money in his existing checking account and a small amount saved. He has been living in his current residence for three years and owns his own home. He has two existing credits at the bank and no other debts. His purpose for the loan is classified as \"others\" and he plans to use the money for a bank installment plan. Additionally, he has a co-applicant for his debts, one dependent, and a registered telephone number under his name. He is a foreign worker and is eligible for the loan.###\nHence this label was No."
"The individual in this data is a 20-year-old female who is divorced/separated/married and works as a skilled employee/official. She has been living in her own home for 1 year, with no other debts or guarantors. She has one existing credit at the bank and no other installment plans. She does not have a telephone but is a foreign worker. Her existing checking account balance is between 0 and 200 DM, with a credit history of paying back credits duly. She is looking to borrow 1577 DM for furniture/equipment, and has a savings account with at least 1000 DM. Her installment rate is 4% of disposable income, and she has no other people dependent on her for maintenance.###\nHence this label was Yes."
"This individual has a good credit history with existing credits paid back duly. They have a checking account with less than 0 DM and savings of less than 100 DM. The purpose of the credit is for a used car. They have been employed for 1 to less than 4 years as a skilled employee/official. The credit amount is 2924 with an installment rate of 3%. The person is a single male, aged 63, with a guarantor. They have been residing in their current residence for 4 years and own their own house. They have no known property and have one existing credit at this bank. They have 2 dependents and a telephone registered under their name. Additionally, they have another installment plan with a bank and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM balance, has been employed for 4 to 7 years, and has no other debtors or guarantors. They have been living in their current residence for 4 years and own a car. The purpose of the credit is for a used car, with a credit amount of 9629 DM. They are a single male, 24 years old, with no other installment plans and no other credits at this bank. They work as a skilled employee/official, have one person liable for maintenance, own a telephone registered under their name, and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a credit history of a critical account or other existing credits. They are seeking a loan for furniture or equipment, with a credit amount of 3343. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. The installment rate for them is 4% of their disposable income. They are a single male, aged 28, with no other debtors or guarantors. They have been living in their current residence for 2 years and have unknown or no property. They have no other installment plans and live in housing for free. This individual is a skilled employee/official with one existing credit at the bank. They are responsible for one person's maintenance and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account, has a good credit history, and has been in their current job for 1 to 4 years. They are borrowing money for a business purpose and have some savings. Their personal status is a married or widowed male. They have no other debtors or guarantors, own their own home, and have one existing credit at the bank. They work as a skilled employee or official and have one dependent. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a critical credit history with other existing credits. They are seeking a new car with a credit amount of 10127. They have savings between 500 and 1000 DM and have been employed for 1 to 4 years. The installment rate is 2% of their disposable income. The individual is a 44-year-old single male with no other debtors or guarantors. They have been residing at their current residence for 2 years and own unknown/no property. They have one existing credit at this bank and work as a skilled employee/official. They are responsible for one person's maintenance and have no telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a 42-year-old single male, working as a skilled employee/offical for over 7 years. He has a good credit history with a slight delay in payments in the past. The purpose of the credit is for business, with a credit amount of 2427 DM. He has no savings account but owns a building society savings agreement/life insurance. He has two existing credits at the bank, no other debtors/guarantors, and no other installment plans. He has been living in his own house for 2 years and has one person dependent on him for maintenance. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for at least 7 years. They are looking to finance a new car with a credit amount of 1287. They have savings of at least 1000 DM and reside in real estate that they own. The person is a 37-year-old, divorced/separated/married female, with 1 dependent. They have 2 existing credits at the bank, a stable job as a skilled employee/official, and a good credit history. Additionally, they have a phone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job and has been working at the same place for 4 to 7 years. He has a good credit history with all previous credits at the bank paid back on time. He is looking to borrow money for a new car, with a credit amount of 1437 DM. He has some savings between 100 and 500 DM and no other significant assets. He has been living in his own house for 3 years and has no other installment plans. He is financially responsible with only one existing credit at the bank and no other debts or guarantors. He is 29 years old and has no dependents.###\nHence this label was No."
"This individual is a single male in his thirties with a short employment history and a modest income. He has a small amount of savings and owns a radio or television. He has a moderate credit amount and a good credit history, but has had delays in paying off debts in the past. He lives in his own home and has no other significant assets. He has a few existing credits and is responsible for providing maintenance to one person. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual is a 26-year-old divorced/separated/married female, who has been employed for 4 to 7 years. She has a checking account with a balance of less than 0 DM and savings of less than 100 DM. She has paid back all existing credits duly and is looking to borrow 3599 DM for furniture/equipment purposes. She has been living in her current residence for 4 years and has one existing credit at the bank. She has no other debtors or guarantors, no other installment plans, and no telephone. She works as an unskilled resident and is the sole provider for one person. She lives in a rented house, owns a car or another type of property, and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown savings account. They have been employed for at least 7 years and have a stable living situation, renting a home for 2 years. The credit history is marked as critical, and the purpose of the credit is for a radio/television. The individual is a 46-year-old single male with no other debtors or guarantors. They have an installment rate of 4% and no other installment plans. The individual works in an unskilled resident job and is responsible for one other person. They have two existing credits at the bank and own a building society savings agreement/life insurance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 29-year-old single male with a short employment history, no savings, and a small amount of credit. He has a good credit history with a slight delay in payment, and a low disposable income installment rate. He resides in his own property, has one existing credit, and is responsible for providing maintenance for one person. He has a banking installment plan, no other debtors, and no telephone. Despite being an unskilled resident, he is a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee/offical, having been employed for 4-7 years. They have a moderate credit history with a critical account/other credits existing elsewhere. The person owns a car or other property, lives in their own home, and has been at their current residence for 2 years. They have a savings account/bonds with a balance of at least 1000 DM and a moderate amount of credit in the range of 0 to 200 DM. The individual has two existing credits at the bank, is responsible for one dependent, and has a telephone registered under their name. They do not have any other debtors/guarantors or other installment plans. At the age of 32, they have a duration of 21 months for their credit and an installment rate of 3% of their disposable income. Additionally, they are a foreign worker with good credit standing.###\nHence this label was Yes."
"This individual is a married/widowed male, aged 40, with a stable job in the same employment for at least 7 years. They own real estate and have been living at their current residence for 3 years. They have a good credit history, with existing credits paid back duly. Their existing checking account balance is between 0 and 200 DM, and they have savings of less than 100 DM. The purpose of their credit is for a radio/television. They have a moderate credit amount of 1155 and an installment rate of 3% of disposable income. They have a guarantor for other debts and no other debtors or guarantors. They have one existing credit at the bank, with two in total. They have no telephone but are a foreign worker. Their job is classified as unskilled - resident, and they are liable to provide maintenance for one person.###\nHence this label was Yes."
"This individual has no existing checking account balance, a good credit history, and is seeking a loan for furniture or equipment. They have savings less than 100 DM, are currently unemployed, and have a low installment rate. They are a divorced, separated, or married female, with no other debtors or guarantors. They have been residing at their current residence for 2 years and own a car or another property. At 33 years old, they have no other installment plans, 1 existing credit at the bank, and work as a skilled employee or official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual has no checking account and an existing credit history of paying back credits on time. They are looking to finance a new car with a credit amount of 3556 over a 15-month period. Their savings account status is unknown. They have been employed for 1 to less than 4 years and have a moderate installment rate. The individual is a single male, without any other debtors or guarantors. They have been residing at their current residence for 2 years and have no specified property. At the age of 29, they have no other installment plans and own their housing. They have one existing credit at the bank and work as a skilled employee. The individual is responsible for one person's maintenance and does not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a good credit history with existing credits at another bank. They are seeking a loan for a radio/television, with a credit amount of 1582. They have savings of at least 1000 DM, have been employed for over 7 years, and have a low installment rate. The applicant is a 46-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years, own a car or other property, and have no other installment plans. The individual is a skilled employee with 2 existing credits at this bank and 1 dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has had existing credits paid back duly till now. They took a loan for a radio/television, amounting to 707 credits. Their savings are less than 100 DM and they have been employed for 1 to 4 years. With an installment rate of 4%, this single male, aged 30, resides in their own real estate. They have no other debtors or guarantors and have been living at their current residence for 2 years. They work as a skilled employee/official and have one person liable for maintenance. They have no telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 35, with no checking account. They have been employed for 1 to 4 years and have no other debtors or guarantors. They live in their own real estate property and have resided there for 2 years. The purpose of their credit is for a radio/television, with a credit amount of 2684 and savings of less than 100 DM. They have no other installment plans and no telephone. They have 2 existing credits at this bank and work as an unskilled resident. Additionally, they have one person to provide maintenance for and are a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account and has a history of delaying payments in the past. They are seeking credit for a business purpose and require 2375 credits. Their savings account balance is between 500 and 1000 DM. They have been employed for 1 to 4 years and have a 4% installment rate on disposable income. The individual is a 44-year-old, single male with no other debtors or guarantors. They have been residing at their current residence for 2 years and own a car or other property. The individual has no other installment plans, owns their own home, and has 2 existing credits at the bank. They are a skilled employee or official with 2 people liable for maintenance. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old female who is divorced/separated/married. She has no checking account and has been employed for less than a year. She owns real estate and has one existing credit at the bank. Her credit history shows that she has paid back existing credits duly. The purpose of her credit is for repairs, and the amount is 1943. She has savings of less than 100 DM and no other installment plans or debtors/guarantors. She has been living at her current residence for 4 years, with no telephone. She is a skilled employee/official and has one person liable for maintenance. She is a foreign worker and has an installment rate of 4%.###\nHence this label was No."
"This individual is a 24-year-old female, divorced/separated/married, who has been employed for less than a year in a management/self-employed/highly qualified employee/officer job. She has one existing credit at this bank, with a good credit history of paying back credits duly. The purpose of her credit is for a new car, with a credit amount of 7408 DM. She has savings of 100 to 500 DM and owns a building society savings agreement/life insurance. She lives in her own home and has been at her current residence for 2 years. She has no other debtors/guarantors, installment plans, or telephone. She is a foreign worker and is responsible for one person's maintenance.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a credit history of repaying existing credits on time, and is seeking a car loan. They have a credit amount of 8229 and savings of less than 100 DM. They have been employed for 1 to 4 years, with a low installment rate as a percentage of disposable income. The person is a 26-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own a building society savings agreement/life insurance. They have no other installment plans, own their own home, and have one existing credit at the bank. The individual is a skilled employee or official, with 2 people reliant on their maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a young, single male in his thirties who is currently unemployed. He has a moderate credit amount and a savings account with less than 100 DM. He has been residing in his own housing for 2 years and has 2 existing credits at the bank. With a good credit history, he is deemed a good credit risk.###\nHence this label was Yes."
"The individual is a 28-year-old single male, working as a skilled employee/official for 1 to less than 4 years. He has a good credit history with existing credits paid back duly. His current checking account balance is less than 0 DM, with savings of less than 100 DM. He has one existing credit at the bank and is living in his own residence for the past 4 years. The purpose of his recent credit application is for furniture/equipment, amounting to 4169 DM. He has no other debtors or guarantors, no other installment plans, and no telephone. He is a foreign worker and is responsible for one person's maintenance. Additionally, he has a building society savings agreement/life insurance as property.###\nHence this label was Yes."
"This individual is a single male with a steady job, renting a place to live. He has a moderate credit amount of 2384 DM to be repaid over 36 months, with a low installment rate. He has a small savings account and no other significant assets. Despite having a limited credit history, he has paid back existing credits on time. He has no other debts or guarantors, and no other installment plans. He is an unskilled resident with one credit at the bank, and is responsible for providing maintenance for one person. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has been employed for less than a year, and has paid back all credits at this bank duly. Their purpose for taking credit is for a radio/television. They have savings of less than 100 DM and own no property. The individual is a single male, with a co-applicant as another debtor/guarantor. They reside for free and have one existing credit at the bank. Their job is in management/self-employment/highly qualified employee/ officer role. They have a telephone registered under their name and can provide maintenance for one person. Additionally, they have a foreign worker status.###\nHence this label was Yes."
"This individual is a young, divorced or separated or married female, aged 20, who has no checking account and unknown savings. She has been employed for less than a year as a skilled employee/official, living in a rented accommodation for the past 4 years. She has taken out a credit for a car (used) worth 4675, with an installment rate of 1% of disposable income. There are no other debts or guarantors involved. She has no other installment plans and no telephone. As a foreign worker, she is responsible for one person's maintenance.###\nHence this label was Yes."
"This individual has no checking account and has had existing critical accounts or other credits. They took a loan for a radio/television with a credit amount of 618 DM, and have savings of less than 100 DM. They have been employed for over 7 years and have a low installment rate. The person is a 56-year-old single male with no other debtors or guarantors. They have been residing in their own real estate for 4 years. The individual has no other installment plans or telephone, but they are a skilled employee with one existing credit at a bank. They are responsible for providing maintenance for one person and are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old married male, working as a skilled employee/offcial for 1-4 years. He has 1 existing credit at the bank and has been residing in a rental property for 2 years. He has no other installment plans and no other debtors/guarantors. He has a savings account with a balance between 100 and 500 DM and has paid back all credits at the bank duly in the past. He is responsible for providing maintenance for 1 person and is a foreign worker. He does not have a telephone. His current credit amount is 1264 DM, with an installment rate of 2% of his disposable income. He intends to use the credit for purchasing a new car.###\nHence this label was No."
"This individual is a 21-year-old married male with no checking account. He has been employed for 1 to 4 years as a skilled employee/official. His credit history shows existing credits paid back duly. The purpose of the credit is for furniture/equipment, with a duration of 6 months and a credit amount of 1766. He has savings of less than 100 DM and no other debts or guarantors. He lives in a rented housing with 2 years of residence. He has no other installment plans or telephone. He has one existing credit at the bank and is the sole provider for maintenance. Additionally, he holds a building society savings agreement/life insurance and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown/no savings account. They have been employed for at least 7 years as a skilled employee/official. Their existing credit has been paid back duly. The purpose of their credit is for a radio/television. They own a building society savings agreement/life insurance property and reside there for 3 years. They are a 41-year-old single male with no other debtors/guarantors and no other installment plans. They have one existing credit at the bank and one person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a current checking account with less than 0 DM. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a used car. The credit amount is 10297. They have savings of less than 100 DM and have been employed for 4 to 7 years. The installment rate is 4% of their disposable income. The individual is a single male, with no other debtors or guarantors. They have been living at their current residence for 4 years and have unknown or no property. The individual is 39 years old and has other installment plans at stores. They live in a housing for free and have 3 existing credits at the bank. They are a skilled employee or official and have 2 people liable for maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and unknown savings, but has been employed for at least 7 years. They have a history of delays in paying off debts and are looking to purchase a radio or television. The credit amount requested is relatively high at 7238. The individual is a 32-year-old single male with no other debtors or guarantors. They have been residing in their current residence for 3 years and own their own home. With a stable job as a skilled employee, they have two existing credits at the bank and two dependents. They have a bank installment plan, own a car or other property, and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has been paying existing credits on time, and is looking to take a new car loan. They have savings of less than 100 DM, have been employed for less than 1 year, and have a low installment rate. The person is a 27-year-old single male with no other debtors, living in a residence for free. They have one existing credit at the bank and work in a managerial position. The individual has no other installment plans, no property, and is financially responsible for one person. They have a telephone registered in their name, are a foreign worker, and are considered to be a good credit risk.###\nHence this label was No."
"This individual has a stable income with a moderate amount of savings, a good credit history with some delays in the past, and currently holds a management position. They have been living in their current residence for 4 years, are single, male, and 36 years old. The individual has no other debtors or guarantors and no savings account. They have two existing credits at their current bank, a car as their purpose for credit, with a credit amount of 7057 DM to be paid off in 20 months. They live in a rental property and have a telephone registered under their name. Additionally, they have two dependents and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been repaying existing credits on time. They are looking to finance a radio/television purchase with a credit amount of 1262. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a low installment rate, are a single male, and have no other debtors or guarantors. They have been living in their current residence for 2 years, own a car or other property, and are 25 years old. They have no other installment plans, own their own home, and have one existing credit at the bank. They work as a skilled employee/official and are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and has a history of delaying payments. They are taking a 30-month loan for business purposes, with a credit amount of 1908. They have savings of less than 100 DM and have been employed for at least 7 years. Their installment rate is 4% of disposable income. The individual is a 66-year-old single male with no other debtors or guarantors. They have been living in their own real estate property for 4 years. They have no other installment plans, 1 existing credit at the bank, and work in a management/self-employed/highly qualified position. They are responsible for providing maintenance for 1 person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a 25-year-old single male, employed for at least 7 years as a skilled employee. He has no checking account but has existing credits that have been paid back duly. His purpose for the credit is to purchase a radio/television. He does not have a savings account, other debtors/guarantors, or other installment plans. He owns his own home and has been living there for 2 years. He has two existing credits at the bank and is liable to provide maintenance for one person. He has no telephone but is a foreign worker. The credit amount he is applying for is 999 with an installment rate of 4% of his disposable income.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account, with a duration of 15 months and a critical credit history. They are taking a loan for a radio/television, with a credit amount of 2728. Their savings account status is unknown, and they have been employed for 4-7 years. The installment rate is 4% of their disposable income.\nThey are a single male, with a guarantor for other debtors and have been living in their current residence for 2 years. They own real estate and are 35 years old, with installment plans through a bank. They have 3 existing credits at this bank and are a skilled employee/official.\nThey are liable to provide maintenance for one person, have a registered telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has a modest amount of money in their checking account, a short credit history with critical accounts, and is looking to buy a used car with a moderate credit amount. They have some savings and have been employed for less than a year. The installment rate is low, and they are a single male. They do not have any other debtors or guarantors. They have been living at their current residence for 4 years and have a property agreement related to life insurance. At 44 years old, they have no other installment plans, own their own home, and have one existing credit at the bank. They are a skilled employee with one dependent and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is unemployed and does not have a checking account or savings. They have a good credit history with all credits paid back duly. The purpose of the loan is for a used car. They have a high credit amount of 7485 and a low installment rate of 4%. The person is a 53-year-old divorced/separated/married female, residing in their own real estate property for 1 year. They have one existing credit at the bank and work in a high-level job. They are responsible for one person's maintenance and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account with 0 to 200 DM balance, a credit history of repaying existing credits diligently, and a purpose of the loan for business. They have a credit amount of 1941 DM and savings of at least 1000 DM. Currently employed for 1 to 4 years with a 4% installment rate, they are a single male with no other debtors or guarantors. They have lived in their current residence for 2 years, own property, and are 35 years old. With no other installment plans, they have one existing credit at the bank and work as an unskilled resident. Responsible for one dependent, they have a registered telephone line under their name and hold foreign worker status.###\nHence this label was Yes."
"The individual has a checking account balance of at least 200 DM, with a credit history showing critical accounts or other existing credits. The purpose of the credit is for a radio/television. They have a credit amount of 1271 and no savings account. Present employment has been held for 1 to 4 years with an installment rate of 3% of disposable income. The individual is a single male, without any other debtors or guarantors. They have been residing at their current location for 4 years and have unknown property. At 39 years old, they have no other installment plans and live in housing provided for free. They have 2 existing credits at the bank, work as a skilled employee/official, and have 1 person liable for maintenance. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has paid back existing credits on time. They are taking out a new car loan for a duration of 15 months, with a credit amount of 3186. They have savings of at least 1000 DM and have been employed for 4 to 7 years. The installment rate is 2% of their disposable income. They are a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 3 years and own a car or other property. At 20 years old, they have no other installment plans and live in a rented housing. They have one existing credit at the bank, work as a skilled employee/official, and have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 20-year-old female who is divorced/separated/married. She has been in her current job as a skilled employee/official for 1 to 4 years. She has no other debtors or guarantors and currently resides in a rented property. She has one existing credit at the bank and is responsible for one dependent. Her credit history shows that she has paid back existing credits on time. She is a foreign worker with no telephone, with savings of less than 100 DM and a credit amount of 2039.###\nHence this label was No."
"The individual in this example has a checking account balance of 200 DM or more. They have had this account for over 7 years. Their credit history shows a critical account or other existing credits not from this bank. The purpose of their credit is for a radio/television. They are borrowing 3656 DM. They have unknown or no savings. They have been living in their current residence for 4 years. The individual is a 49-year-old single male. They have no other debtors or guarantors. They have a building society savings agreement or life insurance as property. Their job is classified as unskilled and they are a resident. They have two existing credits at this bank and one dependent for maintenance. The individual has no telephone and is a foreign worker.###\nHence this label was Yes."
"This individual has sufficient funds in their existing checking account, a good credit history, and has been employed for over 7 years. They are looking to take out a loan to purchase a new car, with a credit amount of 884 DM. They have savings of less than 100 DM and have been living in their current residence for 4 years. The individual is a 36-year-old single male, with no other debtors or guarantors. They have a stable job as a skilled employee/official and own their own home. The individual has one existing credit at a bank, no other loans, and is responsible for providing maintenance for two people. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a single male in his early thirties, working in a managerial or highly qualified position for over seven years. He has a good credit history, with no existing debts or outstanding payments. He owns real estate, has a stable income, and a moderate credit amount. He has a co-applicant as a guarantor, one existing credit, and no other significant financial obligations. Additionally, he has a telephone registered in his name and is a foreign worker.###\nHence this label was Yes."
"The individual has a moderate amount of money in their existing checking account. They have a history of delayed payments in the past and are taking a loan for repairs. The credit amount is relatively high. They have some savings but not a significant amount. The individual has been employed for 1 to 4 years and has a low installment rate. They are a single male with no other debtors or guarantors. They have been living at their current residence for 4 years and own real estate. The individual is 44 years old, has no other installment plans, and has one existing credit at the bank. They work as an unskilled resident and have 2 people they are responsible for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a married or widowed male, aged 27, working as a skilled employee/official for 1-4 years. He has no existing debts or other debtors/guarantors, owns a car or other property, and has been living in his current residence for 2 years. He has a stable income, with 1 existing credit at the bank and no savings. He is financially responsible, as he has been repaying his existing credits on time. The purpose of his credit application is for education, and he is seeking a credit amount of 3711 DM to support this goal. He has no other installment plans, owns his housing, and does not have a telephone. Additionally, he is a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM, has a good credit history, and has been working in the current job for 4 to 7 years. They are looking to finance a radio/television purchase with a credit amount of 5152. Their savings is less than 100 DM and they have no other debtors or guarantors. The person is a 25-year-old single male, living in their own residence for 2 years. They have one existing credit at the bank and work as a skilled employee/official. They have no telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM balance and has a good credit history of repaying existing credits on time. They are seeking a loan for a radio/television purpose, with a credit amount of 2439. Their savings amount is less than 100 DM and they have been employed for less than a year. The installment rate is 4% of disposable income. The individual is a female, divorced/separated/married, and has no other debtors or guarantors. They have been residing in their current residence for 4 years and own real estate. At the age of 35, they have no other installment plans, one existing credit at the bank, and work as a skilled employee/official. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual does not have a checking account and their credit history is marked as critical. They are seeking a loan for a radio or television. With no savings account, they have been employed for at least 7 years. Their personal status is a single male, and they have no other debtors or guarantors. They have been residing in their current home for 4 years and own real estate. At 65 years old, they have no other installment plans and no telephone. As a skilled employee, they have 4 existing credits at the bank and one person to provide maintenance for. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a 23-year-old single male with a job as a skilled employee, residing in his own real estate property. He has a savings account with less than 100 DM and has been in his current employment for less than a year. He has no other installment plans and no telephone. He has a good credit history with critical accounts existing elsewhere. He has a guarantor and has been living at his current residence for 4 years. He has 2 existing credits at this bank and no other debtors/guarantors. He has a moderate credit amount of 882 and an installment rate of 4%. He is a responsible individual with no dependents and is a foreign worker.###\nHence this label was Yes."
"This individual is a married/widowed male, aged 22, with a stable job as an unskilled resident. He has been living in rented accommodation for 4 years and has no other installment plans or debtors/guarantors. He has one existing credit at the bank and is responsible for providing maintenance for one person. He does not have a telephone but is a foreign worker. His credit history shows that he has paid back existing credits on time. He has a small amount of savings, less than 100 DM, and a moderate credit amount of 276 DM. His monthly installment rate is 4% of his disposable income.###\nHence this label was Yes."
"This individual has no checking account and has a stable credit history with existing credits paid back on time. They took a loan for a radio/television, amounting to 1346. They have savings between 100 and 500 DM. The person has been employed for at least 7 years and has a low installment rate. They are a single male, living in their current residence for 4 years. They have no other debts or guarantors, and no known property. At 42 years old, they have a bank installment plan, live in a free housing situation, and have one existing credit at their bank. They are a skilled employee or official, responsible for providing maintenance for two people. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a history of delayed payments. They are looking to borrow money for repairs. The credit amount requested is 1555. They have savings of at least 1000 DM and have been employed for over 7 years. The installment rate is 4% of their disposable income. They are a single male, aged 55, with no other debtors or guarantors. They have been living in their current residence for 4 years and have no specified property. They have no other installment plans and live in a free housing arrangement. They have 2 existing credits at the bank and work as a skilled employee or official. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a good credit history, has a stable job, and has been living in their own home for 4 years. They have a small existing credit at the bank and no other ongoing installment plans. With no other debtors or guarantors, and only one person to provide maintenance for, this person seems financially independent. They have a modest credit amount and savings, and their only possession is real estate. Despite not having a telephone, they have been consistently employed for over 7 years. At 52 years old, this single male resident is a foreign worker with no immediate plans for marriage or family.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM and has been employed for between 4 and 7 years. They took a 6-month loan for a new car, amounting to 609 DM. Their savings account holds less than 100 DM and they have no other debtors or guarantors. Being a divorced, separated, or married female, they have been living in their current residence for 3 years. They own their own home and have a building society savings agreement or life insurance. A skilled employee, they have 2 existing credits at the bank and are responsible for one dependent. At 37 years old, they have no other installment plans, no telephone, and are not a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 34, with a stable job in management/self-employment/highly qualified employee/officer. They have a good credit history with no other debts or guarantors. They have held their current residence for 3 years and have a history of 7 or more years of continuous employment. They own a car or other property, have savings of less than 100 DM, and a moderate credit amount of 1501. They have two existing credits at the bank, a low installment rate, and no other installment plans. They are financially responsible, with only one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"The individual in this example has a checking account with a balance of at least 200 DM and has been paying back existing credits on time. They are taking a loan for a radio/television, with a credit amount of 1258. They have savings between 500 and 1000 DM and have been employed for 1 to 4 years. Their disposable income installment rate is 3%, and they are a divorced/separated/married female. They have no other debtors or guarantors, have been living at their current residence for 3 years, and own a car or other property. At 57 years old, they have no other installment plans, own their housing, have one existing credit at this bank, and work as an unskilled resident. They are responsible for providing maintenance for one person, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 35-year-old divorced or separated or married female, who has no checking account but a savings account with a balance between 500 and 1000 DM. She has been employed for 1 to 4 years and has no other installment plans. She owns real estate as her housing, has been living in her current residence for 3 years, and has one existing credit at the bank. She is unskilled as a resident and has 2 people who are dependent on her for maintenance. She does not have a telephone but is a foreign worker. Her credit history at the bank shows that she paid back all credits duly. The purpose of her credit application is for retraining, with a credit amount of 3447 DM and an installment rate of 4%.###\nHence this label was Yes."
"The individual does not have a checking account and has been paying existing credits on time. They are taking a loan for a radio/television, with a credit amount of 2284. Their savings are under 100 DM and have been employed for 4 to 7 years. They have no other debtors or guarantors and reside in their own home. The individual is a 28-year-old single male with 1 existing credit at the bank. They work as a skilled employee/officer and are responsible for providing maintenance for one person. The person has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a credit history of repaying existing credits on time, and is looking to finance a used car. They have a credit amount of 2910 DM and savings of less than 100 DM. Currently employed for 4 to 7 years, they have a low installment rate on their disposable income. A 34-year-old single male with no other debtors or guarantors, they have been living at their current residence for 1 year. They have no specified property and live in a free housing arrangement. With one existing credit at the bank, they hold a managerial or self-employed position. Responsible for providing maintenance for one person, they have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM and a credit history of critical accounts with other lenders. They are seeking a loan for furniture/equipment, amounting to 2246 DM. Their savings are below 100 DM and they have been employed for at least 7 years. With a low installment rate, they are a single male, aged 60, with no other debtors or guarantors. They have been living in their own property for 3 years and hold a building society savings agreement/life insurance. Additionally, they have two existing credits at this bank, a skilled job, and are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
