"This individual is a young, single male with a short employment history and no current debts or guarantors. They own their own home and have some savings. They have a good credit history, but have experienced delays in paying off debts in the past. They are responsible for providing maintenance for one person and have a good job. Despite having limited credit history, they are considered a good credit risk.###\nHence this label was No."
"The individual in this dataset is a 60-year-old single male, with no checking account, who has been employed for over 7 years as a skilled employee/official. They have no other debtors or guarantors and live in a free housing arrangement. The purpose of their loan is to buy a new car, and they have no other installment plans. They have a credit history of delays in paying off debts in the past but have a relatively low credit amount of 2032. Their savings amount is less than 100 DM, and they have been residing in their current residence for 4 years. They have 2 existing credits at their bank and 1 person who is liable for maintenance. They also have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history of paying back existing credits on time. They took a loan of 1364 DM for a new car, with savings of less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate in terms of disposable income. The individual is a divorced, separated, or married female, owns a house, and has no other debtors or guarantors. They have been living at their current residence for 4 years and are 64 years old. They have one existing credit at the bank, work as a skilled employee or official, and are responsible for providing maintenance to one person. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 34-year-old divorced/separated/married female with a stable job in management/self-employment/highly qualified employee/officer. She has a good credit history with existing credits paid back duly till now. She has a moderate credit amount of 3017 DM and some savings of less than 100 DM. She has been living in her current residence for 1 year and her housing situation is rent. She has no other debtors/guarantors and no other installment plans. She has one existing credit at a bank and is responsible for providing maintenance for one person. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with a moderate credit history and no savings. They have been employed for over 7 years and have a low installment rate relative to their income. Being a single male, they have no other debtors or guarantors. They own their own home and have a few existing credits. With a steady job as a skilled employee, they are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker. Overall, this individual appears to be a reliable credit risk.###\nHence this label was Yes."
"This individual is a single male, aged 32, with a stable job as a skilled employee/official. He has been living in his own home for 1 year and has been employed at his current job for 4-7 years. He has no other debtors or guarantors and no existing installment plans. He has 2 existing credits at the bank and has 2 people he is liable to provide maintenance for. He does not have a telephone but is a foreign worker. In terms of finances, he has a modest credit amount of 2273 DM, savings of less than 100 DM, and a monthly installment rate of 3%. Overall, his credit history shows that he has been diligent in paying back existing credits. His purpose for taking the loan is education.###\nHence this label was Yes."
"This individual does not have a checking account and has a good credit history with existing credits paid back duly. They are taking a loan for furniture/equipment for a duration of 24 months. Their credit amount is 3972 with savings of less than 100 DM. They have been employed for 4 to 7 years and have a low installment rate. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 4 years and have a property in a building society savings agreement/life insurance. At 25 years old, they have no other installment plans, live in a rented house, and have one existing credit at the bank. Their job is a skilled employee/official, with one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with less than 0 DM in their existing checking account. They have a good credit history of repaying all credits at the bank on time. The purpose of the credit is for education. With a credit amount of 1198 DM and savings of less than 100 DM, they have been employed for over 7 years. Their living situation is in a free housing arrangement with unknown or no property. Aged 35, they have no other debtors or guarantors and no other installment plans. This skilled employee has one existing credit at the bank and is responsible for one person’s maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and a good credit history. They are taking a 12-month loan for business purposes, with a credit amount of 1542 DM. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their disposable income installment rate is 2%, and they are a single male. There are no other debtors/guarantors involved. They have been living in their own residence for 4 years and own a car or other property. The individual is 36 years old, has no other installment plans, and works as a skilled employee/official. They have one existing credit at this bank and are responsible for maintaining one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable income, a history of delayed payments, and a moderate credit amount. They have some savings, have been employed for 1 to 4 years, and are responsible for providing maintenance to one person. They are a divorced, separated, or married female in their mid-thirties, with two existing credits at their bank. They have a car or another property, own their housing, and work as a skilled employee or official. They have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and an existing good credit history. They are borrowing 9055 currency for education purposes. They do not have any savings account and have been employed for 1 to less than 4 years. Their installment rate is 2% of their disposable income. The individual is a single male, has no other debtors/guarantors, and has been living at their current residence for 4 years. Their property status is unknown with no other installment plans. They live in a free housing arrangement and have one existing credit at the bank. The individual is an unskilled resident, with two people liable for maintenance. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a credit history of paying existing credits on time, and is seeking a loan for a radio/television. They have savings of less than 100 DM and have been employed for less than a year. With an installment rate of 4% of disposable income, they are a single male, 34 years old, and have no other debtors or guarantors. They have been living in their current residence for 3 years and own a car or other property. This skilled employee has one existing credit at the bank, no other installment plans, and no telephone. They are a foreign worker with one person liable for maintenance.###\nHence this label was No."
"This individual has no checking account and unknown savings. They have been employed for at least 7 years and have a stable income. The credit history is critical, with existing credits from other sources. The purpose for the credit is for a radio/television. They have no other debtors or guarantors. The individual is a 51-year-old single male, living in their own residence. They have one existing credit and work as a skilled employee/official. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has a good credit history with existing credits paid back duly. They are seeking credit for a business purpose, with a credit amount of 1572. They have savings of at least 1000 DM and have been employed for at least 7 years. The installment rate is 4% of disposable income. The individual is a female who is divorced, separated, or married. They have no other debtors or guarantors. They have been residing at their current residence for 4 years and own real estate. At 36 years old, they have a bank installment plan, own their housing, and have one existing credit at this bank. Their job is unskilled and they are a resident. They have one person liable for maintenance and do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 27-year-old single male skilled employee with 4 to 7 years of present employment. He has a good credit history with existing critical accounts and other credits not at this bank. He has a small existing checking account balance, less than 100 DM in savings, and owns his own home. His credit amount is 3652 DM and he has two existing credits with a manageable installment rate. He has no other debtors or guarantors, no other installment plans, and no telephone. He has been living at his current residence for 3 years, and is the sole provider for one person. Additionally, he has a building society savings agreement/life insurance, and is a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee/official. He has been living in his own home for 3 years and has no other debtors or guarantors. He has two existing credits at the bank and is liable to provide maintenance for one person. He does not have a telephone but is a foreign worker. With a monthly installment rate of 2%, he recently took out a car loan amounting to 7966 DM for a used car.###\nHence this label was Yes."
"This individual is a divorced/separated/married female in their early twenties, working as a skilled employee/officer with 1-4 years of employment. They have a checking account balance of less than 0 DM, have been living in their current residence for 4 years, and own a car or other property. The purpose of their credit is for furniture/equipment, with a credit amount of 4281 DM. They have savings between 500 and 1000 DM, no other debtors/guarantors, and no other installment plans. Their installment rate is 1%, and they have two existing credits at this bank. They are responsible for providing maintenance for one person and are a foreign worker with no telephone.###\nHence this label was No."
"The individual in this example has a modest amount of money in their checking account, a short credit history with timely payments, and a stable job. They are seeking a loan for a business purpose and have a moderate credit amount. Their savings are also at a moderate level. The individual is a married/widowed male with no other debtors or guarantors. They own their own home, have a good credit history, and have a stable job as a skilled employee or official. Overall, they appear to be a responsible borrower with a steady income and a good credit track record.###\nHence this label was Yes."
"This individual is a 22-year-old divorced female with existing credits paid back duly till now. She has a good credit history and a stable job as a skilled employee. She has a checking account with less than 0 DM, savings of less than 100 DM, and no other debtors or guarantors. She has been living in her current residence for 4 years and has one existing credit at the bank. She is seeking a loan of 3650 DM for furniture/equipment, with an installment rate of 1% of her disposable income. She does not have any other installment plans, owns a car or another property not specified, and lives in a rented house. She is the sole provider for one dependent and does not have a telephone. She is also a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and unknown savings. They have been employed for 1 to less than 4 years. Their credit history is classified as critical with other existing credits. The purpose of the credit is for a radio/television. They are a single male, aged 34, with no other debtors/guarantors. They have been residing in their current residence for 2 years and own the property. The individual has two existing credits at the bank and works as an unskilled resident. They are liable for providing maintenance to 2 people and do not have a telephone. Additionally, they are a foreign worker with an installment rate of 1% of disposable income.###\nHence this label was Yes."
"The individual in this example has a status of existing checking account between 0 and 200 DM. They have a credit history with critical accounts or other credits existing elsewhere. The purpose of the credit is for a used car. The credit amount is 4576 DM, and they have savings between 100 and 500 DM. The individual is currently unemployed and has an installment rate of 3% of disposable income. They are a single male, with no other debtors or guarantors. They have been residing at their current residence for 4 months and own a car or other property not specified. The individual is 27 years old with no other installment plans, owns their own home, and has one existing credit at the bank. They are a skilled employee / official and have one person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 28-year-old single male with a stable job and has been living in his own home for 4 years. He has a good credit history with existing credits paid back duly. His existing checking account balance is less than 0 DM, and he has savings of less than 100 DM. The purpose of his credit is for furniture/equipment. He has one existing credit at the bank and no other installment plans. The credit amount is 4169, with an installment rate of 4% of disposable income. He has no other debtors or guarantors, no telephone, but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying existing credits back duly. They are seeking a loan for furniture or equipment, with a credit amount of 1543. They have savings of at least 1000 DM and have been employed for 1 to 4 years. The installment rate of their disposable income is 4% and they are a divorced/separated male. They have no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. At 33 years old, they have no other installment plans and no telephone. They are a skilled employee/official with one existing credit at the bank. They are liable for providing maintenance for one person and are a foreign worker.###\nHence this label was Yes."
"This individual is a 26-year-old divorced/separated/married female, working as an unskilled resident for 4 to 7 years. She has a good credit history with existing credits paid back duly. She has a checking account with less than 0 DM, savings of less than 100 DM, and has been living in her current residence for 4 years. Her credit amount is 3599 for the purpose of furniture/equipment. She has no other debtors/guarantors, no other installment plans, and no telephone. She has one existing credit at the bank and is responsible for one dependent. She resides in a rental property and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has had existing credits paid back on time, and is looking to purchase a radio/television. They are requesting a credit amount of 674 DM and have savings between 100 and 500 DM. With 4 to 7 years of employment history, they have a moderate installment rate and are a married male in their twenties. They have no other debtors or guarantors, own their own home, and have a building society savings agreement or life insurance. This individual has one existing credit at the bank, is a skilled employee, and has one dependent. They do not have any other installment plans, own a telephone, and are a foreign worker.###\nHence this label was No."
"The individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a loan of 2141 DM for the purpose of buying a radio/television. They have savings between 100 and 500 DM and have been employed for 4 to 7 years. The installment rate is 3% of their disposable income. The individual is a 35-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 1 year and own their house. They have no other installment plans and no other property. The individual is a skilled employee/official with one existing credit at this bank. They are liable to provide maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old single male, working as a skilled employee, with less than 1 year in their current employment. They have a good credit history with savings of less than 100 DM and own real estate. Their existing checking account balance is between 0 and 200 DM, and they have two existing credits at the bank. The purpose of the credit is for buying a radio/television, with a credit amount of 882. They have no other installment plans, one guarantor, and no telephone. They have been residing in their current residence for 4 years and have a 4% installment rate. Additionally, they have only one person to provide maintenance for, and they are a foreign worker.###\nHence this label was Yes."
"The individual in this data entry does not have a checking account and is unemployed. They have a critical credit history with other existing credits, and their purpose for the credit is for business. The credit amount requested is 2292, with savings of less than 100 DM. They are a single male, aged 42, with two existing credits at their bank. They live in their own house, have been at their current residence for 2 years, and have a management job. They have one person liable for maintenance, a telephone registered under their name, and are a foreign worker.###\nHence this label was No."
"The individual has a checking account with less than 0 DM, has a credit history of paying back existing credits on time. They want to use the credit for a used car, and the amount is 8229. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. The installment rate is 2% of disposable income. The individual, a 26-year-old single male, has no other debtors or guarantors and has been living at their current residence for 2 years. Their property includes a building society savings agreement/life insurance. They have no other installment plans, own their home, and have one existing credit at this bank. The individual is a skilled employee/official with two people liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history of repaying all credits at the bank on time. They are undergoing retraining for a period of 12 months. The credit amount they are seeking is 3447. They have savings between 500 and 1000 DM and have been employed for 1 to 4 years. The installment rate is 4% of disposable income. The individual is a 35-year-old divorced/separated/married female with no other debtors or guarantors. They have been residing in their own real estate for 3 years. They have no other installment plans and no telephone. The individual works as an unskilled resident, has one existing credit at the bank, and is responsible for two dependents. They are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female, aged 74, with a long-standing employment of at least 7 years in a management or self-employed or highly qualified employee or officer position. She has a good credit history with all credits at a bank being paid back duly. She has a moderate credit amount of 5129 DM for a used car. She has savings of less than 100 DM and currently resides in a property for free. She has no other debtors or guarantors and has only one existing credit at the bank. She has been living at her present residence for 4 years and has two people she is liable to provide maintenance for. She has a telephone registered under her name and is a foreign worker.###\nHence this label was No."
"The individual is a single male, aged 31, with a stable job as a skilled employee for over 7 years. He owns his own home and has been living there for 4 years. He has a good credit history, with existing credits paid back promptly. He has no other installment plans and no savings account. He is financially responsible with only one existing credit at the bank and has no other debtors or guarantors. Despite not having a telephone, he is considered a good candidate for credit as a foreign worker. He is looking to purchase furniture/equipment and requires a credit amount of 6350 over a duration of 30 months, with an installment rate of 4%. He is the sole provider for himself and does not have any dependents.###\nHence this label was No."
"This individual has no checking account and unknown savings. They have been employed for at least 7 years and have paid back all existing credits on time. The purpose of the credit is for a radio/television. They have a stable income with a low installment rate. The individual is a 58-year-old single male, owning their own home, with no other debtors or guarantors. They have one existing credit at the bank and work as a skilled employee/official. They have been living at their current residence for 4 years and have no other installment plans. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been repaying existing credits on time. They are looking to purchase furniture/equipment. With a credit amount of 2210, they have savings of less than 100 DM. They have been employed for 1 to 4 years, have a low installment rate, and are a single male. They have no other debtors or guarantors, reside in a rented property, and have one existing credit at the bank. Their job is classified as unskilled-resident, they have no telephone, and are a foreign worker. At 25 years old, they have been living in their current residence for 2 years, with no other installment plans and one person dependent on them for maintenance.###\nHence this label was No."
"The individual is a 26-year-old divorced/separated/married female, working as a skilled employee/official for over 7 years. She has been living in rented housing for 4 years and has no savings account. She has one existing credit at the bank and no other installment plans. She has no other debtors/guarantors or a telephone. The purpose of the credit amount of 2812 DM is for a used car. Overall, she has a good credit history with existing credits paid back duly till now.###\nHence this label was Yes."
"This individual has no checking account and an unknown or non-existent savings account. They have been employed for at least 7 years and have a stable living situation, owning their own home for the past 4 years. They are a married or widowed male, 54 years old, with no other debtors or guarantors. Their credit history shows a delay in paying off debts in the past, but they are looking to take out a new car loan. They have a moderate credit amount of 717 and a low installment rate in terms of disposable income. The individual has two existing credits at this bank and works as a skilled employee or official. They have no other installment plans, one dependent for maintenance, and a telephone registered under their name. Additionally, they are a foreign worker with a positive credit history.###\nHence this label was Yes."
"The individual is a 52-year-old unemployed male, single, with one existing credit at the bank. He has no savings account and owns his own house. He has a good credit history of paying back credits promptly. The purpose of the credit is for a radio/television, with a credit amount of 6468 DM to be paid back over 12 months with a 2% installment rate. He has no other debtors or guarantors, no other installment plans, and no property. He is a highly qualified employee in a managerial position, with one person dependent on him for maintenance. He has a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"The individual is a 41-year-old single male with a stable job as a skilled employee/official. He has been living in his own home for 1 year and has 2 existing credits at the bank. His existing checking account balance is between 0 and 200 DM, with a credit amount of 3979 DM. He has been diligently repaying his credits. His savings account status is unknown/no savings account, and he has no other debtors/guarantors. He has been employed at his current job for 4-7 years and has no other installment plans. He has a telephone registered under his name and is a foreign worker. Overall, he appears to be a good credit risk.###\nHence this label was Yes."
"The individual in this example has a high amount in their existing checking account (>= 200 DM) and has had credit for a critical account/other credits in existence, not from this bank. They are looking to use the credit for a radio/television. The credit amount they are seeking is 3656. They have unknown/no savings account. The individual has been employed for at least 7 years and has a low installment rate of 4% of disposable income. They are a single 49-year-old male with no other debtors/guarantors. They have been residing at their current residence for 4 years and own their own home. They have a building society savings agreement/life insurance. They have other installment plans with stores. They have 2 existing credits at this bank and work in an unskilled-resident job. They have one dependent and no telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual is a young, single male without a checking account, savings, or a telephone. He has been employed for less than a year in an unskilled resident job. He lives in his own home and has no other debtors or guarantors. Despite having two existing credits at this bank, he is classified as a good credit risk.###\nHence this label was Yes."
"This individual is a 24-year-old divorced/separated/married female who has been employed for 1 to less than 4 years as a skilled employee/official. She has a checking account with a balance of less than 0 DM and savings of less than 100 DM. The individual has 2 existing credits at a bank and resides in a rented property for 4 years. She is seeking a credit amount of 2124 for the purpose of furniture/equipment. The installment rate is 4% of disposable income and she has no other installment plans or debtors/guarantors. She is the sole provider for one individual and does not have a telephone, but is a foreign worker.###\nHence this label was No."
"This individual is a 34-year-old divorced/separated/married female with a stable job and a good credit history. She has a moderate amount of credit, has been living in her current residence for 3 years, and owns a car or other property. She has no other debts or guarantors, and no other installment plans. She has 2 existing credits at the bank, a savings account with less than 100 DM, and a checking account with 0 to 200 DM. Her installment rate is low, and she has a positive credit history. She has a telephone registered under her name, and can provide maintenance for one person. She is a foreign worker.###\nHence this label was No."
"The individual in this data has no checking account and has a stable employment history of over 7 years. They have a good credit history with no previous credits taken or repayments made duly. The purpose of the credit is for a radio/television. The individual has savings of less than 100 DM and owns a car or other property. They are a married or widowed male, 39 years old, with one existing credit at the bank. They have no other debtors or guarantors and no other installment plans. They reside in their own house and have been at their current residence for 4 years. The individual is in an unskilled-resident job and is responsible for maintenance of one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a critical credit history with other existing credits. They are borrowing money to buy a used car, with a credit amount of 7253 DM. Their savings are less than 100 DM, and they have been employed for 4 to less than 7 years. They have a low installment rate, are male and single, with no other debtors or guarantors. They have been residing at their current residence for 2 years, own a car or other property, and are 35 years old. They have no other installment plans, own their own home, and have 2 existing credits at the bank. The individual has a high-level job and is responsible for providing maintenance for one person. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a current checking account balance of less than 0 DM and a credit history of delayed payments in the past. They are taking out a 24-month loan for a new car, with a credit amount of 4870. They have less than 100 DM in a savings account. The individual has been employed for 1 to 4 years and has a low installment rate as a percentage of their disposable income. They are a 53-year-old single male, with no other debtors or guarantors. They have been residing at their current location for 4 years and have unknown or no property. The individual has no other installment plans and lives in housing that is free of charge. They have two existing credits at the bank and work as a skilled employee or official. They are responsible for providing maintenance for two people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a checking account with balance less than 0 DM and has a stable employment history of at least 7 years. They have paid back existing credits on time and are seeking a loan of 7865 DM for furniture/equipment. Their savings amount is less than 100 DM and they have no other ongoing installment plans. The person is a 53-year-old single male in a management position, with no other debtors or guarantors. They live in a free housing arrangement and have been at their current residence for 4 years. The individual is responsible for maintaining one other person and has a registered telephone line under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual in this data has no checking account and unknown/no savings account. They have been paying existing credits diligently, have been employed for 4 to 7 years, and have a low installment rate on disposable income. The purpose of the credit is for furniture/equipment, and the credit amount is 2186. They are a divorced/separated/married female, have no other debtors/guarantors, and have been living in their current residence for 4 years. Their property is real estate, they are 33 years old, and have another installment plan through a bank. They live in a rented house, have one existing credit at the bank, and work as an unskilled resident. They are responsible for one person's maintenance, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a critical credit history with other existing credits. They took out a small loan for a radio/television, have savings less than 100 DM, and have been employed for 4 to 7 years. Their installment rate is low, and they are a single, male resident. They have no other debtors/guarantors, reside in their own real estate, and are 42 years old with no other installment plans. They have 3 existing credits at this bank, an unskilled job, and 2 people they are financially responsible for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 29-year-old unemployed female, divorced/separated/married, with no existing checking account balance, looking to borrow 1193 DM for a new car. She has less than 100 DM in her savings account, no current employment, and no other debts. She has been living in her current residence for 4 years, has no property, and pays rent. She has one co-applicant and one person she provides maintenance for. She has two existing credits at the bank, an installment rate of 1%, and no other installment plans. She is a foreign worker with no telephone.###\nHence this label was No."
"This individual has a checking account balance less than 0 DM and has no history of taking credits or has paid all credits back on time. Their purpose for the credit is furniture/equipment, and they are borrowing an amount of 4583. They have savings of less than 100 DM and have been employed for 1 to 4 years. The individual's installment rate is 2% of their disposable income. They are a divorced/separated male with a guarantor for other debtors/guarantors. They have been living at their current residence for 2 years and own real estate. The individual is 32 years old, has no other installment plans, and owns their housing. They have 2 existing credits at this bank, work as a skilled employee/official, and have 1 person dependent on them. They do not have a telephone and are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a critical credit history with other credits existing elsewhere. The purpose of the credit is for a radio or television. The credit amount is 3074 units. They have no savings account and have been employed for 1 to less than 4 years. With an installment rate of 1%, the individual is a single male with no other debtors or guarantors. They have been residing in their current place for 2 years and own real estate. At 33 years old, they have no other installment plans and their housing situation is owned. They have 2 existing credits at this bank and work as a skilled employee or official. The individual is single and liable for two people. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 35-year-old divorced/separated/married female, working as a skilled employee/official with less than 1 year of employment at their current job. They have a good credit history with existing credits paid back duly. The individual has a checking account with less than 0 DM, savings of less than 100 DM, and owns real estate where they have been residing for 4 years. They have no other debtors/guarantors, installment plans, or dependents. The purpose of their credit is for a radio/television, and they have a credit amount of 2439 with an installment rate of 4% of their disposable income. They have one existing credit at the bank and a telephone registered under their name. Additionally, they are a foreign worker and are financially responsible for one person's maintenance.###\nHence this label was No."
"The individual is a female who is divorced/separated/married, aged 28, with no checking account. They have been employed for 1 to 4 years as a skilled employee/official and have a stable residence that they own. Their credit history shows critical accounts/other credits existing elsewhere. The purpose of the credit is for a radio or television, with a credit amount of 1382 and savings of less than 100 DM. They have no other debtors/guarantors, no other installment plans, and no previous credits at this bank. They have 1 person to provide maintenance for and their telephone is registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a good credit history with critical accounts. They are taking out a loan for a radio/television. The credit amount is 2684, with savings of less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate. The individual is a 35-year-old single male, with no other debtors or guarantors. They have been residing in real estate for 2 years and own their own home. The individual has two existing credits at this bank and works as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history, and is looking to finance a used car. They are borrowing 5493 DM for a duration of 36 months. They have savings of less than 100 DM, have been employed for at least 7 years, and have a low installment rate. The individual is a 42-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and have no property of their own. They have no other installment plans and live in housing for free. They have a skilled job, one existing credit at the bank, and two dependents. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM, with a credit history of repaying existing credits on time. They are seeking credit for a business purpose, totaling 806 DM. Their savings account/bonds hold less than 100 DM, and they have been employed for 1 to 4 years. With an installment rate of 4% of disposable income, they are female, divorced/separated/ married. They have no other debtors or guarantors, have lived in their current residence for 4 years, and have a building society savings agreement/life insurance. At 22 years old, they have no other installment plans, own their housing, and have one existing credit at the bank. They work as an unskilled resident and have one person they provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has been paying existing credits back on time. They took a loan of 2848 for a used car, with savings between 100 and 500 DM. They have been employed for 1 to 4 years and have a low installment rate. The applicant is a 32-year-old single male with a co-applicant. They have been living in their own real estate for 2 years and have no other installment plans. The individual is a skilled employee, has one existing credit at the bank, and has two dependents. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with no existing checking account debt and a moderate credit history. They are looking to purchase a new car, with a relatively low credit amount. They have some savings and have been employed for over 7 years. Their personal status is single, with a guarantor for other debts. They own real estate and have been living at their current residence for 3 years. They are a skilled employee with 2 existing credits at the bank. They have no dependents, no telephone, and are a foreign worker.###\nHence this label was No."
"The individual has no checking account and an unknown savings account. They have been employed for at least 7 years and have a stable financial history with critical accounts. The purpose of the credit is for a used car. The credit amount is 7596 and the installment rate is low. The individual is a single male, 63 years old, and owns a property. They have 2 existing credits at the bank and are a skilled employee. The individual has no other debtors or guarantors, no other installment plans, and resides in their own home for 4 years. They have no telephone, one dependent, and are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM and has been employed for over 7 years. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a radio/television. They have savings between 100 and 500 DM, and own real estate for housing. The individual is a 49-year-old divorced/separated male, with no other debtors or guarantors. They have one existing credit at the bank, a skilled job, and one dependent. They do not have any other installment plans or a telephone. Additionally, they are a foreign worker and have a moderate installment rate of 2% of disposable income.###\nHence this label was Yes."
"This individual has no checking account and has never taken credits before but has always paid back duly. They are looking to finance a new car with a credit amount of 5003. Their savings account status is unknown. They have been employed for 1 to less than 4 years and have a low installment rate. The person is a female who is divorced, separated, or married. They have no other debtors or guarantors. They have been residing in their current place for 4 years and own property through a building society savings agreement or life insurance. At 29 years old, they have taken installment plans from a bank and have their own housing. They have 2 existing credits at this bank and work as a skilled employee or official. They are responsible for providing maintenance for 1 person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual has a checking account balance of at least 200 DM, has been in their current employment for 4 to 7 years, and has paid back existing credits on time. They are applying for credit to purchase a radio/television and require a credit amount of 5152. Their savings are less than 100 DM and they have no other debtors or guarantors. The individual is a 25-year-old single male, residing in their own home for 2 years. They have one existing credit at the bank, a stable job as a skilled employee/official, and are responsible for one person's maintenance. The individual has a bank installment plan, owns a car or other property not specified in the data attributes, and is a foreign worker without a telephone.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history of repaying existing credits on time. They are taking a 36-month loan for a used car, with a credit amount of 8133. Their savings account/bonds have less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate on their disposable income. The person is a divorced, separated, or married female, with no other debtors or guarantors. They have been living in their current residence for 2 years and have a building society savings agreement or life insurance. At 30 years old, they have one existing credit at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history of paying existing credits on time. They are seeking a loan for domestic appliances. They have a savings account with a balance between 500 and 1000 DM and have been employed for 4-7 years. The credit amount requested is 1262. They have no other debtors/guarantors and reside in their own property. The individual is a 36-year-old single male with no other installment plans, and their housing situation is categorized as 'own'. They have two existing credits at the bank and work as a skilled employee/official. The individual has been living at their current residence for 3 years and has one person dependent on them. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
