"This individual is a single, male skilled employee with a stable job, who has been with the current employer for 4 to 7 years. He has a good credit history, with existing credits paid back duly. The purpose of the credit is for a new car, with a credit amount of 6560 DM. He has savings between 100 and 500 DM, and no other installment plans or debtors/guarantors. He owns a house and has been living at the current residence for 2 years. At 24 years old, he has one existing credit at the bank and no telephone. He is a foreign worker and is responsible for providing maintenance for one person.###\nHence this label was No."
"This individual is a divorced or separated or married female, aged 37, who has been employed for 4 to 7 years as a skilled employee/official. She has a checking account with less than 0 DM, a credit history with critical accounts/other credits, and a savings account/bonds with less than 100 DM. The purpose of the credit is for a new car, with a credit amount of 609. She has no other debtors/guarantors, no other installment plans, and owns her own home. She has been residing at her current residence for 3 years, has 2 existing credits at the bank, and is liable for 1 person's maintenance. She has no telephone and is not a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a history of delayed payments in the past. They are seeking credit for a business purpose, with a credit amount of 4272. Their savings fall within the range of 100 to 500 DM and have been employed for 1 to 4 years. With a low installment rate, they are a single male with no other debtors or guarantors. They have been residing in their own home for 2 years and have a building society savings agreement/life insurance. At 26 years old, they have no other installment plans, two existing credits at the bank, and work as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a loan for education, with a credit amount of 1393. Their savings are less than 100 DM, and they have been employed for at least 7 years. They have a low installment rate relative to their disposable income. This person is a 47-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own their own home. Their property includes a building society savings agreement or life insurance. They have 3 existing credits at this bank and work as a skilled employee or official. They are responsible for providing maintenance for 2 people. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old single male, employed for less than a year as a skilled employee. He has a good credit history with existing credits paid back duly. His existing checking account balance is less than 0 DM, with savings less than 100 DM. He is looking to finance furniture/equipment with a credit amount of 3149. He has no other debtors or guarantors and no property. He resides in a free housing arrangement for one year and has one existing credit at this bank. He has a low installment rate of 4% and uses a bank for other installment plans. He has no telephone and is a foreign worker, responsible for one person's maintenance.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history, and has paid existing credits back on time. They are taking a 36-month loan for a new car, with a credit amount of 1842. They have savings of less than 100 DM, have been employed for less than a year, and have a low installment rate of 4%. The person is a female who is divorced, separated, or married, and has no other debtors or guarantors. They have lived at their current residence for 4 years, own a car or other property, and are 34 years old. They have no other installment plans, own their own home, have one existing credit at the bank, and have a skilled job. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a divorced or separated or married female, aged 44, with a stable job of 4 to 7 years. She has existing credits that have been paid back duly, and owns real estate. She has one existing credit at the bank and no other installment plans. She has been living in her current residence for 2 years and does not have a telephone. She does not have any savings over 100 DM, but has some amount between 0 and 200 DM in her checking account. She is a guarantor for other debtors/guarantors. She is an unskilled resident and the sole provider for one person. She does not have any foreign worker status. The purpose of her credit is for a radio/television, and the credit amount is 760 with an installment rate of 4% of disposable income.###\nHence this label was Yes."
"This individual has a stable income with a checking account balance between 0 and 200 DM. They have a history of delayed payments but are looking for a business loan. The credit amount requested is 4712 DM, and they have no savings. They have been employed for 1 to 4 years and can afford a 4% installment rate. The applicant is a 37-year-old single male, with no other debtors or guarantors. They have been residing at their current location for 2 years and have a building society savings agreement. With two existing credits at the bank, they work in a managerial or highly qualified position. They are responsible for one dependent, have a registered telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual is a female who is divorced/separated/married. She has a stable job as an unskilled resident for 4 to 7 years. She owns a real estate property and has been living in the same residence for 3 years. She has a good credit history with no other debts or guarantors. She has a savings account with less than 100 DM and a checking account with less than 0 DM. She has 4 existing credits at the bank and is responsible for providing maintenance for 1 person. At the age of 58, she has a telephone registered under her name and is a foreign worker. She took a loan of 385 DM for the purpose of buying a radio/television set, with an installment rate of 4% of her disposable income.###\nHence this label was Yes."
"The individual has a checking account with at least 200 DM, has had existing credits paid back on time, and has been employed for 1 to less than 4 years. They are seeking a loan for domestic appliances and have savings of less than 100 DM. The credit amount requested is 1225 DM with an installment rate of 2% of disposable income. They are male, single, with no other debtors or guarantors. They have been living at their current residence for 2 years, own a car or other property, are 37 years old, and have no other installment plans. They have one existing credit at the bank and work as a skilled employee/official. They are responsible for one dependent and have a telephone registered in their name. They are also a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with a low existing checking account balance. They have a good credit history with existing credits paid back on time. The purpose of the credit is for acquiring a radio/television. The credit amount is moderate. They have some savings. They have been employed for 1 to 4 years. Their disposable income can support the installment rate. The individual is a divorced/separated/married female. They have no other debtors or guarantors. They have been residing at their current residence for 2 years and own real estate. At 25 years old, they have no other installment plans and no significant financial dependents. They have a stable job as a skilled employee/official. They have a telephone registered in their name and are a foreign worker.###\nHence this label was No."
"This individual is a 25-year-old divorced/separated/married female with a stable job as an unskilled resident. She has been living in her own real estate property for 2 years and has no other installment plans or debtors/guarantors. She has one existing credit at the bank and is responsible for providing maintenance for one person. The individual has no telephone, but is a foreign worker. She has a savings account with a balance between 100 and 500 DM, and a moderate credit amount of 2631 DM for the purpose of repairs. Her existing checking account balance is in the range of 0 to 200 DM. Overall, her credit history shows that she has paid back existing credits duly.###\nHence this label was Yes."
"This individual is a 20-year-old female, divorced or separated or married, who has been employed for 1 to less than 4 years as a skilled employee/official. She has a good credit history with existing credits paid back duly. She has a small credit amount of 1282 < 100 DM and has been living in her current residence for 4 years, renting a place. She has no other debtors or guarantors, no other installment plans, and no telephone. She has one existing credit at the bank and is responsible for providing maintenance for one person. Additionally, she is a foreign worker.###\nHence this label was No."
"This individual is a skilled female employee or official, aged 27, who is divorced/separated/married. They have a good credit history with existing credits paid back duly. They have a stable job with less than 1 year of employment at their current position. Their existing checking account balance is between 0 and 200 DM, with savings between 100 and 500 DM. They are looking to finance furniture/equipment with a credit amount of 951 DM. They have no other debtors or guarantors and reside in a rented property for the past 4 years. They have 4 existing credits at the bank and one person to provide maintenance for. They have a telephone, but no other installment plans. Additionally, they are a foreign worker with no specified gender.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a good credit history, and has existing credits paid back duly. They are looking to finance a new car with a credit amount of 14896. They have savings of less than 100 DM and have been employed for at least 7 years. Their disposable income installment rate is 1%, they are a single male, and have no other debtors or guarantors. They have been living in their current residence for 4 years, own their own home, and have no property. At 68 years old, they have a job in management/self-employment/highly qualified employee/ officer. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a single male with a checking account balance between 0 and 200 DM. He has been employed for less than a year and has paid back existing credits duly. The purpose of the credit is for repairs, with a credit amount of 2384 DM. He has savings of less than 100 DM and no other significant assets. His disposable income installment rate is 4%, and he has no other debtors or guarantors. He lives in a rented house with 1 other person and has been at his current residence for 1 year. He is unskilled and is the sole provider for himself. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual is a 23-year-old female who is divorced/separated/married and has been working in their current job for 1 to 4 years. They have a good credit history with a slight delay in paying off debts in the past. Their existing checking account balance is less than 0 DM, and they do not have any savings. The purpose of the credit is for education, and the credit amount is 8471. They have been living in their current residence for 2 years and have 2 existing credits at the bank. They have no other debtors or guarantors, no other installment plans, and no savings account or bonds. Their housing situation is rent, and they are a skilled employee/official. They have a telephone registered under their name and are a foreign worker. They are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual is a single male, aged 30, working as a skilled employee with a stable job for 1 to 4 years. He has a good credit history, with existing credits paid back duly. The purpose of the credit is for repairs, and the amount is 639 DM. He has a savings account with less than 100 DM, no other installment plans or debtors/guarantors, and owns his own house. He has been living at his current residence for 2 years and has 1 existing credit at the bank. He has no telephone and is a foreign worker.###\nHence this label was No."
"The individual has less than 0 DM in their existing checking account and has a good credit history with existing credits paid back promptly. They are looking to borrow a small amount of 1620 DM for furniture or equipment. Their savings account holds less than 100 DM and they have been employed for 1 to 4 years. They have a low installment rate of 2% of disposable income and are a divorced, separated, or married female. They have a co-applicant for other debtors or guarantors. The individual has been living at their current residence for 3 years and has a building society savings agreement or life insurance. They are 30 years old with no other installment plans and own their own home. They have one existing credit at the bank and work as a skilled employee or official. They are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for less than a year. They have a good credit history with all previous credits at the bank being paid back on time. The purpose of the credit is for a used car. They have no savings account, but own real estate as property. They are a single male, 40 years old, and a skilled employee with a job in a bank. They have a guarantor and have been living in their current residence for 4 years. They have two existing credits at this bank and two people they are liable to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been in their current employment for over 7 years. They have a good credit history, with existing credits being paid back duly. The purpose of their credit is for a radio/television. They have savings between 500 and 1000 DM, own a car or other property, and live in their own home. They are a 39-year-old single male with no other debtors or guarantors. They have no other installment plans, no telephone, and are a skilled employee/official. They have one existing credit at the bank and are liable for providing maintenance for one person. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has a good credit history, and borrowed 1422 DM to buy a new car. They have savings of less than 100 DM, have been employed for less than 1 year, and have a low installment rate of 3%. The person is a 27-year-old single male with no other debtors or guarantors. They have been living at their current residence for 2 years and do not own any property. The individual has no other installment plans, lives in a housing property for free, and works in a high-level job. They are responsible for one person's maintenance, have a telephone registered in their name, and are a foreign worker.###\nHence this label was No."
"The individual has no checking account and has been employed for over 7 years. They are applying for a car loan amounting to 5711 DM with a duration of 36 months. They have savings equal to or greater than 1000 DM and own a property. The applicant is a 38-year-old single male in a management position with no other debtors or guarantors. They have been residing at their current address for 2 years and have a telephone registered under their name. Additionally, they have 2 existing credits at the bank, no other installment plans, and are a foreign worker. The individual has a moderate installment rate and is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 74, who has been employed for at least 7 years in a management/self-employed/highly qualified employee/officer role. They have no existing debtors or guarantors, and reside in a property for free. Their existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. They have one credit at the bank, with a credit history of all credits being paid back duly. The purpose of their credit is for a used car, with a credit amount of 5129 DM. They have been living at their current residence for 4 years and have 2 people for whom they are liable to provide maintenance. They have a telephone registered under their name, are a foreign worker, and have installment plans through a bank.###\nHence this label was No."
"This individual has no checking account and a credit history of a critical account/other credits existing. They are seeking a loan for furniture/equipment, with a credit amount of 2788. Their savings amount is less than 100 DM, and they have been employed for 4 to 7 years. The installment rate is 2% of disposable income. The individual is a divorced/separated/married female with a co-applicant as another debtor/guarantor. They have lived at their current residence for 3 years and own a car or other property. At 24 years old, the individual has other installment plans through a bank, owns their housing, and holds a skilled employee/official job. They are liable for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account. They have a good credit history with existing credits paid back promptly. The purpose of the loan is to buy a new car. They have significant savings of at least 1000 DM. The individual has been employed for 4 to 7 years and has a low installment rate. They are a divorced, separated, or married female. There are no other debtors or guarantors. They have been living at their current residence for 3 years and own a car or other property. The individual is young, only 20 years old, with no other installment plans. They rent their housing and have one existing credit at the bank. They have a skilled job and are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are looking to finance a used car with a credit amount of 3029. Their savings are less than 100 DM and they have been employed for 4 to 7 years. They have a low installment rate and are a single male. There are no other debtors or guarantors involved. They have been living in their current residence for 2 years and own a car or another type of property. At 33 years old, they have no other installment plans and live in their own home. They have one existing credit at the bank and work as a skilled employee or official. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 26-year-old divorced or separated or married female, employed for less than a year as a skilled employee or official. They have a checking account balance between 0 and 200 DM, with savings of less than 100 DM. They have no other debtors or guarantors, own their own home, and have been at their current residence for 2 years. They have one existing credit at the bank and no other installment plans. The credit history shows existing credits paid back duly till now. The purpose of the credit is for furniture or equipment, with a duration of 48 months and a credit amount of 9960. They have a 1% installment rate in percentage of disposable income, and have a telephone registered in their name. Additionally, they are a foreign worker with one person liable for maintenance.###\nHence this label was No."
"The individual has a modest amount of money in their checking account, with a credit history indicating past payment delays. They are seeking credit for a business purpose, with a moderate amount needed. Their savings are also limited. They have been employed for 1 to 4 years and have a low installment rate. The individual is a divorced or separated male with no other debtors or guarantors. They have been residing in their current property for 2 years, which is real estate that they own. At 30 years old, they have a credit at the bank and work in a high-level job. They are responsible for providing maintenance for one person and have a telephone registered in their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been repaying existing credits on time. They are seeking a loan for a radio/television. With a credit amount of 3621 DM and savings between 100 and 500 DM, they have been employed for at least 7 years. They have no other debtors or guarantors, own a car or other property, and live in their own home. Aged 31, they are a single male with a stable job, no other installment plans, and no telephone. They have been residing at their current residence for 4 years and have 2 existing credits at the bank. Additionally, they are a skilled employee/official, with 1 person liable for maintenance and are a foreign worker.###\nHence this label was No."
"This individual is a single male with no existing checking account, seeking a credit for a radio/television purpose. They have been employed for 1 to less than 4 years and have a good credit history of paying back existing credits on time. The credit amount requested is 1505 with savings of less than 100 DM. They have no other debtors or guarantors and reside in a free housing arrangement. At 32 years old, they have no other installment plans and own unknown/no property. The individual has one existing credit at their current bank and works in a managerial or highly qualified position. They are responsible for one person's maintenance and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account, a credit history of critical account/other credits existing, and is seeking a loan for repairs. They require a credit amount of 2058 with savings of less than 100 DM. Currently employed for 1 to less than 4 years, their disposable income installment rate is 4%. A 33-year-old male who is divorced/separated, living in their own real estate property for 2 years. They have no other debtors/guarantors, installment plans, or existing credits at this bank. Employed as a skilled employee/official, with one person liable for maintenance. They have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old divorced/separated/married female, working as a skilled employee/official. She has no checking account but has a savings account with a balance between 100 and 500 DM. She has been employed for less than a year and has been living in her current residence for 4 years. She is renting a house and has no other installment plans. She has one existing credit at the bank and no other debtors/guarantors. She is responsible for providing maintenance for one person. She has no telephone but is a foreign worker. In the past 9 months, she has timely paid back her existing credits. Her credit amount for furniture/equipment is 2301 DM, and her installment rate is 2% of her disposable income.###\nHence this label was Yes."
"This individual is a 23-year-old female who is divorced/separated/married. She has a stable job as a skilled employee/official and has been employed for 4 to 7 years. She has a good credit history with existing credits paid back duly. The purpose of her credit application is for furniture/equipment. She has a low credit amount of 2406 DM and a savings account with less than 100 DM. She lives in a rental property and has been at her current residence for 4 years. She has no other debtors or guarantors and no other installment plans. She has one existing credit at the bank and is the sole provider of maintenance for one person. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has been employed for 1 to less than 4 years, and has a stable residence of 2 years. They have taken a loan for a new car amounting to 2799 DM and have savings of less than 100 DM. Their credit history shows critical accounts or other existing credits. They are a 36-year-old single male, working as a skilled employee or official, with no other debtors or guarantors. They live in a rented house and own real estate property. They have 2 existing credits at the bank, with an installment rate of 2%. Additionally, they have no other installment plans, no telephone, and have 2 people to provide maintenance for. They are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated male, aged 31, with a stable job as an unskilled resident. He has been living in his own home for 2 years and has one existing credit at the bank. He has no other debtors or guarantors and no other installment plans. His current checking account balance is between 0 and 200 DM, with savings of less than 100 DM. He has been employed for 1 to 4 years and has a credit history of paying back existing credits on time. The purpose of his credit is for furniture/equipment, with a credit amount of 1521. He has an installment rate of 4% of his disposable income. He is the sole provider for one person and does not have a telephone. Additionally, he is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for at least 7 years. They are looking to finance a used car for a duration of 21 months. The credit history is considered critical, with existing credits outside of this bank. They have savings of less than 100 DM and own a car or other property not specified. With a credit amount of 3275, they have a low installment rate of 1%. The individual is a 36-year-old single male in a management position, with no other debtors or guarantors. They have lived in their current residence for 4 years and have a telephone registered under their name. Additionally, they are a foreign worker with no other installment plans, one existing credit at this bank, and are responsible for one dependent.###\nHence this label was Yes."
"This individual is a 30-year-old divorced/separated/married female, who does not have a checking account. She has been employed for less than a year as a skilled employee/official. She lives in her own home and has been at her current residence for 1 year. She is looking to finance a new car with a credit amount of 1055. She has a savings account/bonds with less than 100 DM. She has 2 existing credits at the bank and no other installment plans. She has no other debtors/guarantors or telephone. She is a foreign worker and is responsible for providing maintenance for 1 person.###\nHence this label was Yes."
"This individual does not have a checking account and has existing credits paid back duly. They are looking to finance a new car with a credit amount of 1546. Their savings account/bonds hold less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate. The individual is a 31-year-old single male, with no other debtors/guarantors. They have been residing in their own real estate for 2 years. The individual has no other installment plans and works as an unskilled resident. They are liable to provide maintenance for 2 people and do not have a telephone. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"This individual is a 32-year-old divorced or separated or married female, who has been employed for 1 to 4 years in a management or self-employed or highly qualified employee or officer role. She has one existing credit at the bank, with a monthly installment rate of 1% of disposable income. She has no other debtors or guarantors and has lived in her current residence for 2 years. She owns her own house and has a building society savings agreement or life insurance. She has a savings account with less than 100 DM and an installment plan with the bank. She has no foreign worker status and is reachable by telephone. Based on her credit history of paying back all credits duly, she is considered a good credit risk.###\nHence this label was No."
"This individual has no checking account and has been unemployed for the past six months. They have a good credit history with existing credits paid back duly. The purpose of their loan is to buy a new car. They have savings of less than 100 DM and own real estate. They are a divorced or separated or married female, aged 54, with one other person being liable for maintenance. They have one existing credit at the bank and no other installment plans. They live in their own home and have a telephone registered under their name. Additionally, they are a foreign worker but have no other debtors or guarantors.###\nHence this label was Yes."
"The individual has no checking account and has a credit history of delaying payments. They require credit for a business purpose. The credit amount is 2764 with savings of less than 100 DM. They have been employed for 1 to less than 4 years and have a moderate installment rate. The person is a divorced/separated/married female, with no other debtors or guarantors. They have been residing at their current residence for 2 years and own a car or other property. The individual is 26 years old, has no other installment plans, and lives in their own house. They have 2 existing credits at this bank and work as a skilled employee/official. One person is dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee. He has been living in his own residence for a year and has one existing credit at the bank. He has no other debts or guarantors. With a modest credit amount of 2896 DM, he has a good credit history of paying back existing credits on time. Despite having a short employment history of less than a year, he demonstrates financial responsibility with a low installment rate. He has some savings and does not have any other installment plans. At 29 years old, he is a responsible borrower with no telephone and no immediate plans for large purchases. He is a foreign worker and has one person to support.###\nHence this label was Yes."
"This individual is a 24-year-old single male with a stable job as a skilled employee/official. They have been at their current job for 4-7 years and own their own home. They have a checking account with a balance of less than 0 DM and some savings. The individual has no other outstanding debts and has paid back all existing credits on time. They are looking to take out a new car loan for 9271 DM, with an installment rate of 2% of their disposable income. They have one existing credit at this bank and are the sole provider for one person. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and unknown savings. They have been employed for at least 7 years and have one existing credit at the bank. Their credit history is considered critical, they are applying for a business loan. The credit amount requested is 1264 with an installment rate of 4%. They are a single male, 57 years old, with no other debtors or guarantors. They reside in a rental property with 4 years of residence. They have no other installment plans or property. Their job is classified as unskilled-resident, and they are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 61-year-old divorced/separated male with a stable employment history of over 7 years. They have fair credit history, two existing credits that have been paid back duly, and a moderate credit amount for a business purpose. Their savings account/bonds balance is between 100 and 500 DM, with no other debtors or guarantors. They live in a rented property with a two-year residence history and have no telephone. Their job is listed as unskilled-resident, and they have one person to provide maintenance for. They have no other installment plans, own a car or other property not specified, and are a foreign worker.###\nHence this label was No."
"This individual has less than 0 DM in their existing checking account and has a credit history of paying back existing credits on time. They are seeking a loan for a used car, amounting to 3857 DM. Their savings amount to less than 100 DM and have been employed for 1 to 4 years. With an installment rate of 4%, they are a divorced/separated male aged 40. They have no other debtors or guarantors, and have been living at their current residence for 4 years. Their property includes a building society savings agreement or life insurance. They have no other installment plans, own their own home, and have one existing credit at this bank. Their occupation falls under management/self-employed/highly qualified employee/officer category, and they are responsible for one person's maintenance. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 29, who has been employed for 1 to less than 4 years as a skilled employee/official. She has a checking account balance less than 0 DM and savings of less than 100 DM. She has no other installment plans, owns her own house, and has a co-applicant for any debts. She has 2 existing credits at a bank, wants a new car, and has been living at her current residence for 2 years. She has no telephone and is a foreign worker. With a credit amount of 3499, her credit history is critical with other existing credits outside this bank. Her installment rate is 3% of disposable income, and she is responsible for one person's maintenance.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has paid back previous credits on time, and has been employed for 1 to 4 years. They are taking a loan of 2302 for a radio or television. They have savings of less than 100 DM and rent a house. The person is a 31-year-old divorced/separated male with no other debtors or guarantors. They have one existing credit, no other installment plans, and work as a skilled employee/official. The individual has been living at their current residence for 4 years and has no telephone. They are a foreign worker and responsible for providing maintenance for one person.###\nHence this label was No."
"This individual is a skilled female employee, divorced or separated, with a present employment duration of 1 to 4 years. She has no other debtors or guarantors, owns a car or other property, and lives in her own home. She has been residing at the current address for 1 year and has no other installment plans or telephone. She has 2 existing credits at the bank and is responsible for providing maintenance for one person. Her credit history shows no credits taken, with all credits paid back duly. She has savings of less than 100 DM and a credit amount of 4221 DM. With a duration of 30 months, an installment rate of 2%, and aged 28 years, she is a foreign worker and does not have a telephone.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has a good credit history, and is looking to finance a radio/television. They are borrowing 6758 DM for a duration of 48 months with savings of less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate. The individual is a divorced/separated/married female, with no other debtors, owning a car or other property. They are 31 years old, have no other installment plans, and own their own home. They have one existing credit at the bank, a skilled job, and one dependent. They have a telephone registered in their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and an unknown or non-existent savings account. They have been employed at the same place for at least 7 years and have a good credit history with other existing credits. The purpose of their credit is for furniture or equipment. With a credit amount of 1520, they have a low installment rate in percentage of disposable income. They are a 63-year-old single male, skilled employee or official, with no other debtors or guarantors. They have been residing in their own property for 4 years and have one existing credit at this bank. There are no other installment plans, they have no telephone, and are a foreign worker. Additionally, they are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They took a loan for a radio/television worth 1346 DM. Their savings account holds between 100 and 500 DM. They have been employed for at least 7 years and have a low installment rate. The person is a 42-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and have no property. Their other installment plan is with a bank, and they live in a free housing situation. This person is a skilled employee or official, with 2 people to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has been repaying existing credits on time. They are borrowing 2687 DM for a business purpose, with savings of less than 100 DM. They have been employed for 4 to 7 years and have a moderate installment rate. The individual is a 26-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and have a building society savings agreement. There are no other installment plans, they rent their housing, and have one existing credit at the bank. The individual is a skilled employee with one dependent, owns a telephone, and is a registered foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been paying back existing credits on time. They are looking to purchase a radio/television, with a credit amount of 804. Their savings amount is less than 100 DM and they have been employed for at least 7 years. They have no other debtors or guarantors and have been living in their current residence for 4 years. The individual is a 38-year-old single male, with no other installment plans, owning their own house. They have one existing credit at their current bank and work as a skilled employee/official. They have no telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of timely payments. They took a loan for a used car, amounting to 4657 credits, with savings of less than 100 DM. They have been employed for 1 to less than 4 years and have a moderate installment rate. The person is a 30-year-old single male, with no other debtors or guarantors, living in their own residence for the past 2 years. They have one existing credit at the bank and work as a skilled employee. The individual has no other installment plans, owns a car or other property, and has a telephone registered under their name. Additionally, they are a foreign worker and have one person dependent on them for maintenance.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 41, with no existing checking account. She has been employed for at least 7 years in a management/self-employed/highly qualified employee/officer position. She has been living in her current residence for 2 years and rents her home. The purpose of her loan of 3868 DM is for a used car. She has no savings greater than 100 DM, no other debts or guarantors, and no other installment plans. She has 2 existing credits at the bank and 1 person dependent on her for maintenance. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM, with a credit history of existing credits paid back duly. They are seeking a loan of 7721 for the purpose of furniture/equipment. Their savings account status is unknown/no savings account. They have been employed for less than a year and have a low installment rate as a percentage of disposable income. The individual is a 30-year-old divorced/separated/married female, with no other debtors or guarantors. They have been residing at their current residence for 2 years and own their own home. This individual has one existing credit at the bank and is a skilled employee/official. They have no other installment plans, one person liable for maintenance, a registered telephone, and are not a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old married/widowed male, employed as a skilled employee/official for 1 to less than 4 years. They have a good credit history with existing credits paid back duly. The purpose of the 1007 DM credit is for a new car. They have savings of at least 1000 DM, own real estate, and have been residing in their current location for 1 year. They have no other debtors/guarantors, no other installment plans, no telephone, and are a foreign worker. They have one existing credit at this bank and are liable to provide maintenance for one person.###\nHence this label was Yes."
"This individual does not have a checking account and has a good credit history with critical accounts or other existing credits. They are seeking a loan for a radio/television, with a credit amount of 1516. They have substantial savings of at least 1000 DM and have been employed for 1 to less than 4 years. With a low installment rate, they are financially stable. The individual is a divorced, separated, or married female, with no other debtors or guarantors. They have been residing in their current home for 1 year, owning real estate. At the age of 43, they have no other installment plans, own their home, and have two existing credits at this bank. Employed as an unskilled resident, this individual has one person to provide maintenance for, does not have a telephone, but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying back existing credits on time. They are looking to finance a used car with a credit amount of 4686. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a low installment rate, are a single male, and have no other debtors or guarantors. They have been living at their current residence for 2 years and have unknown or no property. At 32 years old, they have no other installment plans and live in a free housing situation. They have one existing credit at the bank and hold a management or highly qualified job. They are responsible for one person's maintenance and have a telephone registered under their name. They are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of delays in paying off debts. They are seeking credit for a business purpose, with a credit amount of 2375. They have savings between 500 and 1000 DM, and have been employed for 1 to 4 years. Their installment rate is 4% of disposable income. They are a 44-year-old single male, with no other debtors or guarantors. They have been residing in their own home for 2 years and have a car or other property. They have no other installment plans, and their housing status is owned. They have 2 existing credits at the bank and work as a skilled employee or official. They have 2 people they are liable to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 29-year-old divorced/separated/married female, with no checking account. She has been employed for less than a year, has one credit at the bank, and owns her own house. She has no other debtors/guarantors, no other installment plans, and no significant property. Her credit history shows that she has always paid back existing credits on time. She is looking to borrow a modest amount for a used car. She has savings of less than 100 DM, a low percentage of disposable income going towards installments, and no one else to provide maintenance for. She holds a managerial position or is self-employed and is a foreign worker with a telephone registered in her name.###\nHence this label was Yes."
"This individual has no checking account and has a history of delays in paying off debts. They are looking to finance furniture/equipment with a credit amount of 4151. Their savings fall between 100 and 500 DM. They have been employed for 1 to 4 years and have a low installment rate. The person is a 35-year-old single male with no other debtors/guarantors. They have been residing in their own property for 3 years and have a building society savings agreement/life insurance. They have two existing credits at the bank and work as a skilled employee/official. The individual is responsible for one person's maintenance, does not have a telephone, and is a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account. They have a credit history of paying back existing credits on time. The purpose of the credit is for a used car. They have savings of less than 100 DM and have been employed for 4 to less than 7 years. Their installment rate is 2% of disposable income. The individual is a 34-year-old single male with no other debtors. They have been residing at their current residence for 1 year and have unknown/no property. They have no other installment plans and live in a free housing. The individual has one existing credit at this bank and works in a management/self-employed/highly qualified role. They are responsible for one person's maintenance and have a registered telephone under their name. They are also a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed at the same place for over 7 years. They have paid back all credits at this bank duly and have a good credit history. The purpose of their credit is for a radio/television. They have savings between 500 and 1000 DM and a credit amount of 1750. They have a moderate installment rate, own a building society savings agreement/life insurance property, and reside in their own home for 4 years. The individual is a 45-year-old single male with no other debtors or guarantors. They have one existing credit at this bank and no telephone. Their job is unskilled-resident and they are liable to provide maintenance for 2 people. Additionally, they have another installment plan with a bank and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 56-year-old single male with no checking account, who has been employed for at least 7 years as a skilled employee/official. He owns real estate and has no other installment plans or telephone. His credit history is considered critical, and he has existing credits at this bank. The purpose of his credit is for a radio/television, and he has savings of less than 100 DM. He has one existing credit at this bank, with an installment rate of 4 and a credit amount of 618. He has no other debtors/guarantors and no one else relying on him for maintenance. Additionally, he is a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 32-year-old single male, who has been employed for 4 to 7 years. He has a good credit history with all credits at the bank paid back duly. The purpose of the credit is for a new car, with a credit amount of 1442 DM. He has less than 100 DM in his savings account and no other installment plans. He lives in a free housing arrangement with a residence duration of 4 years. He has no other debtors or guarantors, and no property to his name. He has two existing credits at the bank and works as an unskilled resident. He is responsible for providing maintenance for 2 people and is a foreign worker with no telephone.###\nHence this label was No."
"This individual has a status of existing checking account of less than 0 DM and a credit history of delayed payments in the past. They are looking for a business loan with a duration of 36 months. The credit amount requested is 2145 DM and their savings are less than 100 DM. They have been employed for 4 to 7 years and have a low installment rate of 2% of disposable income. The person is a 24-year-old single male with no other debtors or guarantors. They have been residing in their own home for 1 year and own a car or other property. This individual has 2 existing credits at the bank, a skilled job, and is responsible for providing maintenance for one person. They have a registered telephone and are a foreign worker.###\nHence this label was No."
"The individual is unemployed and does not have a checking account. They have a history of delayed payments in the past. The purpose of the credit is for a radio/television. The credit amount is 2320, and they have savings of less than 100 DM. They are married/widowed, male, aged 34, and own real estate. They have no other debtors or guarantors. They have been residing at their current residence for 3 years. They have a skilled job and 2 existing credits at the bank. They have no other installment plans, own their housing, and have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a modest amount of money in their checking account, has been paying back existing credits on time, and has a stable job. They are looking to finance a new car and have a moderate credit amount. They have some savings and have been living in their current residence for a couple of years. This person is a single male with no other debtors or guarantors. They have no other installment plans, own their own home, and have a good credit history. This individual is a skilled employee in their early thirties, with no dependents. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account and has been in their current employment for 1 to 4 years. They are looking to finance a new car, with a credit amount of 1163. They have savings between 500 and 1000 DM and own real estate. The individual is a 44-year-old single male, a skilled employee, with no other debtors or guarantors. They have been living at their current residence for 4 years and have one existing credit at the bank. They have no other installment plan, own their own home, and have a telephone registered under their name. Additionally, they are a foreign worker and are liable to provide maintenance for one person.###\nHence this label was Yes."
"This individual, a 62-year-old divorced/separated/married female, has no checking account and has been employed for at least 7 years as a skilled employee/official. They have one existing credit at the bank and have been living in their current residence for 4 years. The purpose of their credit is for a new car, with a credit amount of 3757 DM. They have savings of less than 100 DM and no other property. Their installment rate is 4% of disposable income and they have no other installment plans. They have a co-applicant as a guarantor and live in a free housing arrangement. The individual is responsible for providing maintenance for one person and has a registered telephone under their name. Additionally, they are a foreign worker with a good credit history of repaying existing credits.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and has had existing credits at a bank paid back on time. They are borrowing 609 DM for a business purpose and have savings of less than 100 DM. They have been employed for less than a year and have a low percentage of disposable income going towards installments. The individual is a female who is divorced, separated, or married, with no other debtors or guarantors. They have been living in their own real estate property for 1 year and are 26 years old. They have no other installment plans, one existing credit at the bank, and are unemployed or in an unskilled non-resident job. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a moderate amount of money in their existing checking account, a good credit history, and wants to use the credit for purchasing a radio/television. They have some savings, have been employed for 1-4 years, and have a low installment rate compared to their disposable income. The person is a divorced/separated male, has no other debtors/guarantors, and has been living at their current residence for 1 year. They own a car or another type of property not specified. This person is 26 years old, has no other installment plans, and owns their own home. They have one existing credit at the bank, a skilled job, and one person they are financially responsible for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has existing credits paid back duly till now. They are looking to purchase a radio/television, with a credit amount of 2284. Their savings account/bonds have less than 100 DM. They have been employed for 4 to less than 7 years and have a 4% installment rate in percentage of disposable income. The individual is a single male, with no other debtors/guarantors, owning a car or other property. They are 28 years old, with no other installment plans, and own their own home. They have one existing credit at their bank, and work as a skilled employee/official. They are liable for providing maintenance for one person, have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old female who is divorced/separated/married, with a stable job as a skilled employee/official. She has been with her current employer for at least 7 years. She owns her own home and has lived at her current residence for 4 years. She has no other debtors/guarantors or other installment plans. With 1 existing credit at the bank and a credit amount of 1206 DM, she has a good credit history of paying back credits duly. She has savings of less than 100 DM, and her installment rate is 4% of her disposable income. She is financially responsible with no telephone and no other people to provide maintenance for. Additionally, she is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM, has been repaying existing credits on time, and has a stable job for 1 to 4 years. They are looking to use credit for a radio/television purchase, with a credit amount of 3016. They have savings of less than 100 DM and own a car or other property. Being a married/widowed male, they have no other debtors or guarantors. They are 24 years old, have no other installment plans, and live in their own house. They have one existing credit at the bank and are a skilled employee with one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account. They have a good credit history with existing credits paid back duly. The purpose of the credit is for furniture/equipment. They have savings between 100 and 500 DM. Currently unemployed, they have a low installment rate in terms of disposable income. The individual is a male who is divorced or separated. They have no other debtors or guarantors. They have been living at their current residence for 1 year and have a building society savings agreement or life insurance. At 33 years old, they have no other installment plans and own their own home. They have one existing credit at this bank and work as a skilled employee/official. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM and has had no previous credit history. They are seeking a loan for business purposes, and the credit amount is 6289. Their savings account contains less than 100 DM, and they have been employed for less than a year. The individual's disposable income installment rate is 2%, and they are a divorced or separated male. There are no other debtors or guarantors involved. They have been residing in their current residence for 1 year and have a property in the form of a building society savings agreement or life insurance. The individual is 33 years old, has no other installment plans, and owns their own home. They have 2 existing credits at this bank and work as a skilled employee or official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this example has a status of existing checking account with a balance between 0 and 200 DM. They have had this account for 11 months and have a credit history of a critical account or other credits existing elsewhere. The purpose of their credit is for a new car, with a credit amount of 1322 DM. They have savings of at least 1000 DM and have been employed for 1 to 4 years. Their installment rate is 4% of disposable income. They are a divorced/separated/married female with no other debtors or guarantors. They have been residing in their current home for 4 years and own it. The individual is 40 years old, has no other installment plans, and no other significant assets apart from a car. They have 2 existing credits at this bank, are a skilled employee or official, and have 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a 50-year-old single male with no checking account. He has been at his current job for over 7 years and lives in his own home. He has existing credits that have been paid back duly and currently has 2 other credits at the bank. His credit amount is 2241 DM for the purpose of furniture/equipment. He has savings of less than 100 DM and no other installment plans. He has no other debtors/guarantors and no telephone. He has been residing at his current residence for 2 years and has real estate property. He is a skilled employee/official and is responsible for one dependent. He is a foreign worker and has an installment rate of 4% of his disposable income.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying back existing credits on time. They are taking out a loan to buy a radio/television. With a credit amount of 3181 and savings of less than 100 DM, they have been employed for less than a year. Being a divorced/separated/married female, they have no other debtors or guarantors. They have been living at their current residence for 4 years and own their own home. With only one existing credit at the bank, they work as a skilled employee/official. They are responsible for one person's maintenance and have a telephone registered under their name. Additionally, they are a foreign worker and are 26 years old.###\nHence this label was Yes."
"This individual is a 28-year-old single male, working as a skilled employee with 1-4 years of present employment. He has a good credit history with existing credits paid back duly, and currently has a credit amount of 4169 DM for the purpose of furniture/equipment. His existing checking account balance is less than 0 DM, with savings of less than 100 DM. He does not have any other debtors or guarantors, and resides in his own home for the past 4 years. He has no other installment plans or telephone. Additionally, he holds a building society savings agreement/life insurance as property, with no other outstanding credits at this bank. He is responsible for providing maintenance for one person and is a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account with 0 to 200 DM, a credit history showing critical account or other credits existing elsewhere, and a purpose of obtaining a new car. They have a credit amount of 958 DM and savings of less than 100 DM. Currently, they have been employed for 4 to 7 years and have a low installment rate of 2% of disposable income. The individual is a single male, with no other debtors or guarantors. They have been residing in their current residence for 3 years, own real estate, and are 47 years old with no other installment plans. They have 2 existing credits at their bank, work as an unskilled resident, and have 2 dependents. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has a credit history of paying back existing credits on time. They are taking a loan of 2996 for furniture/equipment. Their savings account status is unknown. They have been employed for 1 to less than 4 years. The installment rate as a percentage of disposable income is 2. The individual is a married/widowed male. They have no other debtors or guarantors. They have been residing in their current residence for 4 years, own a car or other property, and are 20 years old. They have no other installment plans, own their own house, and have one existing credit at the bank. They are a skilled employee/official with one person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual has no checking account, has been existing credits paid back duly till now. The purpose of the credit is for a new car, with a credit amount of 2390. They have unknown/no savings account and have been employed for at least 7 years. The installment rate is 4% of their disposable income. The individual is a single male, with no other debtors or guarantors. They have been residing at their current residence for 3 years and own a property. The individual is 50 years old, with no other installment plans and no other existing credits at this bank. They are a skilled employee/official with one person being liable for maintenance. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has had existing credits paid back on time. They are looking to use a loan for a radio/television purchase, with a credit amount of 2171. Their savings account/bonds hold less than 100 DM. They have been employed for less than a year and their disposable income installment rate is 2. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 2 years and own a car or other property. At 29 years old, they have a bank installment plan, own their housing, and have one existing credit at this bank. They are a skilled employee/official with one person they are liable to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a critical credit history with other credits existing elsewhere. They are looking to finance a radio or television purchase with a credit amount of 2831. Their savings are below 100 DM and they have been employed for 1 to 4 years. With a 4% installment rate, the person is a divorced, separated, or married female. They have no other debtors or guarantors, own their residence, and have 1 existing credit at the bank. The individual is a skilled employee or official, aged 33, with no other installment plans. They have been living in their current residence for 2 years, with one dependent. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old divorced/separated/married female who has been employed for at least 7 years as a skilled employee/official. She owns a car or other property. She has no savings account but has been living in her current residence for 4 years. She has one existing credit at the bank and no other debtors/guarantors. She has no other installment plans and does not have a telephone. She has one person depending on her for maintenance. As a foreign worker, she is seeking credit for a radio/television, with a credit amount of 2991 DM to be paid back over 30 months at an installment rate of 2% of her disposable income.###\nHence this label was Yes."
"This individual is a male, single, skilled employee with a stable job, living in his own home for the past 2 years. He has a checking account balance of less than 0 DM, has been employed between 1 to 4 years, and has paid back all existing credits on time. He is looking to purchase furniture/equipment and requires a credit amount of 4020. His savings are less than 100 DM and he has no other debtors or guarantors. He has no other installment plans, a low installment rate, and is responsible for providing maintenance for one person. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown or no savings account. They have been employed for 4 to less than 7 years, have a good credit history with critical accounts/other credits, and are looking to finance a used car. They are borrowing 4042 credits for a duration of 24 months, with an installment rate of 3%. The individual is a 43-year-old single male, with no other debtors/guarantors, and no other installment plans. They own their own home, have a building society savings agreement/life insurance, and hold a skilled job. Additionally, they have been living in their current residence for 4 years, have two existing credits at this bank, and are the sole provider for one person. They possess a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their checking account, a short credit history with critical accounts, and is looking to finance a radio/television. They have a small amount of savings, have been employed for over 7 years, and have a low installment rate. The individual is a 37-year-old single male with no other debtors or guarantors. They have been living in their own real estate property for 4 years and have 3 existing credits at their bank. Their job is unskilled-resident, and they are responsible for one person. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been repaying existing credits on time and have a car loan for a new car. They have a stable job, are single, and have been living in their current residence for 4 years. They do not have any other debtors or guarantors. They have no property, but live in a free housing arrangement. With a credit amount of 6527 and a duration of 60 months, they have a manageable installment rate of 4% of their disposable income. At 34 years old, they are a skilled employee with 2 dependents, and have a telephone registered in their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history of paying back existing credits on time. They are borrowing for education with a credit amount of 727. They have savings between 500 and 1000 DM, and have been employed for at least 7 years. Their disposable income installment rate is 4, and they are a single male. They have no other debtors or guarantors, and have been living at their current residence for 4 years with unknown property. The individual is 46 years old, has no other installment plans, and lives in a free housing arrangement. They have one existing credit at the bank, hold a skilled job position, and have one person dependent on them for maintenance. They own a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for 1 to 4 years and have paid back existing credits on time. The purpose of the credit is for a used car. They are a single male, aged 26, with no other debtors or guarantors. They have been living in their current residence for 3 years and own their own home. This individual has one existing credit at the bank, works as a skilled employee, and is responsible for providing maintenance for one person. They do not have any other installment plans, own a car or other property, and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are taking a loan for furniture/equipment, with a credit amount of 1766. They have savings of less than 100 DM, and have been employed for 1 to 4 years. Their installment rate is low at 1%, and they are a married/widowed male. They have no other debtors or guarantors, and have been living at their current residence for 2 years. Their property includes a building society savings agreement/life insurance. At 21 years old, they have no other installment plans and live in a rented house. They have one existing credit at the bank, are a skilled employee/official, and have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 26-year-old single male, working as a skilled employee with 4-7 years of employment history. He has a good credit history with a manageable credit amount of 1424 DM for domestic appliances. His existing checking and savings accounts have moderate balances, and he owns his own home. He has no other debts or liabilities, and has been living at his current residence for 3 years. He has one existing credit at the bank and no other installment plans. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a good credit history with other existing credits. They need a loan for repairs, amounting to 5507 credits. Their savings are less than 100 DM, and they have been employed for over 7 years. With a low installment rate, they are a single male living for free and have no other debts or guarantors. Being 44 years old, they have no other installment plans and unknown property. They are a skilled employee with 2 existing credits and one person to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with an existing checking account holding less than 0 DM. They have a good credit history with previous credits paid back on time. The purpose of the credit is for a used car. They have savings of less than 100 DM and have been employed for 7 or more years. Their disposable income allows for a 3% installment rate. The individual is a 35-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and have no property. They have no other installment plans, live in a free housing situation, and hold one existing credit at this bank. The individual is a skilled employee/official, responsible for providing maintenance for one person. They have a telephone registered in their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and a credit history of critical account/other credits existing. They are taking out a small loan for a new car. With a stable job of 4 to 7 years, they have some savings, own real estate, and have a moderate installment rate. Being a single male with no dependents, they have three existing credits and are considered an unskilled resident. At 42 years old, they have been residing at their current place for 1 year and do not have any other installment plans or debtors. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a moderate amount of money in their existing checking account, has a good credit history, and is looking to finance a used car. They are seeking a relatively large credit amount of 9398 DM. Their savings are less than 100 DM and they have been employed for less than a year. The individual has a low installment rate and is a married or widowed male. They have no other debtors or guarantors, have been living at their current residence for 4 years, and own a car or other property. The individual is 28 years old, has no other installment plans, and rents their housing. They have one existing credit at the bank, hold a managerial position, and have one person dependent on them. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been repaying existing credits promptly. They are looking to finance a new car with a credit amount of 1386. They have savings between 500 and 1000 DM, and have been employed for 1 to 4 years. With a moderate installment rate, they are a divorced/separated/married female in their mid-twenties. They have no other debtors or guarantors, and have been living in their own residence for 2 years. Their possessions include a building society savings agreement/life insurance. As a skilled employee, they have one existing credit at the bank and are responsible for one person's maintenance. They do not have any other installment plans and do not own a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has been employed for at least 7 years, and has a good credit history with other existing credits. They are using the credit for a used car and have some savings. The individual is 63 years old, male, and single. They have no other debtors or guarantors, own their own home, and have a building society savings agreement. They have two existing credits at this bank and work as a skilled employee. Additionally, they have one person to provide maintenance for, own a telephone registered in their name, and are a foreign worker.###\nHence this label was Yes."
"The individual is a 34-year-old single male with a stable job (4-7 years of employment) and no debts. He has a moderate credit amount and savings, and has been living in his current residence for 4 years. He has no other significant assets or liabilities. Despite being an unskilled worker, he is financially responsible with only one existing credit at the bank. He does not have a telephone but is a foreign worker. Overall, he appears to be a reliable candidate for a credit risk assessment.###\nHence this label was No."
"The individual has a checking account with less than 0 DM, 8 months of credit history showing a critical account/other credits existing, and is seeking a new car. They are borrowing 731 DM, have savings of less than 100 DM, and have been employed for at least 7 years. With an installment rate of 4%, the person is a 47-year-old single male owning real estate. They have no other debts or guarantors, reside in their own home with 4 years of residence, and have no other installment plans. The individual has 2 existing credits at this bank, an unskilled - resident job, and is liable for providing maintenance for 1 person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and a credit history showing critical accounts or other existing credits. They are borrowing money for a radio/television, with a credit amount of 1347. They do not have a savings account and have been employed for 4 to less than 7 years. Their personal status is a single male, with no other debtors or guarantors. They have been living at their current residence for 2 years and own a building society savings agreement/life insurance. At 27 years old, they have no other installment plans, own their housing, and have 2 existing credits at this bank. They are a skilled employee/official with 1 person to provide maintenance for, have a telephone registered under their name, and are a registered foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are taking a loan for a new car, with a credit amount of 640. Their savings are less than 100 DM and have been employed for 1 to 4 years. They have a low installment rate as a percentage of their disposable income. The person is a divorced/separated male, has no other debtors or guarantors, and has been residing at their current place for 2 years. They own real estate, are 49 years old, and have no other installment plans. The individual has one existing credit at this bank, has an unskilled-resident job, and is liable for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 42, with stable employment for over 7 years. They have a good credit history but have experienced delays in paying off debts in the past. The purpose of their credit is for business, with a moderate amount of 2427 DM. They have no savings account but own a building society savings agreement/life insurance. They have two existing credits at the bank, a medium installment rate, and own their residence. They have no other debtors/guarantors or installment plans. They are a skilled employee/official with one person to support. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a stable employment history of at least 7 years. They have no current debts or other installments, and live in their own property. The purpose of their credit is for a radio/television, with a moderate credit amount of 426. They are married or widowed, have no other debtors or guarantors, and no other significant financial obligations. The individual is a foreign worker, an unskilled resident with one existing credit at the bank. They are 39 years old, have been residing at their current residence for 4 years, and have no telephone.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM and has been with their current employer for 1 to less than 4 years. They have paid back all credits at their bank on time. The purpose of their loan is to buy a new car, with a credit amount of 1647. They do not have any savings in their account and have no other installment plans. They are a single male, aged 40, with no other debtors or guarantors, and no telephone. They live in their own home and have been at their current residence for 2 years. They have a building society savings agreement or life insurance as property. They have two existing credits at their bank and work as an unskilled resident. They are liable to provide maintenance for 2 people and are a foreign worker.###\nHence this label was No."
"This individual has a stable financial standing with a checking account balance of less than 0 DM and a savings account balance between 100 and 500 DM. They have been employed for 4 to 7 years and have a good credit history with existing credits in critical accounts. The purpose of their credit is for a used car, with a credit amount of 6187. They are a married/widowed male, aged 24, with no other debtors or guarantors. They have been living in their current residence for 4 years and have no other installment plans. They live in a rented house and work as a skilled employee/official with two existing credits at the bank. They are responsible for providing maintenance for one person and do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has critical credit history with other existing credits, and is looking to finance a new car. They have a credit amount of 3676 DM and savings of less than 100 DM. They have been employed for 1 to 4 years, with a low installment rate on disposable income. The individual is a 37-year-old single male with no other debtors, residing in a rented property for 3 years. They have real estate as their property, no other installment plans, and 3 existing credits at the bank. The individual is a skilled employee/official with 2 dependents, no telephone, and is a foreign worker.###\nHence this label was Yes."
"The individual is a single male in his mid-20s with no checking account. He has been employed for 4 to 7 years as a skilled employee/official. He has a good credit history with a slight delay in payment in the past. The purpose of the credit is for business, and the amount requested is moderate. He has some savings but not a significant amount. He has no other debtors or guarantors. He owns his own home and has been living there for 4 years. He has two existing credits at the bank and no other installment plans. He is responsible for providing maintenance for one person. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM, has had existing credits paid back on time, and is looking to purchase a radio/television. They are employed for 1 to 4 years, have a moderate credit amount of 2647 DM, and have savings between 500 and less than 1000 DM. Their living situation is in rented housing, they are a single, male skilled employee, aged 44, with no other debts or guarantors. They have been living in their current residence for 3 years, have no other installment plans, and have one existing credit at this bank. Additionally, they have 2 people dependent on them for maintenance and are a foreign worker with no telephone.###\nHence this label was Yes."
"The individual has no checking account and has a credit history of delaying payments in the past. They are looking to finance a used car with a credit amount of 8613. They have savings equal to or greater than 1000 DM and have been employed for 1 to less than 4 years. Their installment rate is 2% of disposable income. The individual is a single male, aged 27, with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. The individual has no other installment plans, owns their own home, and has 2 existing credits at the bank. They are a skilled employee or official, with one person liable for maintenance. The individual does not have a telephone and is a foreign worker.###\nHence this label was Yes."
"The individual in this example has no checking account, a credit history with critical accounts/other credits, and is unemployed. They are a female who is divorced, separated, or married, and own a car or other property. The purpose of the credit is for a radio/television, with a credit amount of 1098 and savings of less than 100 DM. They have been unemployed for a while, are in their mid-60s, and have no other installment plans. They have been living at their current residence for 4 years and have 2 existing credits at the bank. They work in an unemployed/unskilled job and have 1 person to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job, employed for less than a year. He holds a checking account with balance between 0 and 200 DM and has savings between 100 and 500 DM. His credit history shows existing critical accounts. The purpose of his credit is for a used car, with an installment rate of 3%. He resides in his own property and has been at the same residence for 4 years. He is 44 years old and has no other installment plans or debtors/guarantors. He has one existing credit at the bank and is responsible for one person's maintenance. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and unknown savings. They have been employed for 4 to 7 years and have paid back existing credits on time. The purpose of the credit is for a radio/television. The credit amount is 10222 with a 4% installment rate. The individual is a 37-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 3 years and own a car or other property. The individual has one existing credit at the bank, works as a skilled employee/official, and has one person they are financially responsible for. They have a landline telephone and are a registered foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female, aged 59, who has been employed for over 7 years as a skilled employee/official. They have no other debtors or guarantors and no other installment plans. They have one existing credit at a bank and have been living in their current residence for 3 years. Their checking account balance is between 0 and 200 DM, with savings of less than 100 DM. They are renting their current housing and have no known property. They have no telephone, but are a foreign worker. This individual has a good credit history with all credits at the bank paid back duly and is looking for a business loan of 6416 DM, with an installment rate of 4% of their disposable income. They are responsible for one dependent.###\nHence this label was No."
"This individual has a good credit history, currently holds a job as a skilled employee, and has been at their present employment for 1 to 4 years. They have a checking account balance between 0 and 200 DM and savings of less than 100 DM. The purpose of their credit is for business, and they are borrowing 3915 DM for a duration of 27 months. They have no other debts or guarantors, own their own home, and have been at their current residence for 2 years. They are a 36-year-old single male with two dependents. They have one existing credit at the bank, no other installment plans, and a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a single, unemployed male aged 27, with a good credit history and no other debtors or guarantors. He has been living in his own residence for 4 years and has 1 existing credit at the bank. He is a skilled employee with no other installment plans and no telephone. The individual has 100-500 DM in savings, no current checking account balance, and is a foreign worker. His purpose for the credit is a used car, for which he is borrowing 4576 DM.###\nHence this label was Yes."
"This individual is a male, divorced or separated, aged 43 and holds a skilled employee/official position. They have a stable job, with 4 to 7 years of employment history, and have been residing in their current home for 3 years. The individual owns a car or other property and has one existing credit at the bank. They have no other debtors or guarantors, no other installment plans, and no savings exceeding 100 DM. Their existing checking account balance is between 0 and 200 DM. They have a good credit history of paying back existing credits duly. The individual's credit amount is 4057, with an installment rate of 3% of disposable income. They have one person to provide maintenance for, own a telephone registered under their name, and are a foreign worker. Their purpose for the credit is furniture/equipment.###\nHence this label was No."
"The individual has a checking account with less than 0 DM, a credit history of paying back all credits at this bank on time. They are seeking retraining and have a credit amount of 339 DM. Their savings are less than 100 DM, and they have been employed for at least 7 years. They have a low installment rate of 4% of disposable income. The individual is a married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 1 year and own a car or other property. At 45 years old, they have a bank installment plan and own their own home. They have one existing credit at this bank, hold an unskilled-resident job, and are responsible for providing maintenance for one person. They do not have a telephone, but they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of delays in paying off debts. They are seeking a loan for business purposes. They have savings of less than 100 DM and have been employed for less than a year. The credit amount requested is 8648. They have a low installment rate in terms of disposable income. The individual is a 27-year-old single male with no other debtors or guarantors. They have been residing at their current residence for 2 years and own a car or other property. They have two existing credits at the bank, work as a skilled employee/official, and have one person they are liable to provide maintenance for. They have a registered telephone under their name and are a foreign worker.###\nHence this label was No."
"The individual is a married/widowed male, aged 26, with a credit history of paying back existing loans duly. He has a small amount of credit (625 DM) for the purpose of buying a radio/television. He has a savings account with less than 100 DM and has been employed for less than a year. He has one guarantor for his debts, lives in his own real estate, and has one existing credit at the bank. He has an unskilled-resident job, no telephone, but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had no issues with credit history. They took a 24-month loan to purchase furniture or equipment, amounting to 5150 credits. Their savings are below 100 DM. They have been employed for at least 7 years and have a low installment rate relative to their disposable income. A male, single, aged 33, with no other debtors or guarantors, they have lived in their current residence for 4 years. They own a car or other property, have no other installment plans, and live in their own house. They have one existing credit at the bank, work as a skilled employee/official, and are the sole provider for one person. They have a registered phone and are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit standing with a small existing checking account balance. They have a history of critical accounts with other institutions, but are looking to make a relatively small loan for a radio/television purchase. They have no savings account, but have been employed steadily for 4-7 years. Their expenses are manageable, and they have a guarantor for any additional debts. They own their own home and have a stable job as a skilled employee, with one person dependent on them for financial support. They have a registered telephone and are a foreign worker. Overall, they appear to be a reliable borrower with a steady financial situation.###\nHence this label was Yes."
"The individual is a female, divorced or separated, aged 24, with no existing checking account. They have been employed for 1 to 4 years and have a duration in month of 48. The credit history is classified as critical account/other credits existing elsewhere. The purpose of the credit is for a used car, with a credit amount of 11590. They have savings between 100 and 500 DM, and no other debtors/guarantors. They currently reside in a rented property, have no telephone, but do have a bank installment plan. They have 2 existing credits at this bank, work as an unskilled resident, and have one person they are liable to provide maintenance for. Lastly, they are a foreign worker and have no other installment plans.###\nHence this label was No."
"This individual has no checking account and has a credit history of critical account/other credits existing. They require credit for a radio/television purchase, with a credit amount of 6070. Their savings are below 100 DM and they have been employed for over 7 years. With an installment rate of 3%, they are a single male, aged 33. They have no other debtors/guarantors and have been residing in their current home for 4 years. They own a car or other property, have no other installment plans, and live in their own house. They have 2 existing credits at this bank, are a skilled employee/official, and have 1 person dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history with existing credits paid back duly. They have a moderate amount of 3976 DM in credit, with a stable savings account or no savings at all. They have been employed for 4 to 7 years and have a single status. With a car or other property, they live in their own house for 3 years. At 35 years old, they have one existing credit at the bank, a skilled job, and one dependent. Furthermore, they have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for at least 7 years. They are single male, 42 years old, with no other debtors or guarantors. They have a strong credit history, one existing credit, and a high credit amount for a new car. They have savings of less than 100 DM, own a home, and have no other installment plans. Their job is in management or a highly qualified position, and they have a telephone registered under their name. Additionally, they have been living in their current residence for 4 years and are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM and has a history of delayed payments. They are looking to purchase a new car, requiring a credit amount of 1344. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a low installment rate relative to their disposable income. The individual is a 43-year-old single male with no other debtors or guarantors. They have lived in their current residence for 2 years and own real estate. They have two existing credits at the bank and work in an unskilled resident job. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old female who is divorced/separated/married. She has no existing checking account but has a savings account with a balance between 100 and 500 DM. She has been employed for less than 1 year as a skilled employee/official. She has one existing credit at the bank and owns her own home. She has been living at her current residence for 4 years. She is taking out a 3812 DM loan for a used car, with an installment rate of 1% of her disposable income. She has no other debts or guarantors. She has no other installment plans or additional people relying on her for financial support. She has a telephone registered in her name and is a foreign worker. Based on her credit history of paying back existing credits duly, she is considered a good credit risk.###\nHence this label was Yes."
"This individual is a single male with a steady job and a good credit history. He has a small amount of money in his checking and savings accounts. He is looking to buy a used car and needs a loan of 7966 DM to make the purchase. He has been living in his current residence for 3 years and has no other debts or dependents. Despite not having a telephone, he is a reliable foreign worker.###\nHence this label was Yes."
"This individual is a 38-year-old divorced/separated/married female, working as a skilled employee/official. She has no existing checking account but has a savings account with less than 100 DM. She has been at her current residence for 3 years and has one existing credit at the bank. She is looking to borrow credit for the purpose of purchasing a radio/television and has a credit amount of 1533. She has no other debtors/guarantors and no other installment plans. She owns her own home, has a telephone registered under her name, and is a foreign worker. Her installment rate is 4% of her disposable income, and she is responsible for providing maintenance for one person.###\nHence this label was Yes."
"A divorced or separated female, aged 28, with no checking account, has been employed for 1 to 4 years as a skilled employee. She lives in a rented house with one dependent and one existing credit at the bank. The purpose of her credit is for a used car, with a credit amount of 2603. She has savings of at least 1000 DM, no other debtors or guarantors, and no other installment plans. She has been residing at her current residence for 4 years, pays an installment rate of 2% of her disposable income, and has a telephone registered under her name. Additionally, she is a foreign worker and has a good credit history of paying back existing credits duly.###\nHence this label was Yes."
"This individual is a 26-year-old unemployed female, divorced or separated, with no existing checking account. She has been living in her current residence for 2 years and owns her own home. She has no other debtors or guarantors and no other installment plans. She is seeking a loan for furniture/equipment, with a credit amount of 10974. Her credit history shows that she has paid back existing credits duly till now. She has less than 100 DM in her savings account. She has 2 existing credits at this bank and works in a job related to management/self-employment/highly qualified employee/officer. She has 1 person to provide maintenance for, and has a telephone registered under her name. Additionally, she is a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a credit history of paying back existing credits on time, and is looking to buy a used car. They have a moderate credit amount of 2924, savings of less than 100 DM, and have been employed for 1 to less than 4 years. The installment rate for them is 3% of disposable income. They are a single male, have a guarantor, and have been living at their current residence for 4 years. They have no property, are 63 years old, have installment plans with a bank, and own their own home. They have one existing credit at the bank, a skilled job, and are responsible for providing maintenance for 2 people. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset does not have an existing checking account, is unemployed, and has all previous credits at the bank paid back duly. They are female, divorced/separated/married, with one person to provide maintenance for. The purpose of the credit is for a used car, with a credit amount of 7485 and unknown/no savings account. They have real estate as their property, own their housing, and have one existing credit at the bank. The individual is 53 years old, with a present residence since 1 year, an installment rate of 4%, and a job in management/self-employed/highly qualified employee/officer category. They have no other debtors/guarantors, with a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account less than 0 DM and has been employed for 4 to less than 7 years. They have no savings account, but have a critical credit history with other existing credits. The purpose of the credit is for furniture/equipment, with a substantial amount of 14179. They have a single status, are male, and are 30 years old. They have no other debtors or guarantors, own their own home, and have 2 existing credits at this bank. Their job is in management/self-employment/highly qualified employee/officer role. They have no other installment plans, have been residing at their current residence for 4 years, and have a telephone registered under their name. Additionally, they are a foreign worker and have one person liable for maintenance.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 37, with less than 1 year of present employment. She has a good credit history with existing credits paid back duly. She is looking to borrow a small amount of money (1274 DM) for a new car, and has a savings account with less than 100 DM. She owns a real estate property and has been residing there for 1 year. She has no other debtors or guarantors, no other installment plans, and no telephone. She works as an unskilled resident, with 1 existing credit at the bank and 1 person to provide maintenance for. She is a foreign worker.###\nHence this label was No."
"This individual has no checking account and a credit history of critical account/other credits existing. They are seeking a loan for furniture/equipment, amounting to 4042 credits. They have savings between 500 and 1000 DM and have been employed for 1 to 4 years. With an installment rate of 4% of disposable income, they are a single male with no other debtors or guarantors. They have been residing in their current location for 4 years and own real estate. The individual is 36 years old, has no other installment plans, and their housing status is listed as own. They have two existing credits at this bank and work as a skilled employee/official. They are responsible for one person's maintenance and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old married/widowed male with a stable job, residing in their own home for the past 3 years. They have existing credit that has been paid back duly and one ongoing credit at the bank. The purpose of their credit is for a new car, with a credit amount of 685 DM. They have a moderate installment rate and a savings account with less than 100 DM. Additionally, they have no other debtors or guarantors, one person they provide maintenance for, and no telephone. They have been in their current employment for 4 to 7 years as an unskilled resident worker, and they have a foreign worker status.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM, has been employed for at least 7 years, and has paid back existing credits on time. They are taking out a loan for a radio/television, with a credit amount of 4473. Their savings are less than 100 DM, and they have no other debtors or guarantors. They are a 31-year-old single male, living in their own residence for 2 years. They have one existing credit at the bank and work as a skilled employee/official. They do not have any other installment plans, own a car or another property, and have no telephone. They are responsible for providing maintenance for one person and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been with their current employer for 4 to 7 years. They have a small credit amount of 1544 for a radio/television purchase. Their savings account balance is less than 100 DM. They are a single male with no other debtors or guarantors. They have been living in their own real estate property for 1 year and are 42 years old. They have 3 existing credits at the bank and work as an unskilled resident. They are responsible for providing maintenance for 2 people and are a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old female who is divorced or separated or married. She has been employed at her current job for at least 7 years as a skilled employee/official. She has no other debtors or guarantors and no other installment plans. She owns her own home and has been living at her current residence for 4 years. She has 2 existing credits at this bank and is responsible for providing maintenance for 1 person. She does not have a telephone but is a foreign worker. In terms of her finances, she has less than 0 DM in her existing checking account and less than 100 DM in savings. She took out a credit amount of 4272 for the purpose of furniture/equipment. Her credit history shows critical account/other credits existing (not at this bank). She has a low installment rate in percentage of disposable income of 1.###\nHence this label was Yes."
"This individual is a 32-year-old divorced/separated male, working as a skilled employee/official with less than 1 year at the current job. They have been residing in their own home for 3 years and have one existing credit at the bank. The person has a good credit history, with existing credits paid back duly till now. They are looking to purchase a radio/television and need a credit amount of 1938. Their savings amount is less than 100 DM, and the installment rate is 4% of disposable income. There are no other debtors/guarantors involved, and no other installment plans or a telephone. The individual is a foreign worker with one person being liable for maintenance. Their main property is on a building society savings agreement/life insurance.###\nHence this label was No."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are borrowing money for furniture/equipment, with a credit amount of 3972. Their savings are less than 100 DM and they have been employed for 4 to 7 years. They have a low installment rate, are female and either divorced, separated, or married. They have no other debtors or guarantors, have been living at their current residence for 4 years, and have a building society savings agreement or life insurance. At 25 years old, they have no other installment plans, live in a rented house, and have one existing credit at this bank. They are a skilled employee/official, with one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a good credit history with existing credits paid back duly. They are seeking a new car loan worth 3577 DM, with savings between 100 and 500 DM. They have been employed for 1 to 4 years and have a low installment rate. The person is a 26-year-old single male, with a guarantor. They have been living in their current residence for 2 years and own real estate. They have no other installment plans, live in a rented house, and work as a skilled employee or official. The individual is responsible for providing maintenance for 2 people and does not have a telephone. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying back existing credits on time. They are unemployed with a duration in month of 48 and a credit amount of 4844 for a business purpose. Their savings are less than 100 DM and they have been residing at their current residence for 2 years. They are a 33-year-old single male with no other debtors. They have a car or other property, not specified. Their installment rate is 3% of disposable income and they have one existing credit at the bank. They work in a management/self-employed/highly qualified position and are responsible for one person's maintenance. They have a bank installment plan, rent housing, a registered telephone, and are a foreign worker.###\nHence this label was No."
"The individual has a checking account balance of at least 200 DM and has been with their current employer for 1 to less than 4 years. They have no other debts or guarantors and own real estate. The purpose of the credit is for business, with a credit amount of 1275 DM. They have savings of at least 1000 DM and have been living at their current residence for 4 years. The individual is a 36-year-old divorced/separated male with a skilled job and one dependent. They have two existing credits at the bank, with an installment rate of 2% of disposable income. They do not have any other installment plans and live in their own home. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced/separated/married, aged 30, with a stable job in management/self-employment/highly qualified employment/officer. She has a good credit history with other existing credits, owns a car or other property, and has no other debtors or guarantors. She has a moderate amount of credit amounting to 5096 DM and has been at her current residence for 3 years. She has been employed for 1-4 years and has a good savings account with less than 100 DM. Additionally, she has one existing credit at the bank, a telephone registered under her name, and is a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account less than 0 DM and has been repaying their existing credits on time. They are looking to take a new car loan with a credit amount of 2303. Their savings account has less than 100 DM. They have been employed for at least 7 years and have a low installment rate. The applicant is a 45-year-old single male with a co-applicant for debts. They have lived in their current residence for 1 year and own real estate. They have no other installment plans, own their own home, and have a stable job as a skilled employee. The individual is responsible for one person's maintenance, does not have a telephone, and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a credit history of paying back existing credits on time. They are seeking a loan for furniture or equipment, with a credit amount of 3349. Their savings amount is less than 100 DM and they have been employed for 1 to less than 4 years. The installment rate is 4% of their disposable income. They are a female who is divorced/separated/married, living in their own residence for 2 years. They have no other debtors or guarantors, no other installment plans, and own a car or other property not specified. At 28 years old, they hold a managerial position and have 1 existing credit at the bank. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a 26-year-old single male, working as a skilled employee or official for at least 7 years. He has no checking account but holds a savings account with less than 100 DM. He has been living in his own residence for 2 years and has 2 existing credits at the bank. His credit history shows critical accounts/other credits existing elsewhere. He is looking to borrow 1934 credits for a radio/television and has no other installment plans. He has no other debtors/guarantors, and no telephone. He does not own any property and has no one else to provide maintenance for. He is a foreign worker with no one being liable.###\nHence this label was Yes."
"This individual does not have a checking account and has a credit history with critical accounts/other existing credits. They are seeking a new car and require a credit amount of 7855. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have a moderate installment rate and are a divorced/separated/married female. They have no other debtors/guarantors and have been residing at their current residence for 2 years. They own real estate and are 25 years old. They have installment plans with stores, own their housing, have 2 existing credits at this bank, and are a skilled employee/official. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been repaying existing credits on time. They are borrowing 1311 DM to buy a radio/television, with savings between 100 and 500 DM. They have been employed for 4 to 7 years and have a moderate installment rate. The person is a married or widowed male, with no other debtors or guarantors. They have been living in their current residence for 3 years and own a building society savings agreement or life insurance. At 26 years old, they have no other installment plans, and their housing status is owned. They have one existing credit at this bank, a skilled job, and one dependent. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"This individual has a good credit risk. He has between 0 and 200 DM in his existing checking account, has a critical credit history with other existing credits, and is looking to purchase a new car with a credit amount of 3878 DM. He has savings between 100 and 500 DM and has been employed for less than a year. His installment rate is 4% of his disposable income, he is male and divorced/separated, and has no other debtors or guarantors. He has been living in his current residence for 2 years, owns a car or other property, and is 37 years old. He has no other installment plans, owns his own home, and has one existing credit at the bank. He is a skilled employee/official with one person liable for maintenance. He has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old divorced/separated male, employed for 1 to 4 years as a skilled employee/official. They have a checking account with less than 0 DM, savings of less than 100 DM, and own their residence. They have two existing credits and are responsible for one person's maintenance. The credit history is critical, with other credits existing elsewhere. The purpose of the credit is for furniture/equipment, with a credit amount of 975. They have no other debtors/guarantors, installment plans, or telephone. Their housing situation is own, with a building society savings agreement/life insurance as property. Additionally, they have no other debts and are a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old single male, who has been employed for 1 to 4 years as a skilled employee/official. He has a good credit history with existing credits paid back duly. He has a checking account with a balance between 0 and 200 DM, and savings of less than 100 DM. The purpose of the credit is for a radio/television. He has no other debtors/guarantors, no other installment plans, and owns his own home. He has been residing at his current residence for 3 years and has one existing credit at the bank. He has no telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for 1 to 4 years in a management position. They are single, male, and own a house. The purpose of the loan is for a used car. They have two existing credits at the bank and have no other installment plans. They have been living in their current residence for 4 years and have a good credit history. They are 46 years old, with an installment rate of 2%. They have no other debtors or guarantors, and two people to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old single male, working as a skilled employee with less than 1 year of employment history. He has a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and no other installment plans. His credit history shows critical accounts/other credits existing elsewhere. The purpose of his credit is for a radio/television, with a credit amount of 882. He resides in his own property, has been at his current residence for 4 years, and has 2 existing credits at this bank. He has a guarantor and no other debtors, with no telephone and is a foreign worker. He has a 4% installment rate in percentage of disposable income and is liable to provide maintenance for 1 person.###\nHence this label was Yes."
"This individual is a 66-year-old unemployed single male with no other debtors or guarantors. He has a checking account balance of at least 200 DM and savings between 500 and 1000 DM. He has been unemployed for a while and has been living in his current residence for 4 years. He is looking to take out credit for a new car, with a credit amount of 1480 DM. He has no property and is living in a free housing situation. Despite his unemployment, he has three existing credits at this bank and one person dependent on him for maintenance. He has no telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a single male in his late twenties with a stable job and a good credit history. He has a moderate amount of savings and has been living in his own home for three years. He has two existing credits at the bank and is responsible for providing maintenance for one person. His credit amount is relatively high, and he has a co-applicant for other debts. He has a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"This individual is a single male with a monthly income of less than 200 DM. He has a critical credit history with other existing credits, and he is seeking a loan for a radio/television. He has some savings between 100 and 500 DM. Currently, he has been employed for less than a year and has a low installment rate of 4%. He has no other debtors or guarantors. He owns his own home and has been residing there for 4 years. At 38 years old, he has a job as a skilled employee/official. He has 2 existing credits at the bank and is responsible for providing maintenance for 2 people. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account less than 0 DM and has had this account for over 7 years. They have a good credit history with other creditors, and their purpose for the credit is for repairs. The credit amount requested is 1288 DM, and they have savings between 100 and 500 DM. They have been living in their current residence for 4 years and own real estate. The individual is a 48-year-old single male, working as a skilled employee with 2 existing credits at the bank. They have no other installment plans, no telephone, and no foreign worker status. They have a guarantor for other debtors, and 2 people who are liable to provide maintenance for.###\nHence this label was Yes."
"This individual is a single male, skilled employee, aged 30 with no existing debts or guarantors. He has been employed for at least 7 years and has no other installment plans or telephone. He has been living in his current residence for 4 years, which is for free. With a good credit history and one existing credit at the bank, he is considered a good credit risk.###\nHence this label was Yes."
"This individual has no checking account and has been repaying existing credits on time. They are seeking retraining with a credit amount of 937. Their savings are less than 100 DM, and they have been employed for less than a year. They have a low installment rate, are male, married/widowed, and have no other debtors or guarantors. They have been living in their current residence for 3 years, own a car or other property, and are 27 years old. They have no other installment plans, own their housing, have 2 existing credits at the bank, and work as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of delayed payments in the past. They took a 15-month loan for a used car amounting to 3594. Their savings are below 100 DM and they have been employed for less than a year. With a low installment rate, they are a divorced/separated/married female aged 46, having no other debtors or guarantors. They have been living in their own house for 2 years and have a building society savings agreement. Additionally, they have 2 existing credits at the bank, an unskilled-resident job, and are liable for one person. They do not have any other installment plans or a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had a critical account/other credits existing in the past. The purpose for the credit is for a radio/television. The credit amount is 717 units. They have savings of less than 100 DM and have been employed for at least 7 years. Their installment rate in percentage of disposable income is 4. The individual is a 52-year-old single male, with no other debtors or guarantors. They have been residing in their current location for 4 years and own real estate. The individual has no other installment plans, owns their housing, and has 3 existing credits at the bank. They are a skilled employee/official and have 1 person they are liable to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual, a 55-year-old divorced/separated male, has a stable financial profile with a checking account balance of less than 0 DM, savings of less than 100 DM, and a credit history of paying back all credits promptly. They have been employed for less than a year and earn enough to afford a moderate installment rate. The purpose of their loan is for furniture/equipment, with a credit amount of 6872. They live in their own home, have one existing credit at the bank, and no other debtors/guarantors. Their property is a building society savings agreement/life insurance, and they have a stable job as a skilled employee/official. They have one person to support financially and possess a telephone registered under their name. Additionally, they have a foreign worker status.###\nHence this label was No."
"This individual is a 20-year-old female who is divorced/separated/married and works as a skilled employee/official. She has been living in her current residence for 4 years and has a checking account with less than 0 DM. She has existing credits that have been paid back duly, and her credit history is good. The purpose of her current credit application is for furniture/equipment, and she is looking to borrow 2039 DM. She has savings of less than 100 DM and has been employed for 1 to 4 years. She has no other debtors or guarantors and no telephone. She has one existing credit at this bank and no other installment plans. She resides in a rental property and is a foreign worker with no dependents.###\nHence this label was No."
"This individual has a stable financial situation with a checking account balance of less than 0 DM and a savings account with less than 100 DM. They have been employed for 1 to less than 4 years and have a moderate credit history. The purpose of their credit is for a new car, with a credit amount of 3939. They have no other ongoing debts or guarantors. The individual is a 40-year-old single male, residing in their own property. They have been living at their current residence for 2 years and have 2 existing credits at the bank. Their job is listed as unskilled-resident, with 2 people they are liable to provide maintenance for. They do not have any other installment plans, own a telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual in this example has a status of existing checking account of less than 0 DM, with a credit duration of 36 months. Their credit history shows a critical account/other credits existing elsewhere. The purpose of the credit is for furniture/equipment, with a credit amount of 5371. They have savings of less than 100 DM, and have been employed for 1 to less than 4 years. The installment rate in percentage of disposable income is 3, and the individual is a single male. They have a guarantor for other debtors/guarantors, have been at their current residence for 2 years, and own property in the form of building society savings agreement/life insurance. The individual is 28 years old, has no other installment plans, and owns their own house. They have 2 existing credits at the bank, with a job as a skilled employee/official. They have 1 person liable for maintenance, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female, working as a skilled employee/official with less than 1 year of current employment. She has no existing checking account but holds a building society savings agreement/life insurance. The purpose of her credit application is for furniture/equipment, with a duration of 36 months and a credit amount of 7127. Her savings account/bonds hold less than 100 DM. She pays a 2% installment rate from her disposable income and currently resides in a rented house for the past 4 years. She has no other debtors/guarantors or other installment plans. There are 2 existing credits at this bank in her name, and she is liable for providing maintenance for one person. She owns a telephone registered under her name and is a foreign worker.###\nHence this label was No."
"The individual has less than 0 DM in their existing checking account and has been in their current job for at least 7 years. They have paid back all existing credits on time and are looking to use a loan of 3345 DM for furniture/equipment. Their savings amount to less than 100 DM and they have no other debts or guarantors. The individual is a 39-year-old single male, living in a rented house for the past 2 years. They have a good credit history and are in a stable job as a management/self-employed/highly qualified employee/officer. They have one existing credit at the bank and one person dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual does not have a checking account and has no existing credits at this bank. They have been employed for 1 to 4 years as a skilled employee or official. The purpose of their credit is for furniture/equipment, with a credit amount of 1817. They have savings of less than 100 DM and own their housing. The individual is a 28-year-old divorced/separated/married female, with no other debtors or guarantors. They have been residing at their current residence for 2 years and have no other installment plans. They have a 4% installment rate in terms of disposable income and no telephone. The individual has 2 existing credits at this bank, is responsible for 1 person's maintenance, and is a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female in their mid-thirties with a stable job and a good credit history. They have savings, own a car, and live in their own home. With a solid financial background and no outstanding debts or other dependents, they are considered to be a good credit risk.###\nHence this label was No."
"This individual has a good credit history with existing credits paid back duly. They have a stable income with existing checking account balance between 0 and 200 DM. The purpose of their credit is for a used car, with a significant credit amount of 12579 DM. They have savings of less than 100 DM and have been employed for over 7 years. The individual is a 44-year-old divorced/separated/married female with no other debtors or guarantors. They have been residing at their current residence for 2 years, with no specified property. There are no other installment plans or debts, and they reside in a free housing situation. Employment-wise, the individual is in a managerial/self-employed/highly qualified employee/officer position. They have one existing credit at the bank and are responsible for providing maintenance for one person. Additionally, they have a registered telephone and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are looking to borrow a small amount of money (1101 DM) to buy a new car. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have a low installment rate and are a married/widowed male. They have no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. They are 27 years old, have no other installment plans, and their housing situation is stable. They have 2 existing credits at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 67-year-old divorced or separated or married female, with a stable job in management, self-employment, or as a highly qualified employee or officer. She has been living in her own home for 4 years and has 2 existing credits at the bank. She has a good credit history with existing credits paid back duly. For this instance, the individual has a moderate credit amount of 1199 DM to be used for education purposes, with savings of less than 100 DM. She has no other debtors or guarantors, and no other installment plans. She has been in her current employment for 4 to 7 years and has a telephone registered under her name. Additionally, she does not have ongoing financial obligations to provide maintenance for others and is a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history, currently holds a job as a skilled employee, and has been employed for 1 to 4 years. They have a stable living situation, owning their own home and residing there for 2 years. With a moderate monthly installment rate, they have no other debtors or guarantors. Their savings amount is less than 100 DM and they have a small existing checking account balance. The individual is a single male, aged 23, and has a telephone registered under their name. They have one existing credit at the bank and are responsible for providing maintenance for one person. Additionally, they have no other installment plans, own a car or other property, and are a foreign worker.###\nHence this label was No."
"This individual is a married/widowed male with a stable job as a skilled employee/official. He has been living in his own home for 3 years and has no other debtors or guarantors. With a good credit history despite past delays in payments, he has no telephone and his only means of communication is in person. He has savings of at least 1000 DM and a building society savings agreement/life insurance as property. At the age of 61, he has two existing credits at the bank and is responsible for providing maintenance for one person. He took a credit amount of 1512 DM for repairs, with a duration of 15 months and an installment rate of 3% of disposable income. Additionally, he has no other installment plans and is a foreign worker.###\nHence this label was No."
"The individual is a female who is divorced/separated/married. She has no checking account and has been employed for 1 to less than 4 years. She is looking to finance a radio/television with a credit amount of 1459. Her savings are less than 100 DM and she has no other debts or guarantors. She currently resides in her own home for 2 years and is 43 years old. She has one existing credit at a bank and works as an unskilled resident. She is responsible for providing maintenance for one person and does not have a telephone. Additionally, she is a foreign worker.###\nHence this label was Yes."
"This individual, a 26-year-old divorced/separated/married female, has no checking account and has been employed for 4 to less than 7 years. She is renting a residence and has a good credit history with no other debts or guarantors. Her purpose for the credit is for a radio/television, and she has a small amount of savings. She has one existing credit at the bank and is in a higher job position. She has a telephone registered under her name, and she is a foreign worker.###\nHence this label was Yes."
"This individual is a 26-year-old female who is divorced/separated/married, employed as a skilled employee/official for 1 to less than 4 years. She has no checking account but has a savings account with less than 100 DM. She owns real estate and has been living at her current residence for 1 year. She has one existing credit at the bank and no other installment plans or debtors/guarantors. She has a good credit history with existing credits paid back duly till now. She has a telephone registered under her name and is a foreign worker. She is requesting a credit amount of 763 for the purpose of furniture/equipment and has a low disposable income with an installment rate of 4%. She is responsible for one person's maintenance.###\nHence this label was Yes."
"The individual is a 44-year-old divorced/separated/married female, working as a skilled employee/official with less than 1 year of employment at their current job. They do not have a checking account or savings account, but own a car or other property. They have no other debtors/guarantors, no other installment plans, and one person they are financially responsible for. They have two existing credits at the bank and have been living at their current residence for 1 year. Their credit history shows that they have paid back existing credits duly. The purpose of their credit application is for a radio/television. They have a credit amount of 5943 and an installment rate of 1% of their disposable income. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account, has existing credits paid back duly, and has been employed for 1 to less than 4 years. They took a loan for a radio/television, amounting to 2697 credits, with savings of less than 100 DM. They have no other debtors/guarantors, own real estate, and are a single male aged 32. The individual has no other installment plans, owns their own house, and has one existing credit at the bank. They are a skilled employee/official with two dependents, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a history of delaying payments in the past. They are looking to finance a used car, with a credit amount of 4679. Their savings are less than 100 DM and they have been employed for 4 to 7 years. They have a moderate installment rate, are male and single, with no other debtors or guarantors. They have been residing in their current location for 3 years and own their housing. The individual is 35 years old, has no other installment plans, and holds 2 existing credits at the bank. They have an unskilled job, one person depending on them for maintenance, a registered telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been steadily employed for 1 to 4 years as a skilled employee. With a good credit history of repaying existing credits on time, they are seeking a car loan of 9277 for a used car. A male who is divorced or separated, living in a free housing with no other debts or guarantors. They have one existing credit at the bank, are 48 years old, and have been living at their current residence for 4 years. With no other installment plans, they are the sole provider for one dependent. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 43, with a stable job as a skilled employee/official. He has been living in his own home for 4 years and has no other debts or dependents. He has been employed at the same place for at least 7 years. Although he does not have a savings account, he does not have any other loans outstanding. He is looking to borrow a relatively small amount to buy a new car and has good credit history, despite some delays in paying off debts in the past. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a loan for a radio/television, amounting to 2333 DM. They have savings between 500 and 1000 DM and have been employed for at least 7 years. Their installment rate is 4% of disposable income. The person is a 30-year-old single male, with no other debtors or guarantors. They have lived in their current residence for 2 years and own a car or other property. Their job is in management or self-employment with high qualifications. They have one existing credit at this bank and no other liabilities to provide maintenance for. They have a bank installment plan, own their housing, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old divorced/separated/married female, with a stable job as an unskilled resident. They have been living in their current residence for 4 years and have 1 existing credit at the bank. Their existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. They have taken a loan of 4736 DM for the purpose of furniture/equipment. Their credit history shows a critical account/other credits existing elsewhere. They have no other debtors/guarantors and no telephone. They have a car or other property not specified in attribute 6, own their own house, and have no other installment plans. Their installment rate is 2% of disposable income, and they have one dependent. They are a foreign worker and do not have a telephone.###\nHence this label was No."
"This individual has a checking account with balance less than 0 DM and a credit history of delayed payments. They are seeking a loan for a radio/television. The credit amount requested is 1659 DM. They have savings of less than 100 DM and have been employed for less than a year. Their disposable income installment rate is 4%. They are a female who is divorced, separated, or married. There are no other debtors or guarantors involved. They have been residing at their current residence for 2 years and own a car or other property. At 29 years old, they have no other installment plans and rent their housing. They have one existing credit at this bank and work as an unskilled resident. They are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a female, divorced or separated, with no checking account. She has been employed for 1 to 4 years as a skilled employee/official. She has no other debtors or guarantors and owns her own home. She has one existing credit at the bank and has been living in her current residence for 1 year. She is 29 years old, has no other installment plans, and no savings above 100 DM. She is not listed as having a telephone, but is a foreign worker. She has a good credit history of existing credits paid back duly till now. The purpose of her credit is for a radio/television, with a credit amount of 518. She has a low installment rate in percentage of disposable income and is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual is a 22-year-old single male, working as a skilled employee/official. He has been employed for 1-4 years and has been living in his own property for 4 years. His existing checking account has less than 0 DM, with a savings account between 500 and 1000 DM. He has repaid all credits at the bank duly and currently has one credit with an installment rate of 4%. The purpose of his credit is for furniture/equipment, with a credit amount of 2828. He has no other debtors or guarantors, no other installment plans, and owns a telephone registered under his name. Additionally, he is a foreign worker with no one else to provide maintenance for.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM, with a credit history of no previous credits or all credits repaid on time. They are borrowing 1082 DM for a new car, with savings of less than 100 DM. Currently employed for 1 to less than 4 years, they have a low installment rate as a percentage of their income. A 48-year-old single male, they have no other debtors or guarantors, and have been living at their current residence for 4 years. They own a car or other property, have 2 existing credits at the bank, and work as a skilled employee or official. With one dependent, they have no telephone and are a foreign worker.###\nHence this label was No."
"The individual is a 24-year-old female who is divorced/separated/married. She has been employed for 4 to 7 years as a skilled employee/official. She has no savings account and owns a car. She has one existing credit at the bank and has paid back all credits duly till now. The purpose of the credit is for a new car, with a credit amount of 8487 DM. She has been residing at her current residence for 2 years and has no other debtors or guarantors. She has no other installment plans or telephone. She has an installment rate of 1% of disposable income and is a foreign worker. She is the sole provider for maintenance, with no dependent individuals.###\nHence this label was Yes."
"The individual has no checking account and has been paying existing credits on time. They are looking to purchase a radio/television, and they have a credit amount of 1552. Their savings are less than 100 DM and they have been employed for 4 to 7 years. They have a low installment rate and are a single male. They have no other debtors or guarantors. They have lived in their current residence for 1 year and own a car or other property. The individual is 32 years old, has a bank installment plan, and their housing is owned. They have one existing credit at the bank and are a skilled employee/official. They are liable to provide maintenance for 2 people and do not have a telephone. Lastly, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account balance of at least 200 DM and has been with the same employer for 1 to less than 4 years. They have paid back all credits at this bank on time. The purpose of the credit is for a radio/television. They have savings of at least 1000 DM and own real estate. The individual is a divorced/separated/married female, aged 42, with no other debtors or guarantors. They have no other installment plans, live in a rented house, and have 2 existing credits at this bank. The individual is a skilled employee/official with one dependent, does not have a telephone, but is a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a history of delaying payments in the past. They are looking to purchase a new car, for which they need a credit amount of 2032. Their savings amount is less than 100 DM and they have been employed for at least 7 years. With an installment rate of 4%, they are a single male, with no other debtors or guarantors. They have been living at their current residence for 4 years and have unknown/no property. At 60 years old, they have no other installment plans and live in housing for free. They have 2 existing credits at the bank, are a skilled employee/official, and have 1 person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 34-year-old divorced or separated or married female, who has been working for less than 1 year in a management, self-employed, highly qualified employee, or officer job. She has 0 to 200 DM in her existing checking account and less than 100 DM in savings. The purpose of the 3017 DM credit is for furniture or equipment. She has paid back existing credits duly, has no other debtors or guarantors, and has no other installment plans. She lives in a rented house with a 1-year residence history and owns real estate. Her installment rate is 3% of disposable income, and she has 1 existing credit at this bank. She is responsible for providing maintenance for 1 person and does not have a telephone. Additionally, she is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been paying back existing credits on time. They are looking to purchase a used car with a credit amount of 2445. Their savings account status is unknown and they have been employed for less than a year. With a low installment rate, they are a married/widowed male in their mid-twenties. They have no other debtors or guarantors, and have been residing at their current location for 4 years. They own a car or other property, are not involved in any other installment plans, and rent their current housing. They have one existing credit at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this example has a status of existing checking account with 0 to less than 200 DM, has been repaying credits promptly, and is looking to purchase furniture/equipment. They are seeking a credit amount of 918 DM and have savings of less than 100 DM. They have been employed for 1 to less than 4 years and allocate 4% of their disposable income towards installments. The person is a female who is divorced/separated/married, with no other debtors or guarantors. They have been living at their current residence for 1 year and own property in the form of a building society savings agreement or life insurance. At 30 years old, they have no other installment plans, own their housing, and have one existing credit at the bank. The individual is a skilled employee/official, with one person relying on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual in this data is a 23-year-old unemployed female who is divorced/separated/married. She has no existing debts or guarantors and has been living in a rented house for 4 years. She has one existing credit at the bank and no other installment plans. She is responsible for providing maintenance for one person. She does not have a telephone but is a foreign worker. Her credit history shows that she has paid back existing credits duly till now. She is looking to borrow 3758 DM to purchase a radio/television, and she has savings of 500-1000 DM.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and has a good credit history of repaying previous credits on time. They are borrowing 745 DM for the purpose of buying a radio/television. Their savings amount to less than 100 DM and they have been employed for 1 to 4 years. They have no other debtors or guarantors and have been residing at their current place for 2 years. They own real estate and are 28 years old, with no other installment plans. They live in their own house, have one existing credit at the bank, and work as an unskilled resident. They are divorced, separated, or married and have one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual is a 54-year-old single male with no checking account, looking for a business loan. He has a good credit history with existing credits paid back on time. He has savings of at least 1000 DM and has been employed for 1 to less than 4 years. He has no other debts or guarantors and owns his own home. He has 3 existing credits and works in a managerial position. He is responsible for providing maintenance for one person and has a registered telephone. Additionally, he is a foreign worker.###\nHence this label was No."
"This individual has a stable financial background with existing credits paid back on time, a moderate credit amount, and a savings account with a large balance. They have been employed for over 7 years, are single, and own real estate. With a good credit history and a skilled job, they have a responsible financial attitude and are likely to be a reliable borrower.###\nHence this label was Yes."
"This individual has no existing checking account and has been a part of their current employment for 1 to less than 4 years. They are seeking credit for education purposes, with a credit amount of 6110. Their savings account holds less than 100 DM, and they have been residing at their current residence for 3 years. The individual is a 31-year-old single male, with no other debtors or guarantors. They have no property, but their housing is for free. They have one existing credit at the bank and work as a skilled employee/official. The individual has one person they are financially responsible for, and they have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with no checking account, owning a radio/television. He has been repaying his existing credits on time. With a stable job as a skilled employee for 4-7 years, he has a moderate credit amount and some savings. He resides in his own house, has no other debts or guarantors, and no other installment plans. Being a foreign worker with no telephone, he is responsible for one person's maintenance. With no known property, he is 35 years old and considered to be a good credit risk.###\nHence this label was Yes."
"This individual is a 22-year-old married/widowed male, employed for less than a year as a skilled employee/official. He has one existing credit at the bank and is responsible for providing maintenance for one person. He has a checking account balance between 0 and 200 DM, savings between 100 and 500 DM, and pays his existing credits on time. The purpose of his credit is for a radio/television, with a credit amount of 3092 DM and an installment rate of 3%. He has no other debtors or guarantors, no other installment plans, and lives in a rented property with two years of residence. He owns a car or other property not specified and has a telephone registered under his name. Additionally, he is a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old single male with a stable job as an unskilled resident. He has a moderate credit amount of 2520 DM and a short credit history, with two existing credits at the bank. He has a modest savings amount of 500-1000 DM and has been living in his own residence for 2 years. He has no other debtors or guarantors, no other installment plans, and no telephone. However, he does have a foreign worker status.###\nHence this label was No."
"This individual, a 33-year-old divorced or separated or married female, has no existing checking account, unknown savings, and has been employed for 1 to less than 4 years. They have taken a credit for education purposes amounting to 1927 over a duration of 24 months. They have an installment rate of 3% and own a car or other property not specified. Living in their own residence for 2 years, they have no other installment plans and no debtors or guarantors. They are a skilled employee or official with 2 existing credits at the bank. They have a telephone registered under their name, are a foreign worker, and are liable for providing maintenance for one person.###\nHence this label was Yes."
"The individual is a single male, aged 35, working as a skilled employee/official. He has been at his current job for 1-4 years and has been living in his own real estate property for 2 years. He has one existing credit at the bank and no other installment plans. His existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. He has no telephone and one person to provide maintenance for. He has a good credit history with existing credits paid back duly. The purpose of his credit is for a radio/television, with a credit amount of 2576 DM. He has a guarantor and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has existing credits that have been paid back on time. They took a loan for a radio/television and have a credit amount of 1478. Their savings are less than 100 DM and they have been employed for 4-7 years. They have a low installment rate, are a single male, and have no other debtors/guarantors. They have been living in their current residence for 2 years and own a car or other property. At 22 years old, they have no other installment plans, no telephone, and no other existing credits at the bank. They are a skilled employee/official with one dependent. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account with 0 to 200 DM, has paid back existing credits duly, and is applying for a loan to purchase furniture/equipment. They have savings between 100 and 500 DM, have been employed for 1 to 4 years, and have a low installment rate. Their personal status is female, divorced/separated/married, with a co-applicant as a guarantor. They have been living at their current residence for 4 years, own a car or other property, and are 21 years old. They have no other installment plans, rent their housing, and have one existing credit at the bank. They work as a skilled employee/official and have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a current checking account balance between 0 and 200 DM. They have a credit history of delaying payments in the past and are looking to finance a radio or television. The credit amount they are seeking is 6403 DM. They have savings of less than 100 DM and have been employed for less than a year. Their installment rate is 1% of their disposable income. The individual is a single male, without any other debtors or guarantors. They have been living at their current residence for 2 years and own a car or other property not specified. At 33 years old, they do not have any other installment plans and live in their own house. They have one existing credit at their bank and work as a skilled employee or official. The individual is responsible for providing maintenance for one other person and does not have a telephone. They are also a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had a critical account/other credits existing in the past. They took out a loan for a radio/television and the credit amount is 2238. Their savings are less than 100 DM and have been employed for 1 to less than 4 years. They have a low installment rate, are female, divorced/separated/married, with no other debtors/guarantors. They have been living in their current residence for 1 year, own a car or other property not specified, and are 25 years old. They have no other installment plans, own their own home, have 2 existing credits at this bank, and are a skilled employee/official. They have 1 person they are financially responsible for and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a history of delaying payments. They are looking to purchase furniture/equipment with a credit amount of 960. They have savings of at least 1000 DM and have been employed for 4 to less than 7 years. Their disposable income installment rate is 3 and they are a female who is divorced/separated/married. They have no other debtors or guarantors and have been residing at their current residence for 2 years. Their property includes a building society savings agreement/life insurance. They are 30 years old with no other installment plans, own their own house, and have 2 existing credits at the bank. They are a skilled employee/official with 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a credit history of paying back existing credits on time, and wants a new car. They are looking to borrow 3931 DM and have savings of less than 100 DM. They have been employed for 4 to 7 years, have a moderate installment rate, are a single male, have no other debtors or guarantors, and have been living at their current residence for 4 years. They have unknown or no property, are 46 years old, have no other installment plans, and live in a free housing. They have one existing credit at the bank, are a skilled employee, and have 2 people they are responsible for providing maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual has no checking account and a credit history of critical accounts/other credits existing. They are looking to obtain a new car with a credit amount of 10127 units. They have savings between 500 and less than 1000 DM, and have been employed for 1 to less than 4 years. With an installment rate of 2%, they have no other debtors or guarantors. The individual has been residing at their current residence for 2 years and has unknown/no property. Aged 44, the individual is a single male with a skilled job and no other installment plans, living in a free housing arrangement. They have one existing credit at this bank and are liable for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual has a checking account with balance >= 200 DM and has been in their current job for at least 7 years. They have no savings account but have successfully paid back existing credits. The purpose of the credit is for a radio/television. They are a single male, aged 37, with no other debtors or guarantors. They own their own home and have no other installment plans. The individual works in a high-level job, with only one existing credit at the bank. They have been living at their current residence for 3 years and have no telephone. The individual is a foreign worker and has one person dependent on them.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They took a loan for domestic appliances, amounting to 1338 units. They have savings of 500 to 1000 DM and have been employed for 1 to 4 years. The installment rate is 1% of disposable income. The person is a 62-year-old male who is divorced/separated. They have no other debtors or guarantors and have been living in their own real estate property for 4 years. They have no other installment plans, one existing credit at the bank, and work as a skilled employee/official. The individual is liable for providing maintenance for one person and does not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM, and has had this account for over 7 years. They have a good credit history with critical account/other credits existing. The purpose of their credit is for a new car, and the credit amount is 4843 DM. They have savings of less than 100 DM. The individual is a 43-year-old single male, with one co-applicant as a debtor/guarantor. They have been living in their current residence for 4 years, which is a rented property. They have no other installment plans, and their housing is a building society savings agreement/life insurance. They are a skilled employee/official with 2 existing credits at this bank. They have one dependent and own a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of less than 0 DM and has been employed for less than a year. They took a loan for a new car, with a credit amount of 1361 DM, to be repaid in 6 months with an installment rate of 2%. They have savings of less than 100 DM and own real estate for housing. The person is a 40-year-old single male with no other debtors or guarantors. They have no other installment plans and work in an unskilled resident job. They have been living at their current residence for 4 years and are liable for maintaining 2 people. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history, a stable job, and a savings account with a moderate amount of money. They have been at their current job for 1 to 4 years and have no other debts or guarantors. They live in a residence for free and have been at the same place for 4 years. With a single male status, they have a phone registered in their name and are a foreign worker. They are 47 years old, have one existing credit at the bank, and are responsible for providing maintenance for two people. The purpose of their recent credit application was for education, with a credit amount of 12612 DM to be repaid over 36 months with a low installment rate. Their property ownership status is listed as unknown/no property.###\nHence this label was No."
"This individual has no checking account and has a good credit history of paying back all credits at the bank duly. They took a loan for a new car, amounting to 6458. Their savings are below 100 DM and they have been employed for at least 7 years. They have a low installment rate, indicating good financial planning. The person is a 39-year-old single male with no other debtors or guarantors. They have been living in their own residence for 4 years and have an unknown property status. The individual has two existing credits at this bank and holds a managerial or highly qualified job. They are responsible for providing maintenance for two people, have a telephone registered under their name, and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been employed for 7 or more years. They are applying for a new car loan amounting to 6614 DM, with a savings account balance of less than 100 DM. The person is a 34-year-old single male with no other debtors or guarantors, owning their own home. They have been living at their current residence for 4 years and have a good credit history, with two existing credits at this bank. The individual has a management or self-employed job and is responsible for providing maintenance for one person. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has had existing credits paid back duly till now. They are taking out a loan for a new car, with a credit amount of 1207. Their savings account/bonds hold less than 100 DM. They have been employed for less than 1 year and dedicate 4% of their disposable income to paying off installments. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been residing at their current place for 4 years and have a building society savings agreement/life insurance. At 24 years old, they have no other installment plans, rent their housing, and have one existing credit at the bank. The individual is a skilled employee/official, with 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a single male, aged 25, who has been employed for 1 to 4 years as a skilled employee/official. He has a good credit history, no other debtors/guarantors, and owns a car or other property. His existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. He has one existing credit at the bank, and has resided in his current home for 2 years. His credit amount is 14421, with an installment rate of 2%. He has no other installment plans, and his housing situation is own. He has a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history. They took a loan of 1924 credits for the purpose of purchasing a radio/television. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. Their living situation is in their own home, and they have no other debts or installment plans. They are a 38-year-old single male, skilled in their job, with one existing credit at the bank. They have been living in their current residence for 4 years and are the sole provider for one dependent. They have a telephone registered under their name and are not a foreign worker.###\nHence this label was Yes."
"This individual is a 27-year-old single male with a job as an unskilled resident. He has been with his current employer for 1 to 4 years and has no other debtors or guarantors. He has no savings account and owns a real estate property where he has been living for 1 year. He has one existing credit at the bank and no other installment plans. He does not have a telephone but is a foreign worker. He is looking to borrow 7418 DM for a radio/television, with a duration of 60 months. He has a good credit history but has had delays in paying off debts in the past.###\nHence this label was Yes."
"This individual has no checking account and unknown savings account. They have been employed for 1 to less than 4 years and have a low installment rate on their disposable income. They are a married/widowed male, residing in their own house for 2 years. Their credit history shows critical accounts/other existing credits. The purpose of the credit is for furniture/equipment, with a credit amount of 1221. They have no other debtors/guarantors, no other installment plans, and no telephone. They have 2 existing credits at the bank, are a skilled employee/official, and have one person liable for maintenance. They have a building society savings agreement/life insurance property and are a foreign worker. Overall, this individual appears to be a responsible credit risk.###\nHence this label was Yes."
"This individual has no checking account and an unknown savings account. They have been employed for at least 7 years as a skilled employee/official. The purpose of their credit is for a radio/television. They have one existing credit at this bank and own their own home. They are a single 47-year-old male with no other debtors or guarantors. They have been living in their current residence for 1 year and have a telephone registered under their name. In terms of credit, the individual has a critical account with other existing credits and is looking to borrow 3578 credits with a 4% installment rate. Additionally, they have no other installment plans, are responsible for providing maintenance for one person, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for at least 7 years, are single, and own a car or other property. They are a skilled employee, are 40 years old, and have 2 dependents. Their credit history is considered critical, and they are borrowing to purchase a radio or television. They have 2 existing credits at this bank, with an installment rate of 3%. They have been residing at their current residence for 2 years and have a telephone registered under their name. Additionally, they have no other debtors or installment plans, and are a foreign worker.###\nHence this label was Yes."
"The individual is a single male in his late 20s, working as a skilled employee with 4-7 years of employment history. He has a good credit history with existing credits paid back on time. He is looking for a small loan to buy a radio or television, and he has some savings. He owns real estate, has been living at his current residence for 3 years, and has 2 existing credits at the bank. He has no other debts or installment plans, and no one else is financially dependent on him. He does not have a telephone and is not a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM and has a good credit history of repaying existing credits on time. They are seeking a car loan with a credit amount of 5493. They have some savings (< 100 DM) and have been employed at their current job for at least 7 years. With a low installment rate, they have no other debts or guarantors. The individual is a 42-year-old single male with no other installment plans, living in a residence for free with 4 years of present residence. They have one existing credit at the bank, a skilled job, and two dependents. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a skilled female, divorced/separated/married, aged 28, with a stable job and a good credit history. She has a moderate credit amount for a new car, with savings between 100 and 500 DM. She has no other debtors or guarantors, and lives in a rented house. She has been living at her current residence for 4 years and has a telephone registered under her name. She has two existing credits at the bank, and one person to provide maintenance for. She has no other installment plans, and is a foreign worker.###\nHence this label was No."
"This individual is a 21-year-old female who is divorced/separated/married. She has no checking account and unknown/no savings account. She has been employed for 1 to less than 4 years as a skilled employee/official. She owns a car or other property. She has 1 existing credit at the bank and pays back her credits on time. She has a good credit history and no other debtors/guarantors. She lives in her own home with one dependent. She does not have any other installment plans or a telephone. She is a foreign worker and is not liable to provide maintenance for anyone else. She took a credit worth 886 for the purpose of buying a radio/television with an installment rate of 4% of her disposable income.###\nHence this label was Yes."
"This individual is a male, single, aged 27, with no existing checking account. They have been employed for 1 to 4 years and have a good credit history with other credits existing. The purpose of their credit is for business. They have savings between 100 and 500 DM, own a building society savings agreement/life insurance, and reside in their own home. Their credit amount is 4139, with an installment rate of 3% of disposable income. They have no other debtors/guarantors, installment plans, or existing credits at this bank. They have 1 person to provide maintenance for, work as an unskilled resident, have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM, has a credit history of existing credits paid back duly till now, and is looking to borrow money for furniture/equipment. They have savings of at least 1000 DM, been employed for at least 7 years, and have a stable living arrangement. With a good credit amount of 3622, they have no other debtors or guarantors. This individual is a 57-year-old female who is divorced/separated/married, with no other installment plans or debts. They live in a rented house, have two existing credits, and work as a skilled employee/official. With one person liable for maintenance, they have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a modest amount of money in their checking account and a small amount of savings. They have been employed for 1 to 4 years and have a good credit history with no prior credits. The credit is for a business purpose and the amount is 4241 DM to be paid back over 24 months with a low installment rate. The person is a 36-year-old single male, living in their own real estate property for the past 4 years. They have no other debts or installment plans, and their job is classified as unskilled-resident. They have one dependent, own a telephone, and are a foreign worker.###\nHence this label was No."
"This individual is a 28-year-old male, married or widowed, with a skilled job and 1 person dependent on him for maintenance. He has been living in his own real estate property for 4 years. His existing checking account balance is between 0 and 200 DM. The credit history indicates a critical account or other existing credits elsewhere. The purpose of the credit is for business, with a credit amount of 1887 DM. He has unknown or no savings account and has been employed for 1 to 4 years. The installment rate is 4% of his disposable income. He has no other debtors or guarantors and no telephone. He has 2 existing credits at the bank and uses a bank for other installment plans. Despite not having a savings account, he is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance between 0 and 200 DM, has a good credit history, and is looking to finance a radio/television purchase. They have savings between 100 and 500 DM, have been employed for 1 to 4 years, and have a low installment rate. The person is a 21-year-old single male with a guarantor for other debts. They have been living at their current residence for 4 years and have a building society savings agreement. They have no other installment plans, rent their housing, and have a skilled job. The individual has one existing credit at this bank and is responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a low checking account balance, has had critical accounts or other credits in the past, and is looking to finance a new car. They have a moderate credit amount of 3905 and some savings. They have been employed for 1 to 4 years, with a stable income and a low installment rate. This person is a 36-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. With two existing credits at the bank, they are a skilled employee with two dependents. They rent their housing, do not have any other installment plans, and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 23-year-old divorced/separated/married female who has been employed for less than a year as a skilled employee/official. She has a credit history of paying back existing credits duly. She has a savings account with less than 100 DM and owns a building society savings agreement/life insurance property. She has one existing credit at the bank, is the sole provider for one person, does not have any other debtors/guarantors, installment plans, or a telephone. She does not have any other dependents. She is a foreign worker and is seeking credit for furniture/equipment, with a credit amount of 1275 and an installment rate of 4%.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and has a credit history of repaying existing credits on time. They are taking a loan for a radio/television, amounting to 5848 DM. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have no other debtors or guarantors. This person is a 24-year-old single male, living in their own house. They have one credit at the bank and work as a skilled employee/official. They have no other installment plans, own a car or other property not specified, and have been living at their current residence for 1 year. They are the sole provider for one person and are a foreign worker without a telephone.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of repaying existing credits on time. They are taking a loan for furniture/equipment, with a credit amount of 1543. Their savings account holds at least 1000 DM. They have been employed for 1 to 4 years. With a 4% installment rate, they are a divorced/separated male, with no other debtors or guarantors. They have been residing in their own real estate for 2 years and are 33 years old. They have no other installment plans, one existing credit at the bank, and are a skilled employee. With one dependent, they do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 34-year-old single male, who has been employed for over 7 years. They do not have a checking account, but have a savings account with a balance between 100 and 500 DM. Their credit history shows that they have paid back all credits at the bank duly. The purpose of their credit is for a radio/television. They have one existing credit at the bank and reside in their own property for 4 years. They have no other debtors or guarantors, and their housing situation is classified as owning. Their job is categorized as unskilled-resident, and they have 2 people they are liable to provide maintenance for. They have no telephone, but are a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced/separated/married and is a skilled employee/official. She has been working at her current job for 1 to less than 4 years. She owns a real estate property and has been living at her current residence for 4 years. She has 1 existing credit at the bank and no other debts or guarantors. She does not have any other installment plans or a telephone. She is responsible for providing maintenance for 1 person. She is a foreign worker. Her existing checking account balance is between 0 and less than 200 DM, with savings of less than 100 DM. She is taking a credit for furniture/equipment, with a duration of 8 months and a credit amount of 1237 DM. Her installment rate is 3% of her disposable income and she is 24 years old.###\nHence this label was No."
"This individual has no existing checking account and has been repaying their credits on time. They are seeking a loan for education, amounting to 1819 credits. They have savings of less than 100 DM and have been employed for 1 to 4 years. With a single status, they have no other debtors or guarantors. They have been residing in their current location for 4 years, own unknown/no property, and are 37 years old. They have one existing credit at the bank and work as a skilled employee. With one dependent, they live in housing for free. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a skilled female employee, aged 37, who is divorced/separated/married. She has been employed for over 7 years and owns a house. She has a good credit history with other credit accounts, and her existing checking account balance is between 0 and 200 DM. She is looking to finance furniture/equipment with a credit amount of 3612 DM. She has savings of less than 100 DM and no other installment plans or debtors/guarantors. She has been living in her current residence for 4 years and has one existing credit at the bank. She has a low installment rate in terms of disposable income (3%) and is the sole provider for one person. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has never taken any credits before or has always paid them back on time. They are looking to finance a used car, with a credit amount of 9436. Their savings account status is unknown. They have been employed for between 1 and 4 years and have a low installment rate in percentage of disposable income. The individual is a single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own their own home. This person is 39 years old, has no other installment plans, and holds a building society savings agreement or life insurance. They have one existing credit at the bank, are an unskilled resident in terms of job status, and have 2 dependents. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a 23-year-old female, divorced or separated or married, with less than 1 year of employment. She has a good credit history with existing credits paid back duly. She is looking to buy a new car and needs a credit of 836 DM. She has savings between 100 and 500 DM and no other debtors or guarantors. She has been living in her own house for 2 years and has one existing credit at the bank. She works as an unskilled resident, has no telephone, and is a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM and has a credit history of repaying existing credits on time. They took a loan for a radio/television for 12 months with a credit amount of 1881 DM. Their savings are less than 100 DM and have been employed for 1 to 4 years. They are a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 2 years and own a car or other property. They are 44 years old, have no other installment plans, and rent their housing. They have one existing credit at the bank, work as an unskilled resident, and have one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
