"This individual has no checking account and a credit history classified as critical account/other credits existing. They are seeking a loan for education, with a credit amount of 6110. Their savings account holds less than 100 DM, and they have been employed for 1 to less than 4 years. They have a low installment rate in percentage of disposable income. The individual is a 31-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 3 years and have unknown/no property. Their other installment plan is through a bank, and they live in a free housing situation. They have one existing credit at this bank and work as a skilled employee/official. They are responsible for providing maintenance for one other person. The individual has a telephone registered in their name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and is currently unemployed. They have a good credit history with existing credits paid back duly. The purpose of the credit is for business, and the credit amount is 4844. Their savings are less than 100 DM and they have a low installment rate of 3% of disposable income. The individual is a 33-year-old single male, with no other debtors or guarantors.\nThey have been living in their current residence for 2 years and own a car or another type of property not specified. The individual works in a high-level job such as management, self-employment, or a highly qualified employee/ officer. They have one existing credit at the bank and one person to provide maintenance for. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"This individual does not have a checking account and has a good credit history, albeit with delays in past payments. They are seeking a loan for a used car, with a moderate amount of 1503 in credit. Their savings are less than 100 DM. They have been employed for 1 to 4 years and have a moderate installment rate. The individual is a 41-year-old married/widowed male, with no other debtors or guarantors. They have been residing in a rented property for 4 years and own real estate. This person has no other installment plans, one existing credit at the bank, and is a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a decent amount of money in their checking account, has been employed for 1-4 years, and has a good credit history with existing credits in critical accounts. They are borrowing money for a non-specific purpose with a relatively large credit amount. They have some savings, no other installment plans and live in their own home. They are a single male with a co-applicant, 39 years old, and have two dependents. They have a car or other property, hold a management position, and have a registered telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a married/widowed male, more than 31 years old, with a stable job and over 7 years of employment history. He has no other debtors, owns a car or other property, and has been residing in his current home for 4 years. He has 2 existing credits at the bank and is responsible for providing maintenance for 1 person. His checking account balance is between 0 and 200 DM, with savings between 100 and 500 DM. He is borrowing 6148 DM for a used car, with an installment rate of 3% of his disposable income. He has a telephone registered under his name, follows all his credit obligations, and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a history of delays in paying off debts. They are seeking a loan for furniture/equipment, with a credit amount of 7678. They have savings between 500 and 1000 DM, and have been employed for 4 to 7 years. Their installment rate is 2% of disposable income. The individual is a 40-year-old divorced/separated/widowed female. They have no other debtors or guarantors and have been residing at their current residence for 4 years. They own a car or other property, have no other installment plans, and live in their own home. They have 2 existing credits at the bank and work as a skilled employee/official. They provide maintenance for one person, have a registered telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for less than a year and have paid back existing credits on time. The purpose of the credit is for a new car. They are a 54-year-old single male, living in their own home. They have one existing credit at the bank, no other debtors/guarantors, and no other installment plans. Their job is a skilled employee/official, with one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual in this example has no checking account and has a credit history of a critical account/other credits existing. They are seeking a loan for the purpose of purchasing a radio/television. The credit amount requested is 1544. Their savings account/bonds have a balance of less than 100 DM. They have been employed for 4 to 7 years and their installment rate is 2% of disposable income. The individual is a single male, has no other debtors/guarantors, and has been residing in their current residence for 1 year. They own real estate and are 42 years old. They have no other installment plans, own their housing, and have 3 existing credits at this bank. The individual is an unskilled resident with 2 people liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and is currently unemployed. They have a critical credit history with other existing credits, and have a good credit amount of 2406 for purchasing furniture/equipment. Their savings account holds less than 100 DM. Being a single male, aged 31 and owning a car or other property, they have no other installment plans and reside in their own house for 3 years. With one existing credit at this bank, they work in a high-ranking job and are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been repaying existing credits on time. They are looking to finance furniture/equipment with a credit amount of 1533. They have savings of less than 100 DM and have been employed for less than a year. The installment rate is 4% of disposable income. The individual is a married or widowed male, with a co-applicant as another debtor. They have been living in their current residence for 1 year and own property in a building society savings agreement or life insurance. At the age of 43, they have no other installment plans and own their own home. They have one existing credit at their bank and work as an unskilled resident. They have 2 dependents and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a single male with a stable job, having been in current employment for over 7 years. They live in their own home and have been at their present residence for 3 years. With no other debtors or guarantors, they have a good credit history and possess a building society savings agreement/life insurance. Their existing checking account has a balance of less than 0 DM, while their savings are below 100 DM. The purpose of their credit is for a new car, with a credit amount of 691. They have no other installment plans, no telephone, and are a foreign worker. They have two existing credits at the bank, with an installment rate of 4% of disposable income. At 35 years old, they are a skilled employee/official with one person dependent on them for maintenance.###\nHence this label was No."
"This individual is a divorced or separated or married female, aged 61, who has been employed for 4 to 7 years. She has no checking account or savings account, owns a car or other property, and has no other installment plans. She has one existing credit at the bank and no other debtors or guarantors. She has been living at her current residence for 2 years and has no telephone. She works as a skilled employee/official and is a foreign worker. She is seeking credit for education, with a credit amount of 2012 to be repaid in 12 months.###\nHence this label was Yes."
"This individual has a stable financial standing with a checking account balance between 0 and 200 DM, savings between 500 and 1000 DM, and a credit amount of 2366. They have a history of critical accounts and existing credits, but not at this bank. The purpose of the loan is for a new car. The individual is a divorced or separated male, aged 36, with no other debtors or guarantors. They have been employed for 4 to 7 years in a managerial or highly qualified position. The individual owns their own home, has one existing credit at the bank, and has been living at their current residence for 3 years. They have no other installment plans, one dependent, a registered telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for more than 7 years. They have paid back all previous credits at the bank duly. The purpose of the current credit is for a radio/television. They have savings between 100 and 500 DM. They have a single status, male, and no other debtors or guarantors. They have been living at their current residence for 4 years and own a car or other property. They have one existing credit at the bank and work as an unskilled resident. They are liable to provide maintenance for 2 people. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is unemployed and does not have a checking account or savings. They are single, male, and own their own home. They are 38 years old and have been residing at their current address for 4 years. Their credit history shows critical accounts/other existing credits. The purpose of their credit is for a used car. They have no other debtors/guarantors and no other installment plans. They have one existing credit at the bank, and their job falls under management/self-employed/highly qualified employee/officer category. They have one dependent and a telephone registered under their name. They are also a foreign worker.###\nHence this label was Yes."
"The individual is a single male, aged 37, with a stable job as an unskilled resident. He has been living in his own house for 2 years. His existing checking account has a balance between 0 and 200 DM, with savings of less than 100 DM. He has one existing credit which has been paid back duly. The purpose of his current credit application is for furniture/equipment, amounting to 1922 DM. He has no other debtors/guarantors and no other installment plans. He has been employed for 1 to 4 years, with a 4% installment rate based on disposable income. He has no telephone but is a foreign worker. Additionally, he has a building society savings agreement/life insurance and is liable to provide maintenance for one person.###\nHence this label was No."
"This individual has a stable credit history with existing credits paid back duly. They are looking to purchase furniture/equipment with a credit amount of 2359. Their savings fall between 100 and 500 DM. Currently unemployed, they have been in their present residence for 1 year. A male who is divorced/separated, they have no other debtors or guarantors. They own their own home and have one existing credit at this bank. A skilled employee/official, aged 33, they have no other installment plans and no telephone. They are a foreign worker with one person liable for maintenance.###\nHence this label was No."
"This individual has no checking account and unknown savings. They have been employed for 1 to less than 4 years as a skilled employee/official. The purpose of the credit is for a radio/television. They have a moderate credit amount of 1169 with a duration of 18 months. Their existing credit history is critical, and they have 2 existing credits at this bank. They are a single male, 29 years old, owning a home, with no other debtors or guarantors. They have been living in their current residence for 3 years and have no other installment plans. They have a moderate installment rate, with no other liabilities for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is currently unemployed and has a moderate credit amount of 3590 DM. They have no existing debtors or guarantors, and own a car or other property. The individual is male, married or widowed, and has been residing at their current residence for 3 years. They have 3 existing credits at the bank and are responsible for providing maintenance for 2 people. The person is 40 years old, has a checking account with a balance between 0 and 200 DM, and savings of less than 100 DM. They have no other installment plans and their only current job is listed as unemployed/unskilled - non-resident. The individual has a telephone registered under their name and is a foreign worker. Their credit history shows a critical account with other existing credits outside of this bank, and they have specified the purpose of their credit as business.###\nHence this label was Yes."
"The individual has no checking account and his credit history is considered critical with other existing credits. He is taking a new car loan for 1455 DM, with savings of less than 100 DM. Currently employed for 4 to 7 years, with a moderate installment rate of 2% of disposable income. A 42-year-old single male, residing in his own real estate property for the past year. He has no other debtors, no other installment plans, and no telephone. He has 3 existing credits at this bank and works as an unskilled resident. He is liable for providing maintenance to 2 individuals and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM and has been at their current job for less than a year. They took a 6-month loan for a new car, with a credit amount of 1361. Their savings account has less than 100 DM. They have no other debts or guarantors. They currently reside in their own real estate property for the past 4 years. The individual is a 40-year-old single male, working as an unskilled resident. They have one existing credit at the bank and two people dependent on them for financial support. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of a critical account or other credits existing elsewhere. They are borrowing for education, with a credit amount of 2096. Their savings are less than 100 DM and they have been employed for 4 to 7 years. The installment rate is 2% of disposable income. They are a single male, 49 years old, with no other debtors or guarantors. They have been residing in their own real estate for 3 years and have no other installment plans. They have one existing credit at this bank and work as an unskilled resident. They have 2 dependents and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"The individual is a 21-year-old single male, working in an unskilled resident job for 1 to less than 4 years. He has a checking account balance of less than 0 DM and has been living in his current residence for 4 years. He has no savings or other installment plans, but has one existing credit at the bank. He pays his existing credits on time and has no other debtors or guarantors. His credit amount is 1987, with an installment rate of 2% of his disposable income. He lives in a rented house and has real estate property. He is responsible for providing maintenance for 2 people and is a foreign worker. He does not have a telephone.###\nHence this label was No."
"This individual has no checking account and has a good credit history, with existing credits paid back on time. They are taking a loan for a radio/television, with a credit amount of 1901. Their savings amount is between 100 and 500 DM, and they have been employed for 1 to 4 years. The installment rate is 4% of their disposable income. They are a single male, with no other debtors/guarantors, and have been living at their current residence for 4 years. They own a car or other property and are 29 years old. They have no other installment plans, live in a rented house, and have one existing credit at the bank. Their occupation is in management/self-employment/highly qualified employee/officer category, and they are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM. They have a good credit history with no previous credits and have always paid back loans on time. The purpose of their current loan is for business. They are borrowing a credit amount of 6289. Their savings are less than 100 DM. They have been employed for less than a year. The installment rate is 2% of their disposable income. The individual is a 33-year-old divorced/separated male. They have no other debtors or guarantors. They have lived at their current residence for 1 year and own property in a building society savings agreement/life insurance. They have no other installment plans and own their own home. They have two existing credits at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a mature, single male with no checking account, unknown savings, and no property. He has been employed for over 7 years in an unskilled resident job. His credit history is critical, with no other debts at this bank. He has one existing credit, pays 4% of his disposable income as installment, and has been living in a rental property for 4 years. With no other installment plans, he has no other debtors or guarantors. Despite not having a telephone, he is a foreign worker and has no one else dependent on him financially. He is seeking credit for a business purpose in the amount of 1264 for a duration of 12 months.###\nHence this label was Yes."
"The individual has no checking account and has been paying existing credits back on time. They are looking to finance a radio/television, with a credit amount of 2397. They have savings between 500 and 1000 DM, have been employed for at least 7 years, and have a low installment rate. The person is a 35-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 2 years and own a car or other property. They have a bank installment plan, own their own home, and have two existing credits at this bank. The individual is a skilled employee or official, with one dependent. They have a registered telephone and are a foreign worker.###\nHence this label was No."
"This individual has no existing checking account and has a credit history of critical accounts or other credits existing elsewhere. The purpose of the credit is for a used car, with a credit amount of 5804. They have savings of at least 1000 DM and have been employed for 1 to less than 4 years. Their installment rate is 4% of disposable income. The individual is a 27-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. They have no other installment plans and their housing status is owned. They have 2 existing credits at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a critical account with existing credits. They are looking to finance furniture/equipment with a credit amount of 1402. They have savings between 500 and 1000 DM and have been employed for 4 to 7 years. Their installment rate is 3% of disposable income. They are a divorced/separated/married female, have no other debtors or guarantors, and have been living in their current residence for 4 years. They own a car or other property not specified. At 37 years old, they have no other installment plans and rent their housing. They have one existing credit at the bank, a skilled job, and one person they provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 55-year-old single male, working as a skilled employee with 4 to 7 years of employment history. He has no checking account but holds a building society savings agreement/life insurance. His credit history shows that he has paid back existing credits duly. The purpose of his credit is for a used car, with a credit amount of 1413. He has savings of >= 1000 DM and no other installment plans. He owns his own house, has been living at his current residence for 2 years, and has one existing credit at the bank. He has no other debtors/guarantors, no other people dependent on him for maintenance, no telephone, and is not a foreign worker.###\nHence this label was Yes."
"This individual is a 30-year-old divorced or separated or married female who has been employed for less than a year as a skilled employee/official. They own a car or other property and have been living at their current residence for 1 year. They have no other debtors/guarantors, no other installment plans, and no telephone. They have 2 existing credits at the bank and are responsible for providing maintenance for one person. They are a foreign worker with no credits taken before, all credits paid back duly. They are seeking a new car with a credit amount of 8358, with savings between 500 and 1000 DM. Their installment rate is 1, and they have no existing checking account balance between 0 and 200 DM.###\nHence this label was Yes."
"This individual has a status of existing checking account with less than 0 DM, has a credit history of repaying existing credits on time, and is looking to purchase a new car. They have a moderate credit amount of 1721 DM and savings of less than 100 DM. Currently employed for less than a year, their disposable income installment rate is 2%. They are a 36-year-old single male with no other debtors or guarantors. They have been living in their own real estate property for 3 years and have one existing credit at the bank. As a skilled employee, they are the sole provider for one dependent. They do not have any other installment plans, own a landline phone, and are a foreign worker.###\nHence this label was Yes."
