"This individual has no checking account and an existing credit history of paying back credits on time. They are looking to finance a used car with a credit amount of 5248. They have no savings account and have been employed for 1 to less than 4 years. Their personal status is a single male, with no other debtors or guarantors. They have been living at their current residence for 3 years and own their own home. The individual is a skilled employee/official, aged 26, with no other installment plans. They have one existing credit at the bank and are liable to provide maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated female, aged 31, with no checking account and a credit history of consistently repaying existing loans. She has been working at her current job for 4 to 7 years as an unskilled resident. Her credit purpose is for furniture/equipment, and she has a small credit amount of 1736. She has savings of less than 100 DM, no other installment plans, and no other debtors or guarantors. She owns her own home and has been residing there for 4 years. She has one existing credit at the bank and one person to provide maintenance for. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and is looking to finance a new car. They have a stable employment history of 1 to 4 years and a good credit history of paying back existing credits on time. The credit amount requested is relatively low at 1101. They have savings of less than 100 DM and no other debts or guarantors. The individual is a married or widowed male, aged 27, and owns their own home. They have two existing credits at a bank and work as a skilled employee or official. The individual has one person they are financially responsible for and has a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a single, unemployed male in his mid-30s, with 2 dependents. He has a good credit history with all previous credits paid back on time. He is looking for a new car and has a moderate amount of savings. He currently owns his own home and has a stable job in a management or highly qualified position. He has one existing credit at the bank and a telephone registered under his name. Additionally, he is a foreign worker.###\nHence this label was No."
"This individual is a single male, aged 30, with a credit history of delayed payments in the past. He has a checking account with a balance between 0 and 200 DM, and savings between 100 and 500 DM. He has been employed for less than a year in a management position and has two existing credits at the bank. The purpose of his credit is for a radio/television, with a credit amount of 1919 DM. He has no other debtors or guarantors, no installment plans besides for stores, and owns his own home. He has been residing at his current residence for 3 years and is responsible for providing maintenance for one person. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a stable financial standing with a checking account balance of less than 0 DM and savings of less than 100 DM. They have been employed for less than a year and have a good credit history of repaying all credits. The purpose of their loan is for furniture/equipment. With a credit amount of 6872, they have a low installment rate relative to their disposable income. As a divorced/separated male, they have no other debtors or guarantors. They live in their own home, have one existing credit, and work as a skilled employee/official. At 55 years old, they have been residing at their current residence for a year. Additionally, they have a telephone in their name and are a registered foreign worker.###\nHence this label was No."
"This individual has less than 0 DM in their checking account, has a good credit history with existing credits paid back duly, and is looking to purchase domestic appliances. They have savings of less than 100 DM, have been employed for 1 to less than 4 years, and have a moderate installment rate. The person is a 54-year-old single male, has no other debtors or guarantors, and has been residing in their current residence for 4 years. They own their own home and have one existing credit at the bank. The individual is a skilled employee/official with one dependent, does not have any other installment plans, and does not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a skilled female employee, divorced/separated/married, aged 42, with a stable job held for over 7 years. She has a good credit history with existing credits paid back duly, and no other debtors or guarantors. She owns a car or other property, lives in her own residence for 4 years, and has no other installment plans. She has a savings account/bonds status of unknown/no savings account, and a checking account balance between 0 and 200 DM. She has one existing credit at the bank and is liable to provide maintenance for one person. She has a telephone registered under her name, is a foreign worker, and the purpose of the credit amount of 5084 is for radio/television.###\nHence this label was Yes."
"The individual has no existing checking account and has a good credit history with all previous credits paid back duly. They are taking a loan for repairs, with a credit amount of 2613. Their savings are less than 100 DM, and they have been employed for 1 to less than 4 years. They have a moderate installment rate in percentage of disposable income. The individual is a 27-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. They have no other installment plans, own their own home, and have 2 existing credits at this bank. The individual is a skilled employee/official and is responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account, with a good credit history despite delays in the past. They are taking out a loan to purchase a new car, with a relatively high credit amount. They have some savings, have been employed at the same place for at least 7 years, and have a low installment rate for repayment. The applicant is a single male, with no other debtors or guarantors. They have been living at their current residence for 4 years and own a car or other property. At 42 years old, they have no other installment plans and own their own home. They have 4 existing credits at their bank, a high-ranking job, and are responsible for providing maintenance for one person. The individual has a telephone registered under their name, and is a foreign worker.###\nHence this label was No."
"The individual is a female, divorced/separated/married, aged 25, with a stable job as a skilled employee/official and has been at the current employment for at least 7 years. She owns a car or other property, lives in her own home for the past 4 years, and has no other debtors or guarantors. She has one existing credit at the bank and no other installment plans. She does not have a telephone but is a foreign worker. Her existing checking account balance is between 0 and 200 DM, with unknown/no savings account. She is looking to borrow a credit amount of 2991 for the purpose of purchasing a radio/television.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are taking a 24-month loan for a new car, with a credit amount of 1525. They have savings of at least 1000 DM and have been employed for 4 to 7 years. The installment rate is 4% of disposable income. The applicant is a divorced/separated/married female, with no other debtors or guarantors. They have been living in their current residence for 3 years and own a car or another property. Aged 34, they have no other installment plans, own their housing, and have one existing credit at the bank. The individual is a skilled employee/official, responsible for providing maintenance for two people. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with a moderate amount in their checking account. They have a good credit history and are looking to make a small loan for a radio/television purchase. They have some savings and have been employed for 1-4 years. With a low installment rate, they seem financially responsible. The individual is a divorced/separated/married female with a guarantor for other debts. They own real estate and have lived at their current residence for 4 years. At 49 years old, they have no other major financial commitments. They have a stable job as a skilled employee/official. With a telephone registered in their name and being a foreign worker, they appear reliable for the loan.###\nHence this label was Yes."
"This individual is a single male in his early twenties with a stable job as a skilled employee. He has been living in his own property for four years and has one existing credit at the bank. His checking account balance is less than 0 DM, and he has been employed for 1-4 years. He has a good credit history of repaying all credits at the bank duly. The purpose of his current credit is for furniture/equipment, with a credit amount of 2828. He has savings between 500 and less than 1000 DM, and his installment rate is 4% of disposable income. He has no other debtors/guarantors and no other ongoing installment plans. He has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"The individual in this dataset has no checking account and has a stable employment history of 1 to 4 years. They are seeking credit for a new car, with a moderate credit amount of 1028. Their savings are less than 100 DM and they have no other significant debts or installment plans. The individual is a 36-year-old divorced/separated/married female, living in their own real estate property for 3 years. They have a stable job as a skilled employee/official and one person dependent on them for maintenance. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 52-year-old divorced/separated/married female who has no checking account, unknown savings, and no property. She has been employed for over 7 years in a management/highly qualified position and has no other debtors or guarantors. She lives in a residence for free, has one existing credit at the bank, and is responsible for one person's maintenance. She has a telephone registered in her name and is a foreign worker. This individual has a good credit history with existing credits paid back duly and is looking to borrow 2133 for a new car over a 12-month period, with an installment rate of 4% of disposable income.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history of paying back existing credits on time. They are looking to finance a new car, with a credit amount of 2507. Their savings account/bonds hold between 500 and 1000 DM. They have been employed for at least 7 years and have a low installment rate as a percentage of disposable income. The individual is a 51-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and have unknown/no property. There are no other installment plans, and they reside in a free housing situation. They have one existing credit at the bank and are employed as an unskilled resident. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of delayed payments. They are seeking a business loan of 2580 credits for a duration of 21 months. They have savings between 500 and 1000 DM and have been employed for less than a year. The installment rate is 4% of their disposable income. This person is a 41-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. They have one ongoing credit at this bank and work in an unskilled resident job. They are responsible for providing maintenance to two individuals. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 24-year-old female, divorced/separated/married, working as a skilled employee/official, with a stable monthly income. She has a good credit history and currently has a small amount of credit. She has been living in her current residence for 4 years, renting a property. She has no other debts or obligations, and no other installment plans. She has no savings but has a checking account with less than 0 DM. She is financially responsible, with a low disposable income installment rate. She is alone responsible for providing maintenance. She does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a good credit risk, as they have a stable checking account with a moderate balance. They have a history of critical accounts and existing credits, but not at the current bank. The purpose of the credit is for a new car, with a moderate amount. They have some savings and stable employment. Their personal status is a divorced male with no other debtors or guarantors. They have been residing at their current residence for 3 years and own their own home. This individual is in their mid-30s, with no other installment plans and one existing credit at the bank. They hold a managerial or highly qualified job, with one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 20-year-old single male with 1 existing credit at a bank. They have a checking account with less than 0 DM, 1 to 4 years of employment history, and a good credit record. Their credit amount is 1107, savings are less than 100 DM, and they have no other debtors or guarantors. They live in rented housing and have been at their current residence for 2 years. They have no other installment plans, but have a telephone registered under their name. Additionally, they have real estate as property, work in a management position, and are a foreign worker. They are responsible for providing maintenance for 2 individuals.###\nHence this label was Yes."
"The individual is a divorced/separated/married 24-year-old female who has been living in a rented house for 4 years. She has no checking account but has a savings account with a balance between 100 and 500 DM. Currently employed for 1 to less than 4 years in an unskilled resident job, she has 2 existing credits at this bank and no other debtors or guarantors. She is looking to finance a used car worth 11,590 DM with an installment rate of 2% of her disposable income. She has one person she is financially responsible for and has a telephone but no foreign worker status.###\nHence this label was No."
"The individual does not have a checking account and has been employed for at least 7 years. They have a good credit history with critical accounts/other credits existing elsewhere. The purpose of the loan is for a radio/television. They have a modest credit amount of 1655 and savings of less than 100 DM. The individual is a 63-year-old single male with no other debtors/guarantors. They have been living in their own real estate property for 4 years. The individual has 2 existing credits at this bank and works as an unskilled resident. They are responsible for providing maintenance for one person and have a registered telephone under their name. The individual is also a foreign worker.###\nHence this label was Yes."
"This individual is a 29-year-old divorced/separated/married female, unemployed or working in an unskilled non-resident job. She has been living in her own house for 2 years and has no other existing credits at this bank. She has no savings account and no other debtors/guarantors. The credit history shows that all credits at this bank have been paid back duly. She is looking to purchase domestic appliances with a credit amount of 3990 DM. Her existing checking account balance is between 0 and 200 DM. She has been in her current employment for less than a year and has a low installment rate in percentage of disposable income. She has an unknown property status and holds a bank installment plan. She has no telephone and is a foreign worker. She is liable to provide maintenance for one person.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, a credit history of paying existing credits on time, and is looking to finance furniture/equipment. They are borrowing 3446 DM for a duration of 36 months. They have savings of less than 100 DM and have been employed for at least 7 years. With a 4% installment rate, they are single, male, and own their home. They have no other debtors/guarantors and reside in their current home for 2 years. At 42 years old, they have one existing credit at the bank and work as a skilled employee/official. They are responsible for 2 dependents and do not have other installment plans. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and a credit history of delaying payments in the past. They are seeking a new car loan with a credit amount of 2538. Their savings are less than 100 DM and they have been employed for over 7 years. The individual is a 47-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own a car or another property. The individual has 2 existing credits at this bank and works as an unskilled resident. They are responsible for providing maintenance for 2 people and do not have a telephone. Despite being a foreign worker, they are seeking a loan as a good credit risk.###\nHence this label was No."
"This individual has no checking account and is applying for a loan to purchase furniture/equipment. They have a critical credit history with other existing credits, and their credit amount is 7127. Their savings account/bonds have less than 100 DM. They have been employed for less than a year and have a low installment rate in percentage of disposable income. The individual is a 23-year-old divorced/separated/married female. They have no other debtors or guarantors and have been residing at their current location for 4 years. Their property includes a building society savings agreement/life insurance. They have no other installment plans, live in a rental property, and have two existing credits at this bank. The individual is a skilled employee/official with one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This data represents a 20-year-old divorced/separated/married female skilled employee with 1.0 person to provide maintenance for. She has been in her current job for 1 to 4 years and has been living in her current residence for 4 years, which is a rented property. She has a good credit history with existing credits paid back duly. Her existing checking account balance is less than 0 DM, and she has savings of less than 100 DM. The credit amount requested is 2039 with an installment rate of 1% of disposable income. She has no other debtors/guarantors and no telephone. She has real estate as a property and one existing credit at the bank. She has another installment plan with the bank and is a foreign worker.###\nHence this label was No."
"This individual has a stable financial background with a checking account balance of less than 0 DM and existing credits that have been paid back on time. They are looking for a loan for a radio/television, with a credit amount of 1680 DM. They have some savings between 500 and 1000 DM and have been employed for over 7 years. Their living situation is in real estate that they own, and they are a married/widowed male in their mid-30s. With no other debtors or guarantors, they have a good credit history and stable income as a skilled employee. Overall, this individual appears to be a responsible and reliable candidate for a credit risk assessment.###\nHence this label was Yes."
"This individual does not have a checking account and has a good credit history with other existing credits. They took a loan for a new car, amounting to 3380 credits. Their savings are less than 100 DM. They have been employed for 4 to 7 years and have a low installment rate. The individual is a divorced or separated or married female, aged 37. They have no other debtors or guarantors and have been residing in their own real estate property for 1 year. They have no other installment plans, one existing credit at the bank, and work as a skilled employee. They are responsible for providing maintenance to 2 people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had existing credits paid back duly till now. They are looking to finance a radio/television, with a credit amount of 1901. Their savings range from 100 to less than 500 DM and they have been employed for 1 to less than 4 years. They have a single male personal status, with no other debtors/guarantors. They have been residing at their current residence for 4 years and their property includes a car or other assets. At 29 years old, they have no other installment plans and live in a rented housing. They have one existing credit at the bank, hold a management position and are responsible for one person's maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old female who is divorced or separated or married. She has no checking account and has been employed for less than a year. She lives in a rented house with two people dependent on her for maintenance. She has one existing credit at the bank and has paid back all previous credits duly. Her credit amount is 601 DM and she has savings of less than 100 DM. She has no other debtors or guarantors and no other installment plans. She owns real estate and is employed as an unskilled resident. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are seeking a loan for business purposes and have a credit amount of 1542. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their disposable income installment rate is 2%. They are a single male, aged 36. They have no other debtors or guarantors, one existing credit at the bank, and own their own home. They work as a skilled employee/official, with one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of repaying existing credits on time. They are seeking a new car, with a credit amount of 1597. Their savings amount falls between 500 and 1000 DM. They have been employed for 1 to 4 years and have a low installment rate. The individual is a 40-year-old single male, with no other debtors or guarantors. They have been residing in their current residence for 2 years, with unknown or no property. They have no other installment plans, live in a rental property, and have one existing credit at the bank. Their job is listed as unskilled-resident, and they are liable for providing maintenance for 2 people. The individual does not have a telephone and is not a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account. They have a good credit history with existing credits paid back on time. The purpose of the credit is for furniture/equipment, with a credit amount of 2359. They have savings between 100 and 500 DM. The individual is currently unemployed but has been in their present employment for 1 month. They have a low installment rate. A male who is divorced/separated. There are no other debtors or guarantors involved. They have been living in their current residence for 1 year and own their housing. They have one existing credit at the bank and work as a skilled employee/official. They are responsible for one person's maintenance and do not have a telephone. They are a foreign worker and are 33 years old.###\nHence this label was No."
"This individual has a status of existing checking account of less than 0 DM, with a credit history of paying back existing credits duly. They are seeking a loan for the purpose of purchasing a radio/television, with a credit amount of 1835 DM. Their savings amount is less than 100 DM and they have been employed for 1 to less than 4 years. The individual is a divorced or separated or married female, with no other debtors or guarantors. They have been living at their current residence for 2 years and own real estate property. At 25 years old, they have no other installment plans, own their housing, and have 2 existing credits at the bank. The individual is a skilled employee/official with one person liable for maintenance. They have a registered telephone under their name and are a foreign worker.###\nHence this label was No."
"This individual is a female, divorced/separated/married, aged 28, working as a skilled employee/official with 1-4 years of present employment. She has a checking account with 0-200 DM, savings of 100-500 DM, and has paid back existing credits duly. She has taken a new car loan of 2631 DM for a duration of 15 months with an installment rate of 2%. She resides in a rented house with a 4-year history at the current residence. She has no other debtors/guarantors, no other installment plans, and has 2 existing credits at the bank. She has one person to provide maintenance for, owns a car or other property not listed, and has a telephone registered under her name. Additionally, she is a foreign worker.###\nHence this label was No."
"This individual is a young married/widowed male, aged 23, with no checking account. He has been employed for 4-7 years and has no other debtors or guarantors. He lives in a rented house and has one existing credit at the bank. His credit history shows that he has been repaying existing credits duly. The purpose of the current credit application is for repairs, with a credit amount of 660. He has savings between 500 and 1000 DM, and his property is real estate. He has no other installment plans, no telephone, and is a foreign worker. Overall, he appears to be a responsible individual seeking credit for a specific purpose.###\nHence this label was Yes."
"This individual is a 28-year-old single male, working as a skilled employee/official. He has been employed for 4 to 7 years and owns a real estate property where he has lived for 3 years. His existing checking account balance is less than 0 DM, with savings of less than 100 DM. He has no other debts or guarantors, no other installment plans, and no telephone. He has 2 existing credits at this bank and is financially responsible, with a good credit history of paying back all credits duly. His current credit amount is 1108 for the purpose of repairs. He has one person he is liable to provide maintenance for and is a foreign worker.###\nHence this label was No."
"The individual is a 67-year-old divorced/separated/married female with a stable job, having been employed between 4 to 7 years. They have a good credit history with existing credits paid back duly till now. The purpose of the credit is for education. They have a moderate credit amount of 1199 DM and some savings. They own a building society savings agreement/life insurance property and have been residing at their current residence for 4 years. They have 2 existing credits at the bank, no other debtors/guarantors, and no other installment plans. The individual has a moderate installment rate, one dependent, a registered telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female, under 35 years old, with less than a year of employment at their current job. They have one existing credit at this bank and own a property. The purpose of their credit is for a new car, with a credit amount of 931 DM. They have a savings account with 100-500 DM and no other debts or guarantors. They have no telephone and work as an unskilled resident. The individual has one dependent and is a foreign worker.###\nHence this label was No."
"The individual has no checking account and has been employed for 4 to 7 years. They took a credit for a radio/television, with a credit amount of 4530 and a duration of 30 months. Their savings are less than 100 DM. They are a divorced/separated/married female, aged 26, with no other debtors or guarantors. They have been living in the same residence for 4 years and have 1 existing credit at the bank. They work in a management/self-employed/highly qualified position. They have no other installment plans, rent their housing, and have a telephone registered under their name. They are a foreign worker and have 1 person liable for maintenance.###\nHence this label was Yes."
"The individual is a female, divorced/separated/married, aged 33, with a stable job as a skilled employee/official. She has been living in her own house for 4 years and has 2 existing credits at the bank. She has a good credit history with no previous loans and has promptly paid back all credits taken. Her monthly installment rate is low at 1%, and she has a telephone registered under her name. She has a small amount of savings, less than 100 DM, and her credit amount is 3244 DM for the purpose of furniture/equipment. She has a moderate duration of 18 months for repayment. Additionally, she has no other debtors/guarantors, no other installment plans, and no one else liable for maintenance. She is a responsible individual who is also a foreign worker.###\nHence this label was Yes."
"This individual has a stable credit history with a minor delay in past payments. They are looking to finance a used car for a duration of 20 months. With a credit amount of 7057 DM, they do not have any savings. They have been employed for 4-7 years and have a moderate installment rate. Being a single male, they have no other debtors or guarantors. They reside in a rented house and have multiple existing credits at the bank. With a job in management/highly qualified employee category, they are responsible for providing maintenance for two people. Additionally, they have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has a credit history of paying back existing credits on time. They are seeking a loan for business purposes and require 6568 DM. Their savings account/bonds hold less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate of 2% on disposable income. The individual is a married/widowed male, with no other debtors or guarantors. They have been residing at their current location for 2 years and own a car or other property. At 21 years old, they have other installment plans at stores and own their housing. They have one existing credit at the bank and work as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a 38-year-old divorced/separated/married female with no checking account. She has been employed for less than a year and lives in her own residence for 3 years. She has one existing credit at the bank and is a skilled employee/official. She has a small loan for a radio/television purchase and a savings account with less than 100 DM. She has no other debtors/guarantors and no other installment plans. She is responsible for providing maintenance for one person and has a telephone registered under her name. Additionally, she is a foreign worker and has been paying back her existing credits diligently.###\nHence this label was Yes."
"This individual is a single male, aged 23, with a stable job as a skilled employee. He has been living in his current residence for 4 years, with no other outstanding debts or guarantors. He has a checking account with less than 0 DM, some savings, and no other significant assets. His credit history shows that he has paid back his existing credits on time. He is looking to borrow a relatively small amount for a radio/television purchase. He has no other installment plans and is currently living in a free housing situation. He has a good credit rating and has a phone registered in his name. Additionally, he is a foreign worker and is financially responsible for one other person.###\nHence this label was No."
"This individual has a checking account with a balance of less than 0 DM. They have a good credit history with all credits at their bank being paid back on time. The purpose of their credit is listed as \"others\" and the credit amount is 1358. They have an unknown or no savings account. They have been employed at their current job for at least 7 years and have a low installment rate in percentage of disposable income. The individual is a 40-year-old single male with no other debtors or guarantors. They have lived at their current residence for 3 years and own a car or other property. The individual has one existing credit at their bank and works in a high-level job. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and unknown savings. They have been employed for 1 to 4 years and live in their own home. They are single, male, and 29 years old. Their credit history is considered critical with existing credits elsewhere. The purpose of their credit is for a radio/television. They have 2 existing credits at this bank and no other installment plans. They have a building society savings agreement/life insurance for property. They have a stable job as a skilled employee/official and one person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and is unemployed, with a history of critical accounts and other credits existing elsewhere. They are a 65-year-old divorced/separated/married female, living in their own home for 4 years. They require a small credit amount for a radio/television, have less than 100 DM in savings, and no other installment plans or debtors/guarantors. They have 2 existing credits at a bank, are unemployed/unskilled, and have 1 person to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a 37-year-old single male, with a modest income and stable employment for 1 to 4 years. He resides in his own real estate property for 2 years. He has a good credit history, with no other debts or guarantors. His purpose for the credit is for a radio/television,and has a manageable credit amount of 2118 DM to be paid back in 9 months. He has some savings and no other installment plans. He is an unskilled resident, liable for 2 people, and does not have a telephone. Despite being a foreign worker, he is considered a good credit risk.###\nHence this label was Yes."
"This individual is unemployed, male, single, and aged 55. They have no existing debts or guarantors. Their credit history at this bank shows prompt repayment. The purpose of their credit is a used car. They have a good credit standing, with a credit amount of 9283 DM. With no property, they reside for free. They have one existing credit at this bank, and their job status is a highly qualified employee in a managerial position. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 30, who has been employed for at least 7 years as a skilled employee/official. They have no existing debts or other people to provide for, and live in a residence for free. They have one existing credit at the bank, with a good credit history of paying back credits on time. Their current checking account balance is between 0 and 200 DM, with savings between 100 and 500 DM. They are looking to make a furniture/equipment purchase with a credit amount of 3069 DM. They have no other installment plans, no other debtors or guarantors, no property, and no telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a single, unemployed male with a good credit history. He has a checking account with a balance between 0 and 200 DM and savings of less than 100 DM. The purpose of the credit is for a used car, with a duration of 12 months and a credit amount of 1860 DM. He has no other debts, owns his own home, and has been living at his current residence for 2 years. Additionally, he has 2 existing credits at the bank, a moderate installment rate, and no other installment plans. He is a highly qualified employee in a management position, aged 34, with 1 person dependent on him for maintenance. He also has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"The individual is a 27-year-old married/widowed male who has been employed for 1 to 4 years as a skilled employee/official. He has one existing credit at the bank and has been living in his current residence for 2 years. He has no savings account, no other debtors/guarantors, and owns his own home. The purpose of his current credit is for education, with a credit amount of 3711 DM to be repaid over 36 months. He has no other installment plans, no telephone, and is a foreign worker. Overall, he has a good credit history with existing credits paid back duly.###\nHence this label was Yes."
"This individual is a 23-year-old divorced or separated or married female, who has been employed for less than a year and resides in her own home. She has a good credit history with existing credits paid back duly, and currently has one credit at the bank. Her existing checking account balance is between 0 and 200 DM, with savings between 100 and 500 DM. She is looking to borrow 836 DM for a new car, with an installment rate of 4% of disposable income. She has a building society savings agreement/life insurance as property, no other debtors/guarantors or other installment plans, and does not have a telephone. She is an unskilled-resident foreign worker, responsible for one person's maintenance.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, a good credit history with existing credits paid back on time, and is looking to finance a new car. They have saved an unknown amount and have been employed for 4 to 7 years. With a manageable installment rate of 2%, they are a single, 24-year-old male. They have a co-applicant and have been living in their own real estate property for 2 years. This individual has no other installment plans, one existing credit at the bank, and works in an unskilled resident job. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old female who is divorced/separated/married and has been employed for at least 7 years in a management/self-employed/highly qualified employee/officer position. She has a good credit history with existing credits paid back duly till now, and currently has one existing credit at the bank. She has no other debtors/guarantors and no other installment plans. Her existing checking account balance is >= 200 DM, with a credit amount of 1961 DM. She has savings of less than 100 DM and owns her own house. Her installment rate in percentage of disposable income is 3, and she has been residing at her current residence for 2 years. She is the sole provider for one dependent, does not have a telephone, and is a foreign worker. The purpose of her credit is for a new car.###\nHence this label was Yes."
"The individual has no checking account, a critical credit history with other credits existing, and has had their current job for 1 to less than 4 years. They took a 15-month loan for a radio/television, amounting to 1471 credits. Their savings are less than 100 DM and they have been living in their current residence for 4 years. Being a single male, they have no other debtors or guarantors. They do not have any other installment plans, live in a free housing situation, and own no property. At 35 years old, they are a skilled employee with 2 existing credits at the bank. They are liable for 1 person's maintenance, have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual, a 28-year-old single male, has been responsibly repaying existing credits for a radio/television purchase. With a stable job as a skilled employee, he has no other debtors or guarantors. He owns a real estate property, has been living at his current residence for 4 years, and has 2 existing credits at the bank. With a good credit history, he has some savings and a moderate credit amount. He has no other installment plans, no telephone, and no dependents. Additionally, he has been employed steadily for 4-7 years and is a foreign worker.###\nHence this label was No."
"The individual has an existing checking account with a balance between 0 and 200 DM, and has a good credit history with no previous credits outstanding. They are seeking a business loan of 12204 DM for a duration of 48 months. They have an unknown or non-existent savings account. The individual has been employed for 1 to 4 years and has a low installment rate as a percentage of their disposable income. They are a single male with no other debtors or guarantors. They have been residing at their current address for 2 years, own a car or other property, and are 48 years old. They have installment plans with a bank, own their own home, and have one existing credit at the bank. They are in a management or self-employed position, with one dependent for maintenance. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been diligently repaying existing credits and have a stable job. Their purpose for the credit is for a radio/television. They are a single male, 37 years old, living in a residence for free. They have no other debtors or guarantors, and no other installment plans. They have one existing credit at this bank and are the sole provider for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They took a loan of 2697 for the purpose of purchasing a radio/television. They have savings of less than 100 DM and have been employed for 1 to 4 years. The installment rate as a percentage of their disposable income is 1. They are a 32-year-old single male, with no other debtors or guarantors. They have been living in their own real estate property for 2 years. They have a stable job as a skilled employee/official and are liable to provide maintenance for 2 other people. They do not have any other installment plans, own a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual is a 26-year-old single male, working as a skilled employee with less than 1 year of employment. He has a good credit history with existing credits paid back duly, and currently holds a checking account with a balance between 0 and 200 DM. He is looking to finance a new car, with a credit amount of 1201 DM. Additionally, he has savings of less than 100 DM and no other debtors or guarantors. He lives in his own property, has been residing at his current residence for 1 year, and has one existing credit at the bank. He has no other installment plans, no telephone, and no other people dependent on him for maintenance. He is also a foreign worker.###\nHence this label was Yes."
