"A 54-year-old male patient with no history of chest pain, normal resting blood pressure, and no fasting blood sugar issues. The resting electrocardiogram shows ST-T wave abnormality. The patient experiences exercise-induced angina, with a slight ST depression of 1.4 relative to rest. The peak exercise ST segment is flat, and the maximum heart rate achieved during exercise is 117.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. The patient does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 135. The patient experiences exercise-induced angina, with ST depression of 2.5 induced by exercise relative to rest. The slope of the peak exercise ST segment is downsloping. These factors suggest a possibility of heart disease.###\nHence this label was Yes."
"A 40-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. Fasting blood sugar is not elevated. Resting electrocardiogram results are normal. The maximum heart rate achieved is 138, and there is no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 63-year-old male patient with non-anginal chest pain, resting blood pressure of 130, normal serum cholesterol levels, fasting blood sugar >120 mg/dl, showing ST-T wave abnormality in resting electrocardiogram results, achieving a maximum heart rate of 160 without exercise-induced angina. The patient has 3.0 ST depression induced by exercise relative to rest and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 33-year-old female patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. She has a normal resting electrocardiogram and achieved a maximum heart rate of 150 during exercise. The patient experienced exercise-induced angina and had 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 58-year-old male who is experiencing asymptomatic chest pain. \nHis resting blood pressure is at 128 and serum cholesterol level is at 259. \nHe does not have fasting blood sugar over 120 mg/dl. \nThe resting electrocardiogram shows probable or definite left ventricular hypertrophy. \nHis maximum heart rate achieved is 130 and he experiences exercise-induced angina. \nST depression induced by exercise relative to rest is at 3.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old male patient with non-anginal chest pain, resting blood pressure of 125, serum cholesterol level of 273, and no fasting blood sugar above 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 152, did not experience exercise-induced angina, and had a ST depression of 0.5 relative to rest. The slope of the peak exercise ST segment was downsloping.###\nHence this label was No."
"A 64-year-old female patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, a maximum heart rate of 145, no exercise-induced angina, 1.1 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 75-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 112. The patient experiences exercise-induced angina and has a ST depression of 3.0 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 53-year-old female patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol levels. The patient achieved a maximum heart rate of 142 with exercise-induced angina present. There was a ST depression of 2.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 54-year-old male patient with atypical angina chest pain, normal resting blood pressure of 160, high serum cholesterol of 305, normal fasting blood sugar levels, normal resting electrocardiogram results, a maximum heart rate of 175, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 140, and serum cholesterol level of 274. The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 154 during exercise, and experienced exercise-induced angina. Additionally, the patient had ST depression of 2.0 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 47-year-old male patient with non-anginal chest pain, resting blood pressure of 138, and serum cholesterol level of 257. The patient does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. Maximum heart rate achieved during exercise was 156, and there was no exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, with a peak exercise ST segment showing an upsloping pattern.###\nHence this label was No."
"The patient is a 54-year-old male who is asymptomatic. His resting blood pressure is 125 and serum cholesterol level is 224. He has normal results on resting electrocardiogram. His maximum heart rate achieved is 122 and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat. Additionally, his fasting blood sugar level is under 120 mg/dl.###\nHence this label was Yes."
"A 58-year-old male patient with non-anginal chest pain, resting blood pressure of 150, serum cholesterol of 219, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 118, experienced exercise-induced angina, no ST depression induced by exercise, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 52-year-old male patient with atypical angina chest pain, normal resting blood pressure, low serum cholesterol levels, normal fasting blood sugar, a normal resting electrocardiogram, achieved a maximum heart rate of 138, experienced exercise-induced angina, no ST depression after exercise, and had an upsloping peak exercise ST segment.###\nHence this label was No."
"The patient is a 62-year-old male with asymptomatic chest pain. His resting blood pressure is 115, and his serum cholesterol level is 0. He has high fasting blood sugar (>120 mg/dl) and normal resting electrocardiogram results. His maximum heart rate achieved is 72, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is -0.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 71-year-old female patient with atypical angina chest pain, normal resting blood pressure, slightly elevated serum cholesterol levels, normal fasting blood sugar levels, a normal resting electrocardiogram, high maximum heart rate achieved during exercise, no exercise-induced angina, a slight ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 50-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, serum cholesterol level of 231, no fasting blood sugar over 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 140, experience of exercise-induced angina, 5.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. These features can help predict the possibility of a heart disease in the patient.###\nHence this label was Yes."
"A 63-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, and serum cholesterol level of 260. The patient does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 112. The patient experiences exercise-induced angina and has ST depression of 3.0 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with atypical angina chest pain has normal resting blood pressure of 130 and serum cholesterol levels of 230. They have a maximum heart rate of 150 with no fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, and the patient does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 64-year-old female patient with asymptomatic chest pain, normal resting blood pressure of 130, serum cholesterol level of 303, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, a maximum heart rate of 122, no exercise-induced angina, 2.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, high resting blood pressure, and slightly elevated cholesterol levels. They have fasting blood sugar over 120 mg/dl, a normal resting electrocardiogram, and experience exercise-induced angina. The patient achieved a maximum heart rate of 105 during exercise, with a 1.0 ST depression relative to rest. The slope of the peak exercise ST segment is flat. These factors indicate a potential risk for heart disease in this individual.###\nHence this label was Yes."
"A 62-year-old male patient with non-anginal chest pain, resting blood pressure of 133, fasting blood sugar over 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. He achieved a maximum heart rate of 119, experienced exercise-induced angina, and had ST depression of 1.2 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 59-year-old female patient with atypical angina chest pain, normal resting blood pressure of 130, serum cholesterol level of 188, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 124, no exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 56-year-old male patient with non-anginal chest pain, resting blood pressure of 137, serum cholesterol level of 208, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 122, who experiences exercise-induced angina, with 1.8 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. These factors suggest a possible heart disease.###\nHence this label was Yes."
"The patient is a 61-year-old male who is experiencing asymptomatic chest pain. His resting blood pressure is 110, and he has a fasting blood sugar level greater than 120 mg/dl. The resting electrocardiogram shows normal results. He achieved a maximum heart rate of 108 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"The patient is a 62-year-old male with atypical angina chest pain. His resting blood pressure is 120, serum cholesterol level is 281, and fasting blood sugar is normal. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 103 and did not experience exercise-induced angina. There was a 1.4 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 61-year-old male who experiences typical angina chest pain. His resting blood pressure is 142, and serum cholesterol is 200. He has fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 100 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 55-year-old female patient with atypical angina presented with a resting blood pressure of 135 and serum cholesterol level of 250. Fasting blood sugar was below 120 mg/dl, and the resting electrocardiogram revealed probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 161, did not experience exercise-induced angina, and showed 1.4 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 70-year-old male patient with atypical angina chest pain has a resting blood pressure of 156 and a serum cholesterol level of 245. They do not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 143 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 35-year-old male who experiences non-anginal chest pain. His resting blood pressure is 123, serum cholesterol level is 161, and fasting blood sugar is normal. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 153 without exercise-induced angina. The ST segment depression induced by exercise relative to rest is -0.1, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 51-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal electrocardiogram results, maximum heart rate of 126, no exercise-induced angina, ST depression of 2.2 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 53-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 140. The patient did not experience exercise-induced angina and showed no ST depression during exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 48-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and elevated serum cholesterol of 263. The patient has fasting blood sugar > 120 mg/dl, a normal resting electrocardiogram, and a maximum heart rate of 110. He does not experience exercise-induced angina and has no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 64-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 110, fasting blood sugar level above 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 114. They experienced exercise-induced angina, with 1.3 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"The patient is a 49-year-old male with asymptomatic chest pain. His resting blood pressure is 150, serum cholesterol level is 222, and fasting blood sugar is normal. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 122 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 64-year-old male patient, experiencing non-anginal chest pain, with normal resting blood pressure of 125 and slightly elevated serum cholesterol of 309. The patient has a normal fasting blood sugar level, a maximum heart rate of 131, and experiences exercise-induced angina. The ST segment depression induced by exercise relative to rest is 1.8, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old female patient with asymptomatic chest pain, resting blood pressure of 170, serum cholesterol level of 225, and fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 146, experienced exercise-induced angina, and ST depression induced by exercise relative to rest is 2.8. The slope of the peak exercise ST segment is flat. These factors suggest a potential risk of heart disease in the patient.###\nHence this label was Yes."
"The patient is a 70-year-old male who is asymptomatic but has high resting blood pressure. His serum cholesterol levels are normal and he has not experienced fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. Despite achieving a maximum heart rate of 129, the patient experiences exercise-induced angina. He has a significant ST depression of 3.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is downsloping. Overall, this data indicates a potential risk for heart disease in the patient.###\nHence this label was Yes."
"The patient is a 61-year-old male who is asymptomatic but has probable or definite left ventricular hypertrophy. His resting blood pressure is 140, serum cholesterol is 207, and he does not have fasting blood sugar above 120 mg/dl. He experienced exercise-induced angina and has an ST depression of 1.9 relative to rest. The peak exercise ST segment slope is upsloping, and his maximum heart rate achieved was 138.###\nHence this label was Yes."
"The 53-year-old male patient experienced non-anginal chest pain and had a resting blood pressure of 130. Their serum cholesterol level was 246, and they had high fasting blood sugar (>120 mg/dl). The resting electrocardiogram showed probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 173 and did not experience exercise-induced angina. Their ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 68-year-old male who experiences typical angina chest pain. His resting blood pressure is 139, with a serum cholesterol level of 181. He has a fasting blood sugar level greater than 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 135 and the patient does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male patient with non-anginal chest pain, elevated resting blood pressure (140 mmHg), and slightly high serum cholesterol (211 mg/dl). The patient has fasting blood sugar > 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. Despite reaching a maximum heart rate of 165, the patient did not experience exercise-induced angina. The ST segment depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 60-year-old male patient with non-anginal chest pain, resting blood pressure of 140, serum cholesterol of 185, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 155, did not experience exercise-induced angina, and showed an ST depression of 3.0 induced by exercise relative to rest with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 42-year-old male patient with asymptomatic chest pain has a resting blood pressure of 136 and a serum cholesterol level of 315. Their fasting blood sugar is normal, and resting electrocardiogram results show normal readings. The patient achieved a maximum heart rate of 125 and experienced exercise-induced angina. They also had an ST depression of 1.8 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 39-year-old female patient with non-anginal chest pain has a resting blood pressure of 110 and a serum cholesterol level of 182. They have a normal fasting blood sugar level, with ST-T wave abnormality in resting electrocardiogram results. The patient achieved a maximum heart rate of 180, did not experience exercise-induced angina, and had no ST depression induced by exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 53-year-old female patient with non-anginal chest pain has normal resting blood pressure and slightly elevated serum cholesterol. Their fasting blood sugar level is below 120 mg/dL. Resting electrocardiogram results are normal, and they achieved a maximum heart rate of 130 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 35-year-old male patient with atypical angina chest pain, normal resting blood pressure, and slightly elevated serum cholesterol of 264. The patient has a normal fasting blood sugar level, a maximum heart rate of 168, and did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest. The peak exercise ST segment shows an upsloping slope, indicating a lower likelihood of heart disease.###\nHence this label was No."
"A 61-year-old male patient with non-anginal chest pain presented normal resting blood pressure and serum cholesterol levels. The patient's maximum heart rate achieved was 80, and there was no fasting blood sugar > 120 mg/dl. The resting electrocardiogram showed normal results. The patient experienced exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 48-year-old male patient with atypical angina presented with normal resting blood pressure (130) and slightly elevated serum cholesterol (245). The patient had a normal fasting blood sugar level, a maximum heart rate of 160, and did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, and serum cholesterol of 256. Fasting blood sugar is higher than 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient experiences exercise-induced angina, with a maximum heart rate of 113. ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 60-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a normal resting electrocardiogram and achieved a maximum heart rate of 126. There was no fasting blood sugar > 120 mg/dl or exercise-induced angina present. The ST depression induced by exercise relative to rest was 0.3, and the slope of the peak exercise ST segment was upsloping. These factors can be used to predict the likelihood of heart disease in this individual.###\nHence this label was No."
"The patient is a 34-year-old male with atypical angina chest pain. His resting blood pressure is 150, serum cholesterol level is 214, and fasting blood sugar is within normal range. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 168 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 58-year-old male who experiences non-anginal chest pain. His resting blood pressure is 130, and his serum cholesterol level is 213. He does not have fasting blood sugar above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 140 and did not experience exercise-induced angina. The ST depression relative to rest induced by exercise is 0.0, and the slope of the peak exercise ST segment is flat. These factors are important in predicting the presence of heart disease in the patient.###\nHence this label was Yes."
"A 39-year-old male patient with atypical angina chest pain, resting blood pressure of 120, serum cholesterol level of 241, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 146, no exercise-induced angina, ST depression of 2.0 induced by exercise relative to rest, and upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"This is a 60-year-old male patient with asymptomatic chest pain. His resting blood pressure is 140 and serum cholesterol level is 281. He does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 118 and experienced exercise-induced angina. His ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 49-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal electrocardiogram results, achieved a maximum heart rate of 132, did not experience exercise-induced angina, exhibited moderate ST depression induced by exercise relative to rest, and had a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 46-year-old female patient with asymptomatic chest pain, resting blood pressure of 138, serum cholesterol level of 243, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate of 152, experienced exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 58-year-old female patient with asymptomatic chest pain has a resting blood pressure of 100 and a serum cholesterol level of 248. She does not have fasting blood sugar > 120 mg/dl and shows probable or definite left ventricular hypertrophy on her resting electrocardiogram. Her maximum heart rate achieved is 122, and she does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 37-year-old male patient with non-anginal chest pain, normal resting blood pressure, slightly elevated serum cholesterol levels, no fasting blood sugar above 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. The patient achieved a maximum heart rate of 165 without experiencing exercise-induced angina. ST depression of 1.0 was observed during exercise compared to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"The patient is a 44-year-old female with non-anginal chest pain. She has normal resting blood pressure (118 mmHg) and slightly elevated serum cholesterol levels (242 mg/dl). Her fasting blood sugar is below 120 mg/dl. The resting electrocardiogram shows normal results. She achieved a maximum heart rate of 149 bpm during exercise, without experiencing angina. There was a slight ST depression of 0.3 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 37-year-old male patient with atypical angina chest pain has a resting blood pressure of 130 and a serum cholesterol level of 283. They have a normal fasting blood sugar level and ST-T wave abnormality in resting electrocardiogram results. The patient achieved a maximum heart rate of 98 without experiencing exercise-induced angina. Their ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 46-year-old female patient with non-anginal chest pain, resting blood pressure of 142, serum cholesterol level of 177, no fasting blood sugar over 120 mg/dl. Resting electrocardiogram showing probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 160, experienced exercise-induced angina, and had ST depression of 1.4 relative to rest. The slope of the peak exercise ST segment was downsloping. These factors suggest a potential risk of heart disease in this patient.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, normal resting electrocardiogram results, and fasting blood sugar above 120 mg/dl. He experienced exercise-induced angina, with a maximum heart rate of 98. He showed ST depression of 2.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 60-year-old male patient with non-anginal chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal ECG results, achieved a maximum heart rate of 141. The patient experienced exercise-induced angina and had 2.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 37-year-old male patient with non-anginal chest pain, normal resting blood pressure of 130, serum cholesterol level of 194, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 150, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 31-year-old female patient with atypical angina chest pain, normal resting blood pressure (100), slightly elevated serum cholesterol (219), no fasting blood sugar above 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. The patient achieved a maximum heart rate of 150, did not experience exercise-induced angina, and had no ST depression after exercise. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 39-year-old male patient with no symptoms of chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. Resting electrocardiogram results are normal and the maximum heart rate achieved during exercise is 140. The patient did not experience exercise-induced angina and showed a slight ST segment depression of 1.2. The slope of the peak exercise ST segment is flat. Overall, the data suggests a relatively healthy individual with a low risk of heart disease based on these factors.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. They have a normal resting electrocardiogram and achieved a maximum heart rate of 161 during exercise. The patient did not experience exercise-induced angina and had a slight ST depression of 0.5 relative to rest. The slope of the peak exercise ST segment was flat. Overall, this patient's heart disease risk factors appear relatively moderate based on the provided data.###\nHence this label was No."
"A 55-year-old male patient with atypical angina chest pain has a resting blood pressure of 110 and serum cholesterol level of 214. They have fasting blood sugar level > 120 mg/dl, with ST-T wave abnormality in resting electrocardiogram. The patient achieved a maximum heart rate of 180 and did not experience exercise-induced angina. They have ST depression of 0.4 induced by exercise relative to rest, with a peak exercise ST segment slope that is upsloping.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, maximum heart rate achieved is 115. The patient experiences exercise-induced angina and has 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat. These factors suggest a potential risk for heart disease in this patient.###\nHence this label was Yes."
"A 50-year-old male patient with atypical angina chest pain has normal resting blood pressure and serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 160 during exercise. The patient did not experience exercise-induced angina and showed no ST depression relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 42-year-old male patient with asymptomatic chest pain, normal resting blood pressure (140), high serum cholesterol (358), normal fasting blood sugar levels, normal resting electrocardiogram results, high maximum heart rate achieved (170), no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 47-year-old male presenting with asymptomatic chest pain. He has a resting blood pressure of 110 and a serum cholesterol level of 275. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 118 during exercise, experienced angina, and had 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 65-year-old male with asymptomatic chest pain. His resting blood pressure is 140, serum cholesterol levels are at 306. He has high fasting blood sugar levels (>120 mg/dl) and a normal resting electrocardiogram. The maximum heart rate achieved is 87, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 39-year-old male patient with no symptoms, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram, achieving a maximum heart rate of 150 bpm without exercise-induced angina. ST depression of 0.0 post-exercise and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain has a resting blood pressure of 132 and high serum cholesterol of 458. Their fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results show normal. The patient achieved a maximum heart rate of 69 and did not experience exercise-induced angina. They have ST depression of 1.0 induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 57-year-old female with typical angina chest pain. Her resting blood pressure is 130, with a serum cholesterol level of 308. She has normal results for resting electrocardiogram and did not experience exercise-induced angina. Her maximum heart rate achieved was 98. She had a ST depression of 1.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat. The fasting blood sugar level was not higher than 120 mg/dl.###\nHence this label was No."
"A 57-year-old male patient with non-anginal chest pain, resting blood pressure of 128, and serum cholesterol level of 229. The patient does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 150, with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.4, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 50-year-old male patient with atypical angina chest pain, resting blood pressure of 170, serum cholesterol level of 209, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 116, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 62-year-old female patient with asymptomatic chest pain has a resting blood pressure of 120 and normal serum cholesterol levels. Their fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 123 and experienced angina during exercise. They have a 1.7 ST depression induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old male patient with atypical angina chest pain has normal resting blood pressure and high serum cholesterol levels. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results, and he achieved a maximum heart rate of 171 without experiencing exercise-induced angina. The ST segment depression induced by exercise relative to rest is 0.6, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 38-year-old male patient with non-anginal chest pain had a normal resting blood pressure of 115 and normal serum cholesterol levels. The patient did not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram results were normal, with a maximum heart rate achieved at 128. The patient experienced exercise-induced angina but had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 56-year-old male patient with non-anginal chest pain, resting blood pressure of 155, normal serum cholesterol levels, no fasting blood sugar > 120 mg/dl, showing ST-T wave abnormality in resting electrocardiogram results. The patient achieved a maximum heart rate of 99 without exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 47-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. They do not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows normal results. The patient experiences exercise-induced angina and has a slightly elevated ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment is flat, and the maximum heart rate achieved is 145.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 110, serum cholesterol level of 197, no fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy per resting electrocardiogram. He achieved a maximum heart rate of 100, did not experience exercise-induced angina, and had an ST depression of 0.0 relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 65-year-old female patient with non-anginal chest pain, normal resting blood pressure, slightly elevated serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 148 bpm, no exercise-induced angina, slight ST depression of 0.8, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 42-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results. The patient experienced exercise-induced angina, had a maximum heart rate of 128, and exhibited downsloping ST segment depression (-1.5) induced by exercise relative to rest.###\nHence this label was Yes."
"A 62-year-old male patient with no history of chest pain or angina visited the clinic. His resting blood pressure was 120 and serum cholesterol level was 220. The electrocardiogram showed ST-T wave abnormality. Despite a maximum heart rate of 86 during exercise, the patient did not experience angina. There was no ST depression post-exercise, and the peak exercise ST segment showed an upsloping pattern.###\nHence this label was No."
"A 41-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. They do not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 158 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment shows an upsloping pattern.###\nHence this label was Yes."
"A 48-year-old male patient with non-anginal chest pain has a resting blood pressure of 132 and serum cholesterol level of 220. Their fasting blood sugar is above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 162 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 63-year-old male with asymptomatic chest pain. \nHis resting blood pressure is 150 and serum cholesterol level is normal. \nHe does not have fasting blood sugar levels above 120 mg/dl. \nHis resting electrocardiogram results are normal, and he achieved a maximum heart rate of 86. \nHe experienced exercise-induced angina and had ST depression of 2.0 relative to rest. \nThe slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 50-year-old female patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, a maximum heart rate of 110, experiencing exercise-induced angina, with 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, resting blood pressure of 142, serum cholesterol level of 228, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 149, experiencing exercise-induced angina, 2.5 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 47-year-old male who is asymptomatic but has a high resting blood pressure of 150. Despite his normal electrocardiogram results, his serum cholesterol is at 226. He does experience exercise-induced angina and has a slightly elevated ST depression of 1.5. Additionally, he has a flat slope of the peak exercise ST segment. His maximum heart rate achieved is only 98, indicating a potential cardiovascular concern.###\nHence this label was Yes."
"A 41-year-old male patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol level of 214. Fasting blood sugar is not higher than 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 168 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 51-year-old male patient with typical angina chest pain, normal resting blood pressure and slightly elevated serum cholesterol. The patient does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient experienced exercise-induced angina and had a maximum heart rate of 125. ST depression induced by exercise relative to rest was 1.4, with a peak exercise ST segment showing upsloping pattern.###\nHence this label was No."
"A 43-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 100, fasting blood sugar greater than 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 122, no exercise-induced angina, 1.5 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 48-year-old female patient with atypical angina chest pain exhibits normal resting blood pressure and slightly elevated serum cholesterol. She has normal fasting blood sugar levels and resting electrocardiogram results. The patient achieved a maximum heart rate of 120, did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure and serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal. Maximum heart rate achieved during exercise is 160, with no exercise-induced angina. ST depression induced by exercise relative to rest is 1.2. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 63-year-old male patient with non-anginal chest pain, resting blood pressure of 133, normal serum cholesterol levels, no fasting blood sugar over 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 120, experiencing exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 36-year-old male patient with atypical angina, normal resting blood pressure of 120, serum cholesterol level of 267, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate reached at 160, no exercise-induced angina, 3.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. This profile provides valuable insights into the patient's heart health.###\nHence this label was Yes."
"A 43-year-old female patient with atypical angina chest pain, normal resting blood pressure and serum cholesterol levels. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 175 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0 with an upsloping peak exercise ST segment. No fasting blood sugar > 120 mg/dl.###\nHence this label was No."
"The patient is a 38-year-old male with asymptomatic chest pain. His resting blood pressure is 135, and he has a fasting blood sugar level above 120 mg/dl. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 150 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 44-year-old male patient with non-anginal chest pain, normal resting blood pressure of 130, serum cholesterol level of 233. Fasting blood sugar is normal. Resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 179 during exercise and experienced exercise-induced angina. ST depression induced by exercise relative to rest was 0.4. The slope of the peak exercise ST segment is upsloping. These factors indicate a potential risk for heart disease in this patient.###\nHence this label was No."
"A 61-year-old male patient with atypical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol. His fasting blood sugar is normal, and his resting electrocardiogram results are normal as well. The patient achieved a maximum heart rate of 135 without experiencing exercise-induced angina. He exhibited a slight ST depression of 0.3 induced by exercise relative to rest, with a peak exercise ST segment that slopes upwards.###\nHence this label was No."
"A 50-year-old male patient with non-anginal chest pain has normal resting blood pressure and serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and the patient achieved a maximum heart rate of 163 during exercise without experiencing angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, high resting blood pressure (144), elevated serum cholesterol (270), fasting blood sugar > 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, achieving a maximum heart rate of 160. The patient experiences exercise-induced angina, with 2.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with non-anginal chest pain had normal resting blood pressure and serum cholesterol levels. Fasting blood sugar was below 120 mg/dl. Resting electrocardiogram results were normal, and he achieved a maximum heart rate of 174 during exercise without experiencing angina. There was a 1.6 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 51-year-old male patient with non-anginal chest pain has normal resting blood pressure and serum cholesterol levels. The patient's fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal activity. The maximum heart rate achieved by the patient is 150, and there is no exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 52-year-old male with asymptomatic chest pain. His resting blood pressure is 112, and serum cholesterol is 342. He does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 96, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with non-anginal chest pain, resting blood pressure of 132, serum cholesterol level of 224, no fasting blood sugar over 120 mg/dl, showing probable or definite left ventricular hypertrophy in resting electrocardiogram results, achieving a maximum heart rate of 173 with no exercise-induced angina. The patient experienced ST depression of 3.2 induced by exercise relative to rest, with a peak exercise ST segment showing upsloping.###\nHence this label was Yes."
"A 39-year-old female patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a maximum heart rate of 152, did not experience exercise-induced angina, and showed no ST depression during exercise. The slope of the peak exercise ST segment was flat. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a normal resting electrocardiogram, maximum heart rate of 110, and experienced exercise-induced angina. The ST depression induced by exercise relative to rest was 0.5, and the slope of the peak exercise ST segment was flat. Fasting blood sugar was below 120 mg/dl.###\nHence this label was No."
"A 52-year-old male patient with no symptoms of chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. The resting electrocardiogram results are normal, and the maximum heart rate achieved during exercise is 161 bpm. The patient experiences exercise-induced angina but has no ST depression. The peak exercise ST segment shows upsloping.###\nHence this label was Yes."
"A 47-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol level. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 179 with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 52-year-old male patient with no history of chest pain or angina, normal blood pressure, and cholesterol levels was found to have a normal resting electrocardiogram. He achieved a high maximum heart rate during exercise and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. Overall, the patient's heart health indicators suggest a low risk of heart disease.###\nHence this label was Yes."
"A 40-year-old male patient with non-anginal chest pain, normal resting blood pressure of 140, serum cholesterol level of 235, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 188, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 55-year-old female patient with atypical angina chest pain has normal resting blood pressure, high serum cholesterol levels, and a high maximum heart rate achieved during exercise. She does not have fasting blood sugar > 120 mg/dl or exercise-induced angina. The ST depression induced by exercise relative to rest is 1.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 51-year-old male patient with no history of chest pain visited the clinic. His resting blood pressure was measured at 140, and his serum cholesterol level was 261. The resting electrocardiogram showed probable or definite left ventricular hypertrophy. During exercise, the patient experienced angina but had no significant ST depression compared to rest. His maximum heart rate achieved was 186, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 49-year-old male patient with non-anginal chest pain, normal resting blood pressure (140 mmHg), and serum cholesterol level of 187. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and a maximum heart rate of 172 beats per minute. They do not experience exercise-induced angina and have no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 61-year-old male with asymptomatic chest pain. His resting blood pressure is 110, and serum cholesterol level is 0. He has high fasting blood sugar (>120 mg/dl) and a normal resting electrocardiogram. The maximum heart rate achieved is 113, and he did not experience exercise-induced angina. He has an ST depression of 1.4 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 38-year-old male patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol levels. The patient's fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, but the maximum heart rate achieved is 105. The patient experiences exercise-induced angina and has ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment is downsloping. These factors suggest a possible risk of heart disease in this patient.###\nHence this label was Yes."
"A 43-year-old female patient with non-anginal chest pain, normal resting blood pressure (122), and serum cholesterol level (213). Fasting blood sugar is below 120 mg/dl, with a maximum heart rate of 165 achieved during exercise. There is no exercise-induced angina, and ST depression induced by exercise relative to rest is 0.2. The slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 55-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. Fasting blood sugar is normal, with ST-T wave abnormality in resting electrocardiogram. The patient experiences exercise-induced angina, with a moderate ST depression after exercise. Maximum heart rate achieved is 130, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 62-year-old male patient with asymptomatic chest pain, resting blood pressure of 158, serum cholesterol level of 170, and no fasting blood sugar higher than 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality, with a maximum heart rate achieved at 138. The patient experiences exercise-induced angina but has no ST depression induced by exercise compared to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 43-year-old female patient with non-anginal chest pain, normal resting blood pressure, and slightly high serum cholesterol. She has a normal fasting blood sugar level, normal resting electrocardiogram results, and a high maximum heart rate of 175. She does not experience exercise-induced angina and has no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 50-year-old male patient presented with asymptomatic chest pain and normal resting electrocardiogram results. His blood pressure is at 140, with a serum cholesterol level of 129. He has a normal fasting blood sugar level and did not experience exercise-induced angina. The patient reached a maximum heart rate of 135 during exercise, with no ST depression observed. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 50-year-old male presenting with asymptomatic chest pain. His resting blood pressure is 115, and his serum cholesterol level is normal. He does not have fasting blood sugar levels over 120 mg/dl. The resting electrocardiogram results are normal, and he achieved a maximum heart rate of 120. The patient experienced exercise-induced angina and had a slight ST depression of 0.5 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 32-year-old male patient with atypical angina chest pain, normal resting blood pressure, serum cholesterol of 225, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 184, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"This is a 55-year-old male patient with asymptomatic chest pain. His resting blood pressure is 116, and serum cholesterol is 186. He has fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 102 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a maximum heart rate of 160 and achieved an upsloping ST segment during peak exercise. They did not experience fasting blood sugar above 120 mg/dl or exercise-induced angina.###\nHence this label was No."
"A 57-year-old male patient with no fasting blood sugar issue presented with asymptomatic chest pain. Resting blood pressure was 122, while serum cholesterol was 264. Resting electrocardiogram showed probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 100 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 49-year-old male patient with atypical angina chest pain, normal resting blood pressure of 100, serum cholesterol level of 253, no fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 174, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 46-year-old male patient, experiencing atypical angina, with a resting blood pressure of 101 and serum cholesterol level of 197. The patient has fasting blood sugar levels over 120 mg/dl, a normal resting electrocardiogram, and achieved a maximum heart rate of 156. They did not experience exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 128, normal serum cholesterol levels, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 148, experiencing exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 52-year-old male who is asymptomatic but has high cholesterol. His resting blood pressure is 108 and he has normal results on his resting electrocardiogram. Despite his age, he achieved a maximum heart rate of 147 during exercise without experiencing angina. There was only a slight ST depression induced by exercise relative to rest (0.1) with an upsloping peak exercise ST segment.###\nHence this label was No."
"A 42-year-old female patient with non-anginal chest pain had a resting blood pressure of 115 and serum cholesterol level of 211. Their fasting blood sugar was normal. Resting electrocardiogram showed ST-T wave abnormality. The patient achieved a maximum heart rate of 137 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 71-year-old asymptomatic female patient with normal resting blood pressure, low serum cholesterol, and normal resting electrocardiogram results. She achieved a maximum heart rate of 125 without exercise-induced angina. The ST depression induced by exercise relative to rest was 1.6, and the slope of the peak exercise ST segment was flat. The fasting blood sugar level was not greater than 120 mg/dl.###\nHence this label was No."
"A 37-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 158, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 32-year-old female with atypical angina chest pain, normal resting blood pressure (105), and serum cholesterol (198). She has a fasting blood sugar level below 120 mg/dl and a normal resting electrocardiogram. With a maximum heart rate of 165 and no exercise-induced angina, her ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old asymptomatic male patient with resting blood pressure of 130 and serum cholesterol of 202. The patient has fasting blood sugar > 120 mg/dl and normal resting electrocardiogram results. He achieved a maximum heart rate of 112 and experienced exercise-induced angina. ST depression induced by exercise relative to rest was 2.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old male patient with atypical angina presented with normal resting blood pressure and slightly elevated serum cholesterol. Fasting blood sugar was normal, resting electrocardiogram results were normal, and the maximum heart rate achieved was 110. The patient did not experience exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 69-year-old male patient with non-anginal chest pain, resting blood pressure of 140, normal serum cholesterol levels, high fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 118, no exercise-induced angina, 2.5 ST depression induced by exercise relative to rest, and a downsloping peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 50-year-old female who is asymptomatic but shows signs of probable or definite left ventricular hypertrophy. Her resting blood pressure is 110, serum cholesterol level is 254. She has a maximum heart rate of 159 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. Fasting blood sugar levels are below 120 mg/dl.###\nHence this label was No."
"A 52-year-old asymptomatic male patient with normal resting blood pressure and cholesterol levels. He does not have fasting blood sugar above 120 mg/dl. His resting electrocardiogram results are normal, but he experiences exercise-induced angina. His maximum heart rate achieved is 126, and he has an ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment is flat. These factors suggest a potential risk for heart disease in this patient.###\nHence this label was Yes."
"A 67-year-old male patient with asymptomatic chest pain, normal blood pressure, high cholesterol, no fasting blood sugar elevation, probable or definite left ventricular hypertrophy on resting electrocardiogram, achieved a maximum heart rate of 125, experienced exercise-induced angina, had 0.9 ST depression induced by exercise relative to rest, and displayed a flat slope on the peak exercise ST segment.###\nHence this label was Yes."
"A 67-year-old male patient, who is asymptomatic, has a resting blood pressure of 120 and a serum cholesterol level of 229. Their resting electrocardiogram shows probable or definite left ventricular hypertrophy. They experienced exercise-induced angina and had an ST depression of 2.6. The slope of the peak exercise ST segment was flat, and their maximum heart rate achieved during the exercise was 129.###\nHence this label was Yes."
"A 45-year-old female patient with asymptomatic chest pain, normal resting blood pressure and high serum cholesterol levels. She does not have fasting blood sugar > 120 mg/dl. Her resting electrocardiogram results are normal and she achieved a maximum heart rate of 144 during exercise, without experiencing angina. The ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 49-year-old male patient with non-anginal chest pain, normal blood pressure, and low cholesterol levels. There are no signs of fasting blood sugar over 120 mg/dl. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 126 without experiencing exercise-induced angina. There was a slight ST depression of 0.8 induced by exercise relative to rest, with an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 61-year-old male patient with non-anginal chest pain has normal resting blood pressure and slightly elevated serum cholesterol. Their fasting blood sugar level is normal, and resting electrocardiogram results are also normal. The patient achieved a maximum heart rate of 123 during exercise, experienced exercise-induced angina, and had a slight ST depression relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 43-year-old male patient with no history of chest pain, but with probable or definite left ventricular hypertrophy shown on electrocardiogram. He experiences exercise-induced angina and has ST depression of 2.5mm after physical activity. His resting blood pressure is normal at 120mmHg, with serum cholesterol level at 177. Despite reaching a maximum heart rate of 120bpm, the slope of his peak exercise ST segment is flat.###\nHence this label was Yes."
"A 32-year-old male patient with typical angina chest pain, normal resting blood pressure of 95, fasting blood sugar > 120 mg/dl, normal electrocardiogram results, maximum heart rate of 127, no exercise-induced angina, ST depression of 0.7 induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was Yes."
"A 60-year-old male patient with non-anginal chest pain, resting blood pressure of 180, normal serum cholesterol levels, no fasting blood sugar over 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 140, experiencing exercise-induced angina, 1.5 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 57-year-old male patient, asymptomatic for chest pain, presented with a resting blood pressure of 150 and a serum cholesterol level of 255. His fasting blood sugar was below 120 mg/dl. His resting electrocardiogram results showed normal activity, and he achieved a maximum heart rate of 92. The patient experienced exercise-induced angina and had ST depression of 3.0 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 51-year-old male patient with atypical angina chest pain, normal resting blood pressure of 125, serum cholesterol level of 188, fasting blood sugar less than 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 145 without exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the peak exercise ST segment showed an upsloping slope.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They have a maximum heart rate of 162 and experienced exercise-induced angina. Their electrocardiogram results were normal, and they showed no fasting blood sugar > 120 mg/dl. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 51-year-old male patient with no serum cholesterol, normal resting blood pressure, and normal resting electrocardiogram results. He has fasted blood sugar over 120 mg/dl, asymptomatic chest pain, and achieved a maximum heart rate of 92 bpm. He did not experience exercise-induced angina and had no ST depression induced by exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 56-year-old male patient with atypical angina chest pain has normal resting blood pressure (126) and serum cholesterol levels (166). The resting electrocardiogram shows ST-T wave abnormalities, but the patient achieved a maximum heart rate of 140 without exercise-induced angina. There was no significant ST depression during exercise, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 51-year-old male patient with asymptomatic chest pain has a resting blood pressure of 132 and serum cholesterol level of 227. His fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 138 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 51-year-old female patient with non-anginal chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram results are normal, and the maximum heart rate achieved is 120. The patient did not experience exercise-induced angina. They had a slight ST depression of 0.5 induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 68-year-old male experiencing non-anginal chest pain. He has high blood pressure (180 mmHg) and high cholesterol levels (274 mg/dl). His fasting blood sugar is elevated (>120 mg/dl). The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 150 bpm during exercise, during which he experienced angina. His ST depression induced by exercise relative to rest is 1.6. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 37-year-old male with no symptoms of chest pain. His resting blood pressure is 120, and serum cholesterol level is 223. His fasting blood sugar is normal, and electrocardiogram results show a normal pattern. He achieved a maximum heart rate of 168 without experiencing exercise-induced angina. There is no ST depression induced by exercise, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 61-year-old male patient with asymptomatic chest pain, resting blood pressure of 134, normal serum cholesterol levels, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved of 86, no exercise-induced angina, ST depression of 1.5 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 39-year-old male patient with atypical angina chest pain, normal resting blood pressure of 120 and serum cholesterol of 204. Fasting blood sugar level is below 120 mg/dl. Resting electrocardiogram results are normal. Patient achieved a maximum heart rate of 145 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 52-year-old male patient with no typical chest pain symptoms, normal blood pressure, and cholesterol levels presented with a normal resting electrocardiogram. He achieved a maximum heart rate of 150 during exercise without experiencing angina. There was no ST depression induced by exercise relative to rest, and the peak exercise ST segment showed a flat slope.###\nHence this label was Yes."
"The patient is a 69-year-old male who is asymptomatic but has abnormal ST-T wave on resting electrocardiogram. He has a resting blood pressure of 140 and a serum cholesterol level of 208. Although his fasting blood sugar is not high, he experiences exercise-induced angina. His maximum heart rate achieved is 140, and he has a ST depression of 2.0 induced by exercise relative to rest with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old female patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 230, fasting blood sugar higher than 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 140, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 62-year-old male patient with asymptomatic chest pain, resting blood pressure of 158, serum cholesterol of 210, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, achieving a maximum heart rate of 112 with exercise-induced angina present. The patient experienced a ST depression of 3.0 induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment. These factors may indicate a possible heart disease in the patient.###\nHence this label was Yes."
"A 47-year-old male patient with non-anginal chest pain, normal resting blood pressure of 108, serum cholesterol level of 243, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 152, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was Yes."
"A 71-year-old female patient presenting with non-anginal chest pain, resting blood pressure of 110, serum cholesterol level of 265, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. Maximum heart rate achieved was 130, with no exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. The overall assessment indicates a possible heart disease risk in this patient.###\nHence this label was No."
"A 68-year-old female patient with non-anginal chest pain, normal resting blood pressure and cholesterol levels. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 115 and there is no exercise-induced angina. ST depression of 1.5mm relative to rest with a flat slope of peak exercise ST segment.###\nHence this label was No."
"A 65-year-old male patient with no history of chest pain or angina visited the clinic. His blood pressure and cholesterol levels were normal. The electrocardiogram results showed no signs of abnormality. Despite reaching a maximum heart rate of 140, the patient did not experience exercise-induced angina. There was a slight ST depression of 0.4mm caused by exercise, with an upsloping slope of the peak exercise ST segment. Overall, the patient's cardiovascular health appeared to be stable during the visit.###\nHence this label was No."
"A 41-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no fasting blood sugar issues, showing ST-T wave abnormality on rest electrocardiogram. They achieved a maximum heart rate of 111 without exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 50-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol of 264. Resting electrocardiogram results are normal, with a maximum heart rate of 150. The patient did not experience exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 51-year-old female patient, asymptomatic for chest pain, with a resting blood pressure of 160 and serum cholesterol of 303. Fasting blood sugar is normal, resting electrocardiogram shows normal results, and the patient achieved a maximum heart rate of 150. She experienced exercise-induced angina, with a 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 69-year-old male patient with asymptomatic chest pain has a resting blood pressure of 140 and serum cholesterol level of 110. They have a fasting blood sugar level above 120 mg/dl and normal resting electrocardiogram results. The patient achieved a maximum heart rate of 109 and experienced exercise-induced angina. They displayed ST depression of 1.5 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"This data describes a 45-year-old male patient with asymptomatic chest pain. He has a resting blood pressure of 104 and a serum cholesterol level of 208. His resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient experienced exercise-induced angina and had an ST depression of 3.0. His maximum heart rate achieved was 148, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 60-year-old female with typical angina chest pain, normal resting blood pressure of 150, serum cholesterol level of 240, normal fasting blood sugar, normal resting electrocardiogram results, achieved a maximum heart rate of 171 without exercise-induced angina. With ST depression of 0.9 induced by exercise relative to rest, showing an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 66-year-old male patient with asymptomatic chest pain, resting blood pressure of 112, serum cholesterol level of 212, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 132, exercise-induced angina present, ST depression induced by exercise relative to rest at 0.1, and a peak exercise ST segment slope that is upsloping.###\nHence this label was Yes."
"A 52-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, achieved a maximum heart rate of 110, experienced exercise-induced angina, had a slight ST depression induced by exercise relative to rest, and displayed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 63-year-old female who is asymptomatic but has high resting blood pressure and cholesterol levels. There is no fasting blood sugar > 120mg/dl present. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. Even though the patient achieved a high maximum heart rate of 154, there is no exercise-induced angina. However, ST depression induced by exercise relative to rest is significant at 4.0. The slope of the peak exercise ST segment is flat. These factors indicate a potential risk of heart disease.###\nHence this label was Yes."
"A 51-year-old female patient with atypical angina presented with normal resting blood pressure and serum cholesterol levels. Fasting blood sugar was below 120 mg/dl, and resting electrocardiogram results were normal. The patient achieved a maximum heart rate of 170 without exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. These factors suggest a relatively low risk of heart disease.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 139, and serum cholesterol level of 277. The patient has fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved is 118. Patient experiences exercise-induced angina, with ST depression of 1.9 relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 59-year-old male patient with atypical angina chest pain, normal resting blood pressure of 140, serum cholesterol level of 221, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved of 164, experienced exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 67-year-old male with asymptomatic chest pain. His resting blood pressure is 120, and he has normal electrocardiogram results. He has a maximum heart rate of 150 and does not experience exercise-induced angina. His serum cholesterol level is 0, and fasting blood sugar is above 120 mg/dl. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 66-year-old male patient with asymptomatic chest pain has a resting blood pressure of 120 and a serum cholesterol level of 302. Their electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 151, did not experience exercise-induced angina, and had a slight ST depression of 0.4. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 52-year-old male patient with non-anginal chest pain, resting blood pressure of 140, serum cholesterol level of 259, normal fasting blood sugar level, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 170, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 48-year-old male patient with atypical angina chest pain has a resting blood pressure of 130 and serum cholesterol level of 245. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 180 during exercise without experiencing angina. The ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 51-year-old male patient with no chest pain symptoms, normal resting blood pressure and cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and maximum heart rate achieved is 107. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 55-year-old male patient with non-anginal chest pain, normal resting blood pressure, no high serum cholesterol, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, achieved a maximum heart rate of 125, experienced exercise-induced angina, with 2.5 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain, normal resting blood pressure, low serum cholesterol, normal fasting blood sugar, normal resting electrocardiogram results, with a maximum heart rate of 120 bpm. The patient experiences exercise-induced angina, with ST depression of 1.5 relative to rest and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 40-year-old male patient with atypical angina chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate of 150, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 59-year-old male patient with non-anginal chest pain, normal resting blood pressure (130), high serum cholesterol (318), normal fasting blood sugar levels, a normal resting electrocardiogram, a maximum heart rate of 120, experienced exercise-induced angina, ST depression of 1.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 59-year-old male patient with non-anginal chest pain, normal resting blood pressure, and no fasting blood sugar elevation. Resting electrocardiogram results are normal, with a maximum heart rate of 128. The patient experiences exercise-induced angina and has an ST depression of 2.0 during exercise relative to rest, with a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 38-year-old male patient with atypical angina chest pain, normal resting blood pressure of 140, high serum cholesterol level of 297, normal fasting blood sugar, normal resting electrocardiogram results, achieving a maximum heart rate of 150 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment shows upsloping pattern.###\nHence this label was No."
"A 54-year-old female patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol level of 294, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate of 100, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and showing a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 50-year-old female patient with atypical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol. She has a good heart rate response during exercise, with no indication of fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram is normal, and there is no presence of exercise-induced angina. The ST depression induced by exercise relative to rest is 1.1, showing upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 41-year-old female patient presenting with atypical angina chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. They have no fasting blood sugar >120 mg/dl and show ST-T wave abnormality on resting electrocardiogram. The patient achieved a maximum heart rate of 142 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the peak exercise ST segment showed an upsloping slope.###\nHence this label was No."
"A 67-year-old male patient with typical angina chest pain, resting blood pressure of 145, no fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy on resting electrocardiogram. The patient achieved a maximum heart rate of 125, did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 60-year-old male patient with asymptomatic chest pain, normal resting blood pressure, slightly high serum cholesterol levels, no fasting blood sugar elevation, probable or definite left ventricular hypertrophy on resting electrocardiogram, reached a maximum heart rate of 141 during exercise, experienced exercise-induced angina, exhibited ST depression of 2.8 relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 45-year-old female with atypical angina chest pain. \nHer resting blood pressure is 130, and serum cholesterol level is 234. \nShe does not have fasting blood sugar above 120 mg/dl.\nThe resting electrocardiogram suggests probable or definite left ventricular hypertrophy.\nHer maximum heart rate achieved is 175, and she did not experience exercise-induced angina.\nST depression induced by exercise relative to rest is 0.6, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 52-year-old male patient with non-anginal chest pain has normal resting blood pressure (138) and a slightly elevated serum cholesterol level (223). Their fasting blood sugar is normal. Resting electrocardiogram results show normal activity. The patient achieved a high maximum heart rate of 169 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 48-year-old male patient with asymptomatic chest pain, normal resting blood pressure (120 mmHg) and high serum cholesterol levels (260 mg/dl). The patient's fasting blood sugar is normal, resting electrocardiogram shows normal results, and the maximum heart rate achieved during exercise is 115. He did not experience exercise-induced angina. There is ST depression of 2.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male with asymptomatic chest pain has high resting blood pressure and high serum cholesterol levels. Fasting blood sugar is above 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 135 without experiencing exercise-induced angina. There was a slight ST depression of 0.3 induced by exercise relative to rest, with a peak exercise ST segment showing upsloping pattern.###\nHence this label was No."
"A 55-year-old male patient with atypical angina chest pain has normal resting blood pressure and elevated serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 155 during exercise without experiencing angina. There was no ST depression induced by exercise relative to rest, and the peak exercise ST segment showed an upsloping pattern.###\nHence this label was No."
"A 57-year-old male patient with atypical angina chest pain, resting blood pressure of 140, serum cholesterol level of 265, no fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 145, presence of exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"This 61-year-old male patient has asymptomatic chest pain and normal resting blood pressure. His fasting blood sugar is below 120 mg/dl. His resting electrocardiogram is normal and he achieved a maximum heart rate of 105 during exercise. He experienced exercise-induced angina but had no ST depression. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 63-year-old male patient with non-anginal chest pain, resting blood pressure of 130, normal serum cholesterol levels, no fasting blood sugar > 120 mg/dL, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 111, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 62-year-old male with asymptomatic chest pain. He has high blood pressure and elevated cholesterol levels. His resting electrocardiogram shows ST-T wave abnormality. The patient experiences angina during exercise and has ST depression relative to rest. The peak exercise ST segment is flat. Despite these risk factors, his maximum heart rate achieved is 108.###\nHence this label was Yes."
"The patient is a 57-year-old male with asymptomatic chest pain. His resting blood pressure is 130, and serum cholesterol is 207. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 96. He experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 58-year-old female patient with no history of chest pain, normal blood pressure, and cholesterol levels visited the clinic. She had a normal resting electrocardiogram and achieved a maximum heart rate of 131 during exercise without experiencing angina. The ST depression induced by exercise relative to rest was 0.6, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"This data belongs to a 57-year-old male who is experiencing non-anginal chest pain. His resting blood pressure is high at 150, but his serum cholesterol levels are low at 126. He has high fasting blood sugar (>120 mg/dl) and normal resting electrocardiogram results. Despite his high blood pressure, his maximum heart rate achieved is quite high at 173. He does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is minimal at 0.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure (140), and serum cholesterol levels (201). They have a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 130. The patient experiences exercise-induced angina and has ST depression of 3.0 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 41-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 150, serum cholesterol level of 171, normal fasting blood sugar, normal resting electrocardiogram results, achieving a maximum heart rate of 128 during exercise, experiencing exercise-induced angina, showing a 1.5 ST depression induced by exercise relative to rest, and having a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 53-year-old male patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol level of 197, and fasting blood sugar over 120 mg/dl. The resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 152, did not experience exercise-induced angina, and had ST depression of 1.2 relative to rest. The slope of the peak exercise ST segment is downsloping.###\nHence this label was No."
"A 66-year-old female patient with asymptomatic chest pain has a resting blood pressure of 178 and serum cholesterol level of 228. Her fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows normal results and maximum heart rate achieved is 165. She experiences exercise-induced angina and has 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat. These factors indicate a potential risk for heart disease in this patient.###\nHence this label was Yes."
"A 70-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results, and the patient achieved a maximum heart rate of 125. They experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 2.6, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 60-year-old male patient with non-anginal chest pain, normal resting blood pressure, elevated serum cholesterol level, no fasting blood sugar above 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 135 with no exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130 and serum cholesterol level of 203. His fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results show normal activity, and his maximum heart rate achieved is 98. He does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 77-year-old male with asymptomatic chest pain. His resting blood pressure is 124 mmHg and serum cholesterol level is 171 mg/dl. He has a normal fasting blood sugar level and ST-T wave abnormality on resting electrocardiogram. The maximum heart rate achieved is 110 bpm. He experiences exercise-induced angina and has a 2.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 47-year-old male patient with atypical angina chest pain, normal resting blood pressure of 160, serum cholesterol level of 263, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 174, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 64-year-old male patient with typical angina chest pain, resting blood pressure of 170, serum cholesterol level of 227, no fasting blood sugar level above 120 mg/dl, and probable or definite left ventricular hypertrophy as per resting electrocardiogram results. The patient achieved a maximum heart rate of 155, did not experience exercise-induced angina, and had an ST depression of 0.6 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat in this case.###\nHence this label was No."
"A 46-year-old male patient with non-anginal chest pain, normal resting blood pressure of 150, serum cholesterol level of 231, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 147, no exercise-induced angina, significant ST depression of 3.6 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. These factors collectively provide insights into the patient's heart health and potential risk for heart disease.###\nHence this label was Yes."
"The patient is a 40-year-old male with asymptomatic chest pain. His resting blood pressure is 120 and serum cholesterol level is high at 466. He has fasting blood sugar level above 120 mg/dl. Resting electrocardiogram results are normal. He achieved a maximum heart rate of 152 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0 and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 51-year-old male patient with non-anginal chest pain, normal resting blood pressure, and slightly elevated serum cholesterol of 227. The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 154 during exercise, and experienced exercise-induced angina. There was no significant ST depression after exercise, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 95, normal electrocardiogram results, maximum heart rate of 182, no exercise-induced angina, and 0.7 ST depression induced by exercise. The patient has a serum cholesterol level of 0, fasting blood sugar above 120 mg/dl, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 37-year-old female patient with atypical angina chest pain has normal resting blood pressure and high serum cholesterol levels. They have a normal resting electrocardiogram result and achieved a maximum heart rate of 130 during exercise. The patient did not experience exercise-induced angina and showed no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 70-year-old male patient with asymptomatic chest pain has a resting blood pressure of 140 and normal electrocardiogram results. His maximum heart rate achieved is 157, and he experiences exercise-induced angina. His serum cholesterol level is 0, fasting blood sugar level is above 120 mg/dl, and ST depression induced by exercise relative to rest is 2.0. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 59-year-old female patient with asymptomatic chest pain, normal resting blood pressure of 174, and serum cholesterol levels at 249. The patient has a maximum heart rate of 143 and experienced exercise-induced angina. Their fasting blood sugar level is below 120 mg/dl and the ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 61-year-old male who is asymptomatic but has high resting blood pressure. Despite having normal serum cholesterol levels, they have fasting blood sugar greater than 120 mg/dL. The resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 145 without experiencing exercise-induced angina. They have a slight ST depression of 1.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 47-year-old male patient with asymptomatic chest pain, resting blood pressure of 110, normal serum cholesterol level, fasting blood sugar over 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. He achieved a maximum heart rate of 149 without exercise-induced angina. ST depression induced by exercise relative to rest was 2.1, with a upsloping peak exercise ST segment.###\nHence this label was Yes."
"A 52-year-old female patient with non-anginal chest pain, normal resting blood pressure of 125, and serum cholesterol level of 272. She has fasting blood sugar levels below 120 mg/dl and a normal resting electrocardiogram. Her maximum heart rate achieved is 139, without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 30-year-old female patient with typical angina chest pain, resting blood pressure of 170, serum cholesterol level of 237, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram results, achieved a maximum heart rate of 170, did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 45-year-old male patient with no symptoms of chest pain, normal resting blood pressure, and serum cholesterol levels. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal and the maximum heart rate achieved during exercise is 144. The patient did not experience exercise-induced angina and showed no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old female patient with typical angina chest pain, a resting blood pressure of 150, serum cholesterol level of 283, fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 162, no exercise-induced angina, ST depression of 1.0 induced by exercise relative to rest, and a peak exercise ST segment showing upsloping pattern.###\nHence this label was No."
"A 39-year-old male patient with non-anginal chest pain, resting blood pressure of 140, serum cholesterol of 321, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, achieved a maximum heart rate of 182 with no exercise-induced angina. ST depression induced by exercise relative to rest was 0.0 and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 62-year-old female patient with no symptoms of chest pain visited the clinic. Her resting blood pressure is 124, and serum cholesterol level is 209. She has normal results for resting electrocardiogram and did not experience exercise-induced angina. Her maximum heart rate achieved was 163, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 40-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol of 240. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal. Maximum heart rate achieved is 80. The patient experiences exercise-induced angina but no ST depression relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 50-year-old male patient with asymptomatic chest pain, resting blood pressure of 150, serum cholesterol level of 243. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 128. The patient did not experience exercise-induced angina. ST depression of 2.6 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 72-year-old male who experiences non-anginal chest pain. His resting blood pressure is 120 and serum cholesterol level is 214. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results show normal activity. He achieved a maximum heart rate of 102 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no fasting blood sugar elevation, and probable or definite left ventricular hypertrophy on resting electrocardiogram. He experienced exercise-induced angina and had a maximum heart rate of 106. His ST depression induced by exercise relative to rest was 1.5, and the slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 152, normal serum cholesterol levels, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 118, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 62-year-old male patient with atypical angina chest pain, resting blood pressure of 128, serum cholesterol level of 208, fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 140 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment slope is upsloping.###\nHence this label was No."
"A 37-year-old female patient with non-anginal chest pain, normal resting blood pressure (130), and serum cholesterol (211). Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 142 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 52-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 128, serum cholesterol level of 204, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 156, experienced exercise-induced angina, with 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. This data suggests a potential risk of heart disease in the patient.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 115, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 155, no exercise-induced angina, slight ST depression of 0.1 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 44-year-old male patient with atypical angina chest pain, normal resting blood pressure (130 mmHg), and slightly elevated serum cholesterol levels (215 mg/dl). The patient has a normal resting electrocardiogram, a maximum heart rate of 135 bpm, and did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 66-year-old male patient with non-anginal chest pain, resting blood pressure of 120, normal serum cholesterol level, no fasting blood sugar > 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. He achieved a maximum heart rate of 120 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest was -0.5, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 56-year-old male patient with non-anginal chest pain, a resting blood pressure of 170, no fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. He achieved a maximum heart rate of 123, experienced exercise-induced angina, and had ST depression of 2.5 relative to rest with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 63-year-old male who is experiencing no chest pain but has ST-T wave abnormality on resting electrocardiogram. His blood pressure is 110, cholesterol level is 252, and fasting blood sugar is not above 120 mg/dl. He has experienced exercise-induced angina and has a ST depression of 2.0 relative to rest. The slope of the peak exercise ST segment is flat, and he achieved a maximum heart rate of 140.###\nHence this label was Yes."
"A 43-year-old male patient with no typical chest pain symptoms visited the clinic. His blood pressure was 110, and his cholesterol level was 211. The resting electrocardiogram results showed normal activity. Despite having a maximum heart rate of 161, the patient did not experience exercise-induced angina. The ST segment depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol of 186, fasting blood sugar higher than 120 mg/dl, and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. The patient achieved a maximum heart rate of 140, experienced exercise-induced angina, had ST depression of 0.5 induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old female patient with non-anginal chest pain, resting blood pressure of 108, serum cholesterol level of 267, no fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 167, with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 72-year-old male patient, asymptomatic chest pain, with normal resting blood pressure and serum cholesterol levels. The patient does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 109 bpm. The patient experiences exercise-induced angina and has an ST depression of 1.4. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
