"A 42-year-old male patient with no history of chest pain presents with a resting blood pressure of 136 and a high serum cholesterol level of 315. His ECG shows normal results, and he achieved a maximum heart rate of 125 during exercise. The patient experienced exercise-induced angina and displayed ST depression of 1.8 relative to rest. The peak exercise ST segment slope was flat.###\nHence this label was Yes."
"A 76-year-old female patient with non-anginal chest pain, normal resting blood pressure, and average serum cholesterol level. Resting electrocardiogram shows ST-T wave abnormality. She achieved a maximum heart rate of 116 without exercise-induced angina. ST depression of 1.1 was induced by exercise relative to rest, with a flat slope of the peak exercise ST segment. Fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol of 207, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 96, experiencing exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 65-year-old female patient with non-anginal chest pain, high resting blood pressure of 140, elevated serum cholesterol level of 417, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved during exercise is 157, with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.8, and the slope of the peak exercise ST segment is upsloping. These factors suggest a possibility of heart disease in the patient.###\nHence this label was No."
"A 63-year-old asymptomatic male patient with normal resting blood pressure, fasting blood sugar greater than 120 mg/dl, and a maximum heart rate of 109. The patient did not experience exercise-induced angina and had a negative ST depression. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 58-year-old female patient with asymptomatic chest pain, high resting blood pressure of 170, and serum cholesterol of 225. The patient has fasting blood sugar over 120 mg/dl and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. She achieved a maximum heart rate of 146 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest was 2.8, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 43-year-old female patient with non-anginal chest pain, normal resting blood pressure of 150, serum cholesterol level of 254, no fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved of 175, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and upsloping peak exercise ST segment.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain had a resting blood pressure of 132 and serum cholesterol level of 218. His fasting blood sugar was below 120 mg/dl. Resting electrocardiogram showed ST-T wave abnormality. He achieved a maximum heart rate of 140 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest was 1.5, and the slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"A 64-year-old female patient with asymptomatic chest pain, normal resting blood pressure (130), elevated serum cholesterol (303), normal fasting blood sugar levels, normal resting electrocardiogram results, a maximum heart rate of 122, no exercise-induced angina, 2.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. Resting electrocardiogram results were normal, maximum heart rate achieved was 105. The patient did not experience fasting blood sugar over 120 mg/dl or exercise-induced angina. ST depression induced by exercise relative to rest was 2.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 52-year-old female patient with non-anginal chest pain, normal resting blood pressure of 125, and serum cholesterol level of 272. Fasting blood sugar is normal. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 139 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 38-year-old female patient with atypical angina presented normal resting blood pressure and high serum cholesterol levels. She had a normal fasting blood sugar level and achieved a maximum heart rate of 129. The patient did not experience exercise-induced angina and showed no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 41-year-old male patient with atypical angina presented with normal resting blood pressure, slightly elevated serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, and achieved a maximum heart rate of 153. The patient did not experience exercise-induced angina and showed no ST depression induced by exercise. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 57-year-old male with asymptomatic chest pain. His resting blood pressure is 140, serum cholesterol level is 214, and fasting blood sugar is below 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 144 during exercise, experienced angina, and had a 2.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 53-year-old male who is asymptomatic for chest pain. His resting blood pressure is 124, serum cholesterol is 243, and fasting blood sugar is normal. Resting electrocardiogram results show normal activity. He achieved a maximum heart rate of 122 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 52-year-old male with asymptomatic chest pain. His resting blood pressure is 120, and serum cholesterol is 182. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved at 150. He does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 46-year-old male patient with non-anginal chest pain had a resting blood pressure of 150 and a serum cholesterol level of 231. His fasting blood sugar was below 120 mg/dl. Resting electrocardiogram results showed normal activity, with a maximum heart rate of 147. The patient did not experience exercise-induced angina. There was a ST depression of 3.6 induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 70-year-old male patient with asymptomatic chest pain, resting blood pressure of 170, serum cholesterol of 192, normal fasting blood sugar, ST-T wave abnormality on electrocardiogram, maximum heart rate of 129, experiencing exercise-induced angina, ST depression of 3.0, and a downsloping peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 58-year-old female with no history of chest pain, high blood pressure, or high fasting blood sugar. The resting electrocardiogram suggests a probable or definite left ventricular hypertrophy. Despite achieving a maximum heart rate of 122 during exercise, the patient did not experience angina. The ST segment depression induced by exercise relative to rest was 1.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 56-year-old male patient with atypical angina chest pain, normal resting blood pressure, and low serum cholesterol levels. The patient shows no signs of fasting blood sugar exceeding 120 mg/dl and exhibits ST-T wave abnormality in resting electrocardiogram results. Despite achieving a maximum heart rate of 140, the patient experiences no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 59-year-old male patient with typical angina chest pain, normal resting blood pressure of 134, and serum cholesterol level of 204. The patient's fasting blood sugar is normal, resting electrocardiogram results are normal, and the maximum heart rate achieved is 162. The patient does not experience exercise-induced angina, has an ST depression of 0.8 induced by exercise relative to rest, and shows an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 53-year-old male patient with atypical angina chest pain, normal resting blood pressure (140), slightly elevated serum cholesterol (320), normal fasting blood sugar levels, normal resting electrocardiogram results, high maximum heart rate achieved (162), no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 53-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, no fasting blood sugar >120 mg/dl, and probable or definite left ventricular hypertrophy according to resting electrocardiogram results. He achieved a maximum heart rate of 135 with exercise-induced angina present. ST depression of 1.0 was induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 39-year-old male who is asymptomatic for chest pain. His resting blood pressure is 130 and serum cholesterol is 307. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results show normal findings. His maximum heart rate achieved is 140 and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 47-year-old male patient with non-anginal chest pain, normal resting blood pressure (155), and no fasting blood sugar > 120 mg/dl. The patient achieved a maximum heart rate of 118 during exercise, experienced exercise-induced angina, and showed 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results. He achieved a maximum heart rate of 110 during exercise, experienced exercise-induced angina, and had ST depression of 1.5 relative to rest. The slope of the peak exercise ST segment was upsloping. This data suggests a possible heart disease risk.###\nHence this label was Yes."
"A 64-year-old male patient with non-anginal chest pain, normal resting blood pressure of 140, high serum cholesterol of 335, normal fasting blood sugar levels, normal resting electrocardiogram results, a maximum heart rate of 158 achieved during exercise, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment. These factors combined suggest a low likelihood of heart disease in this patient.###\nHence this label was Yes."
"The 62-year-old female patient has asymptomatic chest pain and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. Her blood pressure is 140, serum cholesterol is 268, and fasting blood sugar is normal. She achieved a maximum heart rate of 160 during exercise without experiencing angina. The ST depression induced by exercise relative to rest is 3.6, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 38-year-old male patient is asymptomatic but experiences exercise-induced angina. His resting blood pressure is 110, serum cholesterol level is 289, and maximum heart rate achieved is 105. He has a normal resting electrocardiogram with ST depression of 1.5 induced by exercise. The slope of the peak exercise ST segment is downsloping, and fasting blood sugar is below 120 mg/dl.###\nHence this label was Yes."
"A 54-year-old male patient presenting with non-anginal chest pain, normal resting blood pressure (120), and slightly elevated serum cholesterol (217). Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 137 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment slopes upwards.###\nHence this label was No."
"A 58-year-old male patient with atypical angina chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 110, experienced exercise-induced angina, with ST depression of 2.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 53-year-old male with asymptomatic chest pain. His resting blood pressure is 140, serum cholesterol is 203, and fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 155, experienced exercise-induced angina, and had ST depression of 3.1 relative to rest. The slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain had a resting blood pressure of 122 and serum cholesterol level of 223. He had a fasting blood sugar level higher than 120 mg/dl. Resting electrocardiogram results showed ST-T wave abnormality. The patient achieved a maximum heart rate of 100 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 48-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol level of 256, fasting blood sugar higher than 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram, maximum heart rate achieved at 150, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and a peak exercise ST segment showing upsloping. These factors could help predict the likelihood of heart disease in the patient.###\nHence this label was Yes."
"A 43-year-old male patient with no chest pain symptoms and normal resting blood pressure and cholesterol levels. His fasting blood sugar is normal and resting electrocardiogram results are normal. He achieved a maximum heart rate of 161 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. This data indicates a relatively healthy cardiovascular profile for the patient.###\nHence this label was No."
"The patient is a 51-year-old female with non-anginal chest pain. She has normal resting blood pressure (150), serum cholesterol (200), and fasting blood sugar levels. Results from resting electrocardiogram are normal. Her maximum heart rate achieved is 120 and she did not experience exercise-induced angina. She had a slight ST depression of 0.5 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 37-year-old female patient with atypical angina presents normal resting blood pressure, high serum cholesterol, normal fasting blood sugar levels, and a maximum heart rate of 130. She does not experience exercise-induced angina and shows no ST depression after physical activity. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 61-year-old male patient with asymptomatic chest pain has a resting blood pressure of 140 and serum cholesterol level of 207. They do not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 138 and experienced exercise-induced angina. Their ST depression induced by exercise relative to rest is 1.9, and the peak exercise ST segment slope is upsloping.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, resting blood pressure of 124, serum cholesterol level of 266, no fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 109 during exercise, experienced exercise-induced angina, and had ST depression of 2.2 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 45-year-old male patient with atypical angina chest pain, resting blood pressure of 128, serum cholesterol level of 308, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 170, no exercise-induced angina, no ST depression induced by exercise relative to rest, and upsloping peak exercise ST segment.###\nHence this label was No."
"A 52-year-old asymptomatic male with normal resting blood pressure and cholesterol levels. His maximum heart rate reached 126 during exercise, with a slight ST depression of 1.5. He experienced exercise-induced angina and had a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 47-year-old female patient with atypical angina chest pain, normal resting blood pressure (140), and slightly elevated serum cholesterol levels (257). They do not have fasting blood sugar > 120 mg/dl and show a normal resting electrocardiogram. The patient achieved a maximum heart rate of 135 without experiencing exercise-induced angina. They had a minor ST depression of 1.0 induced by exercise relative to rest, with an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 47-year-old female patient with non-anginal chest pain, normal resting blood pressure of 130, and serum cholesterol level of 235. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 145. She did not experience exercise-induced angina, had a ST depression of 2.0 induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 37-year-old male patient with non-anginal chest pain, normal resting blood pressure of 130, serum cholesterol level of 250, normal fasting blood sugar, normal resting electrocardiogram results, a high maximum heart rate of 187, no exercise-induced angina, ST depression of 3.5 induced by exercise relative to rest, and a downsloping peak exercise ST segment.###\nHence this label was No."
"A 51-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram is normal, with a maximum heart rate of 127. The patient experiences exercise-induced angina and has a ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping. These factors can help predict the possibility of heart disease in the patient.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain, resting blood pressure of 164, and serum cholesterol of 176. The patient has fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram. Maximum heart rate achieved is 90, no exercise-induced angina present. ST depression induced by exercise relative to rest is 1.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 45-year-old male patient with atypical angina chest pain has a resting blood pressure of 140 and a serum cholesterol level of 224. The patient has fasting blood sugar over 120 mg/dl. Resting electrocardiogram results show normal activity, and the maximum heart rate achieved is 122. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. These factors suggest a low to moderate risk of heart disease.###\nHence this label was No."
"A 42-year-old female patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. She has a healthy fasting blood sugar level and electrocardiogram results. Her maximum heart rate achieved is 173, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"The patient is a 58-year-old male with non-anginal chest pain. His resting blood pressure is 130 and serum cholesterol level is 213. He does not have fasting blood sugar above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 140 and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 62-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and low serum cholesterol. Resting electrocardiogram shows ST-T wave abnormality. Patient experiences exercise-induced angina but achieves a maximum heart rate of only 97. ST depression induced by exercise relative to rest is 1.6, with a upsloping ST segment during peak exercise.###\nHence this label was Yes."
"A 68-year-old female patient with non-anginal chest pain visited the clinic. She had a resting blood pressure of 120 and serum cholesterol level of 211. Her resting electrocardiogram showed probable or definite left ventricular hypertrophy. Despite achieving a maximum heart rate of 115 during exercise, she did not experience angina. However, ST depression of 1.5 was induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 54-year-old female patient with atypical angina presented with normal resting blood pressure and elevated serum cholesterol. She had a maximum heart rate of 150 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 1.5, and the slope of the peak exercise ST segment was flat. Fasting blood sugar was normal, and resting electrocardiogram results showed no abnormalities.###\nHence this label was No."
"A 45-year-old male patient with asymptomatic chest pain, resting blood pressure of 142, serum cholesterol level of 309, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 147, experiencing exercise-induced angina, with no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 48-year-old female patient with non-anginal chest pain, normal resting blood pressure (130), slightly elevated serum cholesterol levels (275), normal fasting blood sugar, normal resting electrocardiogram results, a maximum heart rate of 139, no exercise-induced angina, a slight ST depression of 0.2 induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 69-year-old male patient with non-anginal chest pain, resting blood pressure of 140, normal serum cholesterol levels, high fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 118, no exercise-induced angina, 2.5 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 52-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. They have fasting blood sugar over 120 mg/dl, a normal resting electrocardiogram, and a high maximum heart rate of 147. The patient does not experience exercise-induced angina and has a minor ST depression of 0.1. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 64-year-old male with asymptomatic chest pain. His resting blood pressure is 141 and serum cholesterol is 244. He has a fasting blood sugar level over 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 116. The patient experiences exercise-induced angina and has ST depression of 1.5 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 47-year-old female patient with asymptomatic chest pain has normal resting blood pressure and moderate serum cholesterol levels. They do not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram results are normal, but the patient experiences exercise-induced angina. The maximum heart rate achieved is 98, and there is a 2.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat. These factors indicate a potential risk for heart disease in this patient.###\nHence this label was Yes."
"A 52-year-old male patient with non-anginal chest pain, normal resting blood pressure of 138, serum cholesterol level of 223, fasting blood sugar below 120 mg/dl, normal ECG results, maximum heart rate achieved at 169, no exercise-induced angina, ST depression of 0.0, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 65-year-old male patient with asymptomatic chest pain, normal resting blood pressure (150), and serum cholesterol level of 235. The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 120 during exercise, and experienced exercise-induced angina. ST depression induced by exercise relative to rest was 1.5, with a flat slope of the peak exercise ST segment. Fasting blood sugar was not above 120 mg/dl.###\nHence this label was Yes."
"A 46-year-old male patient presenting with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 150 during exercise. There was no exercise-induced angina, and the ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 48-year-old female with non-anginal chest pain had normal resting blood pressure and serum cholesterol levels. She had a fasting blood sugar level below 120 mg/dl and a normal resting electrocardiogram. Her maximum heart rate achieved during exercise was 125, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 63-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and they achieved a maximum heart rate of 136. The patient experienced exercise-induced angina but showed no ST depression induced by exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 55-year-old female patient with atypical angina chest pain, normal resting blood pressure of 132, high serum cholesterol of 342, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 166, no exercise-induced angina, 1.2 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment. These factors may be indicative of a heart disease risk assessment.###\nHence this label was No."
