"The patient is a 46-year-old male with no history of chest pain, normal blood sugar levels, and an abnormal resting electrocardiogram showing ST-T wave abnormality. Despite a resting blood pressure of 110 and a high serum cholesterol level of 238, the patient achieved a maximum heart rate of 140 during exercise. They experienced angina during exercise and had a 1.0 ST depression relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. They have a normal resting electrocardiogram and achieved a moderate maximum heart rate during exercise. The patient experienced exercise-induced angina but did not show any ST depression. The peak exercise ST segment showed a flat slope.###\nHence this label was Yes."
"The patient is a 43-year-old male who is asymptomatic but has high resting blood pressure and cholesterol levels. They have fasting blood sugar levels above 120 mg/dl and probable or definite left ventricular hypertrophy according to their electrocardiogram. The patient experiences exercise-induced angina and has a slightly depressed ST segment compared to rest. Their maximum heart rate achieved during exercise is 143 and the slope of the peak exercise ST segment is flat. Overall, these factors indicate a potential risk for heart disease in this individual.###\nHence this label was Yes."
"The patient is a 38-year-old male with non-anginal chest pain. His resting blood pressure is 138 and serum cholesterol is 175. He has normal fasting blood sugar levels and rest electrocardiogram results. The patient achieved a maximum heart rate of 173 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The 52-year-old male patient has asymptomatic chest pain with normal resting blood pressure and serum cholesterol levels. They have fasting blood sugar above 120 mg/dl, a normal resting electrocardiogram, and achieved a maximum heart rate of 82. The patient experienced exercise-induced angina and had ST depression of 0.8 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 39-year-old female patient with non-anginal chest pain has a resting blood pressure of 110 and a serum cholesterol level of 182. Their fasting blood sugar is normal. The resting electrocardiogram shows ST-T wave abnormality, and they achieved a maximum heart rate of 180 without experiencing exercise-induced angina. Their ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment slope is upsloping.###\nHence this label was No."
"A 59-year-old female patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a normal resting electrocardiogram and achieved a maximum heart rate of 124. She did not experience exercise-induced angina and had a mild ST depression of 1.0 induced by exercise. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 53-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no serum cholesterol, normal resting electrocardiogram results, maximum heart rate of 141, experience of exercise-induced angina, 2.0 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 63-year-old male patient with non-anginal chest pain, resting blood pressure of 130, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 160, no exercise-induced angina, 3.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 56-year-old male patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol level of 256, fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 142, exercise-induced angina present, 0.6 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old male patient presents with non-anginal chest pain. His resting blood pressure is 120, and serum cholesterol is 188. Fasting blood sugar is normal. Resting electrocardiogram results are normal, and he achieved a maximum heart rate of 139. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 44-year-old male patient experienced non-anginal chest pain. His resting blood pressure was 130, and serum cholesterol level was 233. He had normal resting electrocardiogram results and a maximum heart rate of 179. The patient experienced exercise-induced angina but had only a slight ST depression of 0.4 relative to rest. The slope of the peak exercise ST segment was upsloping. Fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 47-year-old male patient with non-anginal chest pain, normal resting blood pressure (130), slightly elevated serum cholesterol (253), fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, high maximum heart rate achieved (179), no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 37-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and healthy serum cholesterol levels. Resting electrocardiogram shows ST-T wave abnormality. She achieved a maximum heart rate of 184 without exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the peak exercise ST segment slope was upsloping. Overall, the patient's heart disease risk factors appear to be low based on the provided data.###\nHence this label was No."
"The patient is a 60-year-old male with no history of chest pain, but with probable or definite left ventricular hypertrophy. His resting blood pressure is 125, serum cholesterol is 258, and he experienced exercise-induced angina. His maximum heart rate achieved was 141, and he had an ST depression of 2.8 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 46-year-old male patient with no symptoms of chest pain, normal resting blood pressure and high serum cholesterol levels. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 140 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment slope is upsloping.###\nHence this label was No."
"A 32-year-old male patient with atypical angina chest pain, normal resting blood pressure of 110, serum cholesterol level of 225, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 184, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 40-year-old male patient with non-anginal chest pain, normal resting blood pressure of 130, serum cholesterol level of 215, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 138, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 52-year-old male who is experiencing asymptomatic chest pain. His resting blood pressure is 135, with normal results on his resting electrocardiogram. He has fasting blood sugar levels above 120 mg/dl. He achieved a maximum heart rate of 128 during exercise, which induced angina. The patient also experienced ST depression of 2.0 relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 42-year-old male patient with atypical angina chest pain has normal resting blood pressure and serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 150 during exercise, without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. Fasting blood sugar was below 120 mg/dl.###\nHence this label was No."
"A 49-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, and a maximum heart rate of 132. The patient did not experience exercise-induced angina, had a 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 53-year-old female patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol level of 264, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy shown on resting electrocardiogram, maximum heart rate achieved of 143, no exercise-induced angina, ST depression of 0.4 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, no serum cholesterol, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 98, experiencing exercise-induced angina, with ST depression of 2.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with non-anginal chest pain had a resting blood pressure of 136 and serum cholesterol level of 228. Their fasting blood sugar was normal. Resting electrocardiogram showed ST-T wave abnormality. The patient achieved a maximum heart rate of 124 during exercise and experienced angina. They had ST depression of 1.6 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 43-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, a maximum heart rate of 122, no exercise-induced angina, 1.5 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 45-year-old asymptomatic male patient with normal resting blood pressure and cholesterol levels. Resting electrocardiogram results are also normal. Maximum heart rate achieved during exercise is 144, with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. No fasting blood sugar above 120 mg/dl.###\nHence this label was No."
"A 66-year-old female patient with asymptomatic chest pain, resting blood pressure of 155, normal resting electrocardiogram results, and a maximum heart rate of 90. The patient has fasting blood sugar over 120 mg/dl, no exercise-induced angina, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain has a resting blood pressure of 132 and a serum cholesterol level of 353. Their resting electrocardiogram is normal, and they achieved a maximum heart rate of 132. They experienced exercise-induced angina and had a ST depression of 1.2 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, resting blood pressure of 128, normal serum cholesterol levels, fasting blood sugar over 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 148, experiencing exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old female patient with asymptomatic chest pain has:\n- Resting blood pressure of 140\n- Serum cholesterol level of 241\n- Normal resting electrocardiogram\n- Maximum heart rate achieved at 123\n- Experience exercise-induced angina\n- ST depression of 0.2 induced by exercise relative to rest\n- Flat slope of the peak exercise ST segment###\nHence this label was Yes."
"A 40-year-old male patient with atypical angina chest pain has normal resting blood pressure and high serum cholesterol levels. Their fasting blood sugar is normal. Resting electrocardiogram results are normal, and they achieved a maximum heart rate of 150 without exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 64-year-old male patient with asymptomatic chest pain, high resting blood pressure of 143, elevated serum cholesterol level of 306, and fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 115 during exercise, experienced angina, and showed ST depression of 1.8 induced by exercise. The slope of the peak exercise ST segment was flat. These factors indicate a potential risk of heart disease in the patient.###\nHence this label was Yes."
