"This is a 66-year-old widowed Black female in the United States. She works in the transportation, communication, and other public utilities sector for the local government. She is a high school graduate and works 40 hours per week with no capital gain or loss last year. She is not related to the head of the household.###\nHence this label was No."
"The individual is a 35-year-old married white male from the United States working as an executive in the private sector. He holds a bachelor's degree and works 40 hours per week with no significant capital gains or losses in the past year.###\nHence this label was Yes."
"The individual is a 53-year-old married White male from the United States. He works in the technology and support sector as a private sector employee, with a college education for less than one year. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"The individual is a 55-year-old Black male from the United States. He is divorced and currently unmarried. He works in execution and management for the state government, holding a bachelor's degree. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"This 22-year-old white female is never married and not living with family. She is from the United States and works in the private sector as a sales employee. Despite attending college for some time, she did not graduate. Last year, she had no capital gains or losses. She works 37 hours per week.###\nHence this label was No."
"The individual is a 31-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He is the husband in the household and has a high school education. Last year, he had no capital gains or losses. He works 50 hours per week. This person's annual income is being predicted to be over $50,000.###\nHence this label was No."
"The individual is a 42-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a college education for less than one year. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was No."
"This individual is an 18-year-old White female from the United States who has never been married. She is classified as an own-child in her household. She works in the private sector as an office and administrative support employee, with a college education of less than one year. Despite her young age, she works a standard 40-hour work week with no capital gains or losses from the previous year.###\nHence this label was No."
"This individual is a 21-year-old White female from the United States who has never been married. She is classified as an own-child in relation to the head of the household. She has not specified her occupation or work class. She has no capital gains or losses from the previous year. Her education level is college for less than one year, and she works 40 hours per week.###\nHence this label was No."
"The person is a 30-year-old married White male from the United States. He works in the craft and repair sector as the owner of an incorporated business, professional practice, or farm. He has a bachelor's degree and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The person is a 43-year-old married White male from the United States. He works in the craft and repair sector as the owner of a non-incorporated business, professional practice, or farm. He is a high school graduate and works 35 hours per week. Additionally, he had no capital gains or losses last year.###\nHence this label was No."
"The individual is a 52-year-old White male from the United States. He is divorced and not living with family. His occupation and work class are not specified. He has no capital gain or loss from the previous year. His education level is high school graduate, and he works 45 hours per week.###\nHence this label was Yes."
"The individual is a 31-year-old White female from the United States. She is divorced and not living with any family members. She is the owner of an incorporated business, professional practice, or farm, working in execution and management. She attended college for less than one year. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was No."
"This person is a 51-year-old divorced white female from the United States. She is unmarried and works as a machine operator and inspector in the private sector, with a high school education. She had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 64-year-old White male from the United States. He is divorced and does not live with family. He owns a non-incorporated business, professional practice, or farm, working in a professional specialty occupation. With a master's degree education, he works an average of 50 hours per week. Last year, he experienced neither capital gain nor loss.###\nHence this label was No."
"This individual is a 32-year-old unmarried White female from the United States. She is not living with family and works in the private sector as an execution and management professional. With a master's degree, she works 60 hours per week, indicating a strong commitment to her career. Her significant capital gain from last year suggests financial success, potentially exceeding an annual income of $50,000.###\nHence this label was Yes."
"This individual is a 40-year-old married White male from the United States. He works in the private sector as an executive and manager, having graduated high school. With a work week of 50 hours, he had a capital gain of $7688 last year and no capital loss.###\nHence this label was Yes."
"This dataset entry describes a 19-year-old white female from Mexico who has never been married. She is categorized as an own-child in the household. She works in the service sector as an owner of a non-incorporated business, professional practice, or farm, with a college education of less than one year. She worked 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 34-year-old White female from the United States. She is divorced and lives as an own-child in the household. She has a bachelor's degree education level but her current occupation and work class are unknown. Her capital gain and loss last year were both 0. She works 40 hours per week.###\nHence this label was No."
"This individual is a 49-year-old White female from the United States. She is divorced and not living with any family members. She works in the sales sector as a private sector employee, with a high school education. Last year, she had no capital gain or loss. She works 32 hours per week.###\nHence this label was No."
"The individual is a 26-year-old married White male from the United States. He works in the private sector as an employee in the cleaning and maintenance sector, with a workweek of 40 hours. He has no capital gain or loss from last year and has completed 10th class education.###\nHence this label was No."
"This person is a 41-year-old Black male, separated and not living with family, from the United States. He works as a machine operator and inspector in the private sector, with no capital gains or losses last year. He has less than a year of college education and works 40 hours per week.###\nHence this label was No."
"This individual is a 41-year-old married white male from the United States. He works in the protective services sector for the local government, with a high school education. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"The individual in the dataset is a 62-year-old White male from the United States. He is married and works in office and administrative support for the state government. With a bachelor's degree, he puts in 38 hours of work per week, with no reported capital gain or loss last year.###\nHence this label was No."
"This individual is a 25-year-old White male from the United States who has never been married. He is not living with family, has no reported occupation or work class, and had no capital gain or loss last year. He has received some college education, working 40 hours per week.###\nHence this label was No."
"This individual is a 22-year-old Black male from the United States who has never been married. He is classified as an Own-child in the household. He has not specified his occupation or work class. Despite having completed less than a year of college education, he works 40 hours per week with no financial gains or losses reported in the previous year.###\nHence this label was No."
"This individual is a 27-year-old Black female who is married and is the wife in the household. She holds a bachelor's degree and works an average of 35 hours per week. There is no information provided about her occupation, work class, or native country. Additionally, she did not have any capital gains or losses last year.###\nHence this label was Yes."
"This individual is a 65-year-old white male from the United States. He is widowed and not living with any family members. He works in execution and management for the local government, putting in 44 hours per week. Despite not earning a diploma, he has completed 12th grade education. Last year, he had a capital gain of 2009 and did not incur any capital losses.###\nHence this label was No."
"The person is a 61-year-old Black male from the United States. He is married and is the husband in the household. He works in the service sector as the owner of a non-incorporated business, professional practice, or farm. He has no capital gain or loss from last year. His education level is a high school graduate. He works 12 hours per week.###\nHence this label was No."
"The individual is a 31-year-old White female from the United States, married and working in the private sector as an execution and management professional. She is a high school graduate working 35 hours per week with no capital gains or losses last year.###\nHence this label was No."
"This person is a divorced 43-year-old White male from the United States. He works in the craft and repair sector as a private sector employee, with a college education for less than one year. He is not living with family and had no capital gains or losses last year. He works 40 hours per week.###\nHence this label was No."
"The individual is a 51-year-old White male from the United States. He is married and works in an office and administrative support role for the federal government. He has a high school education and works 40 hours per week with no capital gain or loss last year.###\nHence this label was Yes."
"The person is an 18-year-old White female from the United States who has never been married and is living with their own parents. They recently graduated from high school and are currently not working. Despite their young age, they work 40 hours a week and did not have any capital gains or losses last year.###\nHence this label was No."
"This individual is a 33-year-old White male from the United States who has never been married and is not living with family. He works in the private sector as an execution and management employee, having completed less than a year of college education. Despite working 45 hours per week, he did not experience any capital gain or loss last year.###\nHence this label was No."
"This person is a 33-year-old separated White female from the United States. She is unmarried and a high school graduate. She had no capital gain or loss last year. Her occupation and work class are not specified, and she works 20 hours per week.###\nHence this label was No."
"The person is a 48-year-old White male from the United States. He is divorced and not living with any family members. He works in the sales sector as an owner of a non-incorporated business, professional practice, or farm. He has a bachelor's degree and works 60 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This individual is a 58-year-old White female from the United States. She is divorced and not living with family. She works in an office and administrative support role in the private sector, with a work week of 40 hours. She is a high school graduate with no capital gain or loss last year.###\nHence this label was No."
"This 27-year-old White male, who has never been married, is an own-child living in the United States. He works in the craft and repair sector as a private sector employee, holding an associate's degree. Last year, he had no capital gain or loss. He typically works 40 hours per week.###\nHence this label was No."
"The person is a 50-year-old White female from the United States who has never been married. She is not living with any family members and works in an executive and management role for the state government. She has a bachelor's degree and works 40 hours per week. Last year, she did not have any capital gains or losses.###\nHence this label was No."
"This individual is a 36-year-old unmarried White female, who is separated and living in the United States. She is employed in the craft and repair sector as a private sector employee. She is a high school graduate and works 40 hours per week. Last year, she did not have any capital gains or losses.###\nHence this label was No."
"The individual is a 61-year-old married White male from the United States. He works in an office and administrative support role for the federal government, putting in 40 hours per week. Despite not having any capital gain last year, he experienced a capital loss of $1887. His education level is college for less than one year.###\nHence this label was Yes."
"The individual is a 36-year-old White male from the United States. He is divorced and has an occupation in the transportation, communication, and other public utilities sector as a private sector employee. He is classified as an own-child in relation to the head of the household. He has a high school education and worked 40 hours per week. He had no capital gain or loss last year.###\nHence this label was No."
"The person is a 30-year-old White male from the United States. He is divorced and not living with family. He owns a non-incorporated business, professional practice, or farm in the craft and repair sector. He had no capital gains or losses last year. His education level is college for less than one year, and he works 35 hours per week.###\nHence this label was No."
"This individual is a 50-year-old married white male from the United States. He holds a doctoral degree and works in a professional specialty occupation. He is the husband in his household and is the owner of a non-incorporated business, professional practice, or farm. Despite working only 23 hours per week with no capital gains or losses last year, he has an annual income over $50,000.###\nHence this label was No."
"This individual is a 25-year-old married white female from the United States. She works in execution and management for the state government, with less than one year of college education. Despite working only 19 hours per week, she had no capital gains or losses last year.###\nHence this label was No."
"This dataset entry is about a 22-year-old White female from the United States who has never been married. She is not living with any family member and works in the private sector as a sales sector employee. She had no capital gain but incurred a loss of $1762 last year. She finished 10th grade and works 25 hours per week.###\nHence this label was No."
"The individual is a 64-year-old married White male from the United States. He works in the craft and repair sector as an owner of an incorporated business, professional practice, or farm. He has not experienced any capital gains or losses in the last year. His education level is college for one or more years without a degree, and he works 10 hours per week.###\nHence this label was No."
"This individual is a 47-year-old White female from Cuba. She is divorced and currently unmarried. She works as a machine operator and inspector in the private sector, having completed 9th grade in terms of education. With no capital gain or loss last year, she works 40 hours per week.###\nHence this label was No."
"This individual is a 21-year-old white male from the United States. He has never been married and is categorized as an own-child in terms of relation to the head of the household. His occupation and work class are unspecified. He did not have any capital gains or losses last year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"The person is a 55-year-old White male from the United States. He is married and works in the craft and repair sector as a private sector employee. He has a high school education and works 50 hours per week. Last year, he had no capital gain or loss.###\nHence this label was Yes."
"This individual is a 57-year-old married White male from the United States. He works in the private sector as a cleaning and maintenance worker, with a high school education. He worked 40 hours per week, with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 51-year-old White female from the United States. She is married and works in the private sector as an office and administrative support worker. She has no capital gains or losses from the previous year. She has received college education for less than a year and works 35 hours per week.###\nHence this label was No."
"The person in the dataset is a 38-year-old White male from the United States who has never been married. He is not living with family. His occupation is in the agriculture, forestry, and fisheries sector, and he is the owner of a non-incorporated business, professional practice, or farm. He attained a high school education and works 52 hours per week. In the past year, he did not have any capital gains or losses.###\nHence this label was No."
"This person is a 47-year-old White male from the United States who is married and works as a craftsman in the repair sector. He owns an incorporated business, professional practice, or farm, and has a high school education. He had no capital gains or losses last year and works 40 hours a week.###\nHence this label was Yes."
"The individual is a 24-year-old unmarried White female living in the United States. She is an office and administrative support worker in the private sector with an associate's degree. She has no capital gain or loss from last year and works 15 hours per week.###\nHence this label was No."
"This individual is a 47-year-old married White male from the United States. He holds a master's degree and works in the private sector as an executive manager. Last year, he had no capital gain or loss. He works 40 hours per week.###\nHence this label was Yes."
"The individual is a 27-year-old White male from the United States. He is married and works as a private sector employee in the cleaning and maintenance sector, with a work week of 40 hours. He finished 11th class for education and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 52-year-old married White male from the United States. He works in the private sector in an office and administrative support role, putting in 40 hours per week. He has not experienced any capital gain or loss in the past year. His education level is college for one or more years without a degree.###\nHence this label was No."
"The individual is a 43-year-old Asian-Pac-Islander male living in the United States. He is divorced and not living with family. He works in the cleaning and maintenance sector for the federal government, with no capital gain or loss last year. He has education equivalent to college for less than one year and works 40 hours per week.###\nHence this label was No."
"The individual is a 35-year-old white male from the United States. He is married and works in the craft and repair sector as a private sector employee. He is a high school graduate and works 48 hours per week. Last year, he did not have any capital gains or losses.###\nHence this label was No."
"The individual is a 25-year-old Black male from Japan. He is never married and not living with family. He works in the service sector as a private sector employee, with a high school education. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"This person is a 37-year-old married White male living in the United States. He works in the craft and repair sector as a private sector employee. Despite having a college education for less than one year, he works 40 hours per week with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 47-year-old married White male from Mexico. He works in the private sector as an office and administrative support employee. With a high school education, he works 40 hours per week with no capital gains or losses last year.###\nHence this label was No."
"This 25-year-old White female is never married and not living with family in the United States. She works in the technology and support sector as a private sector employee with an associate's degree. Despite having no capital gain or loss last year, she works 45 hours per week.###\nHence this label was No."
"The individual is a 21-year-old White female from the United States who has never been married. She is categorized as an Own-child in relation to the head of the household. She works in execution and management for the state government, with an education level of college for less than one year. In the past year, she had no capital gains or losses. She works 20 hours per week.###\nHence this label was No."
"The individual is a 44-year-old married White male from the United States. He is the husband in his household and works as a business owner in the sales sector with a professional practice or farm. He had no capital gain or loss last year. His education level is college for less than one year, and he works 45 hours per week.###\nHence this label was Yes."
"This person is a 35-year-old married White male from the United States working in the transportation, communication, and other public utilities sector as a private sector employee. He is a high school graduate and works 45 hours per week, with no capital gain or loss reported last year.###\nHence this label was No."
"The individual is a 53-year-old White male, separated and unmarried, living in the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He is a high school graduate and works 45 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 60-year-old married White male from the United States. He is the husband in his household and works in the transportation, communication, and other public utilities sector as the owner of a non-incorporated business, professional practice, or farm. He had a capital gain of $3137 and no capital loss last year. His education level is college for less than one year, and he works 46 hours per week.###\nHence this label was No."
"The individual is a 56-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He has no capital gain or loss from the previous year. He finished 8th class in terms of education and works 36 hours per week.###\nHence this label was No."
"The individual is a 58-year-old White female from the United States who has never been married. She is not living with family, works in office and administrative support for the state government, and has a high school education. She worked 16 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 31-year-old married White female from the United States. She works as a professional specialty in the private sector, with a college education for less than one year. She works 40 hours per week and had a capital gain of $3908 last year.###\nHence this label was No."
"This is a profile of a 17-year-old White female from the United States who has never been married and is classified as an own-child in the household. She has not specified her occupation or work class. She finished 11th class for her education and works 8 hours per week. Her capital gain and capital loss last year were both 0.###\nHence this label was No."
"The individual is a 42-year-old White male from the United States, working as a machine operator and inspector in the private sector. He is married and the husband in his household. He is a high school graduate and works 42 hours per week. Despite a capital loss of $1579 last year, he did not have any capital gains.###\nHence this label was No."
"The individual is a 32-year-old White male from the United States who has never been married. He is an unmarried private sector employee working in office and administrative support with a high school education. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 35-year-old married White male from the United States. He is employed in the private sector as a professional specialty worker, with a bachelor's degree education. He works 50 hours per week, with no capital gain or loss last year. The prediction for his annual income is over $50,000.###\nHence this label was No."
"This individual is a 21-year-old White female from the United States who has never been married. She is categorized as an own-child in the household and works in the service sector as a private sector employee. With a high school education, she works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This data entry describes a 20-year-old White female from the United States who has never been married and is not living with family. She does not have a specified occupation or work class. She attended college for less than a year and works 25 hours per week. She had no capital gain or loss in the previous year.###\nHence this label was No."
"This individual is a 51-year-old White female from the United States who has never been married. She is not living with family and works in a professional specialty occupation in local government. She holds a bachelor's degree and works 55 hours per week. Both her capital gain and loss last year were $0.###\nHence this label was No."
"The individual in the dataset is a 26-year-old Asian-Pac-Islander male from Taiwan. He is never married and is classified as an own-child in the household. He works in the private sector as an office and administrative support employee, with a bachelor's degree as his highest education level. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 48-year-old White male from the United States. He is divorced and currently unmarried. He works in the sales sector as a private sector employee, with a college education for less than one year. Last year, he had no capital gain or loss. He works 45 hours per week.###\nHence this label was No."
"This individual is a 29-year-old White male from the United States who has never been married. He is living with the head of the household as an own-child. Working in the private sector as an office and administrative support employee, he holds a bachelor's degree. With no capital gain or loss last year, he works 40 hours per week.###\nHence this label was No."
"This person is a 51-year-old white male from the United States. He is divorced and not living with any family members. He is self-employed in the sales sector, working about 40 hours per week. He has a high school education and did not have any capital gains or losses last year.###\nHence this label was No."
"This person is a 23-year-old White female from the United States. She is never married and not living with any family members. She works in the technology and support sector as a private sector employee. She has no capital gain or loss from the previous year. Her education level is some college without a degree. She works 40 hours per week.###\nHence this label was No."
"The individual is a 23-year-old White female from the United States. She has never been married and is classified as an own-child in the household. She works in the private sector as an office and administrative support worker, with a college education for less than one year. She worked 40 hours per week last year, with no capital gain or loss reported.###\nHence this label was No."
"The individual is a 55-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a high school education. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 41-year-old married White male from Mexico. He works in the service sector as a private sector employee, with a capital gain and loss of 0 last year. He finished 4th class education and works 43 hours per week.###\nHence this label was No."
"This individual is a 57-year-old Black male from the United States. He is married and works in the sales sector as a private sector employee, putting in 55 hours per week. With no capital gain or loss last year, he has completed 9th class education.###\nHence this label was Yes."
"The individual is a 51-year-old White male from the United States. He is married and works in execution and management for the state government. With a master's degree, he works 50 hours per week with no capital gain or loss last year.###\nHence this label was Yes."
"This individual is a 32-year-old White male from the United States who has never been married. He is not living with family and works as a professional specialty in the private sector, putting in 40 hours per week. With a bachelor's degree, he had no capital gains or losses last year.###\nHence this label was Yes."
"The individual is a 25-year-old White male from the United States who has never been married. He is classified as an Own-child in the household. He works in the service sector for the local government, with a high school graduate education. Despite working 40 hours per week, he did not have any capital gain or loss last year.###\nHence this label was No."
"This individual is a 31-year-old Black female from the United States. She has never been married and is classified as an unmarried private sector employee in the service sector. She attended college for less than one year and works 40 hours per week. Her capital gain and loss last year were both 0.###\nHence this label was No."
"The individual is a 38-year-old Black female from the United States. She is divorced, unmarried, and a high school graduate. She is currently not employed and has no capital gain or loss from the previous year. She works 40 hours per week.###\nHence this label was No."
"This 22-year-old White male, who has never been married, lives in the United States as a not-in-family member. He works in the private sector as an employee in the agriculture, forestry, and fisheries sector. Despite being a high school graduate, he works 50 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 27-year-old White male from the United States who has never been married. He works in the private sector as an office and administrative support employee, with a high school education. He is not living with family and had no capital gains or losses last year. He works 40 hours per week.###\nHence this label was No."
"The person is a 41-year-old divorced White female, not living with family. She works in the technology and support sector as a private sector employee, with a bachelor's degree. Last year, she had no capital gains or losses. She works 30 hours per week and it is unknown which country she is from.###\nHence this label was No."
"This dataset entry is a 24-year-old White female from the United States. She has never been married and is categorized as an own-child in the household. She works in the private sector as an execution and management professional with a bachelor's degree. In the past year, she had no capital gains or losses. She works 37 hours per week.###\nHence this label was No."
"This individual is a 49-year-old Asian-Pac-Islander male, married and working in the craft and repair sector as a private sector employee in the United States. He has no capital gains or losses from the previous year, with a college education for less than one year. He works 40 hours per week.###\nHence this label was Yes."
"This individual is a 61-year-old White male from the United States. He is divorced and does not live with any family members. His occupation and work class are unknown. He is a high school graduate and works 40 hours per week. In the past year, he had a capital gain of $4865 and did not incur any capital losses.###\nHence this label was No."
"This is a 51-year-old married White male in the United States. He works in the sales sector as a private sector employee, with an associate's degree. He is the husband in the household and worked 50 hours per week last year with no capital gains or losses.###\nHence this label was No."
"A 30-year-old divorced white male, who is an own-child and resides in the United States, works as a private sector employee in the sales sector. He holds a professional degree and works 55 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 33-year-old White male from Mexico. He is never married and considered an Other-relative in the household. He works in the cleaning and maintenance sector as a private sector employee, with no capital gain or loss last year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"This individual is a 37-year-old White female from the United States. She is divorced and not living with any family members. She works in execution and management in the local government sector, holding a master's degree. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was No."
"The individual is a 44-year-old married White male from the United States. He is the Husband in his household and works in the craft and repair sector as an owner of a non-incorporated business, professional practice, or farm. He had no capital gains or losses last year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"The person is a 52-year-old White male from Mexico, working in the private sector as an executive manager. He is divorced and not living with any family members. He holds a bachelor's degree, works 40 hours per week, and did not have any capital gains or losses last year.###\nHence this label was No."
"A married 50-year-old White male with a master's degree from the United States. He is the husband in the household and works unspecified occupation and work class. He had no capital gains or losses last year and works 60 hours per week.###\nHence this label was Yes."
"The individual is a 27-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a 40-hour work week. He finished 10th class for his education. Last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 33-year-old Asian-Pacific-Islander male from the Philippines. He has never been married and is living with his parents. He works in the sales sector as a private sector employee, putting in 40 hours per week. Despite having some college education, he does not hold a degree. Last year, he did not have any capital gains or losses.###\nHence this label was No."
"This individual is a 37-year-old White male from the United States who has never been married. He is not living with family and works in the technology and support sector as a private sector employee. With an associate's degree, he works 46 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"This person is a 31-year-old married White male from the United States. He works in the private sector in the transportation, communication, and other public utilities sector as a high school graduate. He is the husband in the household and worked 65 hours per week last year with no capital gain or loss.###\nHence this label was No."
"This individual is a 35-year-old married White male from the United States. He works in the sales sector as a private sector employee, with a college education for less than one year. Despite working 55 hours per week, he had no capital gain or loss last year.###\nHence this label was Yes."
"This individual is a 47-year-old divorced White female working in the private sector as a professional specialty with a master's degree. She is not living with family members, and her annual income is predicted to be less than $50,000 as she had no capital gain or loss last year. She works 40 hours per week in the United States.###\nHence this label was No."
"This individual is a 19-year-old White male from the United States who has never been married. He is classified as an Own-child in relation to the head of the household. He works in the service sector for the state government, with no capital gain or loss last year. His education level is college for less than one year, and he works 20 hours per week.###\nHence this label was No."
"This individual is a 27-year-old unmarried White male from the United States. He works in the agriculture, forestry, and fisheries sector for the local government. With a high school education, he works 40 hours per week with no capital gains or losses reported last year.###\nHence this label was No."
"This person is a 40-year-old married White male from the United States. He works as a professional in a specialty occupation, specifically as the owner of a non-incorporated business, professional practice, or farm. He holds a professional degree and works 45 hours per week. He did not have any capital gains or losses last year.###\nHence this label was Yes."
"This individual is a 25-year-old married White male from the United States. He works in the protective services sector for the state government, putting in 40 hours per week. With no capital gain or loss last year, he has received less than one year of college education.###\nHence this label was No."
"This individual is a 28-year-old married White male from the United States. He is employed in the private sector as a cleaning and maintenance worker, working 40 hours per week. He has not completed high school and has no capital gain or loss from the previous year.###\nHence this label was No."
"This 37-year-old White female, who is divorced and unmarried, is from the United States. She works in an office and administrative support role for the federal government, with a high school education. She had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"This individual is a 30-year-old married White male from the United States. He works in the sales sector as a private sector employee, with a bachelor's degree education. He is classified as the husband in the household and worked 50 hours per week. In the previous year, he had a capital gain of $7298 and no capital loss. This person's data suggests that they have an annual income over $50,000.###\nHence this label was Yes."
"This is a 23-year-old white male from the United States who is never married and lives with his parents as an own-child. He works in the sales sector as a private sector employee, is a high school graduate, and works 40 hours per week. He had no capital gains or losses last year.###\nHence this label was No."
"The individual is a 40-year-old married white male from the United States. He works in the private sector as an executive manager with an associate's degree. He has no capital gains or losses from the previous year and works 40 hours per week. The dataset predicts whether his annual income is over $50,000.###\nHence this label was Yes."
"The person in the dataset is a 65-year-old widowed White female from the United States. She is unmarried and has a high school graduate education. Her occupation and work class are not specified. Last year, she had no capital gain but incurred a capital loss of $2206. She works very few hours per week, only 10.###\nHence this label was No."
"The individual is a 65-year-old married White male who works as an executive in an owner of a non-incorporated business, professional practice, or farm. He finished 11th class for education and works 59 hours per week. In the last year, he had a capital gain of $9386 and no capital loss.###\nHence this label was Yes."
"This individual is a 38-year-old married white male from the United States, working as a professional specialist in the private sector. He has a master's degree and works 40 hours per week. Last year, he had no capital gain or loss. The prediction is that his annual income is over $50,000.###\nHence this label was Yes."
"The person is a 41-year-old unmarried female of White race from the United States. She is divorced and works as a private sector employee in the technology and support sector. She is a high school graduate and works 40 hours per week. Last year, she had no capital gain or loss.###\nHence this label was No."
"This person is a 64-year-old male from Columbia who is married and works in the agriculture, forestry, and fisheries sector for the state government. He has no capital gain or loss from last year. He has finished 4th class education and works 45 hours per week.###\nHence this label was No."
"This individual is a 44-year-old Asian-Pac-Islander female from the United States who has never been married. She is not living with any family members and works in a professional specialty occupation for the state government. She has a bachelor's degree and worked 38 hours per week last year. Her capital gain and loss were both 0.###\nHence this label was No."
"This person is a 63-year-old White female from the United States, who is divorced and not living with family. She works in office and administrative support for the local government, having completed college for less than one year. She had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
