"The individual is a 54-year-old White male from the United States, who is married and works in state government in an executive and management role. He holds a doctoral degree and works an average of 50 hours per week. Although he had no capital gain last year, he incurred a capital loss of $1902.###\nHence this label was Yes."
"The individual is a 38-year-old married white male from the United States. He works as a machine operator and inspector in the private sector, with a high school education. He did not have any capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"This individual is a 30-year-old white male from the United States, working as an office and administrative support in the private sector. He is married and his relation to the head of the household is a husband. He holds a bachelor's degree and works 40 hours per week. Last year, he had no capital gain but incurred a capital loss of $1,902.###\nHence this label was Yes."
"The individual is a 54-year-old married white male from the United States. He is categorized as the husband in the household. His occupation falls under professional specialty in the local government sector. Despite not having any capital gain last year, he experienced a capital loss of 1977. He holds a master's degree and works 40 hours per week.###\nHence this label was Yes."
"The individual is a 65-year-old married White male from the United States. He works in the private sector as a protective services employee, with an education level of college for less than one year. He did not have any capital gain or loss last year and works 16 hours per week.###\nHence this label was No."
"The person is a 59-year-old White male from Guatemala. He has never been married and is not currently living with family. He works in office and administrative support in the private sector, with a work week of 50 hours. He is a high school graduate with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 31-year-old White male from the United States. He has never been married and is not living with family. He works in the craft and repair sector as a private sector employee, with a college education for less than a year. Despite working 40 hours per week, he did not have any capital gains or losses last year.###\nHence this label was No."
"The person is a 60-year-old White female from the United States. She is married and works for the state government in an executive and management role. With a master's degree, she has a stable work schedule of 40 hours per week. Last year, she had a capital gain of $3103 and no capital loss. Overall, she is likely to have an annual income over $50,000 given her education level, occupation, and work experience.###\nHence this label was Yes."
"This individual is a 31-year-old divorced white male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. With a 9th class education, he works 40 hours per week with no capital gain or loss last year. His relation to the head of the household is not-in-family.###\nHence this label was No."
"The person is a 38-year-old White male from the United States, married, and working in the protective services sector for the local government. He has no capital gain or loss from last year, and his education level is college for less than one year. He works 60 hours per week.###\nHence this label was Yes."
"The individual in this data is a 57-year-old married white male from the United States. He works in the agriculture, forestry, and fisheries sector as an owner of a non-incorporated business, professional practice, or farm. He is the husband in the household and has a high school education. Last year, he had no capital gains or losses. Currently, he works 20 hours per week. Based on this information, the prediction is that his annual income is over $50,000.###\nHence this label was No."
"This individual is a 25-year-old White male from the United States who has never been married. He works in the sales sector as a private sector employee, with an educational background of college for less than one year. He is classified as an Own-child in relation to the head of the household. Last year, he had no capital gains or losses. He works 30 hours per week.###\nHence this label was No."
"This individual is a 44-year-old white male in the United States. He is divorced and not living with any family members. He works as a machine operator and inspector in his own incorporated business, professional practice, or farm. He had no capital gains or losses last year. His education level is college for less than one year, and he works 60 hours per week.###\nHence this label was No."
"This individual is a 40-year-old white male residing in the United States. He is separated and unmarried, working as a machine operator and inspector in the private sector. With a high school education, he works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This person is a 28-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a college education for less than one year. He works 40 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This is a 63-year-old Black female from Haiti who is widowed. She works as a machine operator and inspector in the private sector, with a high school education. She is classified as an other-relative in relation to the head of the household. She had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"This 23-year-old White female, who has never been married, works in office and administrative support in the private sector. She is the own-child of the head of the household in the United States. With a bachelor's degree, she works 40 hours per week and had no capital gains or losses last year. Her annual income is predicted to be over $50,000.###\nHence this label was No."
"The person is a 31-year-old White female from the United States. She is divorced and not living with any family members. She works in the service sector as a private sector employee, having finished 11th class education. There were no capital gains or losses last year, and she works 40 hours per week.###\nHence this label was No."
"The individual is a 41-year-old White male from the United States, who is married and the husband in the household. He is a business owner in an incorporated business, professional practice, or farm, working in the field of execution and management. He has a college education for less than one year. In the previous year, he had no capital gains or losses. He works 50 hours per week.###\nHence this label was No."
"This 20-year-old White female, who has never been married, resides in the United States as a not-in-family member. She is employed in the private sector in the sales sector, working 56 hours per week. She has not experienced any capital gain or loss in the previous year, and her education level is college for less than one year.###\nHence this label was No."
"The person is a 29-year-old unmarried White female from the United States. She works in office and administrative support for the state government, with a high school education. She did not have any capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"The person is a 21-year-old White male from the United States who has never been married. He is classified as an Own-child in relation to the head of the household. He works in the cleaning and maintenance sector as a private sector employee, with a college education for less than one year. Last year, he had no capital gain or loss. He works 40 hours per week.###\nHence this label was No."
"This individual is a 21-year-old White female from the United States who has never been married. She is an Own-child and works as a professional specialist in the private sector. She graduated from high school and works 30 hours per week. Last year, she did not have any capital gain or loss.###\nHence this label was No."
"The individual is a 23-year-old married White male living in the United States. He works in the private sector as a sales sector employee, with a high school education. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was Yes."
"The individual is a 45-year-old married White male from the United States. He works in the agriculture, forestry, and fisheries sector as the owner of a non-incorporated business, professional practice, or farm. He has no capital gain or loss from the previous year. His education level is college for one or more years without a degree. He works 60 hours per week.###\nHence this label was No."
"This 25-year-old Black female, who is separated and not married, works as a cleaning and maintenance employee in the private sector in the United States. She is a high school graduate working 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is an 80-year-old married white male from the United States. He works in the service sector as a private sector employee, with a 32-hour work week. He finished 6th class for education and had no capital gains or losses last year.###\nHence this label was No."
"The individual is a 42-year-old Black man from the United States. He is married and works as a professional specialty in the private sector. He has an associate's degree and works 40 hours per week. There were no capital gains or losses last year.###\nHence this label was No."
"This individual is a 50-year-old white male from the United States who is married and works as a machine operator and inspector in the private sector. He has finished 10th class education and works 50 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"The individual is an 18-year-old White male from the United States who has never been married. He is an own-child of the head of the household and works in the sales sector as a private sector employee. He has no capital gains or losses from last year. His education level is college for less than one year, and he works 16 hours per week. Based on this information, it is predicted that his annual income is less than $50,000.###\nHence this label was No."
"This 23-year-old White male, who has never been married, is living in the United States as an Own-child of the household. He works in the service sector as a private sector employee, with an associate's degree. Despite working long hours per week (60 hours), he did not have any capital gains or losses last year. It is predicted that his annual income is over $50,000 based on this information.###\nHence this label was No."
"This individual is a 56-year-old white male from the United States. He is divorced and not living with any family members. He works in a professional specialty occupation for the state government, with a typical work week of 40 hours. He holds a master's degree as his highest level of education. Although he had no capital gain last year, he incurred a capital loss of $1,669.###\nHence this label was No."
