"The individual is a 25-year-old White male from the United States who is never married and not living with family. He works in the private sector as an employee in the cleaning and maintenance sector, having graduated high school. He worked 47 hours per week last year and did not have any capital gains or losses.###\nHence this label was No."
"This individual is a 32-year-old married White male from the United States. He works in the agriculture, forestry, and fisheries sector as a private sector employee with an associate's degree. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"A 34-year-old married Black female from Haiti, working in the protective services sector as a private sector employee. She has no capital gains or losses from last year and has received college education for less than a year. She works 25 hours per week and is classified as an other-relative in the household.###\nHence this label was No."
"This individual is a 71-year-old married white male from Cuba, working in the protective services sector as a private sector employee. He has finished 9th class education and works 39 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"The person is a 52-year-old married White male from the United States. He is the husband and has a high school education. There is no information provided about his occupation or work class. He did not have any capital gains or losses last year and worked 35 hours per week.###\nHence this label was No."
"The person is a 53-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a capital gain of $3137 and no capital loss last year. He has received some college education for less than one year and works 40 hours per week.###\nHence this label was No."
"This individual is a 24-year-old White female from the United States. She is divorced and not living with any family members. She works in the sales sector as a private sector employee, having graduated from high school. With no capital gain or loss last year, she works an average of 30 hours per week.###\nHence this label was No."
"This is a 29-year-old White female from the United States. She has never been married and is not living with any family members. She works in a professional specialty occupation in the private sector, working 40 hours per week. Last year, she had no capital gain or loss. She has received college education for less than a year.###\nHence this label was No."
"The person is a 30-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a high school education. He did not have any capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 34-year-old single White female, categorized as an Own-child in the household. She is a professional specialty worker in the private sector, holding a bachelor's degree. Despite working only 15 hours per week, she had no capital gains or losses last year. She resides in the United States.###\nHence this label was No."
"This individual is a 47-year-old White male from the United States. He is married and works in the protective services sector for the local government. With an educational background of an associate's degree, he works 40 hours per week with no significant capital gain or loss last year.###\nHence this label was Yes."
"The person is a 42-year-old married White male from Ecuador. He works in the private sector as a professional specialty and holds a master's degree. Despite working 55 hours per week, he did not have any capital gains or losses last year. This individual is likely to have an annual income over $50,000 based on the provided information.###\nHence this label was Yes."
"This individual is a 57-year-old Black female from the United States. She is widowed with no immediate family living with her. She works in the technology and support sector as a private sector employee, having graduated from high school. Despite having no capital gains or losses last year, she works 54 hours per week.###\nHence this label was No."
"The individual is a young 18-year-old White male from the United States who has never been married. He is categorized as an own-child in terms of relation to the head of the household. He works in the service sector as a private sector employee, with a college education for less than one year. Despite being at a young age, he works 20 hours per week and had no capital gains or losses last year.###\nHence this label was No."
"The individual is a 30-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, having finished 11th grade. He is the husband in his household and worked 40 hours per week last year. He had neither capital gain nor loss in the previous year.###\nHence this label was No."
"This individual is a 31-year-old married White female from the United States. She works in the service sector as a private sector employee, with a college education for less than one year. Her capital gain and loss last year were both 0. She works 40 hours per week.###\nHence this label was No."
"This individual is a 44-year-old married white male from the United States. He is the husband in the household and works as an executive in a management role in his incorporated business, professional practice, or farm. He holds a bachelor's degree and works 60 hours per week. Last year, he did not experience any capital gains or losses. His annual income is predicted to be over $50,000.###\nHence this label was Yes."
"This individual is a 25-year-old White female living in the United States. She is divorced and classified as an Own-child in terms of household relation. She works in the technology and support sector as a private sector employee with an associate's degree. Last year, she had no capital gain but incurred a capital loss of $1594. She works 25 hours per week.###\nHence this label was No."
"The individual is a 48-year-old unmarried White female from the United States. She is divorced and works in an office and administrative support position in the private sector. With an associate's degree, she works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 90-year-old widowed White male in the United States. He is not living with any family members. He runs his own non-incorporated business, professional practice, or farm as an owner. He has a professional specialty occupation and holds a professional degree. Last year, he had a capital gain of 1086 and no capital loss. He works 60 hours per week.###\nHence this label was No."
"This individual is a 39-year-old married White male from the United States. He holds a master's degree and works in a professional specialty occupation within the local government. Despite not having any capital gain last year, he experienced a capital loss of $1977. On average, he works 45 hours per week.###\nHence this label was Yes."
"This person is a 38-year-old married White male from the United States. He works in a professional specialty occupation in the local government. Despite having no capital gain or loss last year, he earns an annual income over $50,000. He has received college education for less than one year and works 44 hours per week to support his family.###\nHence this label was No."
"The individual is a 40-year-old White female from the United States who has never been married. She is not living with family members and works in office and administrative support for the federal government. Although she attended college for less than one year, she has no capital gain or loss from the previous year. She works 50 hours per week.###\nHence this label was No."
"The individual is a 26-year-old unmarried White female from the United States. She has never been married and does not have any dependents. Her occupation, work class, and education level are not specified in the data. She has not experienced any capital gains or losses in the last year. She works 40 hours per week.###\nHence this label was No."
"This 32-year-old White male, who has never been married, is an own-child in the household. He is from the United States and works in the sales sector as a private sector employee. Despite having no capital gain last year, he experienced a loss of $1876. His education level is college for less than one year, and he works 60 hours per week.###\nHence this label was No."
"The individual is a 41-year-old White male from the United States, who is married and the husband in the household. He holds a professional specialty occupation as the owner of a non-incorporated business, professional practice, or farm. With a professional degree education, he worked 50 hours per week last year, with a capital gain of $15,024 and no capital loss.###\nHence this label was Yes."
"The person is a 37-year-old married White male from the United States. He works in the private sector as an employee in the transportation, communication, and other public utilities sector. He is the husband in his household and has a high school education. Last year, he had no capital gain or loss. He works 40 hours per week.###\nHence this label was No."
"The individual is a 44-year-old Black male from the United States, married and working in a professional specialty occupation for the state government. He holds a master's degree and works 40 hours per week. Last year, he had a capital gain of $7688 and no capital loss.###\nHence this label was Yes."
"This individual is a 40-year-old white male who is divorced and not living with family. He works as a machine operator and inspector in the private sector in the United States. He is a high school graduate and works 40 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 20-year-old white female from the United States who has never been married. She is categorized as an own-child in the household. She has not specified her occupation or work class. She did not have any capital gain or loss last year. Her education level is college for less than one year, and she works 8 hours per week.###\nHence this label was No."
"This individual is a 35-year-old married White male from the United States. He works in the private sector as a sales employee with a bachelor's degree. His capital gain and loss last year were both 0. He works 40 hours per week.###\nHence this label was No."
"This individual is a 29-year-old White female from the United States who has never been married. She works in the technology and support sector as a private sector employee with a bachelor's degree. She is not living with family and had no capital gains or losses last year. She works 40 hours per week.###\nHence this label was No."
"The individual is a 54-year-old White female from Germany. She is divorced and not living with any family members. She is a high school graduate with unknown occupation and work class. She had no capital gain or loss last year and works 60 hours per week.###\nHence this label was No."
"This person is a 44-year-old White female from the United States. She is divorced and unmarried, working in the private sector as an execution and management professional. Despite having less than a year of college education, she works 42 hours per week with no significant capital gains or losses last year.###\nHence this label was No."
"The person is a 41-year-old White male in the United States, who is divorced and not living with family. He is the owner of an incorporated business, professional practice, or farm, working in the craft and repair sector. Despite being a high school graduate, he works 55 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 44-year-old White male from the United States. He is married and works in the private sector as an executive manager. With a bachelor's degree, he had a capital gain of $15,024 last year and did not incur any capital losses. He works 48 hours per week.###\nHence this label was Yes."
"The individual is a 37-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a work week of 50 hours. He completed 9th grade education and had no capital gains or losses last year.###\nHence this label was Yes."
"The individual is a 25-year-old White male from the United States who is divorced and not living with family. He works in the service sector as a private sector employee, with a high school education. Despite having no capital gain or loss last year, he works 50 hours per week.###\nHence this label was No."
"The individual is a 42-year-old married White male from the United States. He works as an executive in the private sector, holding a bachelor's degree. He has no recorded capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was No."
"The individual is a 44-year-old married White male from the United States working in the private sector as an executive manager. He holds an associate's degree and works 50 hours per week. Despite having no capital gain last year, he experienced a capital loss of 1977.###\nHence this label was Yes."
"This 30-year-old White female, who has never been married, resides in the United States and is not living with family. She works in the private sector as an office and administrative support employee. Despite being a high school graduate, she puts in 45 hours a week at work. With no capital gain or loss last year, the prediction is that her annual income is not over $50,000.###\nHence this label was No."
"The individual is a 43-year-old White male from the United States, married and working in the private sector in the agriculture, forestry, and fisheries sector. He has a bachelor's degree and worked 50 hours per week last year. Both his capital gain and loss were 0.###\nHence this label was Yes."
"The person is a 49-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, putting in 48 hours per week. He finished 8th class for education and had no capital gain or loss last year.###\nHence this label was No."
"The person is a 30-year-old White male from the United States. He is married and works in the craft and repair sector as a private sector employee. He is a high school graduate and works 35 hours per week. He had no capital gain or loss last year.###\nHence this label was No."
"This dataset represents a 38-year-old White female from the United States who has never been married and is not living with family members. She works in the technology and support sector as a private sector employee, with a college education but without a degree. Last year, she had a capital gain of 2354 and no capital loss, while working 40 hours per week. The prediction is whether her annual income is over $50,000.###\nHence this label was No."
"This individual is a 28-year-old male, separated, and not living with family. He is a high school graduate working in the cleaning and maintenance sector as a private sector employee in the United States. He had no capital gains or losses last year and works 30 hours per week.###\nHence this label was No."
"This individual is a 50-year-old married white male from the United States. He holds a master's degree and works as a professional specialty in his own non-incorporated business, professional practice, or farm. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 30-year-old White married male from the United States. He works in the protective services sector for the local government, with a stable work schedule of 40 hours per week. He has not experienced any significant financial gains or losses in the past year. His education level is college for one or more years without a degree.###\nHence this label was No."
"The individual is a 30-year-old married White male from the United States. He works in the private sector as an office and administrative support employee, putting in 30 hours per week. Last year, he had no capital gains or losses. His education level is college for less than one year.###\nHence this label was No."
"The person in the data is a 23-year-old White female from the United States. She has never been married and is not living with any family members. She works in the service sector as a private sector employee and finished 10th class for her education. Last year, she had no capital gain or loss. She works 40 hours per week.###\nHence this label was No."
"This is a 28-year-old married White male from the United States. He works in the private sector as an executive manager, holding a bachelor's degree. Last year, he had no capital gains or losses. He works approximately 50 hours per week.###\nHence this label was Yes."
"This individual is a 31-year-old White female from the United States who has never been married. She is not living with any family members and works as a professional in the private sector. She holds a bachelor's degree and works 40 hours per week with no capital gains or losses last year. This person's annual income is predicted to be over $50,000.###\nHence this label was No."
"This individual is a 36-year-old unmarried White male from the United States. He works in a professional specialty occupation for the local government, holding a bachelor's degree. Despite working 40 hours per week, he did not experience any capital gains or losses in the last year.###\nHence this label was No."
"The person is a 55-year-old White female from the United States. She is divorced and not living with family. She works in the sales sector as a private sector employee, with a high school education. Last year, she had neither capital gains nor losses. She works 40 hours per week.###\nHence this label was No."
"This individual is a 27-year-old Caucasian male from the United States who has never been married. He works in the private sector as an office and administrative support employee with a master's degree education. Despite working 45 hours per week, his capital gain and loss last year were both zero.###\nHence this label was No."
"This individual is a 43-year-old married white male from the United States. He works in the sales sector as a private sector employee, with a high school education. Despite working long hours (80 per week), he did not have any capital gain or loss last year.###\nHence this label was Yes."
"The person is a 44-year-old married male from Puerto-Rico, working in the craft and repair sector as a private sector employee. He is a high school graduate and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This individual is a 33-year-old Black female from the United States. She has never been married and is currently unmarried. She works in an office and administrative support role for the local government, with a work schedule of 18 hours per week. She completed college for less than one year. Last year, she had no capital gains or losses.###\nHence this label was No."
"The individual is a 54-year-old white male from the United States, who is married and works in the transportation, communication, and other public utilities sector as a private sector employee. He has a high school education and works 50 hours per week. Last year, he had no capital gain or loss.###\nHence this label was Yes."
"This is a 39-year-old unmarried White female from the United States. She works in the protective services sector for the state government with a master's degree. She is not living with family, had no capital gain or loss last year, and works 40 hours per week.###\nHence this label was No."
"The individual is a 46-year-old white male from the United States, married and working in the technology and support sector as a private sector employee. He holds an associate's degree and works 40 hours per week. Last year, he did not experience any capital gains or losses.###\nHence this label was Yes."
"The individual is a 40-year-old Asian-Pacific-Islander female from the United States. She is divorced and unmarried, working in the sales sector as a private sector employee. She had no capital gains or losses last year and received college education for less than a year. She works 40 hours per week. This person's annual income is predicted to be under $50,000.###\nHence this label was No."
"The individual is a 44-year-old married White male from Mexico. He works as a machine operator and inspector in the private sector, with an education level of finishing 6th class. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The person is a 34-year-old White male from the United States who has never been married and is not living with family. He works in the sales sector as a private sector employee, holding a bachelor's degree. Last year, he had a capital gain of $27,828 and no capital loss. He works 40 hours per week.###\nHence this label was Yes."
"The individual is a 55-year-old White female from the United States, currently married and identified as the wife in the household. She holds a master's degree and works as an unknown occupation in an unspecified work class. With no capital gain or loss last year, she dedicates 40 hours per week to work.###\nHence this label was Yes."
"The person is a 72-year-old White male, married and the husband in the household. He is from the United States and has a high school education. Currently, his occupation and work class are unspecified. Last year, he had no capital gain or loss, and he works for only 8 hours per week.###\nHence this label was No."
"This individual is a 47-year-old unmarried Black female from the United States. She holds a bachelor's degree and works in the private sector as an execution and management professional. Despite not having any capital gains or losses last year, she puts in 45 hours per week at her job.###\nHence this label was No."
"The individual is a 52-year-old White male from the United States, who is married and works in the private sector in an office and administrative support role. He has not experienced any capital gain or loss in the last year. He has received some college education but does not hold a degree, and works 40 hours per week.###\nHence this label was No."
"This individual is a 46-year-old married White male from the United States. He holds a doctoral degree and works as a professional specialty in the private sector. Despite working long hours (60 hours per week), he did not experience any capital gain or loss last year.###\nHence this label was Yes."
"This individual is a 22-year-old white female from the United States who is never married and not living with family. She works in the sales sector as a private sector employee, having attended college for one or more years without completing a degree. Last year, she did not experience any capital gain or loss. She works an average of 37 hours per week.###\nHence this label was No."
"The person is a 60-year-old widowed white female from the United States. She is not living with family and works in the craft and repair sector as a private sector employee. She has not experienced any capital gain or loss in the last year. Her education level is college for one or more years without a degree, and she works 30 hours per week.###\nHence this label was No."
"The individual is a 58-year-old white male from the United States who is married and works in the craft and repair sector for the federal government. He has not experienced any capital gain or loss in the last year. He completed 10th grade education and works 40 hours per week.###\nHence this label was No."
"This individual is a 24-year-old white male from the United States. He is divorced and not living with family. He works in the craft and repair sector as a private sector employee, with an education level of college for less than one year. Last year, he had no capital gains or losses. He works 48 hours per week.###\nHence this label was No."
"This individual is a 19-year-old White female from the United States who has never been married. She is classified as an own-child in the household. She works in the sales sector as a private sector employee, with a college education for less than one year. Despite working 25 hours per week, she had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 45-year-old separated White female in the United States. She is not living with family and works in the private sector as a technology and support sector employee. She is a high school graduate and works 26 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 61-year-old married White male from the United States. He works as a professional in a specialty occupation and owns a non-incorporated business, professional practice, or farm. Despite having a professional degree, he works 35 hours per week. Last year, he did not experience any capital gain or loss.###\nHence this label was Yes."
"This person is a 25-year-old unmarried White female from the United States. She works in the service sector for the local government, and is classified as an Own-child in relation to the head of the household. She graduated from high school and works 35 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 48-year-old White male from the United States, married, and working in the private sector as a professional specialty. He holds a master's degree and works 40 hours per week. There were no capital gains or losses last year.###\nHence this label was Yes."
"The person is a 46-year-old married White female living in the United States. She is identified as the wife in the household. She is a high school graduate with no specific occupation or work class provided. Last year, she had no capital gain or loss. She works 40 hours per week.###\nHence this label was Yes."
"The individual is a 50-year-old White female from the United States. She is divorced and lives with her own child. She works in office and administrative support for the state government, being a high school graduate. She had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 21-year-old White male from the United States. He is never married and lives with his parents as an own-child. He works as a machine operator and inspector in the private sector, with a high school education. Last year, he had no capital gain or loss. He works 40 hours per week. Based on this information, it is predicted that his annual income is not over $50,000.###\nHence this label was No."
"This individual is a 35-year-old White male, divorced, not living with family, and working in the private sector as an executive manager in the United States. He is a high school graduate and works 60 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 33-year-old married White male from the United States. He works in the craft and repair sector as the owner of an incorporated business, professional practice, or farm. He has no capital gain or loss from the previous year. He has received less than a year of college education and works 40 hours per week.###\nHence this label was No."
"The person is a 45-year-old Black male in the United States, married and working as an office and administrative support employee in the private sector. He has no capital gains or losses from the previous year and has received education for less than a year in college. He works 40 hours per week. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This is a profile of an 81-year-old widowed White female from the United States. She is not living with family and works in the service sector for the state government. She completed 4th class education and works 20 hours per week. She had no capital gain or loss last year. Her annual income is predicted to be below $50,000.###\nHence this label was No."
"The individual is a 33-year-old married White male from the United States. He works in the technology and support sector as a private sector employee, with less than a year of college education. Last year, he had no capital gain or loss. He works 20 hours per week and is described as the husband in the household.###\nHence this label was No."
"The individual is a 36-year-old married White male from the United States. He works as a professional specialty in the private sector and holds a bachelor's degree. He is the husband in the household and worked 55 hours per week. In the past year, he had no capital gain or loss. The prediction is that his annual income is over $50,000.###\nHence this label was No."
"This individual is a 36-year-old White male, currently married and working in an executive or managerial role in local government in the United States. He has a high school education, works 45 hours per week, and did not experience any capital gains or losses last year.###\nHence this label was Yes."
"The person is a 68-year-old married Black male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He is the husband and does not have any capital gains or losses from the previous year. He is a high school graduate and works only 5 hours per week.###\nHence this label was No."
"This is a 47-year-old divorced Asian-Pac-Islander female from the United States. She works in the private sector as a service sector employee, with a high school education. She is not living with family and worked 40 hours per week last year. Her capital gains and losses were both 0.###\nHence this label was No."
"This individual is a 19-year-old White male from the United States who has never been married. He is not living with family and works in the private sector as an office and administrative support employee. He is a high school graduate and works 30 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 33-year-old unmarried Asian-Pac-Islander female living in the United States. She is employed in the private sector as an office and administrative support worker, with an education level of college for less than one year. She did not have any capital gains or losses last year and works 35 hours per week.###\nHence this label was No."
"This individual is a 58-year-old married White male residing in the United States. He works in execution and management for the local government, with a workweek of 40 hours. His occupation yielded a capital gain of 7298 last year, with no reported capital loss. He is a high school graduate and serves as the husband within the household.###\nHence this label was Yes."
"The person is a 27-year-old White female from the United States who has never been married. She is classified as an Own-child and works in the private sector as an office and administrative support employee. She had no capital gains or losses last year. Her education level is college for less than one year, and she works 40 hours per week.###\nHence this label was No."
"The individual is a 58-year-old white male from the United States. He is divorced and not living with family. He works in a professional specialty occupation in the private sector, with an associate's degree education. He did not have any capital gains or losses last year and works 36 hours per week. The prediction is whether his annual income is over $50,000.###\nHence this label was No."
"This is an 81-year-old married white male from the United States. He is a husband and works in the sales sector as a private sector employee. He holds a professional degree and works 45 hours per week. Last year, he did not have any capital gains or losses. This individual's annual income is predicted to be over $50,000.###\nHence this label was Yes."
"The person is a 24-year-old single White male from the United States. He works in the technology and support sector as a private sector employee with a bachelor's degree. He has no capital gain or loss from last year and works 40 hours per week.###\nHence this label was No."
"This young, 18-year-old White female in the United States has never been married and is classified as an Own-child in the household. She works in office and administrative support in the private sector, with no capital gain or loss last year. Her education level is college for less than one year, and she works 25 hours per week. It is predicted that her annual income is below $50,000.###\nHence this label was No."
"This person is a 41-year-old unmarried White male from the United States. He works in the craft and repair sector as a private sector employee, having graduated high school. With no capital gain or loss last year, he works 40 hours per week.###\nHence this label was No."
"The individual is a 57-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a work schedule of 40 hours per week. He finished 11th grade education and had no capital gains or losses last year.###\nHence this label was Yes."
"The individual is a 43-year-old White male from the United States. He is separated and unmarried, and works in the craft and repair sector as an owner of a non-incorporated business, professional practice, or farm. He holds a bachelor's degree and works 35 hours per week. With a capital gain and loss of 0 last year, this person's annual income is predicted to be over $50,000.###\nHence this label was No."
"This individual is a 28-year-old white male from the United States. He is married and works in the protective services sector for the local government. With no capital gain or loss last year, he has received a college education for less than a year. He works 40 hours per week.###\nHence this label was No."
"The person is a 34-year-old White male, divorced, and unmarried, who resides in the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He has a high school education and works 60 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"This individual is a 54-year-old White female from the United States. She is divorced and not living with family. She works as a professional specialty in her own non-incorporated business, professional practice, or farm. With a master's degree, she works 30 hours per week, and had no capital gains or losses last year.###\nHence this label was No."
"The individual is a 32-year-old unmarried White male from the United States. He works in the private sector as a craft and repair worker, with a college education of less than one year. Last year, he had no capital gain or loss. He works 40 hours per week.###\nHence this label was No."
"This individual is a 27-year-old married white male from the United States, working in the service sector as a private sector employee. He has no capital gains or losses from last year, and his education level is college for less than one year. He works 40 hours per week.###\nHence this label was No."
"The person is a 38-year-old White male from the United States who has never been married. He is categorized as an Own-child in relation to the head of the household. He is employed in the craft and repair sector as a private sector employee, working 40 hours per week. With a college education of less than one year, he had no capital gain or loss in the last year.###\nHence this label was No."
"The individual is a 49-year-old White male from the United States. He is married and works in the private sector as an executive/manager. He has a bachelor's degree and works 40 hours per week. Last year, he had neither capital gain nor capital loss. The prediction is that his annual income is over $50,000.###\nHence this label was No."
"The individual is a 45-year-old married Asian-Pacific-Islander woman from the Philippines. She works in a professional specialty occupation for the state government, with no capital gain or loss last year. She has received some college education without obtaining a degree and works 40 hours per week.###\nHence this label was Yes."
"The individual is a 42-year-old married White male from the United States. He holds a professional specialty occupation in the state government sector. With a bachelor's degree, he works 40 hours per week with no capital gain or loss reported last year.###\nHence this label was Yes."
"This is a 69-year-old white male who is married and works in the sales sector. He is the husband of the head of the household and is a business owner with a professional practice or farm. He has a high school education and works 33 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"The individual is a 22-year-old White female from Germany. She is divorced and unmarried, working in the technology and support sector as a private sector employee. She graduated from high school and works 30 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This data is about a 45-year-old White female from the United States who is divorced and not living with family. She is the owner of an incorporated business, professional practice, or farm, working in the field of execution and management. She has an associate's degree and works 40 hours per week. Last year, she had no capital gains but incurred a capital loss of $1590.###\nHence this label was No."
"The individual is a 24-year-old White male from the United States. He is divorced and does not live with family. He works in the private sector in an office and administrative support role, with a college education for less than one year. Despite working 50 hours per week, he did not have any capital gains or losses last year.###\nHence this label was No."
"This 19-year-old White female, who has never been married, is an Own-child in the household. She is from the United States and works in the service sector as a private sector employee. With no capital gain or loss last year, she has less than one year of college education. She works 15 hours per week.###\nHence this label was No."
"The individual is a 31-year-old married Asian-Pac-Islander male from the Philippines. He is a husband and a high school graduate working an unspecified occupation for 40 hours per week. He had no capital gains or losses last year. The dataset predicts whether his annual income is over $50,000.###\nHence this label was No."
"This individual is a 41-year-old White female living in the United States. She is divorced and unmarried, working in the craft and repair sector as a private sector employee. She has no capital gain or loss from the previous year. Her education level is high school graduate, and she works 50 hours per week.###\nHence this label was No."
"This individual is a 29-year-old unmarried White female with a master's degree, working in execution and management in the private sector. She is not living with family, has no capital gains or losses from the previous year, and works 45 hours per week in the United States.###\nHence this label was No."
"The individual is a 24-year-old White male from the United States who is married and works in the private sector as an execution and management professional. He is the husband in the household and has a high school education. Despite working 37 hours per week, he did not have any capital gains or losses last year.###\nHence this label was No."
"This 24-year-old White female, who has never been married, works in the service sector as a private sector employee in the United States. She is not in a family household and has a college education for less than one year. Despite working 53 hours per week, she did not have any capital gain or loss last year.###\nHence this label was No."
"This dataset describes a 30-year-old married White male, who is a private sector employee working as a machine operator and inspector in the United States. He has completed less than a year of college education and works 40 hours per week. In the previous year, he had no capital gains or losses. The prediction is whether his annual income is over $50,000.###\nHence this label was Yes."
"This individual is a 29-year-old White male from the United States. He is married and works in the craft and repair sector as a private sector employee. He holds a bachelor's degree and works 45 hours per week. Last year, he had a capital gain of 3411 and no capital loss.###\nHence this label was No."
"This is a 24-year-old Black female who is married with an occupation in office and administrative support in the private sector. She is categorized as an own-child in the household and holds a bachelor's degree. Last year, she had no capital gains or losses. Currently, she works 20 hours per week in her job in the United States.###\nHence this label was No."
"This individual is a 47-year-old married white male from the United States. He works in the technology and support sector as a private sector employee with a bachelor's degree. Last year, he had a capital gain of $15,024 and no capital loss. He works 40 hours per week.###\nHence this label was Yes."
"This person is a 47-year-old White male in the United States. He is separated and not living with family. He works as a machine operator and inspector in the private sector, with a high number of work hours per week (65). Despite having attended college for less than a year, he has a relatively high annual income with a notable capital gain from the previous year.###\nHence this label was Yes."
"This individual is a 38-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was No."
"The individual is a 28-year-old married White male from Poland. He works in the craft and repair sector as a private sector employee. He is a high school graduate and works 45 hours per week. There were no capital gains or losses last year.###\nHence this label was No."
"The person in this data is a 22-year-old White male from the United States who has never been married. He is living with the head of the household as their own child. He has not specified his occupation or work class. Despite not having any capital gain or loss last year, he has attended college for less than a year. Currently, he works 40 hours per week.###\nHence this label was No."
"The individual is a 69-year-old divorced White male, not living with family. He is a private sector employee working in the cleaning and maintenance sector. He has a bachelor's degree, works 40 hours per week, and had zero capital gains and losses last year. He is from the United States.###\nHence this label was No."
"This individual is a 22-year-old White male from the United States. He has never been married and is not living with family. He works in a professional specialty occupation in the private sector, putting in 12 hours per week. His education level is college for less than one year, and he did not have any capital gains or losses last year.###\nHence this label was No."
"The person is a 60-year-old Black female from the United States. She is widowed and unmarried. Her occupation and work class are not specified. She has no capital gain or loss from last year. She has attended college for less than one year and works 54 hours per week.###\nHence this label was No."
"This data describes a 49-year-old married White female from the United States who works in the private sector as an office and administrative support employee. She has no capital gains or losses from the previous year and has received college education for less than a year. She works 40 hours per week and does not live with any family members.###\nHence this label was No."
"The individual is a 28-year-old married white female from the United States. She works in a professional specialty occupation in the local government sector, with a master's degree education. Last year, she had a capital gain of $7688 and no capital loss. She works 35 hours per week.###\nHence this label was Yes."
"The individual is a 25-year-old White male from the United States. He is married and works in the private sector as a cleaning and maintenance employee. He graduated from high school and works 40 hours per week. He had no capital gains or losses last year. This person's marital status is married, and in relation to the head of the household, he is considered the husband.###\nHence this label was No."
"This individual is a 26-year-old married white male from the United States. He works in the private sector as a cleaning and maintenance employee, putting in 40 hours per week. With a college education of less than one year, he had no capital gains or losses last year.###\nHence this label was No."
"This individual is a 76-year-old white male from the United States. He is married and described as the husband in the household. He has not specified his occupation or work class. Despite having only completed 8th grade education, he has no capital gain or loss from the previous year. He works only 5 hours per week.###\nHence this label was No."
"This individual is a 24-year-old unmarried White male with a bachelor's degree. He works in a professional specialty occupation for the local government in the United States. He is not living with family and had no capital gains or losses last year. He works 40 hours per week.###\nHence this label was No."
"This individual is a 56-year-old White female from the United States, who has never been married. She works in the private sector as an office and administrative support employee, with a high school education. Despite working 35 hours per week, she did not have any capital gains or losses in the last year.###\nHence this label was No."
"The person in the dataset is a 24-year-old White female from the United States. She is divorced and currently unmarried. Her occupation and work class are not specified. She has no capital gain or loss from the previous year. She has received college education for less than a year and works 25 hours per week.###\nHence this label was No."
"This is a 20-year-old White female from the United States who has never been married. She is classified as an own-child in the household and works in the sales sector as a private sector employee. She had no capital gain or loss last year. Her education level is college for less than one year, and she works 40 hours per week. The prediction is whether her annual income is over $50,000.###\nHence this label was No."
"This person is a 28-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, having completed 10th class education. Last year, he had no capital gains or losses. He works 36 hours per week.###\nHence this label was No."
"The individual is a 62-year-old White male from the United States who is married and works in the service sector as a private sector employee. He has completed 9th class education and works 40 hours per week with no capital gains or losses.###\nHence this label was No."
"The individual is a 58-year-old married white male from the United States. He is the husband in the household and works as an owner of an incorporated business, professional practice, or farm, in the field of execution and management. He has a college education for less than one year. Last year, he had a capital gain of $7298 and no capital loss. He works a total of 60 hours per week. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This individual is a 29-year-old married white male from Honduras. He works in a professional specialty occupation for the state government, holding a bachelor's degree. Although he did not have any capital gains or losses last year, he works a standard 40 hours per week.###\nHence this label was Yes."
"This individual is a 27-year-old white male from the United States who has never been married. He is categorized as an own-child in relation to the head of the household. He works in a professional specialty occupation for the local government. Despite having a bachelor's degree, his annual income is not over $50,000 as his capital gains and losses last year were both 0. He works 35 hours per week.###\nHence this label was No."
"The individual is a 29-year-old White male from the United States who has never been married. He is not living with any family members. His occupation, work class, and capital gain/loss last year are not specified. He is a high school graduate working 32 hours per week.###\nHence this label was No."
"This individual is a 22-year-old White male from the United States, who has never been married. He is classified as an Own-child in the household. He works in the sales sector as a private sector employee, with a college education of less than one year. Last year, he had no capital gains or losses and works 40 hours per week.###\nHence this label was No."
"The individual is a 36-year-old married white male from the United States. He works in the craft and repair sector for the local government, having finished 9th class education. Despite working 25 hours per week, he had no capital gain or loss last year.###\nHence this label was No."
"The person in the dataset is a 24-year-old unmarried White female from the United States. She is a high school graduate working in the service sector as a private sector employee, with no capital gain or loss last year. She works 32 hours per week.###\nHence this label was No."
"This individual is a 30-year-old separated White female from the United States. She is unmarried and works in the service sector for the local government. With a high school education, she works 26 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 17-year-old female from the United States who has never been married. She is classified as an Own-child in relation to the head of the household. She has completed 10th grade education but currently does not have any occupation or work class. In the past year, she did not have any capital gains or losses. She works 20 hours per week.###\nHence this label was No."
"The individual is a 37-year-old White male who has never been married. He is not living with family, and is a private sector employee in the craft and repair sector. He is a high school graduate and works 40 hours per week. In the previous year, he had no capital gains or losses. His native country is the United States.###\nHence this label was No."
"This is a 34-year-old divorced White female from the United States. She is unmarried and works in the service sector for the local government. Her annual income is predicted to be less than $50,000 based on her educational background as a high school graduate, working 20 hours per week with no capital gain or loss reported last year.###\nHence this label was No."
"This individual is a 21-year-old, white male from the United States. He has never been married and does not live with family. He works in the private sector in an executive or managerial role. Despite attending college for less than one year, he works a standard 40 hours per week. Additionally, he did not experience any capital gain or loss in the previous year.###\nHence this label was No."
"This individual is a 58-year-old White female from the United States. She is divorced and not living with family. Her occupation is in a professional specialty, and she is the owner of a non-incorporated business, professional practice, or farm. She had no capital gains or losses last year. She has less than one year of college education and works 40 hours per week.###\nHence this label was No."
"The person in the dataset is a 20-year-old male who has never married. He is categorized as an Own-child in relation to the head of the household. His race is not specified, and his native country is South. The person's occupation, work class, and capital gains/losses are unknown. He has a high school graduate education level and works 60 hours per week.###\nHence this label was No."
"This is a 53-year-old Black male, married and working in the private sector as a service sector employee in the United States. He is the husband in the household, with a high school education and works 30 hours per week. Last year, he had a capital gain of 4386 and no capital loss. The prediction is whether his annual income exceeds $50,000.###\nHence this label was Yes."
"The individual is a 26-year-old White female from the United States who has never been married. She is considered an Other-relative in relation to the head of the household. She works in the technology and support sector as a private sector employee with an associate's degree. Last year, she had no capital gain or loss. She works 20 hours per week.###\nHence this label was No."
"The person is a 27-year-old married White male from the United States. He works in the sales sector as a private sector employee with a bachelor's degree. He is the husband in the household and worked 45 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"This 28-year-old married White male, who is a Husband in a household in the United States, works as a professional specialty in the private sector. With a bachelor's degree, he works 55 hours per week and had no capital gains or losses last year.###\nHence this label was Yes."
"This individual is a 38-year-old White female from the United States. She is divorced and is not living with any family member. She works in the service sector as a private sector employee, with a high school education. She had no capital gains or losses last year, and she works 20 hours per week.###\nHence this label was No."
"This individual is a 30-year-old White female from the United States who has never been married. She works as a professional specialty in the private sector, putting in 50 hours per week. She holds a bachelor's degree and had no capital gain last year but experienced a capital loss of 2339. Her relation to the head of the household is noted as Not-in-family.###\nHence this label was No."
"This person is a 59-year-old white male from the United States. He is married and works in the craft and repair sector as a private sector employee. He is a high school graduate and works 40 hours per week. He had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 51-year-old female of Amer-Indian-Eskimo descent, currently divorced and unmarried. She works in the private household sector as a private sector employee in the United States. With no capital gain or loss last year, she received college education for less than a year and works an average of 35 hours per week.###\nHence this label was No."
"The individual is a 49-year-old White male from the United States. He is married and works as a professional in a specialty occupation. He is the husband in the household and owns a non-incorporated business, professional practice, or farm. He has no capital gain or loss from the previous year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was Yes."
"This individual is a 51-year-old Black female from the United States. She is divorced and not living with family. She works in the craft and repair sector as a private sector employee, with a 10th-grade education. She had no capital gain or loss last year and works 35 hours per week.###\nHence this label was No."
"This individual is a 40-year-old married white male from the United States. He works in office and administrative support for the federal government, with a high school education. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"This individual is a 35-year-old married white male from the United States. He is the husband in the household and works as an executive in management for his incorporated business, professional practice, or farm. He holds a bachelor's degree and works 45 hours per week. Last year, he had no capital gains or losses. The prediction indicates that he has an annual income over $50,000.###\nHence this label was Yes."
"The individual is a 34-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. He has a capital gain of 7688 from last year and no reported capital loss. He works 40 hours per week.###\nHence this label was Yes."
"The person is a 51-year-old married White male from Mexico, working in the agriculture, forestry, and fisheries sector as a private sector employee. He finished 9th class education and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This 37-year-old married White male, who is a husband, lives in the United States and works in state government in an executive and management role. He has an associate's degree and works 45 hours per week. Last year, he did not experience any capital gains or losses.###\nHence this label was No."
"This individual is a 54-year-old White male from the United States. He is divorced and unmarried, working in the private sector as a professional specialty employee. With a 10th-grade education, he works 68 hours per week and had a significant capital gain of $14,344 last year.###\nHence this label was Yes."
"This individual is a 29-year-old single White female living in the United States. She works in a professional specialty occupation in the local government sector, holding a bachelor's degree. She is not currently married and has no immediate family in the household. Despite working long hours per week (55 hours), her capital gains and losses last year were both zero.###\nHence this label was No."
"The individual is a 25-year-old White female from the United States. She is never married and lives with the head of the household as an Own-child. She is employed in the private sector as an office and administrative support worker. She is a high school graduate and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 39-year-old married White male from the United States. He holds a bachelor's degree and works as a professional specialist in the private sector, working 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"This is a 24-year-old married White male living in the United States. He works in the private sector as an office and administrative support employee, with a high school education. He has no capital gains or losses from last year and works 40 hours per week.###\nHence this label was No."
"This individual is a 33-year-old married white male living in the United States. He works in the private sector as an execution and management professional, holding a bachelor's degree. Despite having no capital gain or loss last year, he puts in 55 hours per week at work.###\nHence this label was Yes."
"The individual is a 38-year-old Black male from the United States who is divorced and unmarried. He works in the private sector as an execution and management professional, with a college education for less than one year. Despite working 60 hours per week, he had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 53-year-old married White male from the United States. He works in the protective services sector for the federal government with a bachelor's degree. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was Yes."
"This individual is a 43-year-old married Asian-Pac-Islander female working as a machine operator and inspector in the private sector. She is the wife of the head of the household and has completed 6th class education. Despite working a demanding 72 hours per week, she did not have any capital gain last year but incurred a capital loss of 2129.###\nHence this label was No."
"This individual is a 25-year-old married white male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee, with a work week of 40 hours. He finished 11th class for his education and had no capital gain or loss last year.###\nHence this label was No."
"A 47-year-old White female, divorced and unmarried, residing in the United States. She works as an executive in the private sector, with a college education for less than a year. Last year, she had no capital gains or losses and works 40 hours per week.###\nHence this label was No."
"This 20-year-old separated white female works in the service sector as a private sector employee in the United States. She has less than one year of college education and works 30 hours per week. She had no capital gain or loss last year. Her relation to the head of the household is own-child.###\nHence this label was No."
"This person is a 38-year-old white male from the United States who has never been married. He works in the private sector as an agriculture, forestry, and fisheries worker with a high school education. Despite working 60 hours per week, he did not have any capital gains or losses last year. The prediction is that his annual income is not likely to exceed $50,000.###\nHence this label was No."
"This individual is a 24-year-old Black female from the United States. She has never been married and is not living with family. She works in execution and management in the private sector, with a college education of less than one year. Last year, she had no capital gain or loss. She works 20 hours per week.###\nHence this label was No."
"The individual is a 19-year-old White male from the United States who has never been married. He is categorized as an Own-child in the household. He works in the private sector in the cleaning and maintenance sector, putting in 20 hours per week. Despite finishing 12th class without a diploma, he did not have any capital gain or loss last year.###\nHence this label was No."
"The person is a 48-year-old married White male from the United States. He works in the craft and repair sector for the federal government, with a college education for less than one year. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was Yes."
"The individual is a 34-year-old White female from the United States. She is married and works in a professional specialty occupation for the local government. With a bachelor's degree, she works 46 hours per week with no capital gain or loss last year.###\nHence this label was Yes."
"This individual is a 41-year-old White male from the United States. He is separated and not living with family. He works in the service sector as a private sector employee, completing 40 hours per week. He completed 9th class for education and did not have any capital gains or losses last year.###\nHence this label was No."
"This individual is a 33-year-old married White male from the United States. He works in the private sector as a sales employee, putting in 60 hours per week. Despite having finished 11th class for education, he did not report any capital gain or loss last year.###\nHence this label was No."
"This person is a 24-year-old White female from the United States who has never been married. She works in a professional specialty occupation for the local government, holding a master's degree. Despite having a capital gain and loss of $0 last year, she works a standard 40 hours per week.###\nHence this label was No."
"The individual is a 23-year-old White female from the United States. She is separated and is not the head of the household. She works in the sales sector as a private sector employee, with no capital gain or loss last year. She has received education for less than a year in college and works 40 hours per week.###\nHence this label was No."
"The individual is a 49-year-old White female from the United States. She is widowed and not living with family. She works in execution and management for the federal government, with a high school education. She had no capital gains or losses last year and works 20 hours per week.###\nHence this label was No."
"The person is a 55-year-old White female from the United States. She is married and works in a professional specialty occupation in the local government sector. She has a bachelor's degree and works 60 hours per week. Her capital gain and loss last year were both 0.###\nHence this label was No."
"This 23-year-old White female, who has never been married, is in the Own-child category in the United States. She works in the private sector in the technology and support sector, with no capital gain or loss last year. She attended college for less than one year and works 40 hours per week.###\nHence this label was No."
"This individual is a 50-year-old White male from the United States. He is married and the husband in the household. He owns an incorporated business, professional practice, or farm, working in execution and management. With a master's degree education, he works 50 hours per week and had no capital gain or loss last year.###\nHence this label was Yes."
"This individual is a 52-year-old widowed white female from the United States. She is unmarried and works in office and administrative support for the local government. She is a high school graduate and works 28 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 34-year-old White male from the United States who has never been married. He is not living with family and works in the craft and repair sector as an owner of a non-incorporated business, professional practice, or farm. Despite having some capital loss last year, his income exceeds $50,000. He completed some college education, works long hours per week (60), and shows determination in his career.###\nHence this label was No."
"The person is a 63-year-old married White male from the United States. He holds a professional specialty occupation with a professional degree. He is the husband in the household and works as the owner of a non-incorporated business, professional practice, or farm. He had a capital gain of $15,024 last year and did not incur any capital losses. He works 50 hours per week.###\nHence this label was Yes."
"The person is a 51-year-old married White male from the United States. He works in the private sector as an executive and manager, holding a bachelor's degree. Last year, he had a capital gain of $5178 and no capital loss. He works 60 hours per week.###\nHence this label was Yes."
"This individual is a 36-year-old White male from the United States who has never been married. He is not living with family and works in the sales sector as a private sector employee. His education level is college for less than one year. Despite working 50 hours per week, he did not have any capital gains or losses last year.###\nHence this label was No."
"The person is a 40-year-old married White male from the United States. He is a Husband and works in a professional specialty occupation for the federal government. He holds a master's degree and worked 40 hours per week. Last year, he did not have any capital gains or losses.###\nHence this label was Yes."
"This 21-year-old White female is never married and lives in the United States as an own-child. She is employed in the private sales sector, working 20 hours per week. With no capital gain or loss last year, she has attended college for less than one year.###\nHence this label was No."
"This is a 26-year-old White female who is married and works in the private sector as an office and administrative support employee in the United States. She is the wife in the household and has a high school education. She worked 40 hours per week last year with no capital gain or loss.###\nHence this label was No."
"The individual is a 35-year-old married White male living in the United States. He works in the private sector in the transportation, communication, and other public utilities sector. He is a high school graduate and works 50 hours per week. He had no capital gains or losses last year.###\nHence this label was No."
"This individual is a 44-year-old Caucasian female from the United States. She is divorced and not living with any family members. She is employed in the private sector as a cleaning and maintenance worker, with a high school education. She worked 48 hours per week last year and did not have any capital gains or losses.###\nHence this label was No."
"This individual is a 27-year-old married white male from the United States. He works in the service sector as a private sector employee, putting in 40 hours per week. He has not experienced any capital gains or losses in the last year and has attended college for less than one year.###\nHence this label was No."
"This individual is a 36-year-old Black female from the United States. She is divorced, unmarried, and works in the service sector for the local government. With a capital gain and loss of 0 last year, she has completed 11th class education and works 30 hours per week.###\nHence this label was No."
"The individual is a 20-year-old white male from the United States who has never been married. He is classified as an own-child in the household. He works in the service sector for the state government, with a college education of less than one year. Despite working 25 hours per week, he had no capital gains or losses in the previous year.###\nHence this label was No."
"The person is a 26-year-old White male from the United States. He is married and works as a private sector employee in the cleaning and maintenance sector. He is a high school graduate and works 40 hours per week. He had no capital gain or loss last year.###\nHence this label was No."
"The person is a 30-year-old married White male from the United States. He works in a professional specialty occupation in the local government sector, with a high school education. His work hours per week are 40, and he had no capital gains or losses last year.###\nHence this label was No."
"This individual is a 33-year-old White male from the United States. He is divorced and not living with family. He works in the private sector as an execution and management employee, putting in 40 hours per week. Despite not having a diploma, he finished the 12th class. Last year, he had no capital gain or loss.###\nHence this label was No."
"This individual is a 40-year-old married white male from the United States. He holds a doctoral degree and works as a professional in the private sector. He did not have any capital gains or losses last year and works 40 hours per week.###\nHence this label was Yes."
"The individual is a 52-year-old married Black male from the United States. He works in the private sector as a professional specialty and puts in 56 hours per week. Despite having no capital gain or loss last year, he has received some college education.###\nHence this label was Yes."
"This person is a 27-year-old unmarried female from the United States. She works as a professional specialty in the private sector and has a bachelor's degree. She did not have any capital gains or losses last year and works 33 hours per week.###\nHence this label was No."
"The person is a 45-year-old married white male working in the craft and repair sector as a private sector employee. He has finished 11th class education and works 40 hours per week. There were no capital gains or losses last year.###\nHence this label was No."
"The individual is a 44-year-old married White male from the United States. He works in the sales sector as a private sector employee with a bachelor's degree. Despite working long hours per week (60), he did not have any capital gain or loss last year.###\nHence this label was No."
"This 31-year-old White male, who is divorced and not living with family, is a professional in a state government job in the United States. He has a bachelor's degree and works 40 hours per week. Last year, he did not have any capital gain or loss.###\nHence this label was No."
"This individual is a 40-year-old unmarried white male living in the United States. He is divorced and works in the craft and repair sector as a private sector employee. He has no capital gains or losses from the previous year. He has attended college for one or more years but does not have a degree. He works 50 hours per week.###\nHence this label was Yes."
"This is a 42-year-old married White male from the United States working in the private sector as an executive manager. He holds a bachelor's degree, works 50 hours per week, and had no capital gains or losses last year.###\nHence this label was Yes."
"The individual is an 18-year-old White male from the United States, never married, and not living with family. He works as a private sector employee in the sales sector, with a high school education. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 34-year-old married White male from the United States working in the technology and support sector as a private sector employee. He is the husband in his household. He is a high school graduate, working 42 hours per week, with a capital gain of 0 and a capital loss of 1672 in the last year.###\nHence this label was No."
"The individual is a 61-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a high school education. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was Yes."
"This 24-year-old White male, who has never been married, is not living with family in the United States. He works in the private sector in an office and administrative support role, with a college education for less than one year. Despite working 24 hours per week, he had no capital gain but incurred a capital loss of $2205 in the previous year.###\nHence this label was No."
"The individual is a 35-year-old White female from the United States who has never been married. She is an own-child, working as a sales sector employee in the private sector. She is a high school graduate and works 29 hours per week. Her capital gain and loss last year were both 0.###\nHence this label was No."
"The individual is a 33-year-old White female from the United States, currently married and working as a machine operator and inspector in the private sector. She is a high school graduate and works 46 hours per week. In the last year, she had no capital gains or losses.###\nHence this label was Yes."
"The individual is a 47-year-old married White male from the United States. He works in the private sector as an executive/manager, with a high school education. Despite working long hours per week (60), he did not have any capital gains or losses last year.###\nHence this label was No."
"This person is a 43-year-old Black male from the United States who has never been married. He works as a machine operator and inspector in the private sector, putting in 40 hours per week. Last year, he had no capital gains or losses, and he completed 10th grade education. He is not-in-family in relation to the head of the household.###\nHence this label was No."
"The individual is a 46-year-old Black male from the United States, married and working in the sales sector as a private sector employee. He has no capital gain or loss from the previous year, and he has received less than a year of college education. Despite working long hours per week (60 hours), it is uncertain whether his annual income exceeds $50,000.###\nHence this label was Yes."
"The individual is a 47-year-old widowed White female from the United States. She is unmarried and works as a professional specialty in her own non-incorporated business, professional practice, or farm. She holds an associate's degree and works 35 hours per week. Last year, she had a capital gain and loss of 0.###\nHence this label was No."
"This 38-year-old married White male, who is a husband in the household, is employed in the private sector within the transportation, communication, and other public utilities sector. He is a high school graduate and worked 55 hours per week last year. There were no reported capital gains or losses. This individual resides in the United States. The dataset predicts whether his annual income exceeds $50,000.###\nHence this label was No."
"This individual is a 20-year-old White male from the United States who has never been married. He is an own-child of the head of the household and works in the craft and repair sector as a private sector employee. He is a high school graduate working 20 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 58-year-old married White male from the United States. He works in the technology and support sector for the federal government, with a high school education. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was No."
"This individual is a 40-year-old married White male from the United States. He works in the sales sector as a private sector employee, with a high school education. Despite working 60 hours per week, he did not report any capital gains or losses last year.###\nHence this label was Yes."
"The person is a 41-year-old married Asian-Pac-Islander male from India. He has a professional specialty occupation, is the owner of an incorporated business, professional practice, or farm, and has a professional degree. Last year, he had a capital gain of $99,999 and no capital loss. He works 50 hours per week.###\nHence this label was Yes."
"This individual is a 28-year-old White male from the United States who has never been married. He is classified as an own-child in the household. His occupation is in execution and management, and he is the owner of an incorporated business, professional practice, or farm. Despite being a high school graduate, he works 40 hours per week. In the previous year, he did not experience any capital gains or losses.###\nHence this label was No."
"This is a 56-year-old divorced Asian-Pac-Islander female from the Philippines. She is not in a family relationship with the head of the household and works as a professional specialty in the private sector. She holds a bachelor's degree and works 40 hours per week. With no capital gain or loss last year, the prediction is whether her annual income exceeds $50,000.###\nHence this label was No."
"The person is a 30-year-old White male from the United States who has never been married. He works in the private sector as an office and administrative support employee. He has a high school education and works 42 hours per week. In the previous year, he did not have any capital gain but experienced a capital loss of $2001.###\nHence this label was No."
"The individual is a 43-year-old White male from the United States. He is married and works in a professional specialty occupation in the local government sector. With a master's degree education, he puts in 45 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The person is a 54-year-old White male, married and works as a craftsman in the repair sector. He is the husband in the household and is a business owner with a professional practice or farm. He is a high school graduate and works 40 hours per week. Last year, he had no capital gains or losses. His native country is the United States.###\nHence this label was Yes."
"The individual is a 24-year-old married White female from the United States. She works as a machine operator and inspector in the local government sector. She is a high school graduate and works 42 hours per week. Last year, she had a capital gain of 2036 and no capital loss.###\nHence this label was No."
"This individual is a 30-year-old White female from the United States. She has never been married and is classified as an Own-child in terms of her relation to the head of the household. Her occupation, work class, and education level are unspecified. She had no capital gains or losses last year and works 30 hours per week.###\nHence this label was No."
"The individual is a 43-year-old White male from the United States who has never been married. He is not living with family and works in the private sector in an office and administrative support role. Despite having no capital gain, he experienced a capital loss of $1,669 last year. He received some college education for less than a year and works 45 hours per week.###\nHence this label was No."
"The person is a 32-year-old married White male residing in the United States. He is employed in a professional specialty occupation within the local government. With a master's degree as his highest education level, he works 48 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 38-year-old married Asian-Pac-Islander male from the United States. He works in the private sector as an execution and management employee, holding a bachelor's degree. Despite working 60 hours per week, the person did not have any capital gain or loss last year.###\nHence this label was Yes."
"This 21-year-old White female, who has never been married, is living in the United States as an own-child relative. She works in the service sector as a private sector employee, with no capital gain or loss last year. She has attended college for less than a year and works 35 hours per week.###\nHence this label was No."
"This individual is a 64-year-old widowed White female from the United States. She is not in a family relation to the head of the household and her occupation and work class information are not available. She had no capital gains or losses last year. Her education level is high school graduate and she works 20 hours per week.###\nHence this label was No."
"The individual is a 41-year-old unmarried Black female from the United States. She works in office and administrative support for the state government, holding a master's degree. She is not living with family and had no capital gains or losses last year. She works 40 hours per week.###\nHence this label was No."
"The individual is a 35-year-old White male from the United States. He is never married and not living with family. He is employed in the private sector as a cleaning and maintenance worker with a high school education. Last year, he had no capital gain or loss. He works 30 hours per week.###\nHence this label was No."
"The individual is a 31-year-old White male from the United States. He is divorced and currently unmarried. He works in the craft and repair sector as a private sector employee, putting in 40 hours per week. Despite having attended college for one or more years without obtaining a degree, his capital gains and losses last year were both 0.###\nHence this label was No."
"The individual is a 54-year-old married white male from the United States. He works in execution and management in the local government sector with a bachelor's degree. He has no capital gain or loss from last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 40-year-old White female from Scotland, currently married and working in the service sector as a private sector employee. She attended college for less than one year. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was No."
"The individual is a 52-year-old White male from the United States who is married and works as an executive or manager in his own non-incorporated business, professional practice, or farm. He has no capital gains or losses from the previous year and has attended college for at least a year without obtaining a degree. He works 40 hours per week.###\nHence this label was No."
"The individual is a 47-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a college education but without a degree. He had a capital gain of $7688 last year and did not incur any capital losses. He works 40 hours per week. Based on this information, it is predicted that his annual income exceeds $50,000.###\nHence this label was Yes."
"This individual is a 33-year-old White female from the United States. She has never been married and is not living with any family members. She works in the service sector as a private sector employee, with a college education for less than one year. Despite working 25 hours per week, she had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 59-year-old married white male from the United States. He is the husband in the household and works in the sales sector as the owner of an incorporated business, professional practice, or farm. He is a high school graduate who worked 60 hours per week last year. He did not have any capital gain or loss in the previous year.###\nHence this label was Yes."
