"This individual is a 24-year-old divorced/separated/married female with a steady income for less than a year. She has a good credit history of paying back all credits at the bank duly. The purpose of the credit is for education, and the amount is 433 DM. She has significant savings of at least 1000 DM and no other debtors/guarantors. She lives in a rented housing with two people to provide maintenance for. Additionally, she has one existing credit at the bank, a building society savings agreement/life insurance, and a job as a skilled employee/official. She has no telephone but is a foreign worker.###\nHence this label was No."
"This individual is a married/widowed male, employed as a skilled employee/official for 1 to less than 4 years. He does not have a checking account but has a savings account with less than 100 DM. He has paid back existing credits duly, has no other debtors or guarantors, and owns real estate for housing. With a credit amount of 1076, he has been living in his current residence for 2 years, is 26 years old, and has no other installment plans. He has one existing credit at the bank and one person reliant on him for maintenance. He has a telephone registered under his name and is not a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has been repaying existing credits on time, and is looking to purchase furniture/equipment. They are taking out a credit of 4153, have savings of less than 100 DM, and have been employed for 1 to 4 years. Their disposable income installment rate is 2%, and they are a single male. They have a co-applicant for their debts, have been living in their current residence for 3 years, and own a car or other property. At 42 years old, they have no other liabilities and no other installment plans. They work as a skilled employee/official and are the sole provider for one person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, a good credit history, and is looking to purchase domestic appliances with a credit amount of 741. They have savings between 100 and 500 DM, are currently unemployed, and have been at their current residence for 3 years. The person is a 22-year-old female who is divorced/separated/married, has no other debtors/guarantors, and owns their own home. They have one existing credit at the bank, are a skilled employee/official, and have one dependent. They do not have any other installment plans, a telephone, or any debtors/guarantors. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual is a 21-year-old single male with no checking account, but a savings account with less than 100 DM. He has been employed for 4-7 years as a skilled employee/official and owns a car or other property. His credit history shows a delay in paying off debts in the past. He is looking for a loan for a radio/television, amounting to 15653. He has no other debtors or guarantors, no other installment plans, and lives in his own home. He has 2 existing credits at the bank, and one person dependent on him for maintenance. He has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"The individual in this data is a 23-year-old divorced/separated/married female who has been at her current job for less than a year. She has a checking account balance of less than 0 DM, a credit history of paying back credits on time, and a credit amount of 1216 for a new car. She has savings of less than 100 DM and no other debtors/guarantors. She has been living in her current residence for 3 years, has no other installment plans, and rents her housing. As a skilled employee/official, she is the sole provider for one person and has a registered telephone under her name. She is also a foreign worker.###\nHence this label was No."
"This individual is a single male, unemployed and without any savings. He has been paying back all credits at a bank duly and is looking to finance a new car. With a credit amount of 12169 DM and an installment rate of 4%, he has no other installment plans and is living in a property for free. Aged 36, he has one co-applicant as a guarantor, one existing credit at the bank, and has been residing at his current residence for 4 years. His job is in the management/self-employed/highly qualified employee/officer category, and he is liable for providing maintenance to one other person. He has a telephone registered under his name, is a foreign worker, and overall appears to have a stable financial profile.###\nHence this label was Yes."
"The individual in this dataset is a 26-year-old divorced or separated or married female, who has no checking account, but has savings of less than 100 DM. She has been employed for 4 to 7 years and works in a management or self-employed or highly qualified employee or officer role. She lives in a rented housing with 1 dependent, and has 1 existing credit at the bank. The purpose of the credit is for a radio/television, with a credit amount of 4530 and a duration of 30 months. She has no other debtors or guarantors, no other installment plans, and her installment rate is 4. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and their credit history is categorized as critical with other existing credits. They are seeking a new car loan amounting to 5045. Their savings account status is unknown. They have been employed for at least 7 years. The installment rate for disposable income is 1%. The individual is a divorced/separated/married female, aged 59, with no other debtors or guarantors. They have been residing at their current residence for 4 years and own a property. They have no other installment plans, have one existing credit at a bank, and work as a skilled employee/official. They are responsible for providing maintenance for one person. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this example has a stable existing checking account with a balance between 0 and 200 DM. They have a good credit history with other existing credits outside of this bank. The purpose of their credit is for a new car. They are borrowing 2181 DM. Their savings account status is unknown or they do not have one. They have been employed for at least 7 years. They have a moderate installment rate in percentage of disposable income. The individual is a single male, 36 years old, with no other debtors or guarantors. They have been living in their current residence for 4 years and own real estate. They have no other installment plans, own their housing, and have 2 existing credits at this bank. The individual is a skilled employee or official with one person dependent on them. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a credit history of delaying payments in the past. They are taking a business loan for a duration of 36 months. The credit amount is 7980, and they have unknown or no savings. They have been employed for less than a year and their installment rate is 4% of disposable income. The individual is a 27-year-old single male with no other debtors or guarantors. They have been residing in their current location for 4 years and own a car or other property. They have no other installment plans, rent their housing, and have 2 existing credits at the bank. The individual is a skilled employee, responsible for one dependent, has a telephone registered under their name, and is a foreign worker.###\nHence this label was No."
"This individual does not have a checking account and has been repaying existing credits on time. They are looking to finance a radio/television, with a credit amount of 3430. Their savings range from 500 to less than 1000 DM. They have been employed for at least 7 years and have a low installment rate on disposable income. As a single male, they have no other debtors or guarantors. They have been residing in their current home for 2 years and own a car or other property. At 31 years old, they have a stable job as a skilled employee/official. They have no other installment plans and live in their own home. With one existing credit at the bank, they are liable to provide maintenance for 2 people. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"The individual is a 25-year-old divorced/separated/married female, working as a skilled employee/official, with existing checking account balance between 0 and 200 DM. She has a car (new) and has been living in a rented house for 1 year. The credit history shows that she has paid back all existing credits duly till now. She has a savings account with less than 100 DM and no other debtors/guarantors. The credit amount is 1295, with an installment rate of 3% of disposable income. She has no other installment plans and no telephone. She has one existing credit at the bank and is the sole provider for one person's maintenance. As a foreign worker, she does not have a telephone.###\nHence this label was No."
"This individual is a 20-year-old female who is divorced or separated or married. She has been employed for 1 to less than 4 years as a skilled employee/official. She has a stable living situation, residing in a rented accommodation for 4 years. She has a good credit history with existing credits paid back duly. She has a small credit amount of 1282 DM for the purpose of furniture/equipment. She has savings of less than 100 DM and no other debts or guarantors. She has no other installment plans or telephone. She is responsible for one person's maintenance and is a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a good credit history with existing credits paid back on time, and is looking to purchase a used car. They have an unknown or no savings account, have been employed for at least 7 years, and have a moderate installment rate. The person is a 49-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 4 years and have no property. Their other installment plan is with a bank, and they live in housing for free. The individual is a skilled employee/official with one existing credit at the bank, and is responsible for providing maintenance for two people. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable credit history with no prior credits, a good savings amount, and a steady job. They are seeking credit for a business purpose and have a moderate credit amount for a 48-month duration. They are a single male in their mid-30s, with no other debtors or guarantors. They have been living in their current residence for 4 years and have no other major assets. Their financial obligations are manageable with only one existing credit. They have a simple lifestyle with no other installment plans and live in housing for free. Overall, they seem to be a responsible and reliable individual with a good chance of being a low credit risk.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a good credit history with all credits at a bank paid back on time. They are looking to finance a new car with a credit amount of 1647. They have no savings account but have been employed for 1 to less than 4 years. With an installment rate of 4%, they are a 40-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years, own their own home, and have a building society savings agreement/life insurance. They have two existing credits at this bank and work as an unskilled resident with 2 people dependent on them for maintenance. They currently do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 51-year-old single male, working as a skilled employee with 4 to 7 years of current employment. They do not have a checking account but have savings of less than 100 DM. They have no other debtors/guarantors and no other installment plans. Their credit history shows existing credits paid back promptly. The purpose of their credit is for a radio/television, with a credit amount of 1595. They live in their own house, have been residing at their current address for 2 years and have 1 existing credit at the bank. They have an installment rate of 3% of disposable income and no telephone. They are responsible for providing maintenance for 2 people and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has been repaying existing credits on time. They took a loan for a radio/television, amounting to 1258 DM. They have savings between 500 and 1000 DM and have been employed for 1 to 4 years. Their monthly installment rate is 3% of disposable income. The person is a divorced, separated, or married female, with no other debtors or guarantors. They have been living at their current residence for 3 years and own a car or other property. At the age of 57, they have no other installment plans, own their housing, and have one existing credit at the bank. They work as an unskilled resident and are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a critical credit history with other existing credits. They are seeking a loan for a radio or television. The credit amount requested is 1800, with savings of less than 100 DM. The individual has been employed for 1 to 4 years. They have a single status, are male, and have no other debtors or guarantors. The individual has been residing at their current residence for 2 years and owns a car or other property. They are 24 years old, have no other installment plans, and their housing status is own. They have 2 existing credits at this bank, are a skilled employee/official, and have 1 dependant. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with 0 to 200 DM in their existing checking account. They have a good credit history with critical accounts and other existing credits. The purpose of their loan is for a radio or television. They have a moderate credit amount of 1795 DM and some savings. With over 7 years in their current employment, they have a consistent income. Their installment rate is reasonable at 3% of disposable income. The individual is a divorced or separated female with a guarantor for other debts. They have been residing in their current place for 4 years, owning real estate. At the age of 48, they have a bank installment plan and rent housing. With 2 existing credits at this bank, they are employed in an unskilled resident job. Responsible for providing maintenance for one person, they have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"The individual is a 26-year-old female who is divorced/separated/married and works as a skilled employee/official. She has been living in her current residence for 4 years and has no other installment plans or debtors/guarantors. Her existing checking account balance is less than 0 DM and she has a savings account with less than 100 DM. She has one credit at this bank and her credit history shows that she has always paid back her credits duly. The purpose of her current credit is for furniture/equipment, with a duration of 18 months and a credit amount of 3114. She has no telephone, but is a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a credit history of paying back existing credits on time, and wishes to use the credit for domestic appliances. They have savings of less than 100 DM and have been employed for 1 to 4 years. With an installment rate of 4%, they are a married/widowed male aged 47, with no other debtors or guarantors. They own real estate and have been living in their current residence for 3 years. They have one existing credit at the bank, work as an unskilled resident, and have one person dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a loan for furniture/equipment, with a credit amount of 3422. Their savings are less than 100 DM and have been employed for at least 7 years. The person is a 47-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and have a building society savings agreement/life insurance. The individual has three existing credits at the bank, a skilled job, and two dependents. They own their own home, have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual, a 22-year-old divorced/separated/married female, has no checking account and has been employed for 4-7 years. They have a good credit history despite a past delay in payments. They are seeking a loan of 1808 DM for furniture/equipment. Their savings are less than 100 DM and they own real estate. They have one existing credit at the bank and no other debts. They have no other installment plans, no telephone, and one dependent. They work as a skilled employee/official and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been paying back existing credits duly. They are looking to purchase a radio/television with a credit amount of 1376. They have savings between 500 and 1000 DM and have been employed for 4 to 7 years. The installment rate is 4% of disposable income. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been residing at their current residence for 1 year and own a car or other property. At 28 years old, they have no other installment plans, own their own home, and have one existing credit at the bank. They are a skilled employee/official with one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of less than 0 DM, has had existing credits paid back on time, and has been employed for at least 7 years. They are borrowing a credit amount of 3446 DM for the purpose of furniture/equipment. They have savings of less than 100 DM, own a car or other property, and have been living in their current residence for 2 years. The individual is a 42-year-old single male, a skilled employee/official, with no other debtors or guarantors. They have an installment rate of 4% of their disposable income and no other installment plans. They have one existing credit at the bank and two people they are financially responsible for. They own their own home, do not have a telephone, and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history of paying back existing credits on time. They took a loan for education amounting to 727 DM and have savings between 500 and 1000 DM. They have been employed for over 7 years and have a low installment rate of 4% of disposable income. The individual is a 46-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and possess no property. There are no other installment plans, and they live in a residence for free. They have one existing credit at the bank and work as a skilled employee or official. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM and has a good credit history. They are borrowing a credit amount of 7174 for the purpose of purchasing a radio/television. They have unknown or no savings account and have been employed for 4 to 7 years. Their disposable income installment rate is 4% and their personal status is a divorced/separated/married female. They have no other debtors or guarantors and have been residing at their current residence for 3 years. They own a car or other property, are 30 years old, and have no other installment plans. They live in their own house, have 1 existing credit at the bank, and work as a management/self-employed/highly qualified employee/officer. They have 1 person they are responsible for providing maintenance for, have a telephone registered under their name, and are a foreign worker.###\nHence this label was No."
"The individual does not have a checking account and has been employed for 4 to 7 years. They are looking to finance a used car, with a credit amount of 2346. Their savings are less than 100 DM. They are a single male, 35 years old, with no other debtors or guarantors. They have been residing in their current home for 3 years and own it. They have two existing credits at the bank and work as a skilled employee/official. They have one person dependent on them. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old divorced/separated/married female who has no checking account. She has been employed for 4 to 7 years as a skilled employee/official. She has one existing credit at the bank and has been residing in the current location for 4 years. The purpose of the credit is for furniture/equipment, with a credit amount of 3972. She has savings of less than 100 DM and no other installment plans or debtors/guarantors. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has paid back existing credits on time. They are looking for a loan to purchase furniture or equipment. With a credit amount of 1984 and savings less than 100 DM, they have been employed for 1 to 4 years. The installment rate is 4% of disposable income. A 47-year-old single male, they have no other debtors or guarantors. They have been living in their current residence for 4 years with no specified property. They have two existing credits at this bank and work as a skilled employee. Responsible for one person's maintenance, they have no telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old single male with a stable job, having been employed for less than a year. He has no existing debts or other dependents to provide for. He holds a building society savings agreement/life insurance and owns his own home. Although he has a low credit amount and has been prompt in repaying existing credits, his savings account status is unknown. He does not have any other installment plans or a telephone. Despite having no savings account, he is considered a good credit risk according to the available data.###\nHence this label was Yes."
"The individual is a 26-year-old married/widowed male who has been working for less than a year as a skilled employee/official. He has a good credit history with existing credits paid back duly, and he currently has one existing credit at the bank. His checking account balance is between 0 and 200 DM, with a savings account below 100 DM. He is looking for a business loan of 907 DM.\nHe has no other debtors or guarantors, owns real estate, and has been living at his current residence for 2 years. He has no other installment plans or people dependent on him for maintenance. He has a landline telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with critical accounts. They are seeking a loan for furniture or equipment, with a credit amount of 3777. They have savings of at least 1000 DM and have been employed for 1 to 4 years. Their installment rate is 4% of disposable income. The individual is a 50-year-old single male, with no other debtors or guarantors. They have been residing in their own real estate for 4 years and have no other installment plans. The individual is a skilled employee with one existing credit at the bank. They are liable for providing maintenance to one person and have a registered telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a divorced or separated or married female, aged 43. She has no checking account and no other debtors/guarantors. She has a credit history of critical account/other credits existing (not at this bank) and a credit amount of 1516 for the purpose of radio/television. She has savings of >= 1000 DM and has been employed for 1 to < 4 years. She has no other installment plans and resides in her own real estate. She has 2 existing credits at this bank, an installment rate of 4%, and has been living at her current residence for 1 year. She is an unskilled resident with no telephone, and is a foreign worker. She is responsible for providing maintenance for 1 person.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a new car, with a credit amount of 947. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their installment rate is 4% of disposable income. The individual is a single male, with no other debtors or guarantors. They have been living at their current residence for 3 years and have unknown or no property. At the age of 38, they have one existing credit at the bank and work as a skilled employee or official. They are responsible for providing maintenance for 2 people and do not have a telephone. As a foreign worker, this individual is considered a good credit risk.###\nHence this label was No."
"The individual has no checking account and has a credit history of paying back existing credits duly. They are taking a loan for a radio/television, with a credit amount of 776. Their savings are below 100 DM and they have been employed for 1 to less than 4 years. The installment rate is 4% of their disposable income. The individual is a married/widowed male, with no other debtors or guarantors. They have been residing at their current residence for 2 years and own real estate. At 28 years old, they have no other installment plans, one existing credit at the bank, and are a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this data is a 23-year-old divorced/separated/married female with a checking account balance of less than 0 DM. She has been employed for less than 1 year and resides in a rented property. She has one existing credit at the bank and no other debtors/guarantors. Her credit history shows that she has paid back existing credits duly. The purpose of her credit application is for furniture/equipment, with a credit amount of 3234 DM. She has savings of less than 100 DM and no other installment plans. Her installment rate is 4% of disposable income. She has been residing at her current residence for 4 years and is an unskilled resident. She is liable to provide maintenance for one person and has a telephone registered under her name. She is also a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history of paying back existing credits on time. They are taking a loan for a radio/television, with a credit amount of 2299 DM. They have savings between 500 and 1000 DM and have been employed for over 7 years. Their monthly installment rate is 4% of disposable income. They are a single male, have no other debtors or guarantors, and have been living at their current residence for 4 years. They own a car or other property, are 39 years old, and have no other installment plans. They live in their own house, have one existing credit at the bank, and work as a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account. They have a good credit history with critical accounts. The purpose of their credit is categorized as 'others'. They are borrowing a relatively large amount of money. They have some savings. They have been employed for 1 to 4 years. Their monthly installment rate is low. The individual is a single male with a co-applicant. They have lived at their current residence for 3 years and own a car or other property. They are 39 years old and have no other installment plans. They have 2 existing credits at the bank and work in a high-level job. They are responsible for providing maintenance for 2 people. They have a telephone registered in their name and are a foreign worker.###\nHence this label was No."
"This individual is a single male, aged 25, with no checking account or savings. They have been employed for at least 7 years as a skilled employee, with a stable residence of 2 years. Their credit history shows a good track record of repaying existing credits. The purpose of the loan is for a radio/television, with a moderate credit amount of 999. They have no other debtors or guarantors, no other installment plans, and own their own home. Additionally, they have 2 existing credits at this bank and are responsible for providing maintenance for one person. Despite not having a telephone, this individual is a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account and has had the same employment for at least 7 years. They took a 16-month loan for a new car, with a credit amount of 2625 DM. Their savings amount is less than 100 DM, and they have a guarantor for other debts. The individual is a 43-year-old single male, living in a rented house for 4 years. They have one existing credit at the bank and work as a skilled employee. They have one person for maintenance and a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM and has been making credit payments on time. They are looking to borrow money for a radio/television purchase, with a credit amount of 5152. Their savings are less than 100 DM and they have been employed for 4 to 7 years. They have no other debtors or guarantors, own a property, and live in their own house. The individual is a 25-year-old, single male with a skilled job, no telephone, and no other installment plans. They have one existing credit at this bank and are responsible for providing maintenance to one person. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a single, male foreign worker with no checking account and unknown savings. They have been employed for less than 1 year as a skilled employee, and have been living in their own home for 2 years. They have no other debtors or guarantors, no other installment plans, and do not have a telephone. They have 2 existing credits at the bank and are responsible for providing maintenance for 1 person. With a good credit history of paying back existing credits on time, they are seeking a loan of 3105 for the purpose of purchasing a radio/television. At 25 years old, they have a manageable installment rate and are financially stable.###\nHence this label was Yes."
"The individual is a single male with a stable job, having been employed for over 7 years. He has a good credit history with existing credits paid back duly. He is looking for a loan of 368 DM for the purpose of purchasing a radio/television. He has no savings account but owns a building society savings agreement. He has no other debtors or guarantors. He lives in his own house with one dependent, and has been residing there for 4 years. He has no other installment plans, no telephone, and no one else liable for maintenance. Additionally, he is a skilled employee and a foreign worker.###\nHence this label was Yes."
"This individual is a 26-year-old single male, working as a skilled employee with 4-7 years of employment history. He has a good credit history with a small credit amount of 1424 DM, and savings of less than 100 DM. He lives in his own house with one dependent, has no other debtors or guarantors, and no other installment plans. He has been living at his current residence for 3 years and has one existing credit at the bank. He does not have a telephone but is a foreign worker. The purpose of the credit is for domestic appliances.###\nHence this label was Yes."
"This individual has a checking account with a balance below 0 DM and has been paying existing credits on time. They took a loan of 343 DM for domestic appliances, with savings of less than 100 DM. They have been employed for less than a year and have a low installment rate. The individual is a divorced/separated/married female, with no other debtors or guarantors. They have been living in real estate for 1 year, own their own house, and have a skilled job. The individual is responsible for one person's maintenance and does not have a telephone. Additionally, they are a foreign worker and are 27 years old.###\nHence this label was Yes."
"This individual is a 33-year-old female who is divorced/separated/married. She has been in her current employment for 1 to 4 years as a skilled employee/official. She owns a car or other property and lives in her own home for the past 4 years. She has no other debtors or guarantors. She has 2 existing credits at the bank and one person to provide maintenance for. She has a telephone registered under her name and is a foreign worker. She has no history of taking credits and has always paid them back duly. She is looking to finance furniture/equipment with a credit amount of 3244 DM and has savings of less than 100 DM. She has a good credit history with no previous issues.###\nHence this label was Yes."
"The individual has no checking account and has a credit history of delay in paying off in the past. They are taking a 6-month credit for business purposes with an amount of 1743. Their savings account/bonds range from 100 to less than 500 DM. They have been employed for 1 to less than 4 years and have a low installment rate in percentage of disposable income. The individual is a single male, with no other debtors/guarantors, and has been living in their own real estate for 2 years. They have no other installment plans, no telephone, and are a foreign worker. Additionally, they have 2 existing credits at the bank, are unskilled-resident, and have 1 person liable for maintenance.###\nHence this label was Yes."
"This individual has no checking account and an unknown savings account. They have been employed for at least 7 years and have a stable residence. The purpose of the credit is for a radio/television. They are a 47-year-old single male with no other debtors or guarantors. They own real estate and have one existing credit at the bank. The individual is a skilled employee and has a telephone registered under their name. They are a foreign worker and have no other installment plans.###\nHence this label was Yes."
"The individual in this dataset has no checking account and has been employed for 4 to 7 years. They took a loan for a used car with a credit amount of 3850. They have savings of less than 100 DM and have been living in their current residence for 1 year. The person is a 27-year-old single male, with no other debtors or guarantors. They own their own home and have 2 existing credits at the bank. The individual works as a skilled employee or official and is responsible for providing maintenance for one person. They do not have any other installment plans, own a telephone, or are a foreign worker.###\nHence this label was Yes."
"This individual is a 27-year-old divorced/separated male, working as a skilled employee/official. He has been living in his current residence for 4 years and owns a car. His existing checking account has a balance between 0 and 200 DM, and he has less than 100 DM in savings. He is looking to borrow 2820 DM for a new car, with an installment rate of 4% of his disposable income. He has no other debts or guarantors, and no other installment plans. Additionally, he has 2 existing credits at the bank, with 1 person liable for maintenance. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual in this data is a 47-year-old single male, who has been employed for 4-7 years. He has a checking account balance between 0 and 200 DM, with savings under 100 DM. He is looking to take out a new car loan for 958 DM, with a 12-month duration and an installment rate of 2%. He has real estate property, owns his own home, and has two existing credits. The individual has no other debtors/guarantors, other installment plans, or telephone. He is an unskilled resident with two dependents and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history, and is looking to purchase a radio/television. They are borrowing 727 DM for a duration of 12 months, with savings between 100 and 500 DM. They have been employed for less than a year and have a low installment rate. The individual is a 33-year-old married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 3 years and own their own home. This individual has one existing credit at the bank, an unskilled job, and is responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"The individual does not have a checking account and has been employed for 1 to less than 4 years. They took a loan for a new car, with a credit amount of 7228. Their savings are less than 100 DM and they have no other ongoing credits at this bank. They have been living in their current residence for 4 years and own their own home. The individual is a 39-year-old single male, with no other debtors or guarantors. They have a modest income, with an installment rate of 1% of disposable income. They work as an unskilled resident and are responsible for one person's maintenance. They do not have a telephone but are a foreign worker. Their property includes a building society savings agreement or life insurance.###\nHence this label was Yes."
"This individual has no checking account and has been paying back existing credits on time. They took a loan of 1364 DM for a new car, with savings of less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate. The person is a divorced/separated/married female, owns a house, and is 64 years old. They have no other debtors or guarantors, one existing credit at the bank, and work as a skilled employee. The individual lives in their own home with one person dependent on them and has a telephone registered under their name. They are also a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with no existing credits and a good credit history. They are looking to finance a used car for 20 months, with a credit amount of 6148 DM. Their savings are between 100 to 500 DM and they have been employed for over 7 years. The installment rate is 3% of their disposable income. The individual is a married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own a car or other property. At 31 years old, they have a bank installment plan, own their housing, and have 2 existing credits at their bank. The individual is a skilled employee/official with one person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of critical account/other credits existing. They are looking to obtain a new car. The credit amount requested is 1455, and they have savings of less than 100 DM. They have been employed for 4 to less than 7 years and have a low installment rate in percentage of disposable income. The individual is male, single, with no other debtors/guarantors. They have been residing in their current residence for 1 year, own real estate, and are 42 years old. They have no other installment plans, own their housing, and have three existing credits at this bank. The individual has an unskilled-resident job and is responsible for providing maintenance for two people. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 27-year-old single male with a steady job held for over 7 years. He has a good credit history with existing credits paid back duly. His current checking account balance is between 0 and 200 DM, with savings of less than 100 DM. He is looking to borrow 1082 DM for the purpose of buying a radio/television. He has no other installment plans or debtors/guarantors. He has been living in his current residence for 4 years and owns his own home. He has 2 existing credits at the bank and is responsible for providing maintenance for one person. Additionally, he is a foreign worker with no telephone.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of a critical account/other credits existing. They are seeking a loan for a radio/television. The credit amount requested is 6070. They have savings of less than 100 DM and have been employed for at least 7 years. Their installment rate is 3% of disposable income. The individual is a 33-year-old single male. They have no other debtors/guarantors and have been residing at their current residence for 4 years. They own a car or other property not specified in attribute 6. They have no other installment plans, own their own home, and have 2 existing credits at the bank. The individual is a skilled employee/official with 1 person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM, has had the account for over 7 years, and has a good credit history with other existing credits. They are seeking a loan for a radio/television, with a credit amount of 3017 DM. They have savings of less than 100 DM and own a building society savings agreement or life insurance. The individual is a single 47-year-old male, employed as a skilled worker, with no other debtors or guarantors. They have been living in their current residence for 4 years, own their own home, and have no other installment plans. They have one existing credit at this bank and are the sole provider for one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a 21-year-old single male with existing credits paid back duly till now. He has a checking account with less than 0 DM and savings of less than 100 DM. His current employment has been for 1 to less than 4 years, and he has one existing credit at the bank. The purpose of the credit is for furniture/equipment, with a credit amount of 1289. He has a guarantor for other debtors, no other installment plans, and owns his own home. He has been residing in his current residence for 1 year and has no telephone. He works as an unskilled resident and is a foreign worker.###\nHence this label was Yes."
"This dataset contains information about an individual applying for a credit risk assessment. The applicant is a 28-year-old divorced or separated or married female, who has been employed for 1 to 4 years as a skilled employee or official. She has a checking account with a balance between 0 and 200 DM and a savings account with a balance between 100 and 500 DM. The purpose of the credit is for a new car, with a credit amount of 2631 DM. She has no other debtors or guarantors, no other installment plans, and resides in a rental property for the past 4 years. She has been diligent in repaying existing credits and has two existing credits at the bank. She has a moderate installment rate in percentage of disposable income and owns a phone registered under her name. Additionally, she is a foreign worker and is solely responsible for one dependent.###\nHence this label was No."
"This individual is a 27-year-old single male, working as a skilled employee with 1-4 years of employment history. He has a checking account with less than 0 DM, savings of less than 100 DM, and no other debtors or guarantors. He has been residing in his own home for 2 years and has one existing credit at the bank. The individual is financially responsible, with existing credits paid back duly. His current credit amount is 4020 for the purpose of furniture/equipment. He has no telephone but is considered a reliable foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM and a history of delayed payments. They are unemployed and seeking a new car loan of 1333 DM. Their savings are below 100 DM and they have been residing for 2 years in a free housing with real estate property. They are a 43-year-old single male, a skilled employee with two existing credits and two dependents. They have no other debtors or guarantors, no other installment plans, no telephone, but are a foreign worker.###\nHence this label was No."
"The individual in this example has no checking account and a credit history of paying existing credits back duly. They are looking to purchase furniture/equipment with a credit amount of 3349. Their savings amount is less than 100 DM and they have been employed for 1 to less than 4 years. They have a low installment rate, are female, divorced/separated/married, and have no other debtors/guarantors. They have been residing at their current residence for 2 years, own a car or other property, and are 28 years old with no other installment plans. They have one existing credit at this bank, a job in management/self-employment/highly qualified employee/officer role, and one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a 28-year-old married/widowed male with a stable job in management/self-employment. He has a good credit history with existing credits paid back duly. His current checking account balance is between 0 and 200 DM, and he has savings of less than 100 DM. The purpose of his credit is for a used car, and the credit amount is 9398 DM. He has been living in his current residence for 4 years and has one existing credit at the bank. His installment rate is 1% of disposable income, and he has no other debtors/guarantors or other installment plans. He rents his housing, has a telephone registered under his name, and is a foreign worker. He is responsible for providing maintenance for one person.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a good credit history, and is looking to finance a new car. They are seeking a credit amount of 7763 DM with savings of less than 100 DM. They have been employed for at least 7 years and have a low installment rate on their disposable income. The individual is a 42-year-old single male with no other debtors or guarantors. They have been living at their current residence for 4 years and have unknown or no property. Their job falls under management or self-employment, and they have one existing credit at this bank. The individual has no phone, lives in free housing, and is a foreign worker.###\nHence this label was No."
"The individual is a 24-year-old single male with a stable job as a skilled employee/official, who has been at his current job for over 7 years. He has no other debtors or guarantors and has been living in his current residence for 4 years. He has a good credit history with no previous credits taken, and all credits paid back duly. \nHe has existing checking account balance less than 0 DM and savings less than 100 DM. His purpose for the credit is to purchase a used car. The individual has no other installment plans and his housing is for free. He has two existing credits at the bank and is responsible for providing maintenance for 2 people. The individual does not have a telephone but is a foreign worker. \nOverall, he seems financially stable with a steady income and good credit history, making him a potentially good credit risk.###\nHence this label was No."
"The individual has a checking account balance of less than 0 DM, with a credit history showing critical accounts or other existing credits. The purpose of the credit is for others. They have a moderate credit amount of 1164 DM and savings of less than 100 DM. The individual has been employed for at least 7 years and has a low installment rate. They are a 51-year-old single male, with no other debtors or guarantors. They have been living at their current residence for 4 years and have no property. The individual has a bank installment plan, lives in a free housing arrangement, and holds a management position. They have 2 existing credits at the bank and are liable for providing maintenance for 2 people. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account, a history of delayed payments, and has been employed for at least 7 years. They took out a small credit amount for a radio/television purchase. They have no savings account, no other debtors or guarantors, and no other installment plans. They live for free, have no property, and no telephone. As a single male, skilled employee, they have one existing credit at the bank and one person they are financially responsible for. At 36 years old, they are a foreign worker with good credit.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history of paying back existing credits on time. They are taking out a 15-month loan for a used car, with a credit amount of 4657. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. Their installment rate is 3% of disposable income. The individual is a 30-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. They have no other installment plans, own their home, and have 1 existing credit at the bank. The individual is a skilled employee/official, with 1 person relying on them for financial support. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM, has a credit history of repaying existing credits on time, and is looking to finance a radio/television purchase. They have savings of less than 100 DM and have been employed for less than a year. With a manageable installment rate of 4%, they are a divorced/separated male in their early thirties. There are no other debtors or guarantors involved. They have been residing in their own home for three years and have one existing credit at this bank. As a skilled employee/officer, they are responsible for one dependent and do not have any other installment plans. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old single male with no existing checking account but a savings account with at least 1000 DM. He has been employed for over 7 years as a skilled employee/official and has a stable income. He is looking to purchase a used car, and his credit history shows critical accounts/other credits existing. With a good credit amount of 3368, he has no other debtors or guarantors, and lives in a rented housing. He has been at his current residence for 4 years and has 2 existing credits at the bank. Additionally, he has no other installment plans, one person liable for maintenance, a registered telephone under his name, and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a credit history of always paying back existing credits on time, and is seeking a new car loan. They have savings of less than 100 DM and have been employed for less than a year. With an installment rate of 4%, they are female, divorced/separated/married, and own a house. They are 34 years old, have no other debtors or guarantors, and have been living at their current residence for 4 years. They have one existing credit at the bank, work as a skilled employee/official, and have one dependent. They do not have any other installment plans, and their telephone is registered under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and a critical credit history with other existing credits. They are seeking a used car loan for a duration of 48 months, with a credit amount of 11590 DM. Their savings fall within the range of 100 to 500 DM, and they have been employed for 1 to 4 years. They have a low installment rate and are female, divorced/separated/married. There are no other debtors/guarantors involved, and they have been residing in their current residence for 4 years. They own a car or another property not specified, are 24 years old, and have installment plans through a bank. They live in a rented house, have 2 existing credits at their bank, and work as an unskilled resident. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a stable financial status with existing checking account balance less than 0 DM and a moderate duration of 36 months for the credit. Their credit history shows a critical account with other existing credits. The purpose of the credit is for furniture/equipment. They have some savings below 100 DM and have been employed for 1 to less than 4 years. With a manageable installment rate and no other debtors/guarantors, they have been residing at their current place for 2 years. Their property includes a building society savings agreement/life insurance. At the age of 46, they have no other installment plans, own their housing, and have 2 existing credits at the bank. As a skilled employee/official, they have 1 person to provide maintenance for and a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 30-year-old divorced/separated/married female who has no checking account. She has been employed for less than a year as a skilled employee/official. She is looking to borrow a relatively small amount of credit to purchase a new car. She has a stable living situation in her own home, with no other outstanding debts apart from two existing credits at her bank. She does not have any other debtors or guarantors. The installment rate for her disposable income is 4%, and she has been residing at her current address for 1 year. She has no other installment plans, savings below 100 DM, and no telephone. She is a foreign worker and is responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has no checking account and a good credit history of repaying existing credits on time. They are seeking a loan for furniture/equipment, amounting to 2978 DM. They have savings between 500 and 1000 DM, and have been employed for 1 to 4 years. The installment rate is 1% of disposable income. The applicant is a single male, living in their own home with no other debtors or guarantors. They have been residing at their current residence for 2 years and are 32 years old. The individual has no other installment plans, one existing credit at the bank, and is a skilled employee. They are liable for providing maintenance to one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and has a good credit history with existing credits paid back on time. They are requesting a loan for furniture or equipment, with a credit amount of 2864. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have a low installment rate as a percentage of their disposable income. The individual is a 34-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 1 year, own real estate, and have no other installment plans. They have one existing credit at this bank and work as an unskilled resident. They are responsible for providing maintenance for 2 people. The individual does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of less than 0 DM and a credit history of always paying back existing credits on time. They are seeking a loan for a new car, with a credit amount of 3249. Their savings account has less than 100 DM, and they have been employed for 4 to 7 years. The installment rate is 2% of their disposable income. They are a 39-year-old single male with no other debtors or guarantors. They have been living at their current residence for 4 years and have unknown/no property. They have one existing credit at the bank and work in a management/self-employed/highly qualified position. They are liable to provide maintenance for 2 people and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 Deutsche Marks, has no previous credits, and pays back all credits on time. They are borrowing money to purchase a radio or television. The credit amount is 6199 DM, and they have savings of less than 100 DM. They have been employed for 1 to 4 years and their installment rate is 4% of disposable income. The individual is a 28-year-old single male, has no other debtors or guarantors, and has been residing at their current residence for 2 years. Their property includes a building society savings agreement or life insurance. They have no other installment plans, rent their housing, have 2 existing credits at the bank, and work as a skilled employee/official. They are responsible for one person's maintenance and have a registered telephone in their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no existing checking account and an unknown or nonexistent savings account. They have been employed for 4 to 7 years as a skilled employee/official. The credit history shows that existing credits have been paid back duly. The purpose of the credit is for furniture/equipment. They have no other debtors or guarantors. Their personal status is single and they are male. They reside in their own home and have been at their current residence for 2 years. The individual is 31 years old, with 1 existing credit at the bank. They have a telephone registered under their name and are a foreign worker. They have no other installment plans and one person they are liable to provide maintenance for.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 37, who has been employed for 4 to 7 years as a skilled employee/official. She has a checking account with less than 0 DM, savings of less than 100 DM, and owns a building society savings agreement/life insurance. She has no other debtors/guarantors, no other installment plans, and no telephone. She has been living in her own home for 3 years and has 2 existing credits at this bank. She is responsible for providing maintenance for 1 person and is not a foreign worker. She took a loan of 609 DM for a new car and has a duration of 6 months to repay it, with an installment rate of 4% of her disposable income.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM, has a credit history of paying back existing credits duly, and is seeking a loan for education purposes. They have a credit amount of 684 DM and savings of less than 100 DM. They have been employed for 1 to less than 4 years, with an installment rate of 4% of their disposable income. The individual is a 40-year-old single male, with no other debtors or guarantors, living in a rented house. They have one existing credit at the bank and work as an unskilled resident. They have been residing at their current residence for 4 years and have 2 people dependent on them for maintenance. They do not have any other installment plans, own a car or other property, and are a foreign worker. They do not have a telephone.###\nHence this label was No."
"This individual is a single male, aged 34 years old, who has been employed for 1 to 4 years as a skilled employee/official with a stable income. He has a good credit history, with all previous credits at the bank paid back duly. He has 1 existing credit at the bank and no other debtors or guarantors. His housing status is owned, and he has been living at his current residence for 2 years. He has a savings account/bonds with a balance of at least 1000 DM. His current checking account balance is between 0 and 200 DM. He is looking to purchase furniture/equipment with a credit amount of 3496 DM. His installment rate is 4% of disposable income, and he has another installment plan with stores. He has 2 people he is liable to provide maintenance for, and he has a registered telephone in his name. Additionally, he is a foreign worker.###\nHence this label was Yes."
"The individual is unemployed, single male, age 68, with a 16-month credit history of critical accounts. He is looking to finance a new car for 1175 DM. He has no existing checking account, less than 100 DM in savings, and no other debts or guarantors. He has been living in his current residence for 3 years and has 3 existing credits at the bank. He has an installment rate of 2% and no other installment plans. He lives in a free housing arrangement and has a telephone registered in his name. He is a foreign worker with no one else relying on him for maintenance.###\nHence this label was Yes."
"This individual has a checking account with balance less than 0 DM. They have a good credit history with critical accounts or other credits existing elsewhere. The purpose of the credit is for a new car. The credit amount is 1602 DM. They have savings of less than 100 DM. They have been employed for at least 7 years. Their installment rate is 4% of their disposable income. The individual is a married/widowed male. They have no other debtors or guarantors. They have been residing at their current residence for 3 years and own their home. They are 30 years old and have no other installment plans. They have 2 existing credits at this bank. They are a skilled employee/official. They are responsible for providing maintenance for 1 person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history with existing credits paid back duly. They are looking to finance a radio/television purchase with a credit amount of 2141. They have savings between 100 and 500 DM and have been employed for 4 to 7 years. With a low installment rate, they are a single male with no other debtors or guarantors. They have been living in their own residence for 1 year, have unknown or no property, and are aged 35. They have no other installment plans, one existing credit at the bank, and are a skilled employee. They are liable to provide maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a credit history with critical accounts or other existing credits, and is looking to purchase a used car. They are borrowing a credit amount of 6187, with savings between 100 and 500 DM. They have been employed for 4 to 7 years and have a low installment rate. The individual is a married/widowed male, with no other debtors or guarantors. They have been residing at their current residence for 4 years and own a car or other property not specified. This person is 24 years old with no other installment plans, lives in a rented housing, has 2 existing credits at the bank, and is a skilled employee/official. They are liable for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown or nonexistent savings account. They have been employed for 4 to 7 years as a skilled employee/official. They have no other debtors or guarantors and live in their own residence. The purpose of their credit is for a radio/television, with a credit amount of 10222 and an installment rate of 4%. They are a 37-year-old single male, with no other installment plans and one existing credit at the bank. They have been residing at their current residence for 3 years and have one person dependent on them for maintenance. They own a car or other property and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 60-year-old unemployed divorced/separated male with good credit history. He took a loan of 6468 DM for a used car, with no savings account. He owns real estate, has one existing credit at the bank, and no other debts or guarantors. He has been living at his current residence for 4 years and has a telephone registered under his name. His job is in management/self-employment/highly qualified employee/officer. He is responsible for providing maintenance for one person and is a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female, aged 38, with no checking account. She has been in her current employment for less than a year and has been living in her current residence for 3 years. She has one existing credit at the bank and her credit history shows that she has paid back existing credits duly till now. The purpose of her credit is for radio/television. She has a savings account with less than 100 DM and an installment rate of 4% of disposable income. She has no other debtors or guarantors, and owns her own home. Her property is a car or other, not specified in the attributes. She has another installment plan at stores. She is a skilled employee/official with a registered telephone under her name. She is liable to provide maintenance for one person and is a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a credit history of a critical account/other credits existing. They took a loan for a radio/television for 15 months with a credit amount of 1360. Their savings account/bonds contain less than 100 DM. Presently employed for 1 to less than 4 years, their installment rate is 4% of disposable income. They are a single male, with no other debtors or guarantors being liable. Living in their own house for 2 years, their property includes building society savings agreement/life insurance. A skilled employee/official, aged 31, with no other installment plans, they have 2 existing credits at the bank. They have 1 dependent and do not have a telephone, but are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 38, working as a skilled employee with less than 1 year of employment at their current job. They have a status of existing checking account between 0 and 200 DM, and a savings account/bonds between 100 and 500 DM. The person has no other debtors/guarantors, owns their own housing, and has no telephone. They have 2 existing credits at a bank, have been living at their current residence for 4 years, and have no property under their name. Their credit history shows critical account/other credits existing elsewhere, and their purpose for taking credit is radio/television. They have a credit amount of 1216, an installment rate of 4, and another installment plan with a bank. They are liable to provide maintenance for 2 people and are a foreign worker.###\nHence this label was No."
"This individual is a single male in their late 20s with a stable job in management. They have a good credit history with no existing debtors or guarantors. They have been living in their own residence for 2 years and have one existing credit at the bank. Their current financial situation is relatively stable with a small credit amount, low installment rate, and some savings. They do not have any other installment plans or dependents. Despite not having a telephone, they are a foreign worker.###\nHence this label was Yes."
"The individual is a divorced/separated/married female, aged 30, with existing credits paid back duly till now. She has a good credit history and has been employed for 1 to 4 years as a skilled employee/official. She has a savings account with less than 100 DM, no other installment plans, and owns a house. She has one co-applicant and is liable for one dependent. She has been residing at her current location for 3 years. The purpose of the credit is furniture/equipment, with a credit amount of 1620. She has no telephone and is a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history with existing credits paid back duly. They have a stable income, as they have been employed for at least 7 years. The purpose of their credit is for a new car, with a significant amount of 14318 DM. They have some savings and currently do not own any property. At 57 years old, they are a single male in a management position. They have no other debtors or guarantors and are living in a free housing situation. Additionally, they have one existing credit at the bank and are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"The individual is a single male, aged 37, with no existing checking account. They have been employed for 4 to 7 years in a management or self-employed position. They have one existing credit at the bank and own their own home. The purpose of the credit is for a radio/television, with a credit amount of 12749. They have savings between 500 and 1000 DM, and have no other installment plans or debtors/guarantors. They have been residing at their current residence for 1 year and have a telephone registered under their name. They have no other people dependent on them for maintenance and are a foreign worker. In the past, they have experienced delays in paying off credits.###\nHence this label was Yes."
"The individual in this dataset is a 23-year-old divorced/separated/married female, who has no checking account and has been in her current employment for less than a year. She is renting a house and has been living at the current residence for 3 years. She has no other debtors/guarantors, no other installment plans, and no telephone. She has existing credits paid back duly till now and has a good credit history. The purpose of the credit is for furniture/equipment, and the credit amount is 601 DM. She has savings of less than 100 DM and real estate property. She has an installment rate of 1% of disposable income and one existing credit at the bank. She is an unskilled resident with two people liable to provide maintenance for. Additionally, she is a foreign worker with no other significant financial obligations.###\nHence this label was Yes."
"This individual has a stable financial status with a moderate duration of credit history. They are seeking a loan for furniture/equipment and have a medium-sized credit amount. They have significant savings, a steady employment history, and a low installment rate. The individual is a single male with no other debtors or guarantors, owning their own home. They have a moderate number of existing credits, a skilled job, and one dependent. The individual has a telephone and is a foreign worker.###\nHence this label was Yes."
"The individual is a single male, aged 24, with a stable job as an unskilled resident. He has been living in his own property for 3 years. His existing checking account balance is less than 0 DM, and he has a credit history of repaying existing credits on time. He is looking to borrow money for a radio/television, with a credit amount of 2214. He has savings of less than 100 DM and has been employed for 1 to 4 years. His disposable income installment rate is 4, and he has no other debtors or guarantors. He has no other installment plans or telephone. He has one existing credit at the bank and is the sole provider for one person. He also has a building society savings agreement/life insurance and is a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old single male with a steady job as a skilled employee/official. He has been living in his own real estate property for 4 years. His existing checking account balance is less than 0 DM, and he has a savings account with a balance between 500 and 1000 DM. He has paid back all credits at his bank duly and has one other credit at the bank. He is looking to finance furniture/equipment with a credit amount of 2828. His monthly installment rate is 4% of his disposable income. He has no other debtors/guarantors and no other installment plans, only stores. He has a registered telephone under his name and is a foreign worker. He is the sole provider for one person.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 34, working as a skilled employee/official. She has no existing checking account and has been residing in her own home for the past 3 years. She has one existing credit at the bank, and no other debtors or guarantors. Her credit history shows that she has paid back her existing credits duly so far. The purpose of her current credit application is for a radio/television, with a credit amount of 1493. She has savings of less than 100 DM and has been employed for less than a year. Her installment rate is 4% of disposable income, and she has no other installment plans. She is responsible for providing maintenance for two people and is a foreign worker with no telephone.###\nHence this label was Yes."
"The individual in this dataset is a 37-year-old divorced/separated/married female who has no checking account. She has been at her current job for 4 to 7 years and owns a property. She is looking to borrow a small amount of credit to purchase a new car. She has a stable financial situation with savings of less than 100 DM and no other debts or installment plans. She has been living at her current residence for 1 year and has one existing credit at the bank. She is a skilled employee/official with two people dependent on her for maintenance. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual is a 75-year-old unemployed female who is divorced/separated/married. She has a checking account with less than 0 DM, no savings account, and one existing credit at the bank. She has paid back all existing credits duly till now. The purpose of her credit is for a new car. She has a building society savings agreement/life insurance as property and owns her own house. She has no other debtors/guarantors, other installment plans, or people to provide maintenance for. She has been residing at her current residence for 3 months. Her job is in management/self-employment/highly qualified employee/office role. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"The individual in this data is a 59-year-old single male with a stable employment history of 4 to 7 years. He has a good credit history, currently has savings of less than 100 DM, and owns real estate where he has been residing for 4 years. He is a skilled employee with no other debts or dependents. His credit amount is 1364 for the purpose of radio/television, and he has one existing credit at the bank. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with existing checking account balance between 0 and 200 DM. They have a 4-year employment history, own a business, and have no savings. The credit amount is 2825 DM with a 24-month duration. This person is a 34-year-old single male, living in their own home for 3 years. They have no other debts, no other installment plans, and no property. They are a skilled employee with 2 existing credits at the bank and two dependents. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history, with existing credits paid back on time. They are looking to finance a radio/television, with a credit amount of 3979 DM. They have an unknown or no savings account, but a stable job held for 4 to 7 years. Their personal status is a single male, with no other debtors or guarantors. They have been living in their current residence for 1 year, own a car or other property, and are 41 years old. This person has no other installment plans, owns their own home, and has two existing credits at their bank. They work as a skilled employee or official, are responsible for providing maintenance for two individuals, and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced, separated, or married. She has been at her current job for 1 to 4 years and has no other debtors or guarantors. She lives in a rented housing with one dependent. She has no savings account and does not have a telephone. She has one existing credit at the bank and has paid back previous credits duly. She is a skilled employee or official, and despite having no savings, she is a foreign worker.###\nHence this label was No."
"The individual in this example has a stable financial status with savings and a good credit history. They took a small loan for a short period to purchase a radio or television. They are a divorced, separated, or married female, with a guarantor for other debts. They have been living in their own real estate property for a few years, are a skilled employee, and have no other installment plans. With only one existing credit at the bank and no dependents, they seem financially responsible.###\nHence this label was Yes."
"The individual has a checking account balance of at least 200 DM and has a credit history of paying back existing credits on time. They are borrowing money for a radio/television purpose, with a credit amount of 4210. Their savings account holds less than 100 DM and they have been employed for 1-4 years. The installment rate is 4% of their disposable income. They are a single male, with no other debtors or guarantors. They have been living at their current residence for 2 years and own a car or other property. At 26 years old, they have no other installment plans and own their housing. They have one existing credit at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person, do not have a telephone, and are a foreign worker.###\nHence this label was No."
"The individual has no checking account and has been repaying existing credits on time. They took a 12-month loan of 2445 for a used car, with an installment rate of 2%. They do not have a savings account and have been employed for less than a year. The individual is a 26-year-old married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own a car or other property. They have no other installment plans, rent their housing, and have a skilled job. They are responsible for one person's maintenance and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account. They have a good credit history with critical accounts or other credits. The purpose of their loan is to purchase a radio or television. They are borrowing a significant amount of money. They have some savings but not a large amount. This person has been employed for 4-7 years. They have a low installment rate in relation to their disposable income. The individual is a single male. They have a guarantor for their debts. They have been living in their current residence for 2 years and own real estate. At 25 years old, they have no other installment plans and no dependents. They have a stable job as a skilled employee or official. They do not have a telephone. They are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history with other existing credits. The purpose of the credit is for a radio/television. They are financially stable with savings greater than or equal to 1000 DM and have been employed for over 7 years. The credit amount is relatively low at 1582, with a manageable installment rate. The individual is a 46-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own a car or other property. With a stable job as a skilled employee, they have 2 existing credits and are liable for one person's maintenance. They do not have any other installment plans, own their own home, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has been unemployed for an unspecified period. They have a good credit history with existing credits paid back duly till now. The purpose of the credit is listed as \"others\". They have savings of less than 100 DM and own a car or other property. The credit amount is 15857 and they have been living at their present residence for 3 years. The individual is a 43-year-old divorced/separated male with one co-applicant. They have no other installment plans and own their own house. Their job is in management/self-employment/highly qualified employee/officer category. They have one existing credit at this bank and one person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a current checking account with less than 0 DM, has had the account for over 7 years, and has a stable job as a skilled employee. They have no other debts or guarantors, own their own house, and have been living at their current residence for 4 years. They are a 39-year-old divorced, separated, or married female who is financially responsible, with two existing credits at the bank. They are looking to purchase a new car with a credit amount of 860 DM and have a savings account with less than 100 DM. They have no other installment plans, one dependent, and a registered telephone under their name. Additionally, they are a foreign worker with good credit history and no known property.###\nHence this label was Yes."
"This individual is a 43-year-old single male, working as a skilled employee or official for at least 7 years. He has no savings account but owns a car. He has a good credit history with a delay in paying off in the past. His credit request for a new car is 2899 DM and he has been living in his current residence for 4 years. He has one existing credit at this bank and two people are liable to provide maintenance for. He does not have any other debtors or guarantors, installment plans, or a telephone. He is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM balance. They have a credit history of a critical account or other existing credits. The purpose of the credit is for education. The credit amount is 5998. They have savings of less than 100 DM. They have been employed for 1 to less than 4 years. The installment rate is 4% of disposable income. The individual is a single male. They have no other debtors or guarantors. They have been living in their current residence for 3 years. Their property status is unknown with no property owned. The individual is 27 years old. They have another installment plan with a bank. They own their own housing. They have 1 existing credit at this bank. Their job is a skilled employee or official. They have 1 person liable for maintenance. They have a telephone registered under their name. They are a foreign worker.###\nHence this label was No."
"This individual is a married/widowed 40-year-old male who is currently unemployed. They have been living in their own residence for 3 years and have 3 existing credits at the bank. The purpose of their credit is for business, with a credit amount of 3590 DM. They have a savings account with less than 100 DM and no other installment plans or debtors/guarantors. Their job status is unemployed/unskilled, and they are responsible for providing maintenance for 2 people. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of critical account/other credits existing. They are taking a 24-month loan to buy a new car, with a credit amount of 2463. Their savings range from 100 to less than 500 DM and they have been employed for 4 to less than 7 years. They have no other installment plans and own their own home. The individual is a 27-year-old married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 3 years and have a building society savings agreement/life insurance. They have a skilled job, with 2 existing credits at the bank, and one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account and has been employed for at least 7 years. They are looking to finance a new car, with a credit amount of 1255. Their savings account holds less than 100 DM. They have no other ongoing debts or guarantors. The individual is a 61-year-old single male, residing in their own real estate property for the past 4 years. They have 2 existing credits at the bank and work as an unskilled resident. They are responsible for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a status of existing checking account with a balance between 0 and 200 DM. They have had delays in paying off credit in the past. The purpose of the credit is for education. They are borrowing a credit amount of 11,760 DM. They have savings between 100 and 500 DM. Their current employment has been for 4 to 7 years. The installment rate is 2% of their disposable income. The individual is a single male. They have no other debtors or guarantors. They have been living at their current residence for 3 years. Their property status is unknown with no other properties. The individual is 32 years old and has no other installment plans. They reside in a rented house. They have one existing credit at the bank and are a skilled employee. They are liable to provide maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a 12-month loan for a used car, with a credit amount of 1413. They have savings of at least 1000 DM and have been employed for 4 to 7 years. The installment rate is 3% of disposable income. The individual is a 55-year-old single male, with no other debtors or guarantors. They have been residing in their own home for 2 years and have a building society savings agreement/life insurance. They have no other installment plans, one existing credit at the bank, and are a skilled employee/official. They are responsible for providing maintenance for one person, do not have a telephone, and are not a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female in her mid-thirties with a stable job as a management/self-employed/highly qualified employee/officer. She has been living in her own home for the past three years and has a solid credit history with no other debts or guarantors. Her existing checking account balance is between 0 and 200 DM, with some savings below 100 DM. She is taking out a loan for education purposes, with a credit amount of 1501 DM and a relatively short duration of 9 months. She has a good financial track record, evident from her installment rate and the number of existing credits at the bank. Additionally, she has a telephone registered under her name and is a foreign worker.###\nHence this label was No."
"The individual is a 56-year-old divorced/separated/married female, working as a skilled employee/official, with no existing checking account. She has been living in her own home for the past 2 years. Her credit history shows that she has paid back existing credits duly till now. The purpose of her credit is for education, and the amount is 1538 DM. She has savings of less than 100 DM, and has no other debts or guarantors. With an installment rate of 1%, she has no other installment plans. She has one existing credit at this bank, and is the sole provider of maintenance for one person. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a loan for a radio/television, with a credit amount of 2108. Their savings are below 100 DM and they have been employed for 4 to 7 years. They have a low installment rate as a percentage of their disposable income. The person is a married or widowed male, living in a rented house and has been residing at their current residence for 2 years. They have no other debtors or guarantors and own real estate. The individual is a skilled employee or official, aged 29, with no other installment plans or telephone. They have one existing credit at the bank and are liable for one person's maintenance. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has a good credit history, with existing credits paid back on time. They are looking to finance a new car with a credit amount of 7393. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a low installment rate relative to their disposable income. The individual is a 43-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and own their own home. They have one existing credit at the bank and work as an unskilled resident. They are responsible for providing maintenance for two people and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with a moderate amount in their checking account. They have a good credit history and have been diligent in repaying existing credits. The purpose of their loan is for purchasing a radio/television. They have a modest credit amount and some savings. They have been employed in their current position for a long time. Their disposable income allows for a manageable installment rate. The individual is a married/widowed male with a guarantor for debts. They have been residing in their current location for a few years and own real estate. At 40 years old, they have a bank installment plan and own their housing. They have two existing credits at their bank and work as an unskilled resident. They are responsible for supporting one other person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual in the data is a 30-year-old divorced/separated/married female, who has been in her current employment for less than a year. She has a checking account with less than 0 DM, no savings account, and owns a house. She has one existing credit at the bank and has been residing at her current residence for 2 years. She is a skilled employee/official with an installment rate of 1% of disposable income. The purpose of the credit is for furniture/equipment, with a credit amount of 7721. She has no other debtors/guarantors, installment plans, or foreign worker status. She is registered to a telephone under her name and is liable to provide maintenance for one person. Her credit history shows existing credits paid back duly till now.###\nHence this label was Yes."
"This individual has a good credit history with a delayed payment in the past. They have a stable income with a long employment history of at least 7 years. The purpose of their loan is for a used car. They have some savings and own a property. They are single male in their 30s, with no other debtors or guarantors. They have no other installment plans and live in their own home. They have a management or highly qualified job and are responsible for one other person's maintenance. They have two existing credits at the bank and are reachable by telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 34-year-old divorced/separated/married female, working in an unskilled-resident job for the past 4 to 7 years. She has no current telephone connection and owns no property. She has been living for 4 years in a residence she lives in for free. She has a single existing credit at the bank and has no other debtors or guarantors. She has no savings but has 0 to 200 DM in her checking account. She is repaying all credits at the bank duly. The credit she is applying for is for education and amounts to 1837 DM. The installment rate is 4% of her disposable income. She has one person she is liable to provide maintenance for and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a stable employment history of at least 7 years. They are looking to finance a radio/television purchase with a credit amount of 1829. Their savings are below 100 DM. They are a single male, 46 years old, with no other debtors or guarantors. They own their own home and have been residing there for 4 years. They have 2 existing credits at the bank, a skilled job, and 1 person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in the dataset is a 25-year-old single male, working as a skilled employee/official for 1-4 years. He has a good credit history with no previous credits taken, and all credits were paid back duly. His existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. His credit amount is 14421 DM, and he is taking the loan for business purposes. He has no other debtors/guarantors, no other installment plans, and owns his own house. He has been living at his current residence for 2 years and has a telephone registered under his name. Additionally, he has one existing credit at the bank and is liable to provide maintenance for one person. He does not have any other significant assets like a car. Finally, he is a foreign worker with a positive credit rating.###\nHence this label was No."
"This individual has no existing checking account and has a good credit history of paying back credits on time. They took a loan of 3577 DM for a new car and have savings between 100 and 500 DM. They have been employed for 1 to 4 years and have a low installment rate. The person is a 26-year-old single male, with a guarantor as a debtor. They have been living in their current residence for 2 years and own real estate. They have no other installment plans, rent their housing, and have a skilled job. The individual is responsible for providing maintenance for 2 people. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been employed for over 7 years. They took a loan for a radio/television, amounting to 522 DM, with a credit duration of 12 months. They have savings between 500 and 1000 DM and a stable residence for 4 years. The person is a 42-year-old single male, owning a house, with no other debts or installment plans. They have two existing credits at this bank and work as a skilled employee/official. They are responsible for two people and have a telephone registered in their name. Additionally, they have a building society savings agreement/life insurance and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 37-year-old divorced/separated male who has been employed for less than a year. He is looking to take out a loan for a new car, with a credit amount of 3878 DM. He has a savings account with a balance between 100 and 500 DM and owns his own house. He has one existing credit at the bank and one person for whom he is liable to provide maintenance. He has a telephone registered under his name and is a skilled employee/official. Overall, he appears to be a relatively low credit risk based on the provided attributes.###\nHence this label was Yes."
"This individual has a status of existing checking account with less than 0 DM. They have a good credit history, with all credits at this bank paid back duly. The purpose of the credit is for furniture/equipment. The credit amount is 3552. They have savings account/bonds of less than 100 DM.\nThey have been employed for 4 to less than 7 years. The installment rate in percentage of disposable income is 3. Personal status is male and single. There are no other debtors / guarantors. They have been residing at their current residence for 4 years. Their property includes a car or other items not specified. \nThe individual is 27 years old, with a job as a skilled employee / official. They have one existing credit at this bank and are liable to provide maintenance for one person. They have other installment plans with a bank. They own their housing and do not have a telephone. The individual is a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old single male, currently unemployed and has been living in his own home for 2 years. He has one existing credit at the bank and no savings account. His existing checking account balance is between 0 and 200 DM. The purpose of his credit is for a new car, with a total amount of 14555 DM to be repaid over 6 months. He has no other debtors or guarantors. He has no other installment plans and has an installment rate of 1% of his disposable income. His property is a building society savings agreement/life insurance. He is an unemployed/unskilled non-resident, with one person being liable to provide maintenance for. He has a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"This individual, a 67-year-old divorced or separated or married female, has a good credit history, currently has between 0 and 200 DM in their checking account, and has a credit amount of 1199 DM for education. They have savings of less than 100 DM and have been employed for 4 to 7 years. They have no other debtors or guarantors, own their own home, and have a building society savings agreement or life insurance. They have been living at their current residence for 4 years, have 2 existing credits at the bank, and work in a managerial, self-employed, or highly qualified position. They are responsible for providing maintenance for one person and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a stable credit history of paying back existing credits on time. They are looking to finance a new car with a credit amount of 640. Their savings are below 100 DM and they have been employed for 1 to 4 years. With an installment rate of 4% of disposable income, they are a divorced/separated male, with no other debtors or guarantors. They have been living in their own real estate for 2 years and are 49 years old. They have no other installment plans, one existing credit at this bank, and work as an unskilled resident. They have one dependent and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and is currently unemployed. They have a good credit history with existing credits paid back on time. The purpose of the credit is for retraining. They do not have any savings and own their own home. With a credit amount of 1238, they have a manageable installment rate of 4% of disposable income. Being single and male, aged 36, they have no other debtors or guarantors. Their property includes a building society savings agreement or life insurance. They have one existing credit at the bank and work in a high-level job. They have been living at their current residence for 4 years and have 2 people dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and is unemployed. They have existing credits paid back duly, own real estate, and have a car (new) as their purpose for credit. They have a low credit amount, a small savings account, and are a divorced/separated/married female. They have no other debtors or guarantors, no other installment plans, and one existing credit at the bank. They have been living in their current residence for 4 years, are 54 years old, and have one person they provide maintenance for. They have a low installment rate, are unemployed/unskilled, and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a credit history of paying back existing credits on time, and needs a loan for repairs. They have savings of less than 100 DM and have been employed for less than 1 year. With an installment rate of 1%, they are a divorced/separated male with no other debtors or guarantors. They own their own home, have one existing credit at the bank, and work as an unskilled resident. At 34 years old, they have been living in their current residence for 1 year and have no other installment plans. They have a telephone registered under their name, one dependent, and are a foreign worker.###\nHence this label was No."
"The individual in this data is a 41-year-old single male who has been employed for over 7 years in a skilled position. He has a good credit history with a slight delay in payments in the past, and currently has a moderate amount of savings. His purpose for seeking credit is for business-related activities, and he owns his own home. He has two existing credits at the bank and has no other debtors or guarantors. He has no telephone. Overall, he is considered a moderate credit risk.###\nHence this label was Yes."
"This individual has no checking account and unknown savings, with a steady employment history of 1 to 4 years. They have paid back existing credits on time, and are seeking a loan for a radio/television. The credit amount requested is 2279, with an installment rate of 4% of disposable income. A male, single, skilled employee at least 37 years old, residing in a free housing for 4 years. They have no other debtors or guarantors, installment plans, or property. Additionally, they have one existing credit at the bank, with one person dependent on them for maintenance. The individual has a telephone and is a registered foreign worker.###\nHence this label was Yes."
"This individual is a single male skilled employee, aged 30, with a stable job and a good credit history. He has a checking account balance between 0 and 200 DM, a credit amount of 2002 DM, and savings of less than 100 DM. He has been employed for 4 to 7 years, has no other debtors/guarantors, and lives in a rental property. He has one existing credit, pays a 3% installment rate, and has no other installment plans. He has been at his current residence for 4 years and has two dependents. He also has a telephone and is a registered foreign worker.###\nHence this label was Yes."
"This individual is a 20-year-old single male with existing credits paid back duly till now. He has a checking account with less than 0 DM, savings of less than 100 DM, and has been employed for 1 to less than 4 years. His credit amount is 1107, and he is looking to use it for a radio/television purchase. He has no other debtors or guarantors, and none of installment plans. He lives in a rented house with 2 people providing maintenance. He owns real estate and has a telephone registered under his name. He has a management job and is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM. They have a good credit history, with existing credits paid back on time. The purpose of their loan is for a radio/television. They are borrowing 745 DM. Their savings are less than 100 DM. They have been employed for 1 to less than 4 years. Their monthly installment rate is 3% of their disposable income. They are a divorced, separated, or married female. They have no other debtors or guarantors. They have been residing at their current address for 2 years. They own real estate. They are 28 years old with no other installment plans. They own their housing and have 1 existing credit at this bank. They have an unskilled-resident job. They are responsible for providing maintenance for 1 person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 23-year-old divorced/separated/married female, who has been employed for less than a year. She has a checking account balance of less than 0 DM and a credit history of paying back existing credits on time. She is looking to take out a small car loan of 976 DM for a new car. She has savings of less than 100 DM and no other debts or guarantors. She currently owns her own house and has been living at the same residence for 2 years. She has one existing credit at the bank and works as an unskilled resident. She is responsible for providing maintenance for one person and does not have a telephone. She is a foreign worker.###\nHence this label was No."
"This individual is a 68-year-old single male, with a stable job in management/self-employment/highly qualified employee/officer, who has been at the same place of employment for at least 7 years. He has good credit history with existing credits paid back duly. He has a savings account with less than 100 DM, and his existing checking account balance is less than 0 DM. \nHe is looking to finance a new car and has no other debtors/guarantors. He has one existing credit with the bank and lives in his own house. He has been residing at his current residence for 4 years. \nHis credit amount is 14896 DM and he has no other property. He has a low installment rate in percentage of disposable income and a bank installment plan. He is the sole provider for one person. \nHe owns a telephone registered under his name and is a foreign worker. Overall, he appears to be a good credit risk.###\nHence this label was No."
"This individual is a 27-year-old married/widowed male with a stable job as a skilled employee/official. He has been living in his own home for 2 years and has no savings account. He has one existing credit at the bank and has been paying back his credits promptly. His existing checking account balance is between 0 and 200 DM. He is looking for a loan to fund his education, with a credit amount of 3711 DM. He has no other debtors or guarantors and no other installment plans. He has no telephone and is a foreign worker.###\nHence this label was Yes."
"This individual has a current checking account with a balance between 0 and 200 DM. They have a credit history of delayed payments in the past and are looking to use a loan to purchase a radio/television. The credit amount requested is 6403 DM. They have savings of less than 100 DM and have been employed for less than a year. Their disposable income installment rate is 1% and they are a single male. They have no other debtors/guarantors and have been living at their current residence for 2 years. They own a car or other property, are 33 years old, and have no other installment plans. They live in their own house, have one existing credit at the bank, and work as a skilled employee/official. They have one dependent and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has had existing credits paid back on time. They are looking to finance a radio/television purchase with a credit amount of 1262. Their savings are below 100 DM and they have been employed for 1 to 4 years. They have no other installment plans and own their own home. The individual is a 25-year-old single male with no other debtors or guarantors. They have 1 existing credit at the bank and work as a skilled employee/official. They have been residing at their current residence for 2 years and have no telephone. Additionally, they are a foreign worker and are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM and a good credit history. They are looking to purchase domestic appliances with a credit amount of 3051. They have savings of less than 100 DM and have been employed for 1 to 4 years. With a 3% installment rate, they are a single male with no other debtors or guarantors. They have lived in their current residence for 4 years and own a car or other property. At 54 years old, they have no other installment plans, own their housing, and have one existing credit at the bank. This individual is a skilled employee/official with one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of less than 0 DM and a credit history of consistently paying back loans. They are taking a 24-month loan to buy a new car, with a credit amount of 4817. Their savings are less than 100 DM, and they have been employed for 4 to 7 years. The installment rate is 2% of their disposable income. The individual is a 31-year-old single male, with a co-applicant as a debtor. They have been living in their current residence for 3 years and have a building society savings agreement/life insurance. They have no other installment plans, own their own home, and have one existing credit at a bank. The individual is a skilled employee/official, with one person dependent on them for maintenance. They have a registered telephone under their name and are a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a good credit history, and has been repaying existing credits on time. They are taking a loan for furniture/equipment worth 3345 DM and have savings of less than 100 DM. They have been employed for at least 7 years, with a low installment rate of 4%. The person is a 39-year-old single male in a management position, living in a rented house for 2 years. They have no other debts or installment plans, one existing credit at the bank, and one dependent. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"The individual is a 22-year-old divorced/separated/married female, working as a skilled employee/official. She has been living in rented accommodation for 4 years and has been at her current job for less than a year. She has a good credit history, with existing credits paid back duly, and has no other debtors or guarantors. She has no other installment plans and no telephone. She has a savings account with less than 100 DM and maintains a checking account with less than 0 DM. She is seeking a loan for furniture/equipment, with a credit amount of 3650 and an installment rate of 1% of disposable income. She has one existing credit at the bank and is the sole provider for one person. She is a foreign worker and does not have a telephone.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has had it for less than 1 year. They have a critical credit history with other existing credits, and their purpose for the credit is a new car. The credit amount is 2241 DM, and their savings are less than 100 DM. They have been living in their current residence for 3 years and own real estate. The individual is a 48-year-old single male with no other debtors or guarantors. They have a low installment rate and no other installment plans, but they do have two existing credits at this bank. The individual has an unskilled job, rents their housing, and has two people liable for maintenance. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a history of delayed payments. They are taking a business loan for an amount of 9572 credits, with savings of less than 100 DM. Currently employed for less than a year, they have a low installment rate on disposable income. The person is a 28-year-old divorced or separated male with no other debtors or guarantors. They have been living in their own property for the past year and have two existing credits at the bank. Their job is a skilled employee or official, and they are responsible for providing maintenance for one person. They do not have any other installment plans and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has less than 0 DM in their checking account and has a good credit history with no previous credits outstanding. They are looking to purchase furniture or equipment with a credit amount of 4583. Their savings account holds less than 100 DM. They have been employed for 1 to 4 years and have a low installment rate of 2% of disposable income. The person is a divorced/separated male with a guarantor for other debts. They have lived at their current residence for 2 years and own real estate. At 32 years old, they have no other installment plans, own their housing, and have 2 existing credits at the bank. Their job is a skilled employee/official, with one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has been employed for at least 7 years. They have a critical credit history with other existing credits, and their purpose for taking credit is for a radio/television. The credit amount is 1655, and their savings are less than 100 DM. They have been residing in their current home for 4 years and own the property. With an age of 63, they are a single male with no other debtors or guarantors. They have no other installment plans and work as an unskilled resident. The individual has 2 existing credits at this bank and is responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their checking account. They have a history of paying back credits on time. The purpose of their loan is to purchase a new car. They are borrowing a substantial amount of money. They have a decent amount of savings. They have been employed for 4-7 years. Their disposable income installment rate is at 4%. The individual is a single male. They have no other debtors or guarantors. They have been living at their current residence for 2 years. They have unknown or no property. The individual is 27 years old with no other installment plans. They own their own home. They have one existing credit at the bank. Their job is in management, self-employed, or a highly qualified employee/ officer. They have one person dependent on them. They have a telephone registered under their name and they are a foreign worker.###\nHence this label was No."
"This individual has no existing checking account and an unknown savings account. They have been repaying their existing credits on time. The purpose for the credit is for business. They have been employed for 1 to 4 years as a skilled employee/official. Their personal status is male and divorced/separated. They have no other debtors or guarantors. They live in real estate that they own, with a 2-year residence. They have one existing credit at the bank and no telephone. They are a foreign worker and have one dependent.###\nHence this label was No."
"The individual in this example has a stable financial status with a moderate duration of credit history and a small credit amount for business purposes. They have a decent amount saved up and have been employed in the same job for over 7 years. Their personal status is married or widowed, with no other debtors or guarantors. They own real estate and have a good credit score based on their history of paying back credits. They are a skilled employee, aged 35, with no other installment plans or existing credits at this bank. They have one dependent, own their own home, and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of a critical account/other credits existing. They took a loan for a radio/television, amounting to 1898. They have no savings account and have been employed for 1 to less than 4 years. The installment rate for the loan is 1% of their disposable income. This person is a single, 34-year-old male with no other debtors or guarantors.\nThey have been residing in their own real estate for 2 years and have no other installment plans. The individual works as an unskilled resident and is responsible for two people. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with a moderate amount of money in their existing checking account. They have a good credit history with other credit accounts outside of this bank. The credit is intended for purchasing a radio or television. The individual's savings account status is not known. They have been employed for 4 to 7 years and have a low installment rate on their disposable income. The individual is a single male with a guarantor for other debts. They have been living in their current residence for 2 years and own real estate. At 35 years old, they have a bank installment plan and work as a skilled employee or official. They have 3 existing credits at this bank and one person they provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old female who is divorced, separated, or married. She has no existing checking account but has a credit history of a critical account/other credits existing. The purpose of the credit is for furniture/equipment, amounting to 2288. She has savings of less than 100 DM and has been employed for less than 1 year. Her installment rate is 4% of disposable income. She has no other debtors/guarantors and has been living in her current residence for 4 years. Her property includes a building society savings agreement/life insurance, and she owns her own home. She has one existing credit at this bank and is a skilled employee/official. She is liable to provide maintenance for one person and has a telephone registered under her name. Additionally, she is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings, with existing credits paid back duly. They are looking to finance a used car, with a credit amount of 3378 over 18 months. They have been employed for 1 to 4 years as a single male, aged 31, with no other debtors or guarantors. They reside in their own home, have one existing credit, and work as a skilled employee or official. Additionally, they have one person relying on them for support, a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has had their current employment for at least 7 years. They are looking to finance a new car, with a credit amount of 1495. Their savings are less than 100 DM and they have no other installment plans. They live in their own home, which is real estate, and have been at their current residence for 1 year. Additionally, they are a single male aged 38, working as an unskilled resident. They have 2 existing credits at this bank and are responsible for providing maintenance for 2 people. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has a credit history of paying back existing credits duly. They are taking a loan for the purpose of purchasing a radio/television. The credit amount is 1053 with savings less than 100 DM. They have been employed for less than 1 year and have an installment rate of 4% of disposable income. The individual is a married/widowed male, has no other debtors/guarantors, and has been living at their current residence for 2 years. They own real estate, are 27 years old, and have no other installment plans. The individual is a skilled employee/official with 1 existing credit at the bank. They are liable for providing maintenance for 1 person and do not have a telephone. Additionally, they are not a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They took a loan for a radio/television, amounting to 1963 DM. Their savings are less than 100 DM and they have been employed for 4 to 7 years. They have no other debtors/guarantors and live in rented housing. The individual is a 31-year-old single male with management-level job. They have been residing at their current residence for 2 years and have 2 existing credits at the bank. They have no other installment plans and are the only person liable for maintenance. They own a car or other property not specified. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, a history of delayed payments, and a credit amount of 3414. They have savings of less than 100 DM and have been employed for less than 1 year. Their living situation is in their own home, and they are a single, 26-year-old male with no other debtors or guarantors. They have no other installment plans and no telephone. They have two existing credits at the bank, a skilled job, and 1 person to provide maintenance for. Their housing property is a building society savings agreement/life insurance, and they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been present at their current employment for less than a year. They applied for a loan to purchase furniture/equipment, with a credit amount of 2146. They have savings of less than 100 DM and live in a rented house. Their installment rate is low, at 1%, and they have no other installment plans or debtors/guarantors. They are a skilled employee/official, aged 23, and have been residing in their current property for 3 years. They are female, divorced/separated/married, and liable for providing maintenance for one person. They do not have a telephone but are a foreign worker. Overall, they have a modest financial profile with no significant liabilities.###\nHence this label was Yes."
"The individual is a 22-year-old married/widowed male, working as a skilled employee/official for less than a year. He has one existing credit at the bank and resides in a rented accommodation for the past two years. His existing checking account balance is between 0 and 200 DM, with savings between 100 and 500 DM. He has paid back his existing credits duly and has a credit amount of 3092 DM for a radio/television. He has no other debtors/guarantors or installment plans, but has a telephone registered under his name. He has a 3% installment rate and is liable for providing maintenance to one person. Additionally, he is a foreign worker.###\nHence this label was No."
"The individual has no existing checking account and has a good credit history with existing credits paid back duly. They are requesting a loan for a used car for a duration of 39 months. The credit amount is 8588 and they have savings between 100 and 500 DM. They have been employed for at least 7 years with a stable income. The individual is a 45-year-old single male in good financial standing with no other debtors or guarantors. They have been living in their current residence for 2 years and own their own home. The individual has a management or self-employed job and is highly qualified. They have one existing credit at the bank and are responsible for providing maintenance to one person. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was Yes."
"The individual in this example has a checking account balance of over 200 DM, with a credit history of consistently repaying previous credits. They are looking to finance furniture/equipment with a credit amount of 2251. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. Their personal status is a divorced/separated/married female, with no other debtors or guarantors. They have lived in their current residence for 2 years and own a car or other property. At 46 years old, they have no other installment plans, own their own home, and have one existing credit at this bank. Their job is classified as unskilled-resident, with one person dependent on them for maintenance. They do not have a telephone and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been repaying existing credits on time. They are taking out a 36-month loan to purchase a used car, with a credit amount of 4686. Their savings amount is less than 100 DM and they have been employed for 1 to less than 4 years. They have a low installment rate as a percentage of their disposable income. The individual is a 32-year-old single male in a managerial position, with no other debtors or guarantors. They have been living in their current residence for 2 years, and have no specified property. They have no other installment plans, live in housing for free, and have one existing credit at the bank. The individual is responsible for one person's maintenance, has a telephone registered under their name, and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a credit history with critical accounts/other credits. They are seeking a loan for a radio/television and have a credit amount of 1316. Their savings amount is between 500 and 1000 DM with 1 to 4 years of present employment. They have a manageable installment rate, are a married/widowed male, and have no other debtors/guarantors. They have been living in their current residence for 2 years and have a property in a building society savings agreement/life insurance. At the age of 47, they have no other installment plans, own their own house, and have 2 existing credits at this bank. Their job is unskilled and they are a resident with one person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history and has been paying back existing credits duly. They have a stable job, with over 7 years of employment in the current position. The purpose of the credit is for a business-related matter. They have a moderate credit amount and some savings. The person is a 39-year-old divorced/separated/married female, owning their own house. They have no other debtors or guarantors. Additionally, they have no other installment plans and a single existing credit at the bank. The individual has been living at their current residence for 4 years with two dependents. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 22-year-old female who is divorced/separated/married. She has been employed for 1 to 4 years as a skilled employee/official. She has no other debtors or guarantors and owns a real estate property where she has been residing for 2 years. She has a checking account balance between 0 and 200 DM and savings of less than 100 DM. Her credit history shows that she has paid back existing credits duly till now. She is seeking a loan for a radio/television, with a credit amount of 5951. She has no other installment plans and no telephone. She is a foreign worker and has 1 existing credit at the bank, with an installment rate of 2% of disposable income. She is the sole provider of maintenance for one person.###\nHence this label was No."
"This individual has no checking account and a good credit history with other existing credits. They are seeking a loan for a radio/television. The credit amount requested is 1851, with savings of less than 100 DM. They have been employed for 4 to 7 years and have a moderate installment rate. The individual is a married/widowed male, with a guarantor for other debts. They have been living at their current residence for 2 years, own a car or other property, and are 33 years old. They have no other installment plans, own their housing, and have 2 existing credits at this bank. The individual is a skilled employee/official with one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a 24-month loan for a new car with a credit amount of 3757. They have savings of less than 100 DM, have been employed for at least 7 years, and have a low installment rate of 4% of their disposable income. The person is a 62-year-old divorced/separated/married female, with a co-applicant as another debtor. They have been living at their current residence for 4 years and own no property. They have no other installment plans, live in a free housing situation, and are a skilled employee/official. They have one existing credit at the bank, one dependent for maintenance, a registered telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual has a good credit history with a delay in paying off in the past. They have a moderate credit amount of 6967 DM and a savings account with a balance between 100 and 500 DM. Currently employed for 4 to 7 years, they have a stable income with a manageable installment rate. The individual is a 36-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and have a car or other property. With a single existing credit at the bank, they hold a prestigious job and are responsible for providing maintenance for one person. The individual has a telephone registered under their name and is a registered foreign worker.###\nHence this label was Yes."
"The individual in this data is a single male with good credit history and has been employed for over 7 years. He is looking to purchase a used car, has a savings account with less than 100 DM, and is living in a residence for free. He has one existing credit at the bank and is a skilled employee. At 42 years old, he has no other debtors or guarantors, and no other installment plans. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown savings account. They have been repaying existing credits on time, have a stable job, and have been living in their current residence for 2 years. The purpose of their credit is for a radio/television, and they have a good credit history. They are a married/widowed male, aged 40, with no other debtors or guarantors. They have one existing credit at the bank and live in a rented housing. They have a telephone registered under their name, are a skilled employee/official, and have one person dependent on them for maintenance. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a married or widowed male, aged 28, with a stable job of 4 to 7 years. He has one existing credit at the bank and is a guarantor for other debtors. He lives in his own real estate property with one dependent. His existing checking account balance is between 0 and 200 DM, and he has less than 100 DM in savings. He has been living at his current residence for 3 years. The purpose of his credit is for a radio/television, with a credit amount of 484. He has a low installment rate and utilizes a bank for other installment plans. He does not have a telephone but is open to foreign work opportunities.###\nHence this label was Yes."
"The individual does not have a checking account and has been employed for at least 7 years. They took a 10-month loan to buy a new car, with a credit amount of 1231. Their savings account/bonds hold less than 100 DM. They have no other ongoing credits at this bank. The individual, a 32-year-old single male, resides in their own real estate with 2 dependents. They have 2 existing credits and work as an unskilled resident. There are no other debtors/guarantors or installment plans. They have been living at their current residence for 4 years and do not have a telephone connection. Additionally, they are a non-foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has been employed for over 7 years. They have a good credit history with existing credits paid back on time. The purpose of their loan is for furniture/equipment, and they have savings of less than 100 DM. They have no other debtors or guarantors, and live in a property for free. This person is a 51-year-old divorced/separated male, with a stable job as a skilled employee/official. They have one existing credit at the bank and are responsible for providing maintenance for one person. This individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a good credit history, and has paid existing credits back on time. They are taking a loan of 1274 DM to buy a new car. They have savings of less than 100 DM and have been employed for less than a year. With a low installment rate, they are a divorced/separated/married female, with no other debtors or guarantors. They have been living in their own real estate property for 1 year and are 37 years old. They have no other installment plans, one existing credit at the bank, and work as an unskilled resident. They are liable to provide maintenance for one person and do not have a telephone. As a foreign worker, they have the ability to repay the loan.###\nHence this label was No."
"This individual has no checking account and has a history of delaying payments. They are seeking credit for a business purpose and require a loan amount of 3863. Their savings are less than 100 DM, and they have been employed for 1 to 4 years. The installment rate is 1% of their disposable income. They are a single male, with no other debtors or guarantors. They have been residing at their current residence for 2 years and have unknown/ no property. At the age of 32, they have no other installment plans and live in a free housing situation. They have one existing credit at the bank, are a skilled employee/official, and have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of delays in paying off debts. They are seeking a loan for a radio/television. With a credit amount of 4463 and savings less than 100 DM, their employment history is between 1 to 4 years. They are single, male, and have no other debtors or guarantors. They have been living in their current residence for 2 years, own a car or other property, and are 26 years old. They have no other installment plans, own their housing, and have 2 existing credits at the bank. Their job falls under management/self-employed/highly qualified employee/officer category, with one person liable for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has a stable financial status with existing checking account balance of less than 0 DM and savings of less than 100 DM. They have been employed for over 7 years as a skilled employee. The purpose of credit is for furniture/equipment. The individual is a 44-year-old single male, owning a house with a four-year residence history. They have two existing credits at another bank and no other installment plans. The credit amount is 1478 with an installment rate of 4%. There are no other debtors or guarantors, but two people are dependent on the individual for maintenance. The individual has a registered telephone and is a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history with existing credits paid back duly. They have a moderate amount of money in their checking account. They took a loan for a radio/television and have some savings. The person has been employed for 1 to 4 years and has a low installment rate. They are a 37-year-old single male with no other debtors or guarantors. The individual owns real estate and has been living at the same residence for 2 years. They have one existing credit at the bank and work as an unskilled resident. There are two people they are liable to provide maintenance for. They do not have any other installment plans, own their housing, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their existing checking account and has been employed for 4 to 7 years. They took a loan for a new car, with a credit amount of 1038 DM. Their savings are less than 100 DM and they have a critical credit history with other existing credits. They have no other installment plans, own their own home, and have a co-applicant as the other debtor. The individual is a 49-year-old single male, a skilled employee, and has been living at their current residence for 3 years. They have 2 existing credits at the bank and one person to provide maintenance for. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history, and has been repaying existing credits on time. They are taking a loan for a used car, with a credit amount of 10297. Their savings amount is less than 100 DM and they have been employed for 4 to 7 years. They have no other debtors/guarantors and live in a residence for free. They are a 39-year-old single male with a skilled job, having been in their current residence for 4 years. They have 3 existing credits at the bank, and two people are liable to provide maintenance for them. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"The individual has a checking account balance of less than 0 DM and has been employed for over 7 years. They have a good credit history with existing credits outside of this bank. The purpose of the credit is for a radio/television. They have savings between 500 and 1000 DM. The individual is a 52-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and own their own home. The individual has 2 existing credits at this bank and works as a skilled employee/official. They have no other installment plans or telephone. Additionally, they have 1 dependent and are a foreign worker.###\nHence this label was Yes."
"The individual is a 28-year-old single male with a stable job of 4 to 7 years, residing in a rented house for the past 3 years. He has one existing credit at the bank and no other installment plans or debtors/guarantors. He has a good credit history of paying back credits duly. His credit amount is 6260 DM and he has savings of less than 100 DM. He has no telephone but is a foreign worker. Overall, he appears to be a responsible borrower with a steady financial background.###\nHence this label was Yes."
"This individual has no checking account and has had existing credits paid back on time. They are taking a 24-month loan for furniture/equipment with a credit amount of 3062. They have savings between 500 and 1000 DM and have been employed for over 7 years. The installment rate is 4% of disposable income. The individual is a 32-year-old single male, with no other debtors or guarantors. They have been residing in their current residence for 3 years and have unknown/no property. They have no other installment plans, live in a rented house, and have one existing credit at the bank. They are a skilled employee/official with one person they are financially responsible for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of at least 200 DM and a credit history of paying back existing credits on time. They require a loan for furniture/equipment, amounting to 1474 DM. Their savings account holds less than 100 DM and they have been employed for less than a year. With an installment rate of 4%, they are a divorced/separated/married female aged 33. They have no other debtors or guarantors, own their residence, and have one existing credit at the bank. Their job title is in management/self-employment/highly qualified employee/officer, with one person dependent on them for maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee/official, having been employed for 4-7 years. He has a good credit history, with all previous credits at the bank being paid back on time. His current checking account balance is below 0 DM, and he has some savings between 100 and 500 DM. He is looking to take out a new car loan for a credit amount of 2325 DM, with an installment rate of 2% of his disposable income. He has no other outstanding debts or guarantors. He owns his own home and has been living at his current residence for 3 years. At the bank, he has one existing credit and no other installment plans. At 32 years old, he is responsible for providing maintenance for one person and is a foreign worker with no telephone.###\nHence this label was Yes."
"The individual has less than 0 DM in their checking account, has a good credit history, and is looking to finance a used car. They are seeking a credit amount of 2812 with unknown/no savings. They have been employed for more than 7 years as a skilled employee/official and have a low installment rate. The individual is a 26-year-old divorced/separated/married female with no other debtors or guarantors. They have been living in their current residence for 4 years, have real estate property, and no other installment plans. They rent their housing, have one existing credit at the bank, and are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a male, divorced or separated, aged 29, with a stable job as a skilled employee or official. He has been living in his current residence for 1 year and has no other installment plans or debtors/guarantors. He has a small existing credit at the bank and no savings above 100 DM. He owns no property, lives in a house for free, and has no telephone. He has been working at his current employment for 1-4 years. He is a foreign worker with no dependents and has no other people to financially support. He has a good credit history of paying back all credits duly and has taken a credit amount of 2149 for the purpose of radio/television.###\nHence this label was No."
"The individual in this data does not have a checking account and unknown savings. They have been employed for 4 to 7 years as a skilled employee, with a stable living arrangement owning real estate. The purpose of the credit is for repairs, with a moderate amount of 996 over a 12-month duration. The individual is a 23-year-old divorced/separated/married female, with no other debtors or guarantors. They have no other installment plans, no telephone, and are responsible for one person financially. Additionally, they have two existing credits at the bank, and they are a foreign worker. This individual appears to be a relatively low credit risk based on the provided attributes.###\nHence this label was Yes."
"The individual has no checking account and has been repaying existing credits promptly. They are looking to take a new car loan for 24 months. They have savings between 100 and 500 DM and have been employed for over 7 years. They have a moderate installment rate and are a married/widowed male, residing in a rented house. They have no other debtors, own real estate, are 41 years old, and have no other installment plans. They have one existing credit at the bank, work as an unskilled resident, and are responsible for one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 24-year-old female who is divorced/separated/married. She has no checking account and no savings account. She has a stable job as a skilled employee/official and has been employed for less than a year. She lives in her own home and has been there for 1 year. She has one existing credit at the bank and no other installment plans. She is the only one liable to provide maintenance for herself. She does not have a telephone but is a foreign worker. Based on her credit history of paying back existing credits duly, her credit risk is classified as good.###\nHence this label was Yes."
"This individual has a status of existing checking account with less than 0 DM. They have a good credit history with existing credits paid back duly till now. The purpose of the credit is for a new car. The credit amount is 1893. Their savings account/bonds hold less than 100 DM. They have been employed for 1 to less than 4 years. The installment rate is 4% of disposable income. The individual is a divorced/separated/married female. They have a guarantor for other debtors. Current residence has been maintained for 4 years. They have a building society savings agreement/life insurance as property. The individual is 29 years old, with no other installment plans, and owns their housing. They have one existing credit at this bank. The individual is a skilled employee/official with one person liable for maintenance. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying back existing credits on time. They are looking to finance a radio/television, requiring a credit amount of 3059. They have savings of at least 1000 DM and have been employed for 4 to 7 years. With a low installment rate, they are male, divorced/separated, and have no other debtors or guarantors. They have been living in their own real estate property for 4 years and are 61 years old. They have no other installment plans, one existing credit at the bank, and work as an unskilled resident. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated or married female, aged 29, who has been employed for 1 to 4 years as a skilled employee/official. She has a good credit history with existing credits paid back duly till now. She has a checking account with a balance of 0 to less than 200 DM and savings of less than 100 DM. The purpose of her credit is for furniture/equipment. She owns a house and has been living at the current residence for 2 years. She has no other debtors/guarantors, no other installment plans, and no telephone. She has one existing credit at the bank, with an installment rate of 1%. She is responsible for maintaining one person and is not a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a credit history of critical account/other credits existing. They are requesting a loan for a radio/television. With a credit amount of 5103 and savings less than 100 DM, they have been employed for less than a year. The person is a married/widowed male, aged 47, with no other debtors/guarantors. They have been residing for 3 years in a for free housing with no specified property. The individual has 3 existing credits at this bank and is a skilled employee/official with one person liable for maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial situation with less than 0 DM in their existing checking account and a credit history of repaying previous credits on time. They are looking to finance a new car with a credit amount of 759. Their savings account holds less than 100 DM and they have been employed for 4 to 7 years. With a moderate installment rate, they are a 26-year-old single male owning real estate. Having no other debtors or guarantors, they have been living at their current residence for 2 years. They have no other installment plans, own their own home, and have a skilled job. Additionally, they have one existing credit at the bank and are responsible for one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual does not have an existing checking account and has been paying back their credits on time. They are looking to purchase furniture/equipment using a credit amount of 2708. They have savings of less than 100 DM and have been employed for less than 1 year. With a low installment rate, they are a single male with no other debtors or guarantors. They have been living in their current residence for 3 years and own a property through a building society savings agreement/life insurance. At 27 years old, they have two existing credits at this bank and work as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM, with a credit history of paying back existing credits duly. They are looking to take out a loan for a new car, with a credit amount of 2249. Their savings account/bonds range from 100 to less than 500 DM. They have been employed for 4 to less than 7 years and have an installment rate of 4% of disposable income. The person is a single male, with no other debtors or guarantors. They have been living at their current residence for 3 years and own their own home. The individual is 30 years old and has no other installment plans. They have one existing credit at the bank and work in a managerial or highly qualified position. They have 2 people they are financially responsible for and have a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has been in their current employment for 4 to 7 years, and has paid back previous credits on time. They are looking to make a furniture/equipment purchase with a credit amount of 5179. Their savings are less than 100 DM, and they have no other debtors or guarantors. They are a single male, 29 years old, with no other installment plans, owning their own home. They have one existing credit at the bank, a skilled job, and one dependent. They have been living at their current residence for 2 years and are a foreign worker with no telephone.###\nHence this label was No."
"This individual is a single male, aged 33, with a stable job, residing in his own real estate property for 1 year. He has a good credit history, with one existing credit paid back duly. His existing checking account balance is between 0 and 200 DM, and he has savings of less than 100 DM. He has been employed for over 7 years and has a credit amount of 4439. He has a co-applicant as another debtor/guarantor, and his installment rate is 1% of disposable income. He has one existing credit at this bank, no other installment plans, and a registered telephone. He is a foreign worker with no dependents.###\nHence this label was Yes."
"This individual is a 23-year-old married/widowed male with no checking account. He has been employed for 4-7 years and resides in a rented property. His credit history shows existing credits paid back duly. The purpose of his recent credit application was for repairs, amounting to 660 DM. He has savings between 500 and 1000 DM and no other installment plans or debtors/guarantors. Additionally, he has one existing credit at the bank, is an unskilled resident, and has no telephone. He is a foreign worker and has one person dependent on him for maintenance.###\nHence this label was Yes."
"This individual is a 51-year-old single male, working as a skilled employee/official with 4 to 7 years of employment history. He has a good credit history with a slight delay in paying off in the past. His existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. He is looking to borrow 4771 DM for a radio/television. He has no other debtors/guarantors, no other installment plans, and owns his own house. He has been living at his current residence for 4 years and has one existing credit at the bank. He has no telephone but is a foreign worker with no other people dependent on him financially.###\nHence this label was Yes."
"This individual has no checking account and has a critical credit history with other existing credits. They are borrowing for a new car, with a credit amount of 1028 DM. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have a 4% installment rate for disposable income and are a divorced/separated/married female. They have no other debtors or guarantors, have been living in their current residence for 3 years, and own real estate. At the age of 36, they have no other installment plans, own their own house, and have 2 existing credits at this bank. They are a skilled employee/official with 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has a status of existing checking account with 0 to less than 200 DM. They have a credit history of paying back existing credits duly. The purpose of the credit is for a new car. The credit amount is 12389 DM. They have unknown/no savings account and have been employed for 1 to less than 4 years. The installment rate is 1% of disposable income. The individual is a single male. They have no other debtors or guarantors. They have been residing at the current place for 4 years, with unknown or no property. The individual is 37 years old and has no other installment plans. They live in a house for free and have one existing credit at the bank. Their job is a skilled employee/official. They are liable for providing maintenance for one person. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"This individual is a single, male skilled employee with a stable job, owning real estate. They have a small existing checking account balance and a modest amount of savings. They have diligently paid back existing credits and have only one ongoing credit at the bank. Their purpose for the credit is for a radio/television, for which they are borrowing 2415 DM for a short duration of 7 months. They have no other debtors or installment plans, and do not have a telephone. Despite being a foreign worker, they are considered a good credit risk.###\nHence this label was Yes."
"This individual is a male, single skilled employee with a good credit history. He has a moderate amount of money in his existing checking account, a small credit amount for education, and a small savings account. He has been employed for 1-4 years and pays a low percentage of his income towards installments. He has no other debtors or guarantors, and lives in a free housing arrangement. He is of middle age, with one existing credit at the bank and no other installment plans. He has been residing at his current residence for 4 years, has no property, and no telephone. He is responsible for providing maintenance for one person and is a foreign worker.###\nHence this label was No."
"The individual is a single male in his late twenties, working as a skilled employee/official. He has been living in his own property for 2 years. His existing checking account balance is less than 0 DM, and he has been employed for 1 to 4 years. He has no other debtors or guarantors, and no other installment plans. He is responsible for providing maintenance for one person. He does not have a telephone but is a foreign worker. His credit history shows that he has paid back existing credits duly. The purpose of his current credit application is for furniture/equipment, for which he is seeking a credit amount of 1657 DM.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, aged 26, working as an unskilled resident in a business-related field. She has had no previous credits, has a checking account with a balance between 0 and 200 DM, and savings between 100 and 500 DM. She has been employed for 1 to 4 years, renting her housing and living in the same place for 4 years. She has no other debtors or guarantors, no other installment plans, and no telephone. She has two existing credits at the bank, with an installment rate of 4% of disposable income. She is responsible for providing maintenance for one person and is a foreign worker.###\nHence this label was No."
"This individual is a single male, aged 28, with a stable job as a skilled employee/official. He has a good credit history with no other debts or guarantors. He has been residing in a rented house for 4 years and has a good savings account balance. With a longstanding checking account, he has no other installment plans and a positive credit record with 3 existing credits. He has a car or other property, and is financially responsible with a low installment rate. Additionally, he has a telephone registered under his name and is a foreign worker with one person dependent on him for maintenance.###\nHence this label was Yes."
"This individual does not have a checking account and is looking to obtain a new car on credit. They have a critical credit history with existing credits elsewhere. They have been employed for less than a year and have a moderate installment rate. The person is a 44-year-old divorced/separated male, living in their own property. They have no savings account but own real estate. They have no other debts or guarantors and no other installment plans. They have been residing at their current address for 4 years and have two existing credits at the bank. The individual is a skilled employee/official with one dependent. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a female who is divorced, separated, or married. She has been employed for 1-4 years and owns her own house. She has 1 existing credit at the bank and has been living at her current residence for 4 years. She is unskilled and a resident in her job. She has no other debtors or guarantors. Her credit history shows that she has paid back existing credits duly. She has a savings account with unknown/no savings and a building society savings agreement/life insurance as property. She has a telephone registered under her name and is a foreign worker. At 48 years old, she is responsible for providing maintenance for 1 person. Her installment rate is 1% of disposable income and she has no other installment plans. She requested a credit amount of 4351 DM for the purpose of furniture/equipment.###\nHence this label was Yes."
"This individual is a 24-year-old female, divorced or separated, with a stable job as a skilled employee or official. She has been residing in a rented property for 4 years and has no other installment plans or debtors/guarantors. She has a good credit history with existing credits at the bank. The individual has a small credit amount of 2124, with some savings below 100 DM. She has a short credit duration of 18 months and a low installment rate relative to her income. She is responsible for one person's maintenance and is a foreign worker without a telephone.###\nHence this label was No."
"This individual has no checking account and has a good credit history of repaying existing credits on time. They are looking to take out a new car loan, with a credit amount of 1101. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. Their disposable income installment rate is 3%, and they are a married/widowed male. They have no other debtors or guarantors and have been residing in their current place for 2 years. They own real estate, are 27 years old, and have no other installment plans. They have two existing credits at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of a critical account/other credits existing. They are looking to finance a new car with a credit amount of 1940. They have savings of over 1000 DM and have been employed for over 7 years. Their disposable income installment rate is 4% and they are a single male. They have no other debtors or guarantors and have been residing in their current home for 4 years. They own real estate and are 60 years old. They have no other installment plans, one existing credit at this bank, and work as a skilled employee/official. They are single with 1 person to provide maintenance for. They have a registered telephone under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown/no savings account. They have been diligently repaying existing credits and have a stable employment history of 1 to 4 years. The purpose of their credit is for a new car, with a moderate credit amount of 1309. They have a guarantor for other debtors, own their own home, and have no other installment plans. This single male is 27 years old, has one existing credit at the bank, and works as an unskilled resident. They have been living in their current residence for 4 years, do not have a telephone, and are a foreign worker. They are responsible for providing maintenance for one person.###\nHence this label was No."
"The individual has no checking account and has a good credit history with all credits paid back duly. They are taking a 24-month loan for a business purpose. The credit amount is relatively low at 1559. They have savings of less than 100 DM and have been employed for 4 to 7 years. The installment rate is 4% of disposable income. The individual is a 50-year-old single male with no other debtors or guarantors. They have been residing in their current location for 4 years and own a car or other property. The individual has one existing credit at this bank and works as a skilled employee/official. They have no dependents and own a telephone registered under their name. Additionally, they hold foreign worker status.###\nHence this label was Yes."
"This individual has no checking account and an unknown/no savings account. They have been employed for 1 to 4 years and have a good credit history with other existing credits. The purpose of their loan is for a used car. They have a moderate installment rate, own a home, and have multiple credits at the bank. The individual is a 46-year-old single male in a management position, with no other debtors or guarantors. They have been living at their current residence for 4 years and have no other installment plans. They have two dependents and a telephone registered under their name. Additionally, they are a foreign worker with a stable income.###\nHence this label was Yes."
"This individual has no checking account and has been employed for over 7 years. They have paid back all credits at this bank duly and currently have one existing credit. They are looking to purchase a radio/television and need a credit amount of 1750. Their savings amount is between 500 and 1000 DM. They have a building society savings agreement/life insurance and own their own house. They are a 45-year-old single male with two people to provide maintenance for. They have an installment rate of 2% of disposable income and their only other installment plan is with a bank. They have no other debtors or guarantors, no telephone, and are a foreign worker. Their job is unskilled and they have been residing in their current location for 4 years.###\nHence this label was Yes."
"This individual is a 23-year-old divorced or separated or married female, who has been employed for 4 to 7 years as a skilled employee or official. They have a good credit history with existing credits paid back duly till now. They are looking to borrow a small amount (1442 DM) for a new car, and currently have less than 100 DM in savings. They have been living in their current residence for 4 years and have 2 existing credits at the bank. They have no other debtors or guarantors, no other installment plans, and no telephone. They live in a rented house and have 1 person to provide maintenance for. Additionally, they are a foreign worker with no specified telephone.###\nHence this label was No."
"This individual is a 23-year-old female who is divorced/separated/married and works as a skilled employee/official. She has been in her current job for less than 1 year and has been living in her own residence for 4 years. She has no other debtors/guarantors and does not have a telephone. She has no other installment plans and only one existing credit at the bank. She has a small amount of credit (< 100 DM) in her savings account and a low installment rate in percentage of disposable income. She has borrowed 448 DM for education purposes and has been timely in repaying her existing credits. She is a foreign worker and is the sole provider for one person's maintenance.###\nHence this label was No."
"This individual has no checking account and unknown/ no savings account. They have been repaying existing credits on time and are looking to purchase a used car. With over 7 years in their current employment, they have a good credit history. They are a 41-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and own their own home. With a management job and 2 people to provide maintenance for, they are financially stable. They have one existing credit at the bank and have a telephone registered under their name. As a foreign worker, this individual seems to be a reliable and responsible borrower.###\nHence this label was Yes."
"The individual is a divorced/separated/married female in their mid-thirties with a stable job as a skilled employee/official. They have a checking account with a balance of at least 200 DM and savings of less than 100 DM. The purpose of their credit is for a new car, with a credit amount of 2247. They have been employed for 1 to 4 years and have been residing in their current home for 2 years. They have two existing credits at the bank, no other debtors or guarantors, and own their own home. They have one dependent and a telephone registered under their name. Overall, they have a good credit history despite some delays in the past and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown or nonexistent savings account. They have been employed for at least 7 years and have a stable residential status of 4 years. Their credit history is categorized as critical with other existing credits. The purpose of the credit is for a used car. They have a low installment rate, no other debtors or guarantors, and no other installment plans. They own their own home, have 2 existing credits at the bank, and work as a skilled employee or official. The individual is a single male, 63 years old, and has 1 person to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a 24-year-old female, divorced/separated/married, with no checking account and a credit history of existing credits paid back duly till now. She has been in her current employment for 1 to less than 4 years and has one existing credit at the bank. She lives in a rented house and has been at her present residence for 4 years. The purpose of the credit is for business, with a credit amount of 1568 DM. She has savings between 100 and less than 500 DM and an installment rate of 3% of disposable income. She has no other debtors or guarantors, no other installment plans, and no telephone. Her property includes a building society savings agreement/life insurance. She works as an unskilled resident and is the sole provider of maintenance for one person. She is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history with critical accounts or other existing credits. Their purpose is to purchase a new car, with a credit amount of 2775. They have savings of less than 100 DM and have been employed for 4 to less than 7 years. The installment rate is 2% of disposable income. The individual is a 31-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years, owning their housing which is a building society savings agreement or life insurance. They have 2 existing credits at this bank and work as a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual is a single male, aged 29, with a stable employment history of 4 to 7 years. He has a good credit history, no other debtors or guarantors, and owns his own home. He has one existing credit at a bank and is responsible for providing maintenance for one person. He has some savings between 100 and 500 DM and no other installment plans. The purpose of his current credit application is for a new car, with a duration of 9 months and a credit amount of 1437 DM. He has been residing at his current residence for 3 years and has a foreign worker status. He does not have a telephone.###\nHence this label was No."
"This individual has less than 0 DM in their existing checking account. They have a good credit history with existing credits paid back duly. The purpose of their credit is for furniture/equipment. They are looking to borrow a credit amount of 7882 DM. Their savings are less than 100 DM. They have been employed for 4 to 7 years. The installment rate in percentage of disposable income is 2. The individual is a 45-year-old single male. They have a guarantor for other debtors. They have been living in their current residence for 4 years and have a building society savings agreement/life insurance. They have no other installment plans and live in a housing for free. They have one existing credit at this bank. The individual is a skilled employee/official and has 2 people who are liable to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has a good credit history, and is seeking a business loan. They have a credit amount of 806 and savings of less than 100 DM. Employed for 1 to 4 years, they have a moderate installment rate. The applicant is a divorced/separated/married female, with no other debtors or guarantors. They have been living at their current residence for 4 years and possess a building society savings agreement/life insurance. At 22 years old, they have no other installment plans, own their own home, and have one existing credit at the bank. Employed as an unskilled resident, they are liable to provide maintenance for one person. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual is a 25-year-old married/widowed male with stable employment for 4-7 years. He has a good credit history with existing credits paid back duly. The purpose of the credit is for a new car, with a credit amount of 685 DM. He has a savings account with less than 100 DM and no other debtors or guarantors. He has been residing in his current residence for 3 years, owning the house. He has one existing credit at the bank, no other installment plans, and no telephone. He works as an unskilled resident and is responsible for providing maintenance for one person. Additionally, he is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a history of delays in paying off debts. They are taking a 30-month credit for a business purpose, amounting to 4272. Their savings range from 100 to less than 500 DM and they have been employed for 1 to less than 4 years. The installment rate is 2% of disposable income. They are a 26-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and their property includes a building society savings agreement/life insurance. They have no other installment plans and own their housing. They have 2 existing credits at the bank and hold an unskilled-resident job. They are liable for providing maintenance for one person and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a history of delayed payments, and is looking to finance a radio/television. They are seeking a credit amount of 1659 DM with savings of less than 100 DM. Currently employed for less than 1 year, they have a low installment rate and are female, divorced/separated/married. They have no other debtors or guarantors, have been living in their current residence for 2 years, and own a car or other property not specified. At 29 years old, they have no other installment plans, rent their housing, and have one existing credit at the bank. Employed as an unskilled resident, they are responsible for one person's maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been paying existing credits back duly. They are looking to purchase a radio/television with a credit amount of 2397. They have savings between 500 and 1000 DM and have been employed for over 7 years. Their personal status is single male, with no other debtors/guarantors. They have been residing in their current residence for 2 years and own a car. At 35 years old, they have a stable job as a skilled employee/official. They have one person to provide maintenance for, a registered telephone, and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has successfully repaid existing credits. They are taking out a loan for a new car, with a credit amount of 3527. They have no savings account and have been employed for less than a year. Their personal status is single, and they have no other debtors or guarantors. They have been living in their current residence for 3 years, own property, and are 45 years old. They have no other installment plans, and their job is in management or a highly qualified position. They are responsible for providing maintenance for 2 people, have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old single male who is currently unemployed. He has a good credit history with existing credits paid back duly. His current financial situation includes having less than 0 DM in his checking account and less than 100 DM in savings. He is looking to take a new car loan amounting to 3973. He has been living in his current residence for 4 years and resides in a free housing situation with no other significant assets. He is a skilled employee with one existing credit and no other debts or guarantors. He has no other installment plans and does not have a telephone. Despite being unemployed, he is a foreign worker and has one person he is liable to provide maintenance for.###\nHence this label was Yes."
"The individual is a divorced/separated/married female, aged 28, working as a skilled employee/official with at least 1 year but less than 4 years of employment history. She has no checking account but a savings account with 100 to less than 500 DM. She has no other installment plans and currently owns a real estate property where she has been residing for 2 years. She has a co-applicant as another debtor/guarantor. She has 1 existing credit at the bank, with a good credit history of paying back existing credits duly. She is applying for credit amounting to 2073 over a duration of 12 months, with an installment rate of 4% of her disposable income. She has no telephone but is a foreign worker. She is liable to provide maintenance for 1 other person.###\nHence this label was Yes."
"This individual is a 20-year-old married/widowed male, working as a skilled employee/official with 1-4 years of employment. He has a good credit history with a slight delay in payment in the past. His existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. He is renting a house, has no other installment plans, and does not have a telephone. He has a co-applicant and owns real estate property. The individual has 2 existing credits at the bank, with a credit amount of 585 and an installment rate of 4. He has been living at his present residence for 4 years and is liable to provide maintenance for one person. Additionally, he is a foreign worker with no other debtors or guarantors.###\nHence this label was Yes."
"The individual in this example has a checking account balance of less than 0 DM. They have a history of delaying payments in the past and took a loan for education purposes. The credit amount is 8471. They have unknown or no savings, and have been employed for 1 to 4 years. The installment rate is 1% of disposable income. The person is a female who is divorced, separated, or married. There are no other debtors or guarantors involved. They have been living at their current residence for 2 years and own a car or other property. The individual is 23 years old, has no other installment plans, and rents their housing. They have 2 existing credits at the bank and are a skilled employee or official. They are liable to provide maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an unknown or nonexistent savings account. They have been employed for at least 7 years and have a good credit history with existing other credits. The purpose of the credit is for business. They have a moderate credit amount of 6304 and a low installment rate. The individual is a 36-year-old single male with no other debtors or guarantors. They have been residing in their own real estate property for 4 years. They have no other installment plans and no telephone. The individual is a skilled employee with 2 existing credits at the bank and one dependent. They are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with a balance of at least 200 DM and has been in their current employment for 1 to less than 4 years. They have paid back existing credits on time, and are applying for a new car loan worth 2923 DM. They have savings between 100 and less than 500 DM, own a car or other property, and live in their own house. They are a 28-year-old divorced, separated or married female, with no other debtors or guarantors. They have one existing credit at the bank, work in a managerial or highly qualified position, and have a bank installment plan. They have been living at their current residence for 1 year, and have one person they provide maintenance for. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"This individual is a 27-year-old female who is divorced/separated/married. She has been employed for less than a year as a skilled employee/official. Currently, she has 0-200 DM in her existing checking account and less than 100 DM in savings. She lives in her own home with one person liable for maintenance. She has two existing credits at this bank and is making repayments at a 4% installment rate. The credit history is deemed critical, and the purpose of the credit is for furniture/equipment. Additionally, she has a building society savings agreement/life insurance as property. She does not have any other debtors/guarantors, installment plans, a telephone, or foreign worker status.###\nHence this label was Yes."
