"This individual has a status of existing checking account less than 0 DM and has been unemployed for some time. They took a credit for furniture/equipment with a duration of 6 months and an amount of 1872 DM. They have savings of less than 100 DM and no other debts or guarantors. The person is a 36-year-old single male, living for free with 4 years at the current residence. They have a good job in management/self-employment/highly qualified employee/officer and one person relying on them for maintenance. The individual has 3 existing credits at this bank, no other installment plans, and owns no property. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their checking account and has a credit history of paying back existing credits on time. They require a loan for furniture/equipment, amounting to 2996. They have no savings account and have been employed for 1 to less than 4 years. The installment rate on their disposable income is 2, and they are a married or widowed male. They have no other debtors or guarantors and have lived at their current residence for 4 years. They own a car or other property, are 20 years old, and have no other installment plans. They have 1 existing credit at this bank and work as a skilled employee/official. They are responsible for providing maintenance for 1 person and do not have a telephone. They are a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account of less than 0 DM, with a credit history of critical account/other credits existing. They are borrowing 2132 credits for the purpose of furniture/equipment, with unknown/no savings account. Present employment is less than 1 year, and the installment rate is 2% of disposable income. They are a female who is divorced/separated or married, with a co-applicant as other debtors/guarantors. They have been residing at their current residence for 3 years, which is a rental property. The individual is 27 years old, with no other installment plans, and is a skilled employee/official. They are liable to provide maintenance for one person, do not have a telephone, and are not a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and no savings account. They have been employed for at least 7 years and have a good credit history with a past delay in payments. The purpose of the credit is for a radio/television. They have a moderate credit amount of 7238 and a low installment rate of 3% of disposable income. The individual is a 32-year-old single male, living in their own property for 3 years. They have 2 existing credits at the bank and work as a skilled employee/official. They have no other debtors or guarantors, no other installment plans, and no telephone. Additionally, they are a foreign worker with 2 dependents.###\nHence this label was Yes."
"The individual has no checking account and unknown/no savings account. They have a good credit history with existing credits paid back duly. The purpose of the credit is for a new car. The individual has been employed for 1 to less than 4 years as a single male. They have no other debtors or guarantors. The individual resides in their own real estate property for the past 4 years. They are a skilled employee/official with no other installment plans. There is one existing credit at the bank with no other liabilities for maintenance. The individual does not have a telephone but is a foreign worker. The credit amount is 3079 and the individual is 36 years old.###\nHence this label was Yes."
"This individual is a 23-year-old single male with a stable job and a good credit history. He has a savings account with less than 100 DM and has been employed for 1 to less than 4 years. The purpose of his credit is for business, and the credit amount is 15672. He has no other debtors or guarantors, owns his own home, and has one existing credit with the bank. He has been living at his current residence for 2 years and has a telephone registered under his name. He has no other installment plans, no other existing credits, and no one else dependent on him for maintenance. Additionally, he is a foreign worker with a good repayment record.###\nHence this label was No."
"This individual is a 22-year-old married/widowed male with a stable but short-term employment history. They have a checking account balance between 0 and 200 DM, with some savings under 100 DM. They have one existing credit and are looking for a small loan of 454 DM for repairs. They live in their own home and have been at their current residence for one year. They have no other debts or dependents, and no other installment plans. They work in an unskilled resident job and are a foreign worker without a telephone. Overall, this individual appears to be a modest credit risk with a relatively simple financial profile.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for 1 to 4 years and have a good credit history with existing credits. The purpose of the credit is for a used car, with a duration of 24 months. They are a single male, 46 years old, with no other debtors or guarantors. They own their own home and have two existing credits at the bank. Their job is in management or a highly qualified position. They have two dependents and a telephone registered under their name. Overall, they are a reliable foreign worker with a stable financial background.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a 24-month loan for a new car, with a credit amount of 1249. Their savings are less than 100 DM and they have been employed for less than a year. They have a low installment rate of 4% and are a married/widowed male. They have no other debtors or guarantors, own real estate, and have been living at their current residence for 2 years. At 28 years old, they have no other installment plans, no telephone, and no other credits at the bank. They work as a skilled employee/official and are responsible for one person's maintenance. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial status with a moderate credit amount and a history of delays in payments. They are taking a loan for business purposes and have some savings. They have been employed for over 7 years and have a low installment rate. The person is a 41-year-old single male with no other debtors or guarantors. They own a house and have a moderate number of credits. Their job is a skilled employee/official, and they have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has existing credits paid back duly till now. They are requesting a credit amount of 1376 for the purpose of purchasing a radio/television. Their savings amount is between 500 and 1000 DM, and they have been employed for 4 to 7 years. The installment rate in percentage of disposable income is 4. They are a divorced/separated/married female with no other debtors or guarantors. They have been living at their current residence for 1 year and own a car or other property not specified. At 28 years old, they have no other installment plans and own their housing. They have one existing credit at the bank and are a skilled employee/official. They have one person liable for maintenance. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a stable credit history of repaying existing credits on time. They are seeking a loan for furniture/equipment, amounting to 4611. Their savings are less than 100 DM and they have been employed for less than a year. With a low installment rate of 1%, they are a divorced/separated/married female, residing in their own home for the past 4 years. Their property includes a building society savings agreement/life insurance. At 32 years old, they have no other installment plans, no other debtors/guarantors, and one existing credit at the bank. Employed as a skilled employee/official, they are liable for providing maintenance to one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM and has been employed for at least 7 years. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a radio/television. The credit amount is 4473 DM. They have savings of less than 100 DM and own a car or other property. The individual is a 31-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and have no other installment plans. They have a stable job as a skilled employee/official and are responsible for providing maintenance for one person. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a reliable credit history of repaying existing credits on time. They are applying for a loan to purchase furniture/equipment. They have savings of less than 100 DM and have been employed for 4 to 7 years. The loan amount is 3972, with a low installment rate. The individual is a divorced/separated/married female, with no other debtors/guarantors. They have been living at their current residence for 4 years and have a building society savings agreement/life insurance. At 25 years old, they have no other installment plans and rent their housing. The individual has one existing credit at the bank, is a skilled employee/official, and is responsible for one person's maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been paying back existing credits on time. They are looking to borrow 1418 credits for a new car. They have savings between 100 and 500 DM and have been employed for 1 to 4 years. Their disposable income installment rate is 3%. The individual is a 35-year-old single male, with no other debtors or guarantors. They have been living in real estate for 2 years and have no other installment plans. They rent their housing and have one existing credit at the bank. The individual has an unskilled-resident job and is responsible for providing maintenance for one person. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history of paying back existing credits on time. They are taking a loan of 2515 credits for furniture/equipment. With savings of less than 100 DM, they have been employed for 1 to 4 years. Their personal status is a single male, and they have no other debtors or guarantors. They have been living in their current residence for 4 years and own real estate. At 43 years old, they have a skilled job and no other installment plans. They have one existing credit at the bank and one person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a history of delaying payments. They took a credit for business purposes amounting to 1743. Their savings account holds between 100 and 500 DM. They have been employed for 1 to 4 years and have a low installment rate. The person is a single male with no other debtors. They have been living in their own real estate property for 2 years and are 34 years old. The individual has no other installment plans, 2 existing credits at this bank, and works as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual is a divorced/separated/married female, aged 42, with a stable job as a skilled employee/official. She has been living in her current residence for 4 years and has been employed at the same place for at least 7 years. She has a good credit history with existing credits paid back duly. She has one existing credit at the bank and no other debtors/guarantors. She owns a car or another type of property not specified. She has no other installment plans or savings account. She has a telephone registered under her name and is a foreign worker. Based on her financial attributes, she is considered as a potentially good credit risk.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They took a loan for a radio/television worth 2697. Their savings account holds less than 100 DM and they have been employed for 1 to less than 4 years. They have a low installment rate in percentage of disposable income and are a single male. There are no other debtors or guarantors involved. They have been residing in their own real estate property for 2 years and are 32 years old. They have no other installment plans, one existing credit at the bank, and work as a skilled employee/official. They are liable to provide maintenance for 2 people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old female who is divorced or separated or married, working as an unskilled resident with 1-4 years of employment history. She has a good credit history with existing credits paid back duly, and currently has no other debtors or guarantors. She owns real estate and has been residing at her current location for 2 years. She has one existing credit at the bank and no other installment plans. Her savings amount is between 100 and 500 DM, with a checking account balance between 0 and 200 DM. She is looking for a loan for repairs, amounting to 2631 DM, to be paid back in 15 months with a 3% installment rate. She has no telephone and is a foreign worker with one dependent to provide maintenance for.###\nHence this label was Yes."
"The individual is a 24-year-old female who is divorced/separated/married. She has been working in her current job for 1 to less than 4 years and resides in her own home for 2 years. She has no other debtors or guarantors and no other installment plans. She has one existing credit at the bank with a credit amount of 1228 DM, and she has a savings account/bonds with less than 100 DM. She has no telephone and is a foreign worker. Based on her credit history of existing credits paid back duly till now, she is classified as a good credit risk.###\nHence this label was No."
"This individual has a checking account balance of less than 0 DM and a credit history of paying back existing credits on time. They are seeking a loan for domestic appliances, totaling 1217 DM. Their savings amount to less than 100 DM, and they have been employed for 1 to less than 4 years. The individual is married or widowed, male, aged 47, with no other debtors or guarantors. They have been living in their current residence for 3 years, own real estate, and have no other installment plans. The individual's housing situation is owned, they have one existing credit at this bank, and work as an unskilled resident. They are responsible for providing maintenance for one person, have a registered telephone, and are a foreign worker.###\nHence this label was No."
"This individual does not have a checking account and has a good credit history with existing credits paid back on time. They are borrowing money for a radio/television, with a credit amount of 1963. Their savings are less than 100 DM and they have been employed for 4 to 7 years. The installment rate is 4% of their disposable income. They are a 31-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. They have no other installment plans, reside in a rented house, and work in a managerial or self-employed position. They have 2 existing credits at the bank and are responsible for providing maintenance for 2 people. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account. They have been employed for at least 7 years and have no other debts or guarantors. They live in their own home and have been at their current residence for 4 years. The purpose of the credit is for a radio/television. They have a good credit history with existing accounts. They have savings between 100 and 500 DM, and own real estate. The individual is a 36-year-old single male, a skilled employee, with two dependents. They have one existing credit at the bank and an installment rate of 3%. They have a telephone registered under their name and are a registered foreign worker.###\nHence this label was Yes."
"This individual is a single, unemployed male with a management job, aged 36. He has no savings account and no property, but resides for free. He has a co-applicant and one existing credit at the bank. Despite being unemployed, he has a telephone registered under his name. He has been living at his current residence for 4 years and has no other installment plans. His credit history shows that all credits at this bank have been paid back duly. The purpose of his credit is for a new car, with a credit amount of 12169 DM to be paid back over 48 months with an installment rate of 4%. He is liable for providing maintenance for one person and is a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account and some savings. They have a short credit history with critical accounts and other credits. The credit is for a radio or television. They have a stable job, own their own home, and have no other property. This person is a 38-year-old single male with no other debtors or guarantors. They have been in their current residence for four years and have two existing credits at their bank. Additionally, they have two dependents and no telephone. They are a foreign worker but have a bank installment plan.###\nHence this label was No."
"The individual is a single male, 47 years old, with a stable job of 4-7 years. He has a checking account balance between 0 and 200 DM, with savings less than 100 DM. He is looking to finance a new car with a credit amount of 958 DM. He has no other debts or guarantors and owns real estate for housing. He has been living at his current residence for 3 years and has two existing credits at the bank. He is an unskilled resident with two dependents. He does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are taking a loan to purchase furniture or equipment. The credit amount is 1736. They have savings of less than 100 DM and have been employed for 4 to 7 years. The installment rate is 3% of disposable income. The individual is a 31-year-old divorced, separated, or married female. They have no other debtors or guarantors and have been residing in their current residence for 4 years. They own real estate and have no other installment plans. The individual has one existing credit at the bank and works as an unskilled resident employee. They have 1 person dependent on them for maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit risk as they have a stable existing checking account with a moderate credit history. They are taking a loan to purchase a new car, with a relatively low credit amount. They have a long-standing job and own real estate. Their financial obligations are manageable with a low installment rate and no other significant debts. Additionally, they have a stable living situation and a good credit history. Overall, this individual exhibits responsible financial behavior and is likely to repay their loan on time.###\nHence this label was Yes."
"This individual is a single male, aged 44, with less than 1 year of employment. He has a checking account with a balance of less than 0 DM and no savings account. His credit history shows critical accounts and other existing credits. The purpose of the credit is for a new car. He has two existing credits at the bank and owns real estate. His monthly installment rate is 1, and he has no other installment plans. He resides in his own home for 3 years and has 2 dependents. His job is classified as unskilled-resident, and he is a foreign worker without a telephone.###\nHence this label was Yes."
"This individual has a small amount of savings and a modest credit amount for a new car. They have been employed for 1 to 4 years and have a good credit history. Being a single male, they live in their own real estate property and have two existing credits. With a stable residence and two dependents, this 40-year-old foreign worker has a cautious approach to financial commitments and prefers not to use installment plans or have any other debtors.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are looking to purchase furniture/equipment and need a credit amount of 2835. They have savings between 500 and 1000 DM. The individual has been employed for at least 7 years and has a low installment rate. They are a 53-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own their own home. The individual has one existing credit at the bank, a skilled job, and is the sole provider for one person. They do not have any other installment plans, do not have a telephone, but are a foreign worker.###\nHence this label was Yes."
