"The individual has no checking account and has a history of delayed payments. They took a loan for a used car, with a credit amount of 2993. Their savings account has less than 100 DM. They have been employed for 1 to 4 years and have a modest installment rate. The individual is a 28-year-old single male, with no other debtors or guarantors. They have been living in their own real estate property for 2 years. They have 2 existing credits at the bank and work as an unskilled resident. They are responsible for one dependent and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, who has no checking account but has existing credits paid back duly till now. She has been employed for 1 to less than 4 years as a skilled employee/official. She took a loan of 1364 DM for a new car, and her savings are less than 100 DM. She has no other debtors or guarantors, owns her house, and has been living at the current residence for 4 years. With an age of 64, she has no other installment plans, one existing credit at the bank, and no one else to provide maintenance for. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"This individual is a 75-year-old unemployed female, who is divorced/separated/married. She has no existing savings account, but owns a car and a house. She has been living in her current residence for 3 years. She has one existing credit and is responsible for providing maintenance for one person. She has a good credit history with existing credits paid back duly. She works in a high-level position such as management/self-employment/highly qualified employee/officer. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history, with existing credits paid back on time. They are looking to finance a used car, with a credit amount of 4788. They have some savings, with less than 100 DM in their account. The individual has been employed for 4 to 7 years and has a stable income. They are single, male, and living in their own house. With no other outstanding debt, they have a good credit standing. At 26 years old, they are a skilled employee with one existing credit at the bank. They have been living at their current residence for 3 years and have two dependents. They do not have any other installment plans and do not own a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 28, with no existing checking account and a stable employment history of more than 7 years. They have paid back existing credits on time, have a modest credit amount of 3595, and savings of less than 100 DM. The purpose of the credit is for a radio/television. They have no other debtors or guarantors, own their own home, and have one existing credit at the bank. As a skilled employee/officer, they have no other installment plans and no telephone. They have been residing at their current residence for 2 years and have no one else dependent on them financially. Additionally, they are a foreign worker with good credit history.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, a credit history of repaying existing credits on time, and intends to use the credit for purchasing a radio/television. They have savings of at least 1000 DM, been employed for less than a year, and have a low installment rate of 4%. The individual is a divorced/separated/married female, has no other debtors/guarantors, and has been living at their current residence for 2 years. They own a car or other property not specified, are 29 years old, and have another installment plan with a bank. The individual has one existing credit at the bank, is a skilled employee/official, and is liable to provide maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a critical credit history with other existing credits. They took a loan for a radio/television, amounting to 1360. Their savings are less than 100 DM, and they have been employed for 1 to less than 4 years. They pay 4% of their disposable income towards installments. A 31-year-old single male, they have no other debtors or guarantors. They have been living in their current residence for 2 years and have a building society savings agreement/life insurance. They have no other installment plans, own their housing, and have two existing credits at the bank. As a skilled employee/official, they are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM. They have a good credit history with existing credits paid back on time. They are taking a loan for education, amounting to 1977. They have an unknown or no savings account. The individual has been employed for over 7 years and has a low installment rate. They are a single male, own their own home, and have no other debtors or guarantors. Their age is 40, and they have no other installment plans. They have one existing credit at the bank and work in a high-level position. They are responsible for one other person's maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and an existing credit history with all credits paid back duly. They are looking for a loan of 2279 for the purpose of purchasing a radio/television. Their savings account status is unknown, and they have been employed for 1 to less than 4 years. With an installment rate of 4% of disposable income, the person is a single male living in a free housing arrangement. They have no other debtors or guarantors, and no other installment plans. The individual is a skilled employee/official aged 37, with no property ownership information available. They have been residing at their current residence for 4 years, have one existing credit at the bank, and are liable for one person's maintenance. Moreover, they have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a good credit history, and is seeking a loan for furniture/equipment. They have a moderate credit amount of 2359 DM and some savings between 100 and 500 DM. Despite being unemployed, they have a stable residential history of 1 year. Being a divorced/separated male, they have no other debtors or guarantors and currently own a property. With a single existing credit, they are a skilled employee in a stable job. At the age of 33, they have no other installment plans, own their own home, and have one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a divorced/separated/married female aged 20, working as a skilled employee/official with 1-4 years of employment. They have a checking account with less than 0 DM, with savings of less than 100 DM. They have paid their existing credits on time and are currently looking to finance furniture/equipment. The credit amount requested is 1282 with an installment rate of 2%. They have no other debtors/guarantors or installment plans, and live in a rental property with 4 years of residence. They have 1 existing credit at the bank and are the sole provider for 1 person. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 25-year-old single male, working in an unskilled-resident job, with a monthly income below 200 DM. He has been living in his current residence for 2 years and owns his own home. He has 2 existing credits at a bank and no other installment plans. His credit history shows a critical account with other existing credits not from this bank. The purpose of his loan was for a radio/television, and the credit amount is 4746 DM. He has savings of less than 100 DM, with no other debtors or guarantors. His installment rate is 4% of his disposable income, and he has no telephone. Additionally, he is a foreign worker with 1 person to provide maintenance for.###\nHence this label was No."
"This individual has no checking account and has existing credits paid back duly. They are looking to purchase a used car with a credit amount of 1413. They have savings of at least 1000 DM and have been employed for 4 to less than 7 years. The installment rate for disposable income is 3%. The individual is a 55-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and have a building society savings agreement/life insurance. They do not have any other installment plans and own their own home. The individual has one existing credit at this bank, is a skilled employee/official, and has one person relying on them for maintenance. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with no existing credits and a checking account balance between 0 and 200 DM. They have a good credit history, having paid back all credits duly. The purpose of the credit is for business. With a credit amount of 8318 DM and savings of less than 100 DM, they have been employed for over 7 years and have a low installment rate. The applicant is a 42-year-old divorced/separated/married female with no other debtors/guarantors. They have been residing at their current residence for 4 years and have no property. The individual has no other installment plans, lives in housing for free, and has a job in management/self-employment/highly qualified employee/officer role. They have 2 existing credits at this bank and are responsible for one dependent. The individual has a telephone registered under their name and is a foreign worker.###\nHence this label was No."
"This individual has less than 0 DM in their existing checking account and has a good credit history with existing credits paid back on time. They are borrowing 2315 DM for a radio/television. They have savings of less than 100 DM and have been employed for at least 7 years. Their monthly installment rate is 3% of their disposable income. They are a 52-year-old single male with no other debtors or guarantors. They have been residing in their own real estate property for 4 years. They have no other installment plans and no telephone. They have an unskilled-resident job and are responsible for providing maintenance for one person. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 25, with a stable job as a skilled employee/official. She has had existing credits paid back duly till now and currently has less than 100 DM in her savings account. She has been in her current residence for 2 years and has a good credit history. She is looking to borrow 1835 DM for the purpose of purchasing a radio/television. She owns her own home and has a telephone registered under her name. She has 2 existing credits at the bank and is the sole provider for 1 person. Additionally, she has no other debtors/guarantors, no other installment plans, and is a foreign worker with at least 1-4 years of employment history.###\nHence this label was No."
"The individual has a checking account with a balance of less than 0 DM and has been at their current employment for 1 to less than 4 years. They have a good credit history with critical accounts and existing credits elsewhere. The purpose of the credit is for a new car, with a credit amount of 2799. Their savings account contains less than 100 DM and they have no other installment plans or debtors/guarantors. They live in a rented housing situation with 2 people liable for maintenance and have been at their current residence for 2 years. The individual is a 36-year-old single male skilled employee with 2 existing credits at the bank. They hold real estate as property, have no telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been diligently repaying existing loans. They are looking to purchase furniture/equipment and require a credit amount of 1574. Their savings are below 100 DM and they have been employed for 1 to 4 years. With a low disposable income installment rate of 4%, they are a single male living in their own real estate property. Aged 50, they have no other debtors or guarantors, no other installment plans, and no telephone. This skilled employee has one existing credit at the bank, has lived in their current residence for 2 years, and has 1 person dependent on them for maintenance. They are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for at least 7 years in a managerial or highly qualified position. They are a divorced/separated/married female, aged 52, with no other debtors or guarantors. They have been living in their current residence for 4 years, which is rent-free. Their credit history shows they have consistently paid back previous credits. They are looking to borrow 2133 for a new car and have no other ongoing installment plans. They have a good credit score and are a registered telephone user and foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a stable employment history of 4 to 7 years. They took a short 4-month loan for a new car, with a moderate credit amount. Their savings are below 100 DM. They are a divorced, married, or separated female, aged 37, with no other debtors or guarantors. They own real estate and have one existing credit at the bank. They are a skilled employee or official with 2 people to support. They have no other installment plans, own their home, do not have a telephone, and are a foreign worker.###\nHence this label was Yes."
"This individual has a good credit history with existing credits paid back duly. They have a stable job with income >= 7 years. They are a single male, 39 years old, and have been living in their current residence for 2 years. The purpose of their credit is for furniture/equipment, with a credit amount of 3345. They have savings of < 100 DM, no other debts, and own a building society savings agreement/life insurance. They have one existing credit at the bank, no other installment plans, and rent their housing. They have a phone registered under their name, with one person liable for maintenance. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and no savings account. They have existing credits that have been paid back duly. The purpose of the credit is for a new car. The individual has been employed for at least 7 years and has a stable income. They are a single male, 45 years old, with a co-applicant as a guarantor. They have been living in their current residence for 2 years and own their own home. They have one existing credit at the bank and work as an unskilled resident. They have no other installment plans, no telephone, and do not have any foreign worker status.###\nHence this label was Yes."
"This individual has no checking account and is unemployed. They have a critical credit history with other existing credits, and their purpose for the credit is furniture/equipment. The credit amount is 2406, and they have savings of less than 100 DM. They are a 31-year-old single male, with no other debtors/guarantors and no other installment plans. They live in their own property, have one existing credit at the bank, and work in a management/self-employed role. They have been living at their current residence for 3 years, with one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a single, unemployed male, aged 34, with a present residence duration of 2 years. He has a good credit history with other credits existing, holds a small amount in savings, and has no other debtors or guarantors. He has two existing credits at the bank and works in a high-level job. He has a car or other property, owns a home, and has a telephone registered under his name. He is a foreign worker and is liable to provide maintenance for one person. The purpose of the credit is for a used car, with a credit amount of 1860 and an installment rate of 4%.###\nHence this label was Yes."
"The individual has no checking account and has been employed for 1 to 4 years. They took a loan of 2134 for a new car, with a credit history of critical account/other credits existing. They have savings of less than 100 DM and own a house. Being a single male with no other debtors, the individual is a skilled employee/official with 3 existing credits at the bank. They are 48 years old, have been at their current residence for 4 years, and have no other installment plans. They have one person to provide for and have a registered telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old unemployed single male with a good credit history. He has a checking account balance of less than 0 DM and less than 100 DM in savings. His loan amount is 2473 with an 18-month duration to purchase furniture/equipment. He has no other debts, owns his own home, and has one existing credit at the bank. He has no other installment plans, no phone, and no other people to support financially. He is a foreign worker and employed in an unskilled, non-resident position.###\nHence this label was No."
"This individual is a 23-year-old female who is divorced, separated, or married. She has been employed for 1 to less than 4 years in an unskilled-resident job. She has a good credit history with a critical account or other credits existing elsewhere. Her existing checking account balance is between 0 and less than 200 DM, and she has savings of less than 100 DM. The purpose of her credit is for a radio/television. She owns real estate and has been living in her current residence for 1 year. She has no other debtors or guarantors, no other installment plans, and no telephone. Additionally, she has one existing credit at a bank and is the sole provider for 1 individual. She is a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, a critical credit history, and seeks a loan for education. They are borrowing 8065 DM for a duration of 36 months. Their savings are less than 100 DM, and they have been employed for 1 to 4 years. With a manageable installment rate of 3%, the borrower is a divorced/separated/married female aged 25. They have no other debtors or guarantors, own their own home, and have unknown property. The individual has no other installment plans, two existing credits at this bank, and a job in management/self-employment/highly qualified employee/office. They have one dependent and a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has no checking account and has been paying back existing credits on time. They are looking to finance a used car and do not have a savings account. Currently, they have been employed for 1 to 4 years and have a low installment rate. The individual is a single male, with no other debtors or guarantors. They own their home and have one existing credit at the bank. They work as a skilled employee or official and are responsible for one person's maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are looking to finance a new car with a credit amount of 5324. They have savings between 500 and 1000 DM and have been employed for over 7 years. The installment rate as a percentage of disposable income is low at 1. The individual is a 35-year-old divorced/separated/married female. They have no other debtors or guarantors. They have been living at their current residence for 4 years and have no property. The individual has no other installment plans, lives in housing for free, and is a skilled employee/official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with less than 0 DM, has been employed for 4 to 7 years, and has a good credit history with critical accounts/other credits. They are using the credit for a used car, amounting to 6187 DM. They have savings between 100 to 500 DM and no other debts. The individual is a married or widowed male, residing in rented housing for 4 years. They are 24 years old, with no other installment plans or telephone. They have 2 existing credits at this bank, a skilled job, and are responsible for one person. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, aged 25, with no checking account and unknown/no savings account. She has been employed for 1 to less than 4 years as a skilled employee/official. She has one existing credit at the bank and has been living in her current residence for 4 years. The purpose of her credit is for a radio/television, and the credit amount is 2394. She has no other debtors or guarantors, no other installment plans, and owns her own house. Her installment rate is 4% of disposable income, and she is the sole provider for 1 person. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been repaying existing credits on time. They took a loan for furniture/equipment, amounting to 1313 DM, with savings of less than 100 DM. Employed for over 7 years, they have a low installment rate on disposable income. A 20-year-old single male, they have no other debtors/guarantors and have lived in their own residence for 4 years. They own a car or other property, with no other installment plans. With a stable job as a skilled employee/official, they are the sole provider for one person and do not have a telephone. As a foreign worker, the individual appears to be a responsible and financially stable individual.###\nHence this label was Yes."
"This individual has a checking account balance less than 0 DM and has had it for over 7 years. They took out a small loan for a new car, with a credit amount of 731 DM, to be paid back in 8 months with an installment rate of 4%. They have no other debts or loans, and own real estate where they have been living for 4 years. At 47 years old, this single male, who is an unskilled resident, has 2 existing credits at the bank and is financially responsible for one other person. They do not have any other installment plans, a telephone, or other debtors. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM and has been at their current employment for at least 7 years. They took a loan for a used car, with a credit amount of 2957 DM, and have savings of less than 100 DM. They have no other debts or guarantors, own their own home, and have been living at their current residence for 4 years. At 63 years old, they are a single male and a skilled employee with 2 existing credits at the bank. They have no other installment plans, one dependent, a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with balance less than 0 DM and has had existing credits paid back on time. They are taking a 48-month loan for a used car, amounting to 10297 DM. The savings account holds less than 100 DM. They have been employed for 4 to 7 years and their monthly installment rate is 4% of disposable income. The person is a 39-year-old single male with no other debtors or guarantors. They have been living at their current residence for 4 years, have unknown property, and use installment plans for stores. Their housing is free and they have 3 existing credits at this bank. The individual is a skilled employee, with 2 dependents. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"The individual has a checking account with a balance of at least 200 DM, has existing credits paid back on time, and is looking to purchase a new car. They have a credit amount of 709 and savings of at least 1000 DM. They have been employed for less than 1 year, with an installment rate of 2% of disposable income. The individual is a 27-year-old married/widowed male with no other debtors or guarantors. They have been living in their own real estate property for 2 years and have no other installment plans. The individual is unemployed or unskilled, non-resident, with no telephone and not a foreign worker. They have one existing credit at the bank and are responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has no checking account and has been repaying existing credits promptly. They are looking to purchase a radio/television with a credit amount of 804. Their savings are less than 100 DM and have been employed for at least 7 years. They have no other debts or guarantors, own a car or other property, and live in their own home. As a single male, aged 38, they have a skilled job and no other installment plans. They have been residing at their current residence for 4 years and have one existing credit at the bank. There is no telephone in their name, but they are a foreign worker with one person to support financially.###\nHence this label was Yes."
"This individual has no checking account and their credit history shows that they have always paid back existing credits on time. They are seeking a loan for business purposes and have an unknown or no savings account. They have been employed for 1 to less than 4 years and their disposable income installment rate is 4%. The individual is male, divorced or separated, and has no other debtors or guarantors. They have been living in their current residence for 2 years and own real estate. At 38 years old, they have a bank installment plan and work as a skilled employee or official. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has less than 0 DM in their existing checking account and has been repaying their existing credits on time. They are seeking a new car and have a credit amount of 654 DM. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have no other debtors or guarantors. The individual is a 28-year-old single male with one existing credit at the bank. They have been living in their current residence for 3 years and own a car or other property. They have no other installment plans and no telephone. The individual is employed as an unskilled resident and is responsible for one other person. They are a foreign worker.###\nHence this label was No."
"This individual has a stable financial situation with a checking account balance of less than 0 DM, savings of less than 100 DM, and a long-standing employment of at least 7 years. They have a good credit history, no other debtors or guarantors, and own their housing. The purpose of their credit is for a radio/television, and they have a single existing credit at the bank. Despite being divorced or separated, they are a skilled employee with no other installment plans, aged 55, with 4 years at their current residence. They have no telephone but are a foreign worker, with one person relying on them for maintenance.###\nHence this label was Yes."
"The individual has no checking account and is unemployed. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a new car. They do not have any savings or property. The individual is a single male, 38 years old, and owns a house. They have no other debts or guarantors. They have one existing credit at the bank and work in a high-level job. The installment rate is 4% of disposable income and they have no other installment plans. They have been residing at their current residence for 4 years and have one person dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account and has a good credit history with existing credits elsewhere. They seek a loan for education, amounting to 936 credits. Their savings are between 500 and 1000 DM. Employed for over 7 years, they have a low installment rate and own a car or other property. A 52-year-old single male, they have no other debtors and have resided in their current home for 2 years. They have no other installment plans and own their own home. With 2 existing credits at the bank, they work as a skilled employee/official and are responsible for one other person. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 29-year-old divorced or separated or married female, with no checking account. She has been in her current job for less than a year and owns her own home. She has one existing credit at the bank and pays her existing credits back on time. Her credit amount is 2679, and she has savings of less than 100 DM. She has no other debtors or guarantors, no other installment plans, and no property. She has a 4% installment rate and has been residing at her current residence for 1 year. She is a foreign worker with a telephone registered under her name and is liable to provide maintenance for one person.###\nHence this label was Yes."
"This individual is a young married/widowed male, aged 23, with a stable job as a skilled employee/official. He has been living in his own residence for 2 years and has 1 existing credit at the bank. His existing checking account balance is less than 0 DM, and he has no savings. He has a good credit history of repaying credits on time. The purpose of his current credit application is for a new car. He is borrowing 900 credits with an installment rate of 4% of his disposable income. He has no other debtors/guarantors or other installment plans. He does not have a telephone but is a foreign worker.###\nHence this label was No."
"This individual does not have a checking account and has a critical credit history with other existing credits. They are applying for a new car loan, amounting to 1393 credits. Their savings account holds less than 100 DM, and they have been employed for less than a year. With a 4% installment rate, they are a divorced/separated/married female, with no other debtors or guarantors. They have been residing in their current location for 4 years, own their housing, and are aged 35. They have two existing credits at their bank and work in a high-level job. They have one dependent and no other installment plans, telephone, or foreign worker status.###\nHence this label was Yes."
"The individual in this dataset is a divorced/separated/married female, aged 26, with no checking account. She has been employed for 1 to less than 4 years as a skilled employee/official and has been living in her current residence for 2 years. She owns a car or other property, has less than 100 DM in savings, and has a credit history of delay in paying off in the past. The purpose of her credit is for business, with a credit amount of 2764. She has no other debtors/guarantors, no other installment plans, and no one else to provide maintenance for. She has 2 existing credits at the bank, with an installment rate of 2% of disposable income. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"The individual is a 23-year-old single male with less than 1 year of employment and owns real estate. He has a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and no other debtors or guarantors. He has one existing credit, a loan for a new car, and pays installments at a rate of 4% of his disposable income. He has lived in his current residence for 2 years and has no telephone. With a credit amount of 1246 DM, he is considered an unskilled resident and is the sole provider for one person. He also has an installment plan at stores and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a business loan with a credit amount of 4591. They have savings of at least 1000 DM and have been employed for 1 to 4 years. Their personal status is a single male, aged 54, with no other debtors or guarantors. They have been living in their current residence for 3 years and own their own home. The individual holds a management position, has no other installment plans, and has 3 existing credits at the bank. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was No."
"The individual has no checking account and has been repaying existing credits on time. They are taking a loan for a radio/television, with a credit amount of 2397. They have savings between 500 and 1000 DM, have been employed for at least 7 years, and have a low installment rate. The person is a single male, with no other debtors or guarantors. They have been residing at their current location for 2 years and own a car or other property. Their age is 35, they have two existing credits at the bank, and work as a skilled employee/official. They have one dependent and a registered telephone. Additionally, they have a foreign worker status.###\nHence this label was No."
"This individual has no checking account and unknown savings account. They have had existing credits paid back duly, with a credit amount of 7409 for a business purpose. Present employment has been for at least 7 years. They are single, male, and 37 years old, residing in their own home for 2 years. They have no other debtors or guarantors, no other installment plans, and no telephone. They have a building society savings agreement/life insurance as property. Their job is a skilled employee/official, with 2 existing credits at this bank. They are liable to provide maintenance for 1 person and are a foreign worker.###\nHence this label was Yes."
"This individual is a female, divorced/separated/married, who has been employed for at least 7 years as a skilled employee/official. She has a good credit history with other credits existing, does not have any other debtors/guarantors, and owns her own home. She has a checking account balance between 0 and 200 DM, less than 100 DM in savings, and a credit amount of 3612. She has been living at her current residence for 4 years, is 37 years old, and has one existing credit at the bank. She has no other installment plans, one person to provide maintenance for, a telephone registered under her name, and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and unknown savings. They have been employed for 1 to 4 years in a skilled position, with a stable residence for 2 years. They are married or widowed, have no other debtors, and do not have any other installment plans. Their credit history shows timely payments on existing credits. The purpose of their credit is for a radio or television, with a moderate credit amount of 1386. They have a moderate disposable income installment rate of 4 and live in rented housing. At 40 years old, they are responsible for one existing credit and have one person dependent on them. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 54-year-old unemployed female who is either divorced, separated, or married. She does not have a checking account but has less than 100 DM in a savings account. She has no other debtors or guarantors. The purpose of her credit is for a new car, with a credit amount of 672. She owns a real estate property and has been living at her current residence for 4 years. She has one existing credit at the bank and no other installment plans. Her job status is unemployed or unskilled non-resident. She is responsible for providing maintenance for one person. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has been employed for at least 7 years. They took a 24-month loan for a radio/television, with a credit amount of 2872. They have savings between 100 and 500 DM and own real estate. The person, a 36-year-old single male, has no other debtors or guarantors, and no other installment plans. They live in their own house, have one existing credit at the bank, and are a skilled employee. They have been living at their current residence for 4 years, have a 3% installment rate, and 2 people to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 20-year-old single male, working as a skilled employee for over 7 years. He has a good credit history with existing credits outside of this bank. He is looking to purchase furniture/equipment with a credit amount of 3617. He does not have a savings account but has a co-applicant. He has been living in a rented accommodation for 4 years and has no other property. He has 2 existing credits at this bank and no other installment plans. He has an installment rate of 4% of his disposable income. He is responsible for providing maintenance for one person and has no telephone. Additionally, he is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of repaying existing credits on time. They took a loan for a radio or television, amounting to 2753 DM, with savings between 100 and 500 DM. They have been employed for at least 7 years and have a low installment rate. The person is a 35-year-old single male with a co-applicant. They have been living in their own home for 4 years and have no other installment plans. The individual has a car or other property, one existing credit at the bank, and works as a skilled employee or official. They have one person dependent on them and own a telephone registered under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 22-year-old married or widowed male with a stable job, residing in a rented house for the past 4 years. He has a good credit history with one existing credit at the bank and no other debtors or guarantors. His existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. He has been employed for 1 to 4 years and has no other installment plans or telephone. His credit amount is 276 DM, with an installment rate of 4%. He has real estate property and is an unskilled resident with one person to provide maintenance for. Additionally, he is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They took a loan for a radio/television, amounting to 1963 DM. They have savings of less than 100 DM and have been employed for 4 to 7 years. With a 4% installment rate, they are a single male in their early thirties. They have no other debtors or guarantors, reside in a rented house, and have two existing credits at the bank. The individual is a management/self-employed/highly qualified employee/officer with two dependents. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has a status of existing checking account with less than 0 DM balance. They have a good credit history with all credits at the bank paid back duly. The purpose of the credit is for others. The credit amount is 1358. They have unknown or no savings account. The individual has been employed for at least 7 years. Their installment rate in percentage of disposable income is 4. They are a single male. There are no other debtors or guarantors involved. The person has been residing at the current address for 3 years and owns a car or other property not specified. The individual is 40 years old and has other installment plans at stores. They own the house and have one existing credit at the bank. Their job is in management/self-employment/highly qualified employee/officer category. They are responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual has no checking account and unknown savings. They have been employed for 4 to 7 years as a skilled employee/official. The purpose of the credit is a used car. They have no other installment plans or debtors/guarantors. With a credit amount of 4042 and a duration of 24 months, they have a moderate installment rate. They are a single male, 43 years old, living in their own home with one dependent. They have been a customer with the same residence for 4 years and have 2 existing credits at the bank. The individual has a building society savings agreement/life insurance, a registered telephone, and is a foreign worker.###\nHence this label was Yes."
"The individual is a 34-year-old divorced/separated/married female, who has been at her current job as an unskilled resident for 4 to less than 7 years. She has a savings account with less than 100 DM and no other debts or guarantors. She has been residing in her current place for 4 years, living in a house for free. She has one existing credit at this bank and no telephone. She has no property but does have some unknown property. Furthermore, she has a duration in months of 24, with a credit amount of 1837 and an installment rate of 4%. She has all credits at this bank paid back duly and her purpose for credit is education. She has another installment plan at the bank. She is the only person responsible for providing maintenance and she is also a foreign worker.###\nHence this label was No."
"This individual is a 22-year-old married/widowed male who has been working for less than a year as a skilled employee/official. He has a stable credit history with existing credits paid back duly, and currently has a small credit amount of 2039 DM for the purpose of purchasing a radio/television. He has a modest amount of savings and owns a building society savings agreement/life insurance. He lives in his own home and has one existing credit at the bank. Additionally, he has no other debtors/guarantors, installment plans, or dependents. He has had a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account of less than 0 DM, with a credit history of a critical account/other credits existing elsewhere. The purpose of the credit is for a radio/television. They have an unknown/no savings account and have been employed for at least 7 years. The credit amount is 1169 with an installment rate of 4% of disposable income. They are a 67-year-old single male, with no other debtors or guarantors. They have been residing in their own real estate for 4 years. The individual has no other installment plans and no other people to provide maintenance for. They have 2 existing credits at the bank and work as a skilled employee/official. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
