"This individual is a 24-year-old unemployed female who is divorced/separated/married. She has been living in a rented residence for 2 years and has no savings account. She has one existing credit at the bank and no other installment plans. She has been unemployed and unskilled as a non-resident. She does not have a telephone but is a foreign worker. Her credit history shows that she has paid back existing credits duly till now. The purpose of the credit amount of 7472 DM is for a new car. Overall, she is categorized as a credit risk based on these attributes.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee/official, aged 35. He has been living in his own home for 3 years and has been employed for 4 to 7 years. Despite having no savings account, he has a good credit history of paying back existing credits duly. He is responsible for providing maintenance for one person and has one ongoing credit at the bank. With a moderate installment rate, he is seeking credit for furniture/equipment amounting to 3976 DM for a duration of 21 months. He has no other debtors or guarantors, no other installment plans, and owns a car or other property. Additionally, he has a telephone registered under his name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying back existing credits on time. They took a loan of 2073 DM for the purpose of purchasing a radio/television. They have savings between 100 to 500 DM and have been employed for 1 to 4 years. The installment rate is 4% of disposable income. They are a 28-year-old divorced/separated/married female, with a co-applicant as another debtor/guarantor. They have been living in their current residence for 2 years and own real estate. They have one other credit at the bank, work as a skilled employee/official, and have one dependent. They do not have any other installment plans, own a telephone, and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and an unknown or nonexistent savings account. They have been employed for at least 7 years in a management or highly qualified position. The purpose of the loan is to buy a new car, with a credit amount of 13756. Despite having no property, they live in free housing and have been at the same residence for 4 years. The individual is a 63-year-old single male with no other debtors or guarantors, and no other people to provide maintenance for. They have one existing credit at this bank, and their installment rate is 2% of disposable income. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has been repaying existing credits on time. They took a loan for a radio/television and have savings between 100 and 500 DM. They have been employed for over 7 years and have a moderate installment rate. The person is a single male with a co-applicant, living in their own residence for 4 years. They own a car or other property and have no other installment plans. With one existing credit at the bank, they are a skilled employee in a stable job. The individual is 35 years old, with one dependent, and has a telephone registered in their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 27-year-old divorced/separated male, working as a skilled employee/official. He has been living in his current residence for 4 years and owns his own home. With a duration of 36 months, he took a credit amount of 2820 DM for a new car. His existing checking account balance is between 0 and 200 DM, and he has less than 100 DM in savings. He has no other debts, no other installment plans, and no telephone. He has 2 existing credits at the bank and 1 person dependent on him for maintenance. Additionally, he has a good credit history, a low installment rate, and is a foreign worker.###\nHence this label was No."
"The individual does not have a checking account and has a good credit history with existing credits paid back on time. They are taking a 24-month loan to purchase a radio/television with a credit amount of 2284. Their savings are less than 100 DM and they have been employed for 4 to 7 years. The installment rate is 4% of their disposable income. They are a 28-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. They have no other installment plans and no other people to provide maintenance for. They have a skilled job and a registered telephone under their name. They are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with balance less than 0 DM and a history of delayed payments. They are taking out a loan for a new car, totaling 4870 DM. They have some savings below 100 DM and have been employed for 1 to 4 years. Their disposable income installment rate is 3%. The individual is a 53-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and have unknown or no property. They have no other installment plans and live in a free housing arrangement. The individual is a skilled employee with 2 existing credits at the bank. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are a foreign worker in the country.###\nHence this label was No."
"This individual is a 28-year-old married/widowed male who is currently unemployed. They have been residing in their own home for 2 years. With a good credit history and 2 existing credits at the bank, they are deemed a good credit risk. They are looking to purchase a new car with a credit amount of 5234 DM. Being a skilled professional in management/self-employment, they have a stable financial situation despite having no income at present.###\nHence this label was No."
"This individual has no checking account and has never taken any credits or has always paid them back on time. They are looking to purchase furniture/equipment and need a credit amount of 2759. Their savings are less than 100 DM and they have been employed for more than 7 years. They have a low installment rate on their disposable income and are a single male. They have no other debtors or guarantors, have been residing in their current location for 4 years, and own their housing. They have 2 existing credits at the bank, work as a skilled employee/official, and have one person they are financially responsible for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are borrowing money for a radio/television, with a credit amount of 3059. They have significant savings of at least 1000 DM and have been employed for 4 to 7 years. Their personal status is a divorced/separated male, with no other debtors or guarantors. They have been living in their current residence for 4 years and own real estate. At 61 years old, they have a low installment rate in terms of disposable income. They have no other installment plans, no telephone, and are a foreign worker. With only one existing credit at the bank and being liable for one person's maintenance, they work in an unskilled resident job.###\nHence this label was Yes."
"This individual is a male, single skilled employee who has been with the same employer for over 7 years. He currently resides in his own home and has been at the same address for 4 years. He has no existing debtors or guarantors and does not have a telephone. He has 2 existing credits at the bank and has paid back all previous credits duly. He has no savings account and receives a monthly credit amount of 754 DM. His installment rate is 4% of his disposable income. He has no other installment plans and is responsible for providing maintenance for one person. Additionally, he has a building society savings agreement/life insurance and is a foreign worker. At 38 years old, he falls into the age category \"unknown/ no savings account\".###\nHence this label was Yes."
"This individual is a 26-year-old unemployed female who is divorced/separated/married. She has no existing checking account and unknown/ no savings account. She has one existing credit which has been paid back duly. The purpose of her credit is for a used car. She has a building society savings agreement/life insurance as property and rents her housing. She has a installment rate of 2% of disposable income and one person who is liable to provide maintenance for. She works in a management/self-employed/highly qualified employee/officer position. She has a telephone registered under her name and is a foreign worker.###\nHence this label was Yes."
"The individual has a good credit history with all previous credits paid back duly. They have a stable income of 4-7 years, work as a skilled employee, and have a single existing credit at this bank. The purpose for the credit is for business, with a credit amount of 7685 DM. They have savings of less than 100 DM and no other installment plans. The individual is a divorced/separated/married female, with a guarantor for other debtors. They have been living in their current residence for 4 years and are 37 years old. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"The individual has a checking account with less than 0 DM balance and has a good credit history of repaying loans on time. They are seeking a loan for repairs, with a credit amount of 11998. They have some savings (< 100 DM) and have been employed for less than a year. The installment rate for the loan is low at 1%, and they are a divorced/separated male. They have no other debtors or guarantors, own their own home, and have unknown/no other property. At 34 years old, they have no other installment plans and work as an unskilled resident. They have one existing credit at the bank and one person dependent on them for maintenance. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a single male, aged 36, with a good credit history of paying back all credits at the bank duly. He has a checking account with less than 0 DM, savings of less than 100 DM, and has been employed for less than a year. His purpose for the credit is for a radio/television. He has no property, lives in a free housing, and has one co-applicant. He has one existing credit at the bank, works in a managerial position, and has a telephone registered under his name. Additionally, he has one person he is liable to provide maintenance for and is a foreign worker.###\nHence this label was Yes."
"The individual has a status of existing checking account of less than 0 DM and has a credit history of delays in paying off in the past. They are taking out a loan for a new car, with a credit amount of 1333. They have savings of less than 100 DM and are currently unemployed. Their installment rate is 4% of disposable income. The individual is a single male, aged 43, with no other debtors/guarantors. They have been living in their current residence for 2 years and own real estate. They have no other installment plans and live in a housing unit for free. The individual is a skilled employee/official with 2 existing credits at the bank. They are responsible for providing maintenance for 2 people and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, has a good credit history with existing credits paid back duly, and is looking for a loan to purchase a radio/television. They have savings of less than 100 DM and have been employed for less than a year. With a low installment rate, they are a married/widowed male, with no other debtors or guarantors. They have been living in their current residence for 2 years, own real estate, and are 27 years old. They have no other installment plans, no telephone, and are not a foreign worker. They have a stable job as a skilled employee/official and are responsible for providing maintenance for one person.###\nHence this label was Yes."
"The individual has no existing checking account and has been paying back their credits on time. They took a loan for a radio/television and have savings of less than 100 DM. They have been employed for 1 to less than 4 years and have a low installment rate. The individual is a 32-year-old single male with no other debtors or guarantors. They own real estate and have been living at their current residence for 2 years. The individual has one existing credit at this bank and works as a skilled employee/official. They are liable for providing maintenance for 2 people, do not have any other installment plans, and own their housing. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual is a single male, aged 30, with no checking account. They have been employed for 1 to 4 years and have one existing credit at the bank. Their credit history shows that they have paid back previous credits on time. The purpose of their current credit is for a radio/television, with a credit amount of 707. They have savings of less than 100 DM and own real estate for housing. They have no other debtors or guarantors, no telephone, and are a skilled employee/official. They have been residing at their current residence for 2 years, have a 4% installment rate based on disposable income, and have one person they are liable to provide maintenance for. Additionally, they have another installment plan with the bank and are a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has a critical credit history with other credits at different banks. They are looking to finance furniture/equipment with a credit amount of 4526. They have savings of at least 1000 DM and have been employed for less than a year. Their installment rate is 4% of disposable income.\nThe individual is a 32-year-old single male, residing in their own real estate property for 2 years. They have 2 existing credits at this bank and work as an unskilled resident. They have 2 people they are financially responsible for.\nThey have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account, with a history of delay in paying off debts. They are seeking credit for educational purposes and require a significant amount of money. They have some savings but not a large amount. They have been employed steadily for a few years and have a low installment rate. The individual is a single male in their early thirties with no other debtors or guarantors. They have been living in their current residence for a few years and have no property of their own. They have a stable job as a skilled employee with no other installment plans. They rent their housing and have one existing credit at their bank. They are responsible for providing maintenance for one person and have a telephone registered in their name. They are also a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has had a critical account/other credits at a different bank. They are taking out a loan for a radio/television purchase, with a credit amount of 1360. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have a single male personal status, no other debtors or guarantors, and have been living at their current residence for 2 years. Their property includes a building society savings agreement/life insurance. At 31 years old, they have no other installment plans, own their own home, and have 2 existing credits at this bank. They are a skilled employee/official with 1 person to provide maintenance for. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 61-year-old single male, with a stable job in management/self-employment/highly qualified employee/officer, having been employed for over 7 years. He has no existing credits at the bank, lives in a free housing arrangement, and has no debts or guarantors. He has a good credit history with no previous credits taken or any defaults. His savings are less than 100 DM. He has been living at his current residence for 4 years and has 1 person dependent on him for maintenance. He has a registered telephone and is a foreign worker. His credit amount is 1953, with an installment rate of 4%, and the purpose of the credit is for business.###\nHence this label was No."
"This individual is a 26-year-old divorced/separated/married female, working as a skilled employee/official. She has a good credit history with existing credits paid back duly. She has a moderate credit amount of 9960 DM for furniture/equipment, with savings of less than 100 DM. She has been residing in her own house for 2 years and has a stable job for less than a year. She is financially responsible, with only one existing credit at the bank and no other debtors/guarantors. She has a low installment rate in percentage of disposable income, no other installment plans, and one person depending on her for maintenance. She owns a car or other property and has a registered telephone under her name. Despite being a foreign worker, she is considered a good credit risk.###\nHence this label was No."
"This individual is a female who is divorced/separated/married, aged 33, with no checking account and unknown/no savings account. She has been employed for 4 to less than 7 years in an unskilled-resident job, and has been living in her current residence for 4 years. She is looking to borrow a credit amount of 2186 for the purpose of furniture/equipment. She has one existing credit at the bank, with no other debtors or guarantors. She has no telephone, but is a foreign worker. Her installment rate in percentage of disposable income is 1, and she has a single person to provide maintenance for. Her property is real estate, and she has a bank installment plan. She lives in a rented house and is considered to be a good credit risk based on her existing history of paying credits back duly.###\nHence this label was Yes."
"This individual has no checking account and has a stable employment history of at least 7 years. They have successfully paid back existing credits and are seeking a loan for a radio/television. With a credit amount of 3430 and savings of 500-1000 DM, they have a low installment rate and own their own home. A single, 31-year-old male, they have no other debtors or guarantors and no other installment plans. They have one existing credit, a skilled job, and two dependents. Their living situation is stable, with 2 years at their current residence. They have a registered telephone and are a foreign worker.###\nHence this label was Yes."
"The individual in this example has a good credit history with all previous credits paid back duly. They have a stable income, have been employed for over 7 years, and hold a management or highly qualified job. The individual is a 60-year-old divorced or separated female, living in a residence for free. They have savings between 100 and 500 DM and no other significant assets. The individual has two existing credits at the bank, a large credit amount of 14782 DM, and a good credit score, making them a potentially low credit risk.###\nHence this label was No."
"This individual has no checking account and unknown savings. They have held their current employment for less than a year and live in their own home. They are a single male, aged 54, with no other debtors. They have one existing credit, are a skilled employee, and have one person to provide maintenance for. They have no telephone and are a foreign worker. Their credit history shows that they have paid back existing credits on time. The purpose of their credit is for a new car, with a credit amount of 2255 to be repaid over 24 months at an installment rate of 4%. Their property is under a building society savings agreement or life insurance.###\nHence this label was Yes."
"This individual has no checking account and no previous credits taken. They are looking to use a car (used) and need a credit amount of 9436. They have unknown savings and have been employed for 1 to 4 years. With a low installment rate and owning their own home, they have no other debtors or installment plans. A male, single, unskilled resident with no telephone, they have one existing credit at a bank. With a moderate age of 39, they have been residing in their current home for 2 years and have a building society savings agreement. Additionally, they have 2 people to provide maintenance for and are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has had a critical credit history in the past. They took a loan of 1224 for a new car, and have savings of less than 100 DM. Currently employed for 1 to 4 years, with a 3% installment rate. The individual is a 30-year-old single male, living in their own real estate. They have 2 existing credits at the bank and work as a skilled employee. They are the sole provider for one person and do not have any other installment plans. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account and has a credit history of delayed payments in the past. They are looking to finance a used car with a credit amount of 8613. They have savings equal to or greater than 1000 DM. The individual has been employed for 1 to less than 4 years with an installment rate of 2% of disposable income. They are a single male, have no other debtors or guarantors, and have been residing in their current place for 2 years. They own a car or other property not specified in the attributes. At the age of 27, they have no other installment plans, own their house, and have 2 existing credits at the bank. The individual is a skilled employee/official with one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual does not have a checking account and has a critical credit history with other existing credits. They took a loan for a radio/television, amounting to 1800 units. Their savings are less than 100 DM and they have been employed for 1 to 4 years. With an installment rate of 4%, the person is a single male with no other debtors. They have been residing at their current place for 2 years and own a car. At the age of 24, they have no other installment plans and no telephone. The individual is a skilled employee with 2 existing credits at the bank and is responsible for one person's maintenance. They are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has existing credits paid back duly. They are borrowing money to buy a new car, with a credit amount of 5324. They have savings between 500 and 1000 DM. The individual has been employed for over 7 years and has a low installment rate. They are female, divorced/separated/married, and have no other debtors or guarantors. They have been residing at their current residence for 4 years and have unknown or no property. The individual is 35 years old, has no other installment plans, and lives in a free housing situation. They have one existing credit at the bank, a skilled job, and one person depending on them for maintenance. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual is a single male with a stable job as a skilled employee, having worked at the same place for 4 to 7 years. He owns a car or other property, and has been living in his current residence for 2 years. With a good credit history of always paying back loans on time, he is seeking a loan for business purposes. He has a moderate amount of savings and a small credit amount of 3566 DM. He has no other debts or guarantors, no other installment plans, and no telephone. Despite having only one existing credit at the bank, he is financially responsible, as indicated by his low installment rate relative to his disposable income. In addition, he is a foreign worker with one person dependent on him for maintenance.###\nHence this label was Yes."
"This individual is a divorced/separated/married female, aged 22, with a steady job as a skilled employee/official. She has been living in her current residence for 4 years and has no telephone. She has a good credit history with all credits at the bank paid back duly. Her existing checking account has less than 0 DM, and she has a savings account/bonds with less than 100 DM. The purpose of her credit is for a used car, with a credit amount of 3632. She has no other debtors/guarantors and one existing credit at the bank. She has no other installment plans, but has a guarantor. Her housing is rented and she has one person she is liable to provide maintenance for. Additionally, she does not have a foreign worker status.###\nHence this label was Yes."
"The individual has no checking account and has a credit history of paying back existing credits on time. They are seeking a loan for furniture/equipment, with a credit amount of 1123. Their savings amount is between 500 and 1000 DM, and they have been employed for 1 to 4 years. The installment rate is 4% of disposable income. The individual is a female, divorced/separated/married, living in rented housing with no other debtors or guarantors. They have been at their current residence for 4 years and are 29 years old. They have no other installment plans and one existing credit at the bank. The individual is in an unskilled-resident job, with one person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has no checking account and a critical credit history with existing credits at other banks. They are seeking a loan for education, amounting to 1532 DM. They have savings between 100 and 500 DM, employed for 1 to 4 years, and have a moderate installment rate. The applicant is a 31-year-old divorced/separated/married female, with no other debtors or guarantors. They have been residing in their own home for 3 years, possess a car or other property, and have no other installment plans. The individual is a skilled employee/official with one existing credit at the bank and is liable for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has a credit history of consistently paying back existing credits. They are requesting credit for a radio/television and the credit amount is 2315. Their savings account/bonds are less than 100 DM and they have been employed for over 7 years. They have a low installment rate in percentage of disposable income and are single male. There are no other debtors or guarantors involved. They have been residing in their current residence for 4 years and own real estate. At the age of 52, they have no other installment plans and their housing situation is 'own'. They have 1 existing credit at the bank, work as an unskilled resident, and are responsible for providing maintenance for 1 person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual does not have a checking account but has existing credits paid back duly. They are looking to take out a new car loan, with a credit amount of 672. Their savings are less than 100 DM. Currently unemployed, they have been residing at the same place for 4 years and own real estate. A divorced/separated/married female, aged 54, they have no other debtors or guarantors. They have no other installment plans, one existing credit at the bank, and are unemployed/unskilled. They are responsible for providing maintenance for one person and have a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and an unknown/no savings account. They have been employed for 1 to less than 4 years as a skilled employee/official. The purpose of their credit is for a radio/television. They have 2 existing credits at the bank and have been living in their current residence for 3 years. The individual is a 29-year-old single male, owning their own house, with no other debtors/guarantors. They have no other installment plans, are registered to a telephone, and are a foreign worker. The credit amount is 1169, with an installment rate of 4% of disposable income. They have a building society savings agreement/life insurance as property and are liable to provide maintenance for one person.###\nHence this label was Yes."
"This individual has a checking account with less than 0 Deutsche Mark balance, has a good credit history with all credits paid back on time. They are looking to use a loan of 2149 DM for the purpose of purchasing a radio/television. Their savings account balance is below 100 DM. They have been employed for 1 to 4 years, with an installment rate of 4% of disposable income. The individual is a 29-year-old divorced/separated male, with no other debtors or guarantors. They have been living in their current residence for 1 year and do not own any property. They have no other installment plans, live in a house for free, and have a skilled job with 1 existing credit at the bank. They are liable for providing maintenance to one person, do not have a telephone, and are a foreign worker.###\nHence this label was No."
"This individual has a status of existing checking account with a balance between 0 and 200 DM. They have a credit history of delaying payments in the past and are looking to purchase a radio/television. The credit amount they are requesting is 6403 DM. Their savings amount is less than 100 DM and they have been employed for less than a year. They have a low installment rate relative to their disposable income. This person is male, single, and has no other debtors or guarantors. They have been residing in their current residence for 2 years and own their own home. At 33 years old, they have no other installment plans and have one existing credit at their bank. They are a skilled employee/official with one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account, is unemployed, single male, and has no savings account. They have a good credit history with existing credits paid back duly. The purpose of the credit is for retraining. They own a property, have one existing credit at the bank, and are liable to provide maintenance for two people. The individual is 36 years old, has been living at their current residence for 4 years, and has a job in management/self-employment/highly qualified employee/officer category. They have a telephone registered under their name and are a foreign worker. The credit amount is 1238 with an installment rate of 4% of disposable income. They have no other debtors/guarantors, other installment plans, or any additional information provided.###\nHence this label was Yes."
"The individual has no existing checking account and has been employed for 4 to 7 years. They are applying for credit to purchase a radio/television and have a credit history of critical accounts or other existing credits. They have savings of under 100 DM and own a car or another type of property not specified. The individual is a 38-year-old single male, with a co-applicant as another debtor. They have one existing credit at the bank, no other installment plans, and own their own home. The individual is a skilled employee or official, with one dependent. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a divorced or separated female, aged 34, with a credit history of always repaying credits, currently employed for 4 to 7 years in an unskilled resident job. She has no other debtors or guarantors, no telephone, and no property or known savings. She resides rent-free, has one existing credit at the bank, and is responsible for providing maintenance for one person. She is seeking credit for education purposes, with a credit amount of 1837 DM to be repaid in 24 months at an installment rate of 4%.###\nHence this label was No."
"This individual is a 22-year-old married/widowed male, working as a skilled employee/official with less than 1 year of employment. They have existing credits paid back duly, with one ongoing credit at the bank for furniture/equipment. The credit amount is 3832 DM and their savings amount is less than 100 DM. They reside in their own home for 1 year, with no other debtors/guarantors or installment plans. They have no telephone and are responsible for one person's maintenance. Additionally, they have a building society savings agreement/life insurance and are a foreign worker.###\nHence this label was Yes."
"The individual has a status of existing checking account less than 0 DM, with a duration in month of 36. They have a good credit history, with existing credits paid back duly till now, and are unemployed. The purpose of the credit is for others, with a credit amount of 15857 DM and savings account/bonds less than 100 DM. They have a low installment rate in percentage of disposable income, and their personal status is a male who is divorced/separated. They have a co-applicant as other debtors/guarantors, with a present residence since 3 years and own a car or other property. The individual is 43 years old, with no other installment plans, and owns their house. They have one existing credit at this bank, a job in management/self-employed/highly qualified employee/officer role, and are liable for providing maintenance for one person. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account with less than 0 DM balance, a credit history of paying back all credits at the bank duly, and has been employed for at least 7 years. They are a single male, 40 years old, with no other debtors or guarantors. They have a car or other property, no savings account, and own their housing. Their credit amount is 1358 with an installment rate of 4%. They have one existing credit at the bank and work in a management or highly qualified job. They have been living at their current residence for 3 years, have no other installment plans, and have a telephone registered under their name. They also have no other people to provide maintenance for and are a foreign worker.###\nHence this label was No."
"This individual is a 22-year-old single male with a steady job as a skilled employee. He has been living in his own real estate property for 2 years. His existing checking account balance is between 0 and 200 DM, and he has savings between 100 and 500 DM. He has a good credit history with existing credits paid back duly. The purpose of his credit is for repairs, amounting to 1514 DM. He has no other installment plans and no telephone. He has one existing credit at the bank and no other debtors or guarantors. He has no one else to provide maintenance for and is a foreign worker.###\nHence this label was Yes."
"The individual is a single male in his early 20s, working in a management or self-employed role. He has been at his current job for 1 to 4 years and has 2 people he is financially responsible for. He has a good credit history with existing credits paid back on time. He is renting a place to live, has a small amount of savings, and a low installment rate on his disposable income. He has no other debtors or guarantors, and no other installment plans. He has a telephone registered in his name and is a foreign worker. Overall, he has one existing credit at the bank and is requesting credit to purchase a radio or television.###\nHence this label was Yes."
"This individual is a 23-year-old divorced/separated/married female, working as a skilled employee/official with less than 1 year of employment at their current job. They do not have a checking account but have a savings account with less than 100 DM. They have paid back existing credits duly, have no other debtors/guarantors, and live in a rented house with 4 years of residence. The purpose of the credit is for domestic appliances, with a credit amount of 1236 and an installment rate of 1% of disposable income. They have no other installment plans, own real estate, and have 1 existing credit at this bank. They have 1 dependent and a registered telephone under their name. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account of less than 0 DM. They have a good credit history with existing credits paid back duly. The purpose of the credit is for furniture/equipment. The credit amount is 1262. They have no savings account or bonds. They have been employed for at least 7 years. The installment rate is 2% of disposable income. The individual is a divorced/separated male. They have no other debtors or guarantors. They have been residing at their current residence for 4 years. Their property is a building society savings agreement or life insurance. The individual is 49 years old, with no other installment plans, and owns their own home. They have 1 existing credit at this bank. Their job is unskilled-resident. They are liable to provide maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual is a 49-year-old divorced/separated/married female, who has been employed for over 7 years as a skilled employee/official. She has a checking account with less than 0 DM, savings of less than 100 DM, and owns a building society savings agreement/life insurance property. She has one existing credit at the bank, with a credit history of paying back existing credits duly. The purpose of the credit is for furniture/equipment, with a duration of 6 months and a credit amount of 428. She has no other debtors/guarantors, one person to provide maintenance for, and a telephone registered under her name. She has a low installment rate, and her housing status is \"own.\" Additionally, she has another installment plan at the bank and is a foreign worker.###\nHence this label was Yes."
"This individual has a status of existing checking account less than 0 DM and has no history of taking credits or has paid back all credits duly. They are seeking a loan for a business purpose. With a credit amount of 11816 DM and savings of less than 100 DM, they have been employed for at least 7 years. Their personal status is a single male, aged 29, with no other debtors or guarantors. They have been residing at their current residence for 4 years, own a car or other property, and have no other installment plans. They live in a rented house, hold a skilled job as an employee or official, and have 2 existing credits at the bank. They are responsible for providing maintenance for one person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was No."
"This individual has a steady income with a checking account balance of 0 to 200 DM. They have a good credit history, with existing credits paid back on time. The purpose of the loan is for a new car. They have savings of less than 100 DM and have been employed for at least 7 years. With a moderate installment rate, they are a single male. There are no other debtors or guarantors involved. They have been living at their current residence for 4 years and own a car or other property. At 41 years old, they have one existing credit at the bank and work in an unskilled resident job. They are responsible for providing maintenance for 2 people and do not have a telephone. As a foreign worker, they are seeking a loan from the bank for a new car.###\nHence this label was No."
"This individual is a 40-year-old skilled female employee who is divorced/separated/married. She has been with her current employer for 4 to 7 years and has been living in her current residence for 4 years. She does not have any other debtors/guarantors, other installment plans, or a telephone. She holds a real estate property, pays a rent, and has a savings account with less than 100 DM. She has one existing credit at the bank and is responsible for providing maintenance for one person. She has no foreign worker and has a good credit history of paying back existing credits duly. The purpose of her recent credit is furniture/equipment, and the credit amount is 3001 DM.###\nHence this label was Yes."
"This individual has a moderate amount of money in their existing checking account. They have a good credit history with no previous credits and all payments made on time. The purpose of the credit is for business. The credit amount is 4241 DM. They have some savings, but less than 100 DM. They have been employed for 1 to 4 years. The installment rate is low, at 1%. The individual is a 36-year-old single male. They have no other debtors or guarantors. They have been living at their current residence for 4 years and own real estate. They have no other installment plans or housing loans. They have 3 existing credits at the bank and work as an unskilled resident. They are responsible for providing maintenance for 1 person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a female who is divorced, separated, or married, aged 21. She has no checking account and no savings account. She has been employed for 1 to less than 4 years as a skilled employee/official. She lives in her own home with a 2-year residence. She has one existing credit at the bank and no other debts or guarantors. She is responsible for the maintenance of one person. She does not have any other installment plans or a telephone. She is a foreign worker. The credit history indicates that she has paid back existing credits duly. The purpose of the credit amount of 886 is for radio/television.###\nHence this label was Yes."
"The individual in this data does not have a checking account and has a history of being delayed in paying off debts. They are seeking a car loan, specifically for a used car. The credit amount requested is 2993. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. The installment rate is 3% of disposable income. The individual is a 28-year-old single male, with no other debtors or guarantors. They have been residing in their current residence for 2 years and own real estate. Their job is described as unskilled-resident and they have one person for whom they provide maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account balance of less than 0 DM and has had it for 6 months. They have a critical credit history with other existing credits not at this bank. The purpose of their credit is for a radio/television. The credit amount is 1957 DM. They have savings of less than 100 DM, have been employed for 4 to 7 years, and have a low installment rate on disposable income. The individual is a divorced, separated, or married female. They have no other debtors or guarantors. They have been residing in their current residence for 4 years and own a car or other property. The individual is 31 years old, has no other installment plans, and owns their own home. They have one existing credit at this bank and work as a skilled employee/official. They provide maintenance for 1 other person and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old single male with no checking account and unknown savings. He has been employed for less than a year in a skilled position. His credit history shows existing credits paid back on time. The purpose of his credit is for a radio or television purchase. He lives in his own home and has been at his current residence for 2 years. He has 2 existing credits at the bank and no other installment plans. He has no other debtors or guarantors and no telephone. As a foreign worker, he is responsible for one dependent.###\nHence this label was Yes."
"This individual has no checking account and a history of delaying payments. They are taking out a loan for a radio/television, with a credit amount of 12749. They have savings between 500 and 1000 DM and have been employed for 4 to 7 years. Their installment rate is 4% of disposable income. They are a single male, with no other debtors or guarantors. They have been living in their current residence for 1 year and own a car or other property. At the age of 37, they have no other installment plans and no other existing credits at the bank. They have a high-status job and are responsible for one other person's maintenance. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and an existing credit history with payments made on time. They are looking to finance a new car with a credit amount of 2662. They do not have a savings account and have been employed for 4 to less than 7 years. The installment rate for disposable income is 4%. The individual is a single male, debt-free, owning their own home, and has a building society savings agreement/life insurance. They are 32 years old, have no other installment plans, and have been living at their current residence for 3 years. They are a skilled employee with one existing credit at the bank and provide maintenance for one person. They do not have a telephone and are not a foreign worker.###\nHence this label was Yes."
"This individual has a stable financial standing with over 200 DM in their existing checking account and savings of over 1000 DM. They have a good credit history, all credits at their bank have been paid back duly. The purpose of their credit request is for a radio/television. They have been employed for 1 to less than 4 years as a skilled employee/official. With no other debtors or guarantors, they live in a rental property with 3 dependents and are financially responsible for one person. At the age of 42, they have two existing credits at their bank and have no other installment plans or telephone. As a foreign worker, they present a stable and reliable profile for potential creditors.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has been employed for over 7 years. They have a critical credit history with existing credits at other institutions, but none at the current bank. The purpose of the loan is for furniture/equipment, with a credit amount of 3617. They have unknown savings and own no property. Their personal status is a single male, with a co-applicant as a debtor/guarantor. They have been living in their current residence for 4 years, renting their housing. At 20 years old, they are a skilled employee/official with no other installment plans. They have 2 existing credits at the bank and are responsible for one person's maintenance. The individual does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a good credit history with existing credits paid back on time. They are taking a 36-month loan for a used car, with a credit amount of 4686 DM. Their savings are below 100 DM and have been employed for 1 to less than 4 years. They have a low installment rate, are male and single, and have no other debtors or guarantors. They have been living in their current residence for 2 years and have unknown/no property. At the age of 32, they have no other installment plans, live in a house for free, and have one existing credit at the bank. They hold a management/self-employed/highly qualified job, with one person dependent on them for maintenance. They have a telephone registered under their name, and are a foreign worker.###\nHence this label was Yes."
"The individual has a status of existing checking account less than 0 DM, with a credit history of repaying existing credits on time. They are taking a loan for furniture/equipment, amounting to 2577. Their savings account holds less than 100 DM. The individual has been employed for 1 to 4 years and has a low installment rate. They are a divorced/separated male, with no other debtors or guarantors. They have been residing in their own property for 1 year and are 42 years old. They have no other installment plans or debts, and are a skilled employee/official. They are responsible for one person's maintenance and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual has less than 0 DM in their checking account. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a used car. The credit amount is 6579. They have savings of less than 100 DM and are currently unemployed. The installment rate is 4% of disposable income. The individual is a single male, aged 29, with no other debtors or guarantors. They have been living for 2 years in a place with no property, and their housing is free. They have one existing credit at the bank and work in a management/self-employed/highly qualified role. They have one person they are financially responsible for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has a credit history of consistently paying back existing credits. They are looking to finance furniture/equipment with a credit amount of 2251. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. They have a low installment rate in percentage of disposable income and are a female who is divorced/separated/married. They have no other debtors or guarantors, have lived at their current residence for 2 years, and own a car or other property. At 46 years old, they have no other installment plans and live in their own home. They have one existing credit at the bank and work as an unskilled resident. They are responsible for providing maintenance for one person and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 58-year-old divorced or separated or married female who has been in her current job for 4 to 7 years. She has a checking account with less than 0 DM, savings of less than 100 DM, and owns real estate. She has no other debtors or guarantors, no other installment plans, and lives in her own home for the past 3 years. She has 4 existing credits at the bank and is an unskilled resident with one person to provide maintenance for. She has a telephone registered under her name, is a foreign worker, and is looking to borrow credit for a radio or television purpose with a credit amount of 385 for a duration of 12 months at an installment rate of 4%.###\nHence this label was Yes."
"The individual is a 23-year-old female who is divorced/separated/married, with a present residence duration of 4 years. She has a job as an unskilled resident and has been employed for less than a year. She has a co-applicant as another debtor/guarantor and no other installment plans. She lives in a rented house with a telephone registered under her name. She has a savings account with less than 100 DM, and her existing checking account is less than 0 DM. She has 2 existing credits at the bank and is liable to provide maintenance for 1 person. She is a foreign worker and her credit history shows critical account/other credits existing elsewhere. The purpose of her credit application is for furniture/equipment, and the credit amount requested is 6229.###\nHence this label was No."
"The individual in this data is a 27-year-old divorced/separated/married female with a stable job (>= 7 years) as an unskilled resident. She has a good credit history despite experiencing delays in paying off debts in the past. She is looking to purchase furniture/equipment and has a moderate credit amount of 3643. She has savings of less than 100 DM and has been residing in her own home for 4 years. She has no other debtors/guarantors, installment plans, or telephone, but is a foreign worker. With two existing credits at the bank and one person to provide maintenance for, she appears to be a responsible individual with a modest financial profile.###\nHence this label was Yes."
"This individual has a checking account with less than 0 DM, has been repaying existing credits on time, and is looking to finance a new car. They have a moderate credit amount of 1207 and savings of less than 100 DM. Currently employed for less than a year, they have a low installment rate of 4% and are female, divorced/separated/married. There are no other debtors/guarantors, and they have been living at their current residence for 4 years. Their property includes a building society savings agreement/life insurance. At 24 years old, they have no other installment plans, live in a rented house, and have one existing credit at this bank. They hold a skilled job and are responsible for one person's maintenance. The individual does not have a telephone but is a foreign worker.###\nHence this label was No."
"The individual in this example has a checking account balance of at least 200 DM, with a credit history of always paying existing credits on time. They took a loan for a radio/television, amounting to 1126 DM. Their savings fall between 100 and 500 DM, and they have been employed for at least 7 years. With a low installment rate, they are a divorced/separated male, with no other debtors or guarantors. Living in their own real estate property for 4 years, they are 49 years old with no other installment plans. As a skilled employee, they are responsible for one dependent and do not have a telephone. They are also a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 37-year-old single male, working as a skilled employee/official for 4 to 7 years. He has no checking account and an unknown/savings account. He has been paying back existing credits duly and has one credit at the bank. The purpose of the credit is for a radio/television, with a credit amount of 10222. He has been residing in his own house for 3 years and has a telephone registered under his name. He has an installment rate of 4% of disposable income and no other debtors/guarantors. He has no other installment plans, no other people to provide maintenance for, and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a credit history of paying back existing credits on time. They are seeking a loan for education purposes, with a credit amount of 1819. Their savings are less than 100 DM and they have been employed for 1 to 4 years. They have a moderate installment rate and are a single male. There are no other debtors or guarantors involved. They have been living at their current residence for 4 years and have unknown/no property. At 37 years old, they have installment plans with stores and live in housing for free. They have one existing credit at the bank and work as a skilled employee/official. They are responsible for providing maintenance for one person, have a telephone registered under their name, and are a foreign worker.###\nHence this label was No."
"This individual is a male who is divorced or separated, aged 31, and has been employed for 1 to less than 4 years. He has a savings account with less than 100 DM, owns a car or other property, and has no other debtors or guarantors. He has been living in his current residence for 2 years and has one existing credit at the bank. His credit history shows that he has paid back existing credits duly. He is an unskilled resident with no other installment plans and no telephone. He has no one else liable for maintenance and is a foreign worker. His current purpose for credit is furniture or equipment, with a credit amount of 1521 and a duration of 10 months.###\nHence this label was Yes."
"The individual does not have a checking account and has a credit history of a critical account/other credits existing. They are seeking credit for a radio/television purpose and the amount is 1149. They have savings of at least 1000 DM and have been employed for 1 to 4 years. The installment rate is 4% of disposable income.\n\nThe individual is a single male, aged 46, with no other debtors or guarantors. They have been residing in their current residence for 3 years and own real estate. They have no other installment plans, 2 existing credits at the bank, and work as a skilled employee/official. They have one person liable for maintenance.\n\nThey do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a single male, aged 30, with no checking account and existing credits paid back on time. He has been employed for over 7 years in a managerial or self-employed position. His purpose for the credit is for a radio/television, with a credit amount of 2333 DM. He has savings between 500 and 1000 DM and an installment rate of 4% of his disposable income. He has no other debtors or guarantors, owns a car or other property, and lives in his own home for 2 years. He has one existing credit at the bank, no other installment plans, and no telephone. He has one person he is responsible for providing maintenance for and is a foreign worker.###\nHence this label was Yes."
"The individual in this data does not have a checking account and has been in their current employment for at least 7 years. They have a good credit history with existing credits paid back duly. The purpose of the credit is for business, with a credit amount of 7409. They do not have a savings account and do not have any other installment plans or debtors/guarantors. The individual is a 37-year-old single male, living in their own home for 2 years. They have a building society savings agreement/life insurance as property. They are a skilled employee/official with 2 existing credits at this bank. They have one dependent and do not have a telephone. Additionally, they are a foreign worker.###\nHence this label was Yes."
"This individual is a 20-year-old female who is divorced/separated/married. She has been employed for 1 to 4 years as an unskilled resident. She has a checking account with a balance between 0 and 200 DM, savings of less than 100 DM, and a credit history of paying back existing credits duly. The purpose of her loan is for a new car, with a credit amount of 2718. She pays an installment rate of 3% from her disposable income and has no other debtors or guarantors. She has been residing at her current residence for 4 years and lives in a rented house with one other person who she provides maintenance for. She has one existing credit at the bank and no other installment plans. She has a telephone registered under her name and is a foreign worker.###\nHence this label was No."
"This individual has no checking account and a history of delayed payments. They are taking a loan for furniture/equipment with a credit amount of 960. They have savings of >= 1000 DM and have been employed for 4 to 7 years. Their disposable income installment rate is 3% and they are female, divorced/separated/married. They have no other debtors/guarantors and have been living at their current residence for 2 years. Their property includes building society savings agreement/life insurance. At 30 years old, they have no other installment plans, own their own home, and have 2 existing credits at the bank. They are a skilled employee/official with 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 20-year-old female, divorced or separated, with a stable job as a skilled employee or official. She has been living in her current residence for 4 years and has one existing credit at the bank. Her existing checking account balance is less than 0 DM, and she has a credit history of paying back credits on time. She is taking a loan for furniture/equipment, with a credit amount of 1282 DM. She has savings of less than 100 DM and has been employed for 1 to 4 years. Her installment rate is 2% of disposable income, and she has no other debtors or guarantors. She has no other installment plans, lives in a rented house, and has no telephone. She is a foreign worker and is responsible for one person's maintenance.###\nHence this label was No."
"The individual has less than 0 DM in their checking account. They have a good credit history with existing credits paid back on time. The purpose of the credit is for a new car. They have savings of less than 100 DM and have been employed for 4 to 7 years. The installment rate is 2% of their disposable income. The individual is a divorced/separated male. They have no other debtors or guarantors. They have been living at their current residence for 3 years and own a car or other property. The individual is 36 years old with no other installment plans. They live in their own house and have one existing credit at the bank. They have a skilled job and one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a single male, aged 34, with a stable job as an unskilled resident for the past 4-7 years. He has no debts or other people relying on him for financial support. He has been living in his current residence for 4 years, which he owns for free. He has one existing credit at the bank and no other installment plans.\n\nIn terms of finances, he has no existing checking account, but a savings account with 100-500 DM. He has not taken any credits before and has a good credit history of paying back all dues. He is taking a credit amount of 3844 for business purposes and has an installment rate of 4%.\n\nOverall, he seems financially stable, with a steady income and responsible credit behavior.###\nHence this label was No."
"This individual has a stable financial background with a moderate credit history. They are looking to make a relatively small purchase, possibly for entertainment purposes. Despite having a low savings amount, their long-term employment status adds to their creditworthiness. They are a single male in their late forties, owning their own home and having a few existing credits. Overall, they seem like a responsible borrower with a good chance of being a reliable credit risk.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has been repaying existing credits on time. They are taking a loan for a radio/television, with a credit amount of 1258. Their savings amount is between 500 and 1000 DM, and they have been employed for 1 to 4 years. The installment rate for their loan is 3% of their disposable income. They are a female, divorced/separated/married, aged 57. They have no other debtors or guarantors, own their house, and have one existing credit at the bank. Their job is unskilled-resident, with one person dependent on them for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has less than 0 DM in their existing checking account. They have a good credit history with existing credits being paid back on time. The purpose of the credit is for a new car. The credit amount is 759. They have savings of less than 100 DM. They have been employed for 4 to 7 years. The installment rate is 4% of disposable income. They are a 26-year-old single male. There are no other debtors or guarantors. They have been residing at their current location for 2 years and own real estate. They have no other installment plans or debts. They have one existing credit at this bank. The individual is a skilled employee or official. They are responsible for one person's maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual is a 50-year-old single male, working as a skilled employee/official for over 7 years. He has a good credit history with a delay in paying off in the past, seeking a loan of 6224 DM for education purposes. He has no existing debtors or guarantors, no other installment plans, and currently resides for free in an unknown/no property. With only one existing credit at the bank, he has no telephone and is responsible for only himself. Additionally, he has savings of less than 100 DM and no other assets. Despite being a foreign worker, he is considered a good credit risk based on the provided information.###\nHence this label was No."
"This individual has no checking account and has a good credit history with existing credits paid back duly. They are seeking a business loan of 3914 credits for a duration of 48 months. They do not have any savings account. Currently, they have been employed for 1 to 4 years and have a stable income. The installment rate is 4% of their disposable income. The person is a divorced/separated male in their late thirties. They have no other debtors or guarantors. They reside in their own real estate property for 2 years. The individual has one existing credit at the bank and works as a skilled employee/official. They have no dependents to provide maintenance for, do not have a telephone, but are a foreign worker. Their other installment plans involve a bank loan.###\nHence this label was No."
"The individual in this dataset is a 38-year-old single male who has been employed for at least 7 years as a skilled employee/official. He has 0-200 DM in his existing checking account and no savings account. He has paid back existing credits duly, has a good credit history, and owns a property. The purpose of the credit is for a radio/television, with a credit amount of 368. He has no other installment plans or debtors/guarantors. He lives in his own house, has 1 existing credit at the bank, and no other people to provide maintenance for. He has no telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a stable employment history of over 7 years. They have paid back existing credits on time and are looking to borrow money for a new car. They have savings of less than 100 DM and no other significant assets, living in a free housing situation. With a credit amount of 3757, they have a moderate disposable income installment rate of 4%. As a divorced/separated/married female in their 60s with a co-applicant, they have one existing credit at the bank and no other outstanding debts or installment plans. They hold a skilled job, with a single person to provide maintenance for. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 29-year-old single male, working as a skilled employee with 4-7 years of employment history. He has no other debtors or guarantors, owns his own home, and has no other installment plans. He has been living in his current residence for 3 years and has 1 existing credit at the bank. The credit history shows that all credits at this bank have been paid back duly. He is a foreign worker and has no telephone. He has savings between 100 and 500 DM and a checking account balance between 0 and 200 DM. He is looking for a new car and needs a credit amount of 1437 DM. He has a moderate installment rate and is responsible for providing maintenance for one person. His property status is unknown/no property.###\nHence this label was No."
"The individual has a steady existing checking account with less than 0 DM. They have a good credit history with critical accounts and other credits. The purpose of the credit is for a radio/television. The credit amount is 338 DM. They have savings between 500 and 1000 DM and have been employed for over 7 years. The installment rate is 4% of disposable income. The individual is a single male, has no other debtors/guarantors, and has been residing at their current residence for 4 years. They own a car or other property. The individual is 52 years old, has no other installment plans, and owns their own home. They have 2 existing credits at this bank and work as a skilled employee/official. They are liable for providing maintenance for one person and do not have a telephone. They are a foreign worker.###\nHence this label was Yes."
"The individual has no checking account and has a stable employment history of at least 7 years. They have paid back existing credits on time, and their current purpose for credit is education. With a credit amount of 1393 DM and savings below 100 DM, they have a moderate installment rate. The individual is a 47-year-old single male, with no other debtors or guarantors. They own their home and have a building society savings agreement/life insurance. They work as a skilled employee/official, have 3 existing credits at the bank, and provide maintenance for 2 people. The individual has a telephone registered in their name and is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are borrowing money for a radio/television, with a credit amount of 4594. Their savings is less than 100 DM and they have been employed for less than a year. They have a low installment rate relative to their disposable income. The individual is a 32-year-old single male, with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. They have no other installment plans and live in their own home. They have a skilled job and one existing credit at the bank. They are responsible for providing maintenance for one person. They have a telephone registered in their name and are a foreign worker.###\nHence this label was Yes."
"This individual is a 46-year-old divorced/separated/married female who has no checking account and has been employed for less than a year. She has two existing credits at the bank, no other debtors/guarantors, and owns her own house. She has a building society savings agreement/life insurance and less than 100 DM in her savings account/bonds. She has a good credit history with some delay in paying off debts in the past. She took a 3594 DM credit for a used car and has been living in her current residence for 2 years. She has no other installment plans, no telephone, and is an unskilled resident worker. She is liable to provide maintenance for one person and is a foreign worker.###\nHence this label was Yes."
"This individual has no existing checking account and has not taken any credits before, but has paid back all credits duly in the past. They are requesting a loan for repairs, with a credit amount of 2613. They have savings of less than 100 DM and have been employed for 1 to less than 4 years. The installment rate in percentage of disposable income is 4. The individual is a 27-year-old single male, with no other debtors or guarantors. They have been residing in their current residence for 2 years and own a car or other property. They have no other installment plans and their housing status is own. They have 2 existing credits at this bank, are a skilled employee/official, and have 1 person liable for maintenance. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual is a 25-year-old divorced/separated/married female who has been employed for over 7 years as a skilled employee/official. She has a good credit history with existing credits paid back duly till now. She does not have any savings account but owns a car or another property not specified. She lives in her own house for 4 years and has no other debts or guarantors. She has one existing credit at the bank and has no other installment plans. She has no telephone but is a foreign worker. The credit amount she is applying for is 2991 DM for the purpose of purchasing a radio/television.###\nHence this label was Yes."
"The individual is a single male, aged 32, working as a skilled employee/official with 4-7 years of employment history. He has a good credit history with existing credits paid back duly. He has a savings account with less than 100 DM, no other debtors/guarantors, and owns his own house. The purpose of the credit is for education. He has 2 existing credits at the bank and has been living at his current residence for 1 year. He has no other installment plans, no telephone, and no foreign worker. The credit amount is 2273 with a duration of 36 months. He has an installment rate of 3% of disposable income and 2 people liable for maintenance.###\nHence this label was Yes."
"The individual is a 40-year-old married/widowed male, working in an unskilled-resident job for over 7 years. They have a good credit history with existing credits paid back duly. Their existing checking account balance is between 0 and 200 DM, with savings of less than 100 DM. The purpose of the credit is for a radio/television. They own real estate, have 2 existing credits at the bank, and have one person liable for maintenance. They have been living in their current residence for 3 years and have no telephone. Additionally, they have a guarantor for other debtors/guarantors, a 3% installment rate, and have a bank installment plan. They are also a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a history of delaying payments in the past. They are seeking a loan for a business purpose and require 1743 credits. Their savings amount is between 100 and 500 DM. They have been employed for 1 to 4 years and have a low installment rate relative to their disposable income. The individual is a single male residing in a real estate property. They have no other debts or guarantors and have been living at their current residence for 2 years. With two existing credits at the bank, the individual works in an unskilled job and is responsible for one dependent. They do not have a telephone but are classified as a foreign worker.###\nHence this label was Yes."
"The individual has a checking account balance of less than 0 DM and has a credit history of no credits taken or all credits paid back duly. They are seeking credit for a business purpose and the amount requested is 3104. Their savings account/bonds hold less than 100 DM and they have been employed for 4 to 7 years. The individual has a low installment rate, is a single male, and has no other debtors or guarantors. They have been living at their current residence for 1 year and their property includes a building society savings agreement/life insurance. The individual is 31 years old, has installment plans with a bank, owns their housing, and has one existing credit at the bank. They work as a skilled employee/official and have one dependent. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a 25-year-old single male with a steady job as a skilled employee or official. He has been living in his own real estate property for 2 years and has been working at the same place for 4 to 7 years. He has a good credit history with a critical account and other existing credits. His current checking account balance is between 0 and 200 DM, and he has savings of less than 100 DM. He is making regular payments on a credit amount of 4933, with an installment rate of 2% of his disposable income. He has no other installment plans or telephone, but he is a guarantor for other debtors. He has 2 existing credits at the bank and one person to support. Additionally, he is a foreign worker.###\nHence this label was No."
"This individual is a skilled female employee, aged 27, who is divorced/separated/married. She has no savings account and has been employed for less than a year. She lives in a rented house and has been at her current residence for 3 years. She has one existing credit at the bank and no other installment plans. The credit history shows that she has paid back existing credits duly till now. She is responsible for providing maintenance for one person and does not have a telephone. Additionally, she is a foreign worker. In this instance, she is looking for a loan for furniture/equipment, amounting to 1924 DM, with a repayment installment rate of 4% of her disposable income.###\nHence this label was No."
"The individual has a stable financial situation with no existing debt and a good credit history. They have a small loan for domestic appliances and have been repaying their credits on time. They have some savings and have been employed for 1 to 4 years. The monthly installment for the loan is manageable, and they have no other significant debts. They own their own home, have one other credit account, and are a single, 54-year-old male. They are a skilled employee with no other people dependent on their income. They do not have a telephone but are a foreign worker.###\nHence this label was No."
"This individual has a checking account with a balance of at least 200 DM and has been in their current employment for less than 1 year. They have a good credit history, have paid back existing credits on time, and are looking to finance a new car. They have savings of less than 100 DM and live in their own real estate property. They are a 26-year-old single male, employed as a skilled worker, with no other debtors or guarantors. They have one existing credit at the bank, with an installment rate of 4% of their disposable income. They have been residing at their current address for 1 year and have no other installment plans or telephone. They are responsible for providing maintenance for one person and are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They took a loan of 3029 credits for a used car, with savings of less than 100 DM. Currently employed for 4 to 7 years, they have a low installment rate on disposable income. A 33-year-old single male, they have no other debtors or guarantors. Living in their own home for 2 years, they have one existing credit at the bank. As a skilled employee, they are responsible for one person's maintenance. They do not have any other installment plans or a telephone. Being a foreign worker, they have a stable financial profile.###\nHence this label was Yes."
"This individual has a checking account with a balance of less than 0 DM and has successfully repaid previous credits. They are borrowing 3931 DM for a new car. Their savings amount is less than 100 DM and they have been employed for 4 to 7 years. The installment rate is 4% of their disposable income. The individual is a 46-year-old single male with no other debtors or guarantors. They have been living in their current residence for 4 years and have no property. They have no other installment plans and live in a free housing. The individual is a skilled employee with one existing credit at the bank. They have 2 dependents and do not have a telephone. They are a foreign worker.###\nHence this label was No."
"The individual does not have a checking account and has been employed for more than 7 years. They are looking to purchase a radio/television and have a credit amount of 1655. Their savings are less than 100 DM and they live in their own real estate property. The individual is a 63-year-old single male with no other debtors or guarantors. They have been living at their current residence for 4 years and have two existing credits at the bank. The individual works as an unskilled resident and is responsible for providing maintenance for one person. They have a telephone registered under their name and are a registered foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a good credit history with existing credits paid back on time. They are looking to purchase a radio/television and require a credit amount of 2397. They have savings between 500 and 1000 DM. The individual has been employed for at least 7 years and has a low installment rate in relation to their disposable income. They are a 35-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and own a car or other property. The individual has a stable job as a skilled employee/official and is responsible for providing maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a married/widowed male in his late 20s with a stable job, having been employed for 1 to 4 years. He has one existing credit at the bank and has paid back existing credits on time. He does not have any savings account but owns a car or other property. With no other debtors or guarantors, he resides in his own house with one dependent. He has no other installment plans, does not have a telephone, and is a foreign worker. The purpose of his credit is for education, and the credit amount is 3711 DM with a duration of 36 months.###\nHence this label was Yes."
"The individual in this example is a 42-year-old divorced or separated or married female who has been employed for 1 to less than 4 years as a skilled employee/official. She has a good credit history with no outstanding credits, and currently has a checking account balance between 0 and less than 200 DM. She is looking to take a loan of 3804 DM for the purpose of radio/television. She has savings of less than 100 DM and owns her own house. She has no other debts or guarantors, no other installment plans, and no other people relying on her financially. She has one existing credit at a bank, pays a 4% installment rate, and has a telephone registered in her name. Additionally, she is a foreign worker.###\nHence this label was No."
"The individual is a 23-year-old single male with a skilled job, owning a house and having been at their current residence for 1 year. They have no savings account, no other debtors/guarantors, and no other installment plans. The individual has been employed for less than 1 year and has no telephone. They have 1 existing credit at the bank and have paid back existing credits duly till now. They are a foreign worker with no specified existing checking account balance, seeking a credit amount of 1444 for the purpose of radio/television. Their installment rate is 4% of disposable income, and they have a building society savings agreement/life insurance as property. They are solely responsible for providing maintenance for one person.###\nHence this label was Yes."
"This individual has no checking account and an unknown savings account. They have been employed for less than a year and have a stable residence for 4 years. The purpose of the credit is for a new car. The credit history is considered critical, and the credit amount is 3485. They are a divorced/separated male, aged 44, with no other debtors or guarantors. They own their own home and have two existing credits at this bank. The individual is a skilled employee/official and is liable to provide maintenance for one person. They have a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"This individual has a checking account with a balance of at least 200 DM and has been repaying existing credits on time. They took a loan of 2116 DM for furniture/equipment. Their savings are less than 100 DM and they have been employed for 1 to less than 4 years. The installment rate for the loan is 2% of their disposable income. They are a 41-year-old single male, with no other debtors or guarantors. They have been living in their own real estate property for 2 years. The individual has a stable job as a skilled employee/official and is responsible for one person's maintenance. They own a telephone registered under their name and are a foreign worker.###\nHence this label was Yes."
"The individual has a checking account with balance less than 0 DM and has no previous credit history. They are seeking a new car loan amounting to 1082. Their savings are less than 100 DM, and they have been employed for 1 to 4 years. The installment rate for their disposable income is 4%, and they are a single male. They have no other debtors or guarantors. They have been residing at their current place for 4 years and own a car or other property. At 48 years old, they have two existing credits at a bank and work as a skilled employee/official. They have one dependent and do not have a telephone. They are a foreign worker.###\nHence this label was No."
"This individual has a checking account with less than 0 DM, a history of delayed payments, and has been employed for 4 to 7 years. They are seeking a loan for a radio/television, with a credit amount of 4370 DM. Their savings are between 0 and 100 DM, and they have no other debtors/guarantors. They are a single male, 26 years old, and own their own home. Their property includes a building society savings agreement/life insurance. They have two existing credits at the bank, work as a skilled employee/official, and have two dependents. They have a telephone registered under their name and are a foreign worker.###\nHence this label was No."
"This individual is a young, divorced or separated or married female who has no checking account and unknown savings. She has been employed for less than a year as a skilled employee. She has been living in her current residence for 4 years, renting a house. She has no other debtors or guarantors and no other installment plans. She has 1 existing credit at the bank and is responsible for one person's maintenance. She does not have a telephone but is a foreign worker. She is looking to borrow 4675 for a used car, with a credit history of paying back existing credits duly.###\nHence this label was Yes."
"This individual has no existing checking account and has a stable credit history of repaying credits on time. They are seeking a loan for furniture/equipment amounting to 3972. They have savings of less than 100 DM and have been employed for 4 to 7 years. Their living situation is in rented housing and they have no other installment plans. They are a 25-year-old divorced/separated/married female with one dependent. They have no other debtors or guarantors and possess a building society savings agreement/life insurance. The individual works as a skilled employee/official and has a registered telephone connection. Additionally, they are a foreign worker.###\nHence this label was Yes."
"The individual in this dataset is a single male, aged 35, who has been employed for over 7 years as a skilled employee/official. He has no existing checking account, but has a savings account with less than 100 DM. He has no other debtors/guarantors, and owns his own home. He has two existing credits at the bank, with an installment rate of 2% of disposable income. He has a telephone registered under his name and is a foreign worker. The purpose of his credit is for a used car, with a duration of 36 months and a credit amount of 5842. He has been residing in his current residence for 2 years and has no other installment plans. He is responsible for providing maintenance for 2 individuals.###\nHence this label was Yes."
"This individual is a 47-year-old unemployed single male with a good credit history but a delay in paying off debts in the past. He has a small amount of savings, owns a car, and lives in his own home. Despite being unemployed, he holds a high-ranking job and has one existing credit at the bank. Additionally, he has a telephone registered under his name and is a foreign worker.###\nHence this label was No."
"This individual is a 20-year-old female who is divorced or separated or married. She has a good credit history with existing credits paid back duly till now. She has a checking account with a balance between 0 and 200 DM, while her savings account or bonds have a balance of at least 1000 DM. She has been employed for less than a year as a skilled employee or official. The purpose of her credit is for furniture/equipment, with a credit amount of 1577. She has no other debtors or guarantors, and no other installment plans. She owns a real estate property and has been residing at the current address for 1 year. She has one existing credit at the bank and is solely responsible for providing maintenance for one person. She does not have a telephone but is a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and has a stable credit history with existing credits paid back on time. They are seeking a loan for a radio/television. The credit amount requested is 1595, and they have savings of less than 100 DM. The individual has been employed for 4 to less than 7 years and has a low installment rate. They are a 51-year-old single male with no other debtors or guarantors. They have been living in their current residence for 2 years and have a building society savings agreement or life insurance. They have one existing credit at this bank and work as a skilled employee/official. They have 2 dependents. The individual owns their own home, has no other installment plans, does not have a telephone, and is a foreign worker.###\nHence this label was Yes."
"This individual is a 23-year-old unemployed woman who is divorced/separated/married. She has a checking account with less than 0 DM, a savings account with 500-1000 DM, and has existing credits paid back duly. She is looking to purchase a used car with a credit amount of 1352. She has been residing in her current residence for 2 years and has one existing credit at the bank. She has no other debtors or guarantors, no other installment plans, and no one else to provide maintenance for. She has a telephone registered under her name and is a foreign worker. She has an installment rate of 1% of disposable income and her job is listed as unemployed/unskilled - non-resident. Her housing situation is renting, and she has a property in a building society savings agreement/life insurance.###\nHence this label was Yes."
"This individual has a moderate amount of savings and has been employed for over 7 years. They are requesting credit for a radio/television purchase. With a stable living situation in their own home, they have three existing credits at the bank and are responsible for providing maintenance for one person. At 37 years old, male and single, they have a good credit history and no other debtors or guarantors. They have a low installment rate and no other installment plans. Additionally, they have a job as an unskilled resident and own real estate. They do not have a telephone but are a foreign worker.###\nHence this label was Yes."
"This individual has no checking account and a credit history with critical accounts or other existing credits. They are taking a loan for a new car, with a credit amount of 362 units. They have savings between 100 and 500 DM and have been employed for 1 to 4 years. Their installment rate is 4% of disposable income. The individual is a divorced, separated, or married female, with no other debtors or guarantors. They have been residing at their current residence for 4 years and own a car or another type of property. At 52 years old, they have no other installment plans, own their housing, and have 2 existing credits at this bank. The individual works in an unskilled resident job, is liable to provide maintenance for one person, does not have a telephone, and is a foreign worker.###\nHence this label was Yes."
