"This is an example of a patient with a moderate risk of developing diabetes. The patient is 40 years old and has been pregnant 7 times. They have low diastolic blood pressure and no triceps skin fold thickness. Their glucose levels after a glucose tolerance test are slightly elevated at 159, with no insulin present. The patient has a healthy body mass index of 27.4 and a low diabetes pedigree function of 0.294.###\nHence this label was No."
"A 24-year-old individual, who has been pregnant once, with a diastolic blood pressure of 60, a triceps skin fold thickness of 46, a plasma glucose concentration of 108 after a glucose tolerance test, 2-hour serum insulin level of 178, a body mass index of 35.5, and a diabetes pedigree function of 0.415.###\nHence this label was No."
"This individual is a 46-year-old woman who has been pregnant 12 times. She has a normal diastolic blood pressure of 72 and a below-average triceps skin fold thickness of 31. Her glucose levels after a 2-hour oral glucose tolerance test are low at 84, and she has very low insulin levels. Despite having a slightly high body mass index of 29.7, her diabetes pedigree function is low at 0.297.###\nHence this label was Yes."
"This patient is a young adult, 21 years old, who has never been pregnant. She has a low diastolic blood pressure of 75 and a normal triceps skin fold thickness of 23. Her plasma glucose concentration during an oral glucose tolerance test is 102, and she has no insulin in her system after a 2-hour serum test. Her BMI is 0.0, indicating she may be underweight. The diabetes pedigree function score is 0.572, suggesting a moderate genetic predisposition to diabetes. Overall, this data indicates a low risk for developing diabetes.###\nHence this label was No."
"The individual in the dataset is a 25-year-old woman who has never been pregnant. She has a diastolic blood pressure of 66, a triceps skin fold thickness of 39, and a high plasma glucose concentration of 180 after a glucose tolerance test. Her 2-hour serum insulin level is 0, indicating potential issues with insulin production. With a body mass index of 42.0 and a diabetes pedigree function of 1.893, she may have an increased risk of developing diabetes.###\nHence this label was Yes."
"This is a 22-year-old individual who has never been pregnant and has normal diastolic blood pressure. They have average triceps skin fold thickness, slightly elevated plasma glucose concentration, and normal insulin levels. Their body mass index is in the overweight range, and they have a low diabetes pedigree score.###\nHence this label was No."
"This data belongs to a 35-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 82, a triceps skin fold thickness of 41, and a plasma glucose concentration of 77 after a glucose tolerance test. Their 2-hour serum insulin level is 42, with a body mass index of 35.8. The diabetes pedigree function is calculated as 0.156.###\nHence this label was No."
"A 24-year-old individual who has been pregnant three times and has a diastolic blood pressure of 74. They have a triceps skin fold thickness of 15, a plasma glucose concentration of 116, and a 2-hour serum insulin level of 105. With a body mass index of 26.3 and a diabetes pedigree function of 0.107, this individual's risk of developing diabetes may be considered low.###\nHence this label was No."
"A 28-year-old individual who has been pregnant twice with a diastolic blood pressure of 86, triceps skin fold thickness of 42, plasma glucose concentration of 112 after a glucose tolerance test, 2-hour serum insulin level of 160, a body mass index of 38.4, and a diabetes pedigree function of 0.246.###\nHence this label was No."
"This data belongs to a 23-year-old individual who has been pregnant 3 times. They have a diastolic blood pressure of 68, triceps skin fold thickness of 28, plasma glucose concentration of 74, 2-hour serum insulin level of 45, and a body mass index of 29.7. Their diabetes pedigree function is 0.293.###\nHence this label was No."
"A 61-year-old individual who has been pregnant 7 times with a diastolic blood pressure of 60, triceps skin fold thickness of 33, plasma glucose concentration of 142 after a GTT, 2-hour serum insulin level of 190, body mass index of 28.8, and a diabetes pedigree function of 0.687.###\nHence this label was No."
"The person in the dataset is a 22-year-old who is pregnant for the first time. They have a normal diastolic blood pressure of 70 and a moderately high triceps skin fold thickness of 28. The plasma glucose concentration after a 2-hour oral glucose tolerance test is 106, and they have high 2-hour serum insulin levels of 135. Their body mass index is in the obese range at 34.2, but their diabetes pedigree function is low at 0.142, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"The patient is a 48-year-old woman who has been pregnant 12 times. Her diastolic blood pressure is 74 mmHg. She has a triceps skin fold thickness of 40mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 88 mg/dL, and her 2-hour serum insulin level is 54 uU/ml. Her body mass index is 35.3, indicating she is obese. The diabetes pedigree function value is 0.378, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"A 56-year-old individual, who has been pregnant 10 times, exhibits normal diastolic blood pressure and a healthy body mass index. They have moderate triceps skin fold thickness, low insulin levels, and a slightly below average plasma glucose concentration after a glucose tolerance test. Their diabetes pedigree function indicates a low to moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is a 36-year-old woman who has been pregnant 7 times. She has a healthy diastolic blood pressure of 78, a moderate triceps skin fold thickness of 26, and a normal plasma glucose concentration of 83 after a glucose tolerance test. Her insulin levels are slightly elevated at 71. She has a body mass index of 29.3, indicating she is overweight. Her diabetes pedigree function score is 0.767, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 25-year-old woman who has been pregnant twice has a healthy diastolic blood pressure of 58. Her triceps skin fold thickness is normal at 16mm. Her glucose level after a 2-hour oral glucose tolerance test is within the normal range at 87mg/dL, and her insulin level is also moderate at 52mu U/ml. With a body mass index of 32.7, she is slightly overweight. Her diabetes pedigree function is low at 0.166, indicating a lower risk of developing diabetes.###\nHence this label was No."
"This individual is a young adult who is slightly overweight but otherwise healthy. They have a low number of pregnancies and normal blood pressure. Their glucose levels after a glucose tolerance test are within normal range, as is their insulin level. Overall, this person has a low risk of developing diabetes based on the provided diagnostic measurements.###\nHence this label was No."
"This individual is 31 years old and has been pregnant 4 times. Their diastolic blood pressure is 70 mmHg. They have a triceps skin fold thickness of 39 mm. During a glucose tolerance test, their plasma glucose concentration at 2 hours is 197 mg/dL. Their 2-hour serum insulin level is notably high at 744 μU/mL. With a body mass index of 36.7, they are considered obese. The diabetes pedigree function, which predicts the likelihood of diabetes based on family history, is 2.329.###\nHence this label was No."
"The individual is 41 years old, has never been pregnant, and has a diastolic blood pressure of 104 mmHg. They have a triceps skin fold thickness of 25 mm and a plasma glucose concentration of 189 mg/dL after a glucose tolerance test. Their 2-hour serum insulin level is 0 μU/mL. With a body mass index of 34.3, they have a relatively high risk of developing diabetes, indicated by a diabetes pedigree function score of 0.435.###\nHence this label was Yes."
"The patient is a 45-year-old woman who has been pregnant 13 times. She has a diastolic blood pressure of 72, triceps skin fold thickness of 54, and a plasma glucose concentration of 106 after a glucose tolerance test. Her 2-hour serum insulin level is 0. With a body mass index of 36.6 and a low diabetes pedigree function of 0.178, she may have a lower risk of developing diabetes.###\nHence this label was No."
"The patient is a 28-year-old female who has been pregnant 4 times. She has a low diastolic blood pressure of 58 and a normal triceps skin fold thickness of 22. Her plasma glucose concentration after a glucose tolerance test is 85, and her 2-hour serum insulin level is 49. With a body mass index of 27.8, she is in the overweight category. Her diabetes pedigree function is low at 0.306, indicating a lower genetic predisposition to diabetes.###\nHence this label was No."
"This is a record of a 33-year-old individual who has been pregnant 4 times. They have normal diastolic blood pressure and a slightly above-average body mass index. Their triceps skin fold thickness is within a healthy range. Their plasma glucose concentration after a glucose tolerance test is elevated, and their 2-hour serum insulin level is also high. The diabetes pedigree function score indicates a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient, a 38-year-old woman, has been pregnant 9 times. She has a healthy diastolic blood pressure of 78 and a slightly low triceps skin fold thickness of 25. Her plasma glucose concentration is normal at 72, and she has no insulin levels after a 2-hour oral glucose tolerance test. With a body mass index of 31.6, which is in the overweight range, and a low diabetes pedigree function of 0.28, she appears to have a low risk of developing diabetes.###\nHence this label was No."
"A 61-year-old individual who has been pregnant 4 times, with a diastolic blood pressure of 92. They have no triceps skin fold thickness and a plasma glucose concentration of 146 after a glucose tolerance test. Their 2-hour serum insulin level is 0, with a body mass index of 31.2. The diabetes pedigree function score is 0.539.###\nHence this label was Yes."
"The patient is a 43-year-old woman who has been pregnant 13 times. She has a diastolic blood pressure of 90 mmHg, a triceps skin fold thickness of 33 mm, and a plasma glucose concentration of 152 mg/dL after a GTT. Her 2-hour serum insulin level is 29 μU/mL, and her body mass index is 26.8. The diabetes pedigree function, a measure of diabetes risk based on family history, is 0.731 for this patient.###\nHence this label was Yes."
"The patient is a 41-year-old woman who has been pregnant 13 times. She has a very low diastolic blood pressure of 60 and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 76, with a 2-hour serum insulin level of 0. Her body mass index is 32.8 and her diabetes pedigree function is 0.18.###\nHence this label was No."
"This patient is a 40-year-old woman who has been pregnant 11 times. She has a diastolic blood pressure of 0, triceps skin fold thickness of 0, and a plasma glucose concentration of 135 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a high body mass index of 52.3. Additionally, she has a diabetes pedigree function value of 0.578. Based on these measurements, the patient may be at risk for developing diabetes.###\nHence this label was Yes."
"A 25-year-old woman who has been pregnant 4 times, with a diastolic blood pressure of 90 mmHg, triceps skin fold thickness of 23 mm, plasma glucose concentration of 84 mg/dL after a glucose tolerance test, 2-hour serum insulin level of 56 mu U/mL, body mass index of 39.5, and a diabetes pedigree function of 0.159. This data provides insights into various health parameters related to diabetes risk in this individual.###\nHence this label was No."
"This individual is a young adult female who has never been pregnant, with a healthy diastolic blood pressure of 68. She has a normal triceps skin fold thickness of 14 mm. Her plasma glucose concentration after a glucose tolerance test is 137 mg/dL, and her 2-hour serum insulin level is elevated at 148 μU/mL. With a body mass index of 24.8, she is within the healthy weight range. Her diabetes pedigree function is low at 0.143, indicating a relatively low genetic risk for diabetes.###\nHence this label was No."
"A 69-year-old individual with 5 pregnancies, normal diastolic blood pressure, no triceps skin fold thickness, slightly elevated plasma glucose level after a glucose tolerance test, no insulin level after 2 hours, a healthy body mass index, and a low diabetes pedigree function score.###\nHence this label was No."
"A 29-year-old female who has been pregnant five times shows slightly low diastolic blood pressure, a moderately high triceps skin fold thickness, high plasma glucose concentration, very high 2-hour serum insulin levels, elevated body mass index, and a moderate diabetes pedigree function score. Overall, this individual exhibits signs of potential risk for developing diabetes.###\nHence this label was Yes."
"This is a dataset of a 21-year-old individual with 2 pregnancies. They have normal diastolic blood pressure, no triceps skin fold thickness, and a moderate plasma glucose concentration of 118 mg/dL. Their 2-hour serum insulin is low, and they have a high body mass index of 42.9. Their diabetes pedigree function value is 0.693, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
