"The patient is a 25-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 80, triceps skin fold thickness of 35, plasma glucose concentration of 139, 2-hour serum insulin of 160, body mass index of 31.6 and a diabetes pedigree function of 0.361. Overall, these measurements indicate a moderate risk for developing diabetes.###\nHence this label was Yes."
"The data belongs to a 35-year-old woman who has never been pregnant. She has a diastolic blood pressure of 90, a triceps skin fold thickness of 26, and a plasma glucose concentration of 180 after a glucose tolerance test. Her 2-hour serum insulin level is 90, and her body mass index is 36.5. The diabetes pedigree function score is 0.314.###\nHence this label was Yes."
"A 52-year-old woman who has been pregnant five times has a diastolic blood pressure of 76 and a triceps skin fold thickness of 27. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 97, with a 2-hour serum insulin level of 0. She has a body mass index of 35.6 and a diabetes pedigree function of 0.378.###\nHence this label was Yes."
"This data describes a 24-year-old individual who has never been pregnant and has a normal diastolic blood pressure of 78. They have a moderately high triceps skin fold thickness of 40, but their plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range at 102. The individual has a high serum insulin level of 90, a body mass index indicating obesity at 34.5, and a low diabetes pedigree function score of 0.238, suggesting a relatively lower genetic risk for developing diabetes.###\nHence this label was No."
"The patient, a 36-year-old woman who has been pregnant once, has a relatively low diastolic blood pressure of 74. She has a moderate triceps skin fold thickness of 21, indicating some subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 95, which is within the normal range. The 2-hour serum insulin level is 73, suggesting a normal response to the glucose challenge. With a body mass index of 25.9, she is considered to be in the healthy weight range. The diabetes pedigree function score of 0.673 indicates a moderate genetic risk for developing diabetes.###\nHence this label was No."
"This individual is 46 years old and has been pregnant 4 times. They have a diastolic blood pressure of 72 and triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 115. They have no insulin after a 2-hour serum test. Their body mass index is 28.9 and they have a diabetes pedigree function of 0.376.###\nHence this label was Yes."
"This patient is 55 years old and has been pregnant 3 times. \nTheir diastolic blood pressure is 78 mmHg and triceps skin fold thickness is 0mm.\nDuring a glucose tolerance test, their plasma glucose concentration at 2 hours is 128 mg/dL.\nTheir 2-hour serum insulin level is 0 μU/mL and body mass index is 21.1 kg/m^2.\nThe diabetes pedigree function, which predicts the likelihood of diabetes based on family history, is 0.268.###\nHence this label was No."
"This individual is 37 years old and has been pregnant 5 times. Their diastolic blood pressure is 78, triceps skin fold thickness is 30, and plasma glucose concentration after a glucose tolerance test is 88. They have no insulin in their system after a 2-hour period. Their body mass index is 27.6 and their diabetes pedigree function is 0.258.###\nHence this label was No."
"The individual is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 90 and a triceps skin fold thickness of 24. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 142, and her 2-hour serum insulin level is 480. She has a body mass index of 30.4 and a diabetes pedigree function of 0.128.###\nHence this label was Yes."
"This is a dataset of a 21-year-old individual with no prior pregnancies. Their diastolic blood pressure is 70, triceps skin fold thickness is 27, and plasma glucose concentration after a glucose tolerance test is 94. Additionally, their 2-hour serum insulin level is 115, body mass index is 43.5, and diabetes pedigree function is 0.347.###\nHence this label was No."
"The patient is a 42-year-old female who has been pregnant 9 times. She has a low diastolic blood pressure of 52, no triceps skin fold thickness, and a normal glucose concentration of 106 after a 2-hour oral glucose tolerance test. Her insulin level is 0, indicating normal insulin function. With a body mass index of 31.2, she is considered overweight. Her diabetes pedigree function is relatively low at 0.38, suggesting a lower genetic predisposition to diabetes. Overall, this patient has some risk factors for diabetes such as age and BMI, but her current test results indicate low immediate risk.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant twice. She has a relatively low diastolic blood pressure of 60 and a moderate triceps skin fold thickness of 18. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122, and her 2-hour serum insulin level is elevated at 106. With a body mass index of 29.8, she is considered overweight. Her diabetes pedigree function is 0.717, indicating a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This data describes a 34-year-old individual who has been pregnant 5 times. They have a diastolic blood pressure of 84, triceps skin fold thickness of 44, plasma glucose concentration of 155, and 2-hour serum insulin level of 545. Their body mass index is 38.7 and their diabetes pedigree function is 0.619.###\nHence this label was No."
"The individual in the dataset is a 41-year-old woman who has never been pregnant. She has a diastolic blood pressure of 104, a triceps skin fold thickness of 25, and a high plasma glucose concentration of 189 following an oral glucose tolerance test. Her 2-hour serum insulin level is 0, indicating potential issues with insulin production or utilization. She has a body mass index of 34.3, which is considered obese. The diabetes pedigree function score is 0.435, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"A 32-year-old woman who has been pregnant 6 times has normal diastolic blood pressure and low triceps skin fold thickness. Her glucose levels after a GTT are low, as well as her insulin levels. She has a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was No."
"This 24-year-old individual is relatively young and has been pregnant once. Their diastolic blood pressure is within the normal range at 88. They have a relatively low triceps skin fold thickness of 19, indicating less body fat. The plasma glucose concentration of 108 after a glucose tolerance test is normal. Their insulin level at 2 hours is 0, which might be considered low. With a body mass index of 27.1, they are considered overweight. The diabetes pedigree function score of 0.4 suggests a low genetic risk of diabetes.###\nHence this label was No."
"This individual is a 24-year-old female who is pregnant for the first time. She has low diastolic blood pressure, normal triceps skin fold thickness, and a slightly low plasma glucose concentration after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is within normal range, and she has a slightly elevated body mass index. Additionally, she has a relatively high diabetes pedigree function score, indicating a potential genetic predisposition to diabetes.###\nHence this label was No."
"A 27-year-old woman, who has been pregnant twice, with very low diastolic blood pressure and triceps skin fold thickness. Her glucose levels are normal after a 2-hour oral glucose tolerance test, while her insulin levels are also low. However, she has a high body mass index and a slightly elevated diabetes pedigree function score.###\nHence this label was No."
"A 36-year-old female who has been pregnant 5 times shows low diastolic blood pressure and zero triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is very low at 44, with no insulin detected after 2 hours. Despite having a normal body mass index of 25.0, she has a slightly elevated diabetes pedigree function score of 0.587.###\nHence this label was No."
"This data represents a 21-year-old individual who has been pregnant 4 times and shows relatively normal measurements in terms of blood pressure, triceps skin fold thickness, glucose concentration, insulin levels, body mass index, and diabetes pedigree function.###\nHence this label was No."
"This is a dataset of a 27-year-old individual who is moderately active, has slightly elevated blood pressure, and some excess body fat. Their glucose levels are normal, but they have high insulin levels. There is a family history of diabetes, indicating a potential risk for developing the disease.###\nHence this label was Yes."
"A 25-year-old woman who has been pregnant twice has a lower than normal diastolic blood pressure of 58. She has a moderately healthy triceps skin fold thickness of 24mm. Her glucose levels are slightly elevated at 127mg/dL after a 2-hour oral glucose tolerance test, and her insulin levels are notably high at 275muU/mL. Despite this, her body mass index is within a healthy range at 27.7. She has a moderately elevated diabetes pedigree function score of 1.6, indicating a possible genetic predisposition to diabetes.###\nHence this label was No."
"This is a 41-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 74 and a triceps skin fold thickness of 18. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 104, and their 2-hour serum insulin level is 156. With a body mass index of 29.9 and a diabetes pedigree function of 0.722, this individual's risk of developing diabetes may be assessed as per these diagnostic measurements.###\nHence this label was Yes."
"This data belongs to a 36-year-old individual who has been pregnant 4 times. Their diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin levels are all zero. However, their plasma glucose concentration after a glucose tolerance test is 183, indicating a potential risk for diabetes. The individual has a body mass index of 28.4 and a low diabetes pedigree function of 0.212.###\nHence this label was Yes."
"This is a data record of a 23-year-old individual who has never been pregnant. They have a diastolic blood pressure of 64, triceps skin fold thickness of 18, plasma glucose concentration of 119, and 2-hour serum insulin level of 92. Their body mass index is 34.9 and their diabetes pedigree function is 0.725.###\nHence this label was No."
"The individual is 44 years old and has never been pregnant. They have a diastolic blood pressure of 82, zero triceps skin fold thickness, and a plasma glucose concentration of 146 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is zero, and their body mass index is 40.5. The diabetes pedigree function is 1.781.###\nHence this label was No."
"This 45-year-old person has been pregnant 9 times and has a diastolic blood pressure of 78. Their triceps skin fold thickness is 30mm. In a glucose tolerance test, their plasma glucose concentration at 2 hours is 154mg/dL. They have a 2-hour serum insulin level of 100muU/mL. With a body mass index of 30.9, their diabetes pedigree function is calculated to be 0.164, indicating a certain level of genetic susceptibility to diabetes.###\nHence this label was No."
"The patient is a 21-year-old female who has been pregnant 2 times. She has low diastolic blood pressure (52 mmHg), moderate triceps skin fold thickness (15 mm), normal glucose levels (99 mg/dL), slightly elevated insulin levels (94 μU/mL), a healthy body mass index (24.6 kg/m^2), and a moderately low diabetes pedigree function score (0.637).###\nHence this label was No."
"The individual in this data is a 46-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 82, triceps skin fold thickness of 46, and a plasma glucose concentration of 144 after a glucose tolerance test. Her 2-hour serum insulin level is 180, and she has a body mass index of 46.1. The diabetes pedigree function value is 0.335.###\nHence this label was Yes."
"A 37-year-old woman who has been pregnant 7 times shows normal diastolic blood pressure, no triceps skin fold thickness, and low levels of insulin. She has a healthy plasma glucose concentration of 119 after a 2-hour oral glucose tolerance test. With a moderate body mass index of 25.2 and a low diabetes pedigree function of 0.209, she appears to have a relatively low risk of developing diabetes.###\nHence this label was No."
"The individual in the dataset is a 67-year-old who has never been pregnant. They have a low diastolic blood pressure of 60 and a normal triceps skin fold thickness of 0. Despite having a low plasma glucose concentration of 57 after a glucose tolerance test, their 2-hour serum insulin level is also low at 0. The individual has a healthy body mass index of 21.7 and a moderately elevated diabetes pedigree function score of 0.735, indicating a potential genetic predisposition to diabetes.###\nHence this label was No."
"The patient is a 25-year-old who has been pregnant 5 times. She has normal diastolic blood pressure, moderately high triceps skinfold thickness, and slightly elevated plasma glucose concentration after a glucose tolerance test. Her insulin level is also elevated. She has a high body mass index and a moderate diabetes pedigree function score.###\nHence this label was Yes."
"The patient is a 24-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 50 and a triceps skin fold thickness of 16, indicating a healthy body composition. However, her plasma glucose concentration after a glucose tolerance test is high at 193, suggesting a risk for diabetes. Additionally, her 2-hour serum insulin level is elevated at 375, which may also indicate insulin resistance. Despite these concerning values, her body mass index is within the normal range at 25.9. The patient has a moderately low diabetes pedigree function score of 0.655, indicating a mild genetic predisposition to diabetes. Overall, this data suggests a potential risk for developing diabetes due to high glucose and insulin levels, despite being within a healthy weight range.###\nHence this label was No."
"A 29-year-old individual who has been pregnant 6 times with a diastolic blood pressure of 72. They have a triceps skin fold thickness of 0 and a plasma glucose concentration of 124 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, while their body mass index is 27.6. The diabetes pedigree function score is 0.368.###\nHence this label was Yes."
"This patient is a 24-year-old female who is 1 time pregnant. She has a normal diastolic blood pressure of 62, a slightly below average triceps skin fold thickness of 12, and a normal plasma glucose concentration of 90. Her 2-hour serum insulin level is 43, which is within the normal range. With a body mass index of 27.2, she is slightly overweight. Her diabetes pedigree function score is 0.58, indicating a moderate genetic risk for diabetes.###\nHence this label was No."
"A 31-year-old individual, who has been pregnant 3 times, with a diastolic blood pressure of 74. They have a triceps skin fold thickness of 19, a plasma glucose concentration of 169 after a glucose tolerance test, and a 2-hour serum insulin level of 125. Their body mass index is 29.9 and they have a diabetes pedigree function of 0.268.###\nHence this label was Yes."
"This patient is a 37-year-old female who is pregnant for the first time. She has slightly elevated diastolic blood pressure at 88 mmHg. Her triceps skin fold thickness is 39 mm, indicating some level of body fat. The plasma glucose concentration from a glucose tolerance test is 128 mg/dL and her 2-hour serum insulin level is elevated at 110 μU/ml. She has a body mass index of 36.5, which is classified as obese. Additionally, her diabetes pedigree function score is 1.057, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 37-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 35 mm. In an oral glucose tolerance test, her plasma glucose concentration at 2 hours was 186 mg/dL and her 2-hour serum insulin level was 225 μU/mL. She has a body mass index of 34.5 and a diabetes pedigree function of 0.423.###\nHence this label was Yes."
"This 27-year-old individual has never been pregnant and shows no indication of triceps skin fold thickness or serum insulin. Their diastolic blood pressure is normal at 80, while their glucose concentration after a 2-hour oral test is 91, also within the healthy range. With a body mass index of 32.4 and a low diabetes pedigree function of 0.601, the individual appears to have a relatively low risk of developing diabetes.###\nHence this label was No."
"A 39-year-old individual, who has been pregnant 6 times, with a diastolic blood pressure of 74, triceps skin fold thickness of 32, plasma glucose concentration of 154, 2-hour serum insulin level of 193, body mass index of 29.3, and a diabetes pedigree function value of 0.839. These measurements provide valuable insights into the individual's health and potential risk for developing diabetes.###\nHence this label was No."
"The patient is a non-pregnant 25-year-old with normal blood pressure and a slightly above average body mass index. They have a moderate level of triceps skin fold thickness and high plasma glucose concentration after an oral glucose tolerance test. The patient also has high serum insulin levels and a relatively high diabetes pedigree function score, indicating a potential risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 84, no triceps skin fold thickness, and a high plasma glucose concentration of 178 after a glucose tolerance test. Her 2-hour serum insulin level is 0, indicating potential insulin resistance. She has a high body mass index of 39.9, suggesting obesity. The diabetes pedigree function score is 0.331, indicating a moderate genetic predisposition to diabetes. Overall, these factors suggest that the patient may be at high risk of developing diabetes.###\nHence this label was Yes."
"This individual, aged 37, has been pregnant 3 times. Their diastolic blood pressure is 76. They have a triceps skin fold thickness of 0, which may indicate low body fat. The plasma glucose concentration after a glucose tolerance test is 150, suggesting normal blood sugar levels. Their 2-hour serum insulin is 0, which is lower than normal. With a body mass index of 21.0, they are within the healthy weight range. The diabetes pedigree function score is 0.207, indicating a low genetic predisposition to diabetes.###\nHence this label was No."
"This 22-year-old individual has been pregnant twice and has a relatively low diastolic blood pressure of 70. They have a moderately low triceps skin fold thickness of 17, and their plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 90. They have very low 2-hour serum insulin levels. Their body mass index is within the healthy range at 27.3, and their diabetes pedigree function is low at 0.085.###\nHence this label was No."
"The patient is a 33-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 78 mmHg and a triceps skin fold thickness of 34 mm. Her plasma glucose concentration is 152 mg/dL after a 2-hour oral glucose tolerance test, and she has a 2-hour serum insulin level of 171 μU/mL. Additionally, her body mass index is 34.2 and her diabetes pedigree function is 0.893.###\nHence this label was Yes."
"The patient is a 41-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 70 and a triceps skin fold thickness of 26. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125, with a 2-hour serum insulin level of 115. She has a body mass index of 31.1 and a diabetes pedigree function value of 0.205.###\nHence this label was Yes."
"The patient is a 41-year-old female who has been pregnant twice. She shows normal diastolic blood pressure, no triceps skin fold thickness, and no serum insulin level. However, she has a relatively high plasma glucose concentration after a 2-hour oral glucose tolerance test. Her body mass index is 38.5, indicating she is obese. Additionally, her diabetes pedigree function is 0.304, suggesting a moderate genetic predisposition to diabetes. Overall, these factors may indicate a risk for developing diabetes in the future.###\nHence this label was No."
"A 46-year-old woman who has been pregnant 9 times with normal diastolic blood pressure. She has a moderately high triceps skin fold thickness and a normal glucose concentration in an oral glucose tolerance test. Her insulin levels are low, and she has a slightly elevated body mass index. The diabetes pedigree function indicates a moderate genetic risk for diabetes.###\nHence this label was Yes."
"This individual is a young adult who has never been pregnant. Despite having a low diastolic blood pressure and no insulin in their system, their glucose levels are within a healthy range. They have a moderate amount of triceps skin fold thickness, a relatively normal body mass index, and a low diabetes pedigree function score.###\nHence this label was No."
"A 23-year-old individual with a history of 6 pregnancies has a diastolic blood pressure of 50 mmHg. They have a triceps skin fold thickness of 30 mm and a plasma glucose concentration of 93 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 64 uU/mL, and their body mass index is 28.7 kg/m^2. The diabetes pedigree function, a measure of diabetes genetic risk, is 0.356.###\nHence this label was No."
"The individual in the dataset is a 23-year-old female who has never been pregnant. She has a diastolic blood pressure of 64 mmHg, a triceps skin fold thickness of 23 mm, and a plasma glucose concentration of 104 mg/dL after a glucose tolerance test. Her 2-hour serum insulin level is 116 μU/mL, and she has a body mass index of 27.8. The diabetes pedigree function, which assesses the likelihood of developing diabetes based on family history, is 0.454 for this individual.###\nHence this label was No."
"The patient is a 42-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 29. Her plasma glucose concentration is 149 after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin level is 127. She has a body mass index of 29.3 and a diabetes pedigree function of 0.349.###\nHence this label was Yes."
"This individual is a 47-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 106 mmHg. Her triceps skin fold thickness is 23 mm. During an oral glucose tolerance test, her plasma glucose concentration at 2 hours is 68 mg/dL. Her 2-hour serum insulin level is 49 μU/mL. She has a body mass index of 35.5, indicating she is obese. The diabetes pedigree function value is 0.285, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"A 26-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 48 and a triceps skin fold thickness of 32. They have a plasma glucose concentration of 123 after a 2-hour oral glucose tolerance test and a 2-hour serum insulin level of 165. With a body mass index of 42.1 and a diabetes pedigree function value of 0.52.###\nHence this label was No."
"The patient is a 52-year-old woman who has been pregnant 13 times. She has a low diastolic blood pressure of 70 and no triceps skin fold thickness. Her glucose level after a 2-hour oral glucose tolerance test is 106, and she has no serum insulin in her system. She has a body mass index of 34.2 and a low diabetes pedigree function score of 0.251.###\nHence this label was No."
"The patient is a 32-year-old female who has never been pregnant. She has a healthy diastolic blood pressure of 68 and a moderate triceps skin fold thickness of 20. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 108, and she has no 2-hour serum insulin present. With a body mass index of 27.3 and a relatively low diabetes pedigree function of 0.787, this patient may have a low risk of developing diabetes.###\nHence this label was No."
"This is a dataset of a 21-year-old individual who has been pregnant twice. Their diastolic blood pressure is 80 and their triceps skin fold thickness is 0. They have a plasma glucose concentration of 118 after a 2-hour oral glucose tolerance test and a 2-hour serum insulin level of 0. Their body mass index is 42.9 and their diabetes pedigree function is 0.693.###\nHence this label was Yes."
"This patient is a 32-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125, and her 2-hour serum insulin level is 120. She has a body mass index of 30.0 and a diabetes pedigree function of 0.464.###\nHence this label was No."
"This patient is a 31-year-old who has never been pregnant. She has slightly elevated diastolic blood pressure, a high triceps skin fold thickness, and moderate plasma glucose concentration after a glucose tolerance test. She has very high serum insulin levels, indicating potential insulin resistance. Additionally, she has a high body mass index and a moderate diabetes pedigree function score. Based on these factors, she may be at risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 21-year-old female who is pregnant for the first time. She has a low diastolic blood pressure of 70 and a below-average body mass index of 18.2. Her triceps skin fold thickness is 15, indicating a relatively low level of body fat. The patient's plasma glucose concentration following a glucose tolerance test is 97, which is within the normal range. Her 2-hour serum insulin level is 0, suggesting normal insulin production. The diabetes pedigree function score is low at 0.147, indicating a low genetic predisposition to diabetes.###\nHence this label was No."
"A 21-year-old woman, who has been pregnant twice, with normal diastolic blood pressure and a healthy BMI of 24.7, showed elevated levels of plasma glucose and serum insulin after a glucose tolerance test. She has moderate triceps skin fold thickness and a relatively low diabetes pedigree function score of 0.761.###\nHence this label was No."
"A 37-year-old individual, who has been pregnant 5 times, with a diastolic blood pressure of 108. They have a triceps skin fold thickness of 0, plasma glucose concentration of 137, and 2-hour serum insulin level of 0. Their body mass index is 48.8 and they have a diabetes pedigree function value of 0.227.###\nHence this label was Yes."
"This individual is a 56-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 72, triceps skin fold thickness of 47, and a plasma glucose concentration of 111 after a glucose tolerance test. Additionally, her 2-hour serum insulin level is 207, body mass index is 37.1, and her diabetes pedigree function is 1.39.###\nHence this label was Yes."
"A 26-year-old woman who has never been pregnant has normal diastolic blood pressure and a slightly above average Body Mass Index. Her glucose levels after a glucose tolerance test are within normal range, and her insulin levels are also normal. She has a moderate triceps skin fold thickness, indicating she may have a healthy amount of body fat. Additionally, her diabetes pedigree function shows a low genetic risk for diabetes.###\nHence this label was No."
"A 30-year-old woman with 2 pregnancies shows normal diastolic blood pressure, slightly below average triceps skin fold thickness, and moderate plasma glucose concentration after a glucose tolerance test. She has high insulin levels, a slightly elevated body mass index, and a family history of diabetes.###\nHence this label was Yes."
"The patient is a 52-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 104 mmHg. Her triceps skin fold thickness is 0 mm, indicating low subcutaneous fat. She had a plasma glucose concentration of 162 mg/dL after a 2-hour oral glucose tolerance test, which is elevated. She has no 2-hour serum insulin detected. Her body mass index is 37.7, classified as obese. The diabetes pedigree function score is 0.151, suggesting a low genetic predisposition to diabetes.###\nHence this label was Yes."
"This data belongs to a 27-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 68 and no triceps skin fold thickness. Her plasma glucose level after a GTT is 83, with no insulin detected after a 2-hour serum test. The individual has a low body mass index of 18.2 and a moderate diabetes pedigree function of 0.624.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 62 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 91, and her 2-hour serum insulin level is 0. Despite these low values, her body mass index is relatively healthy at 27.3. The patient has a moderate diabetes pedigree function of 0.525.###\nHence this label was No."
"This 37-year-old individual has been pregnant 4 times and shows low diastolic blood pressure of 65. The triceps skin fold thickness and 2-hour serum insulin levels are both at 0. However, their plasma glucose concentration after a glucose tolerance test is 114. With a body mass index of 21.9 and a diabetes pedigree function of 0.432, this person's risk for developing diabetes appears relatively low based on these measurements.###\nHence this label was No."
"This 34-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 86. They have a triceps skin fold thickness of 19, a low plasma glucose concentration of 83, and zero insulin level. The individual's body mass index is 29.3 and they have a relatively low diabetes pedigree function of 0.317.###\nHence this label was No."
"The individual is a 30-year-old who has been pregnant 5 times. They have a diastolic blood pressure of 66 and a triceps skin fold thickness of 21. In an oral glucose tolerance test, their plasma glucose concentration at 2 hours is 88, and their 2-hour serum insulin level is 23. The individual has a body mass index of 24.4 and a diabetes pedigree function value of 0.342.###\nHence this label was No."
"This data belongs to a 45-year-old individual who has been pregnant 9 times. Despite having a higher than normal diastolic blood pressure of 94, their triceps skin fold thickness and 2-hour serum insulin levels are both at 0. However, their plasma glucose concentration after a glucose tolerance test is 140, indicating a moderate level. The individual has a body mass index of 32.7 and a diabetes pedigree function score of 0.734.###\nHence this label was Yes."
"A 21-year-old individual who is pregnant for the first time with a normal diastolic blood pressure, low triceps skin fold thickness, and a slightly elevated plasma glucose concentration after a 2-hour oral glucose tolerance test. They have high insulin levels, a healthy body mass index, and a moderate diabetes pedigree function score.###\nHence this label was No."
"The patient is a 41-year-old woman who has been pregnant 13 times. She has a very low diastolic blood pressure of 60 and a Triceps skin fold thickness of 0, indicating low body fat. Her glucose level after a 2-hour oral glucose tolerance test is 76, which is on the lower side. She has no detectable serum insulin after 2 hours. Despite her low body fat, her body mass index is high at 32.8. The diabetes pedigree function score is low at 0.18, suggesting a low risk of developing diabetes based on family history.###\nHence this label was No."
"This patient is a 29-year-old who has been pregnant 10 times. They have a diastolic blood pressure reading of 0, no triceps skin fold thickness, and a plasma glucose concentration of 115 after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 0, and they have a body mass index of 35.3. The diabetes pedigree function for this individual is 0.134.###\nHence this label was No."
"A 22-year-old woman who is 4 times pregnant with a diastolic blood pressure of 86. She has a triceps skin fold thickness of 0, a plasma glucose concentration of 142, and 0 insulin levels. Her body mass index is 44.0 and her diabetes pedigree function is 0.645.###\nHence this label was Yes."
"A 26-year-old woman who has never been pregnant shows a high diastolic blood pressure of 110. Her triceps skin fold thickness is 46, indicating a moderate amount of subcutaneous fat. She has a plasma glucose concentration of 129 after a 2-hour oral glucose tolerance test, along with a high 2-hour serum insulin level of 130. With a body mass index of 67.1, she is classified as severely obese. Her diabetes pedigree function is low at 0.319, suggesting a relatively low genetic risk for diabetes.###\nHence this label was Yes."
"This individual is a 42-year-old woman who has been pregnant 11 times. Her diastolic blood pressure is 68, and her triceps skin fold thickness is 40. She had a plasma glucose concentration of 103 after a 2-hour oral glucose tolerance test, with no insulin detected in her serum. Her body mass index is 46.2, and her diabetes pedigree function is 0.126.###\nHence this label was No."
"This data belongs to a 21-year-old female who is pregnant for the first time. Her diastolic blood pressure is 72, triceps skin fold thickness is 30, and plasma glucose concentration after a glucose tolerance test is 99. She has a 2-hour serum insulin level of 18 and a body mass index of 38.6. Her diabetes pedigree function is 0.412.###\nHence this label was No."
"This is a 44-year-old individual who has been pregnant 3 times and shows normal diastolic blood pressure. They have a triceps skin fold thickness of 0, indicating low fat levels. Their plasma glucose concentration after a glucose tolerance test is 132, which is within the normal range. The 2-hour serum insulin level is 0, showing no insulin production. They have a body mass index of 34.4, which is categorized as obese. The diabetes pedigree function is 0.402, suggesting a low genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 21-year-old who has been pregnant 3 times. She has a low diastolic blood pressure of 62 and a very low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 111, with no serum insulin detected. She has a healthy body mass index of 22.6 and a low diabetes pedigree function of 0.142.###\nHence this label was No."
"The individual is a 35-year-old woman who has been pregnant 5 times. She has a diastolic blood pressure of 84, a triceps skin fold thickness of 41, and a plasma glucose concentration of 136 after a glucose tolerance test. Her 2-hour serum insulin level is 88, and her body mass index is 35.0. Her diabetes pedigree function is 0.286.###\nHence this label was Yes."
"The patient is a 38-year-old woman who is pregnant for the first time. She has normal diastolic blood pressure, slightly below-average triceps skin fold thickness, high plasma glucose concentration after a glucose tolerance test, elevated serum insulin levels, and a higher than average body mass index. However, her diabetes pedigree function is relatively low.###\nHence this label was Yes."
"A 29-year-old individual, who has been pregnant twice, has a diastolic blood pressure of 76 mmHg. They also have a triceps skin fold thickness of 35 mm, a plasma glucose concentration of 146 mg/dL after a glucose tolerance test, and 194 mmHg of 2-hour serum insulin. With a body mass index of 38.2 and a diabetes pedigree function of 0.329, this individual's health data suggests they may be at risk for developing diabetes.###\nHence this label was No."
"The patient is a 23-year-old who has never been pregnant. She has a diastolic blood pressure of 82, triceps skin fold thickness of 31, and a plasma glucose concentration of 84 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 125, and she has a body mass index of 38.2. Her diabetes pedigree function is 0.233.###\nHence this label was No."
"A 23-year-old female, who is pregnant for the first time, has a low diastolic blood pressure of 56. She has a triceps skin fold thickness of 21, a plasma glucose concentration of 109 after a glucose tolerance test, and a high 2-hour serum insulin level of 135. Her body mass index is 25.2, and she has a relatively low diabetes pedigree function value of 0.833. The overall picture suggests a mixed risk for developing diabetes, with some factors indicating low risk and others indicating high risk.###\nHence this label was No."
"A 33-year-old individual, who is pregnant for the first time, has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 17 mm. They have a plasma glucose concentration of 167 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 144 μU/ml, and their body mass index is 23.4. The diabetes pedigree function for this individual is 0.447, indicating a potential risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 25-year-old female who is pregnant for the first time. She has low diastolic blood pressure, a moderate triceps skin fold thickness, and normal glucose levels after a GTT. Her insulin levels are moderate, and she has a high BMI. The diabetes pedigree function indicates a low genetic predisposition to diabetes.###\nHence this label was No."
"This individual is a 22-year-old who has been pregnant twice. She has a diastolic blood pressure of 74, triceps skin fold thickness of 19, and a plasma glucose concentration of 88 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 53, and she has a body mass index of 29.0. She also has a diabetes pedigree function of 0.229.###\nHence this label was No."
"The 23-year-old patient, who has been pregnant once, has normal diastolic blood pressure and a healthy BMI of 29.9. Their triceps skin fold thickness is within normal range, while their plasma glucose concentration after a 2-hour oral glucose tolerance test is low. The patient also has a moderate level of insulin in their blood and a relatively low diabetes pedigree function score of 0.422.###\nHence this label was No."
"This data belongs to a 34-year-old individual who has been pregnant 4 times. They have a diastolic blood pressure of 68 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 120, with a 2-hour serum insulin level of 0. Their body mass index is 29.6 and they have a diabetes pedigree function value of 0.709.###\nHence this label was No."
"A 41-year-old woman who has been pregnant 9 times shows normal diastolic blood pressure, low triceps skin fold thickness, very low plasma glucose concentration after a glucose tolerance test, no serum insulin, and a slightly elevated body mass index. Her diabetes pedigree function is low, indicating a low genetic risk for diabetes.###\nHence this label was No."
"This patient is a young adult, 22 years old, who has never been pregnant. They have a low diastolic blood pressure reading of 50 and a slightly elevated triceps skin fold thickness of 36. Their plasma glucose concentration after a glucose tolerance test is high at 179 and they have a high level of serum insulin at 159. With a body mass index of 37.8, this individual is considered obese. Their diabetes pedigree function score is relatively low at 0.455.###\nHence this label was Yes."
"The patient is a young adult woman, 22 years old, who has been pregnant 3 times. She has a normal diastolic blood pressure of 64 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a GTT is within normal range at 130, and she has a low 2-hour serum insulin level of 0. Her body mass index is at a healthy level of 23.1, and her diabetes pedigree function is low at 0.314. Overall, she appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"The patient is a 34-year-old woman who has been pregnant 10 times. She has a normal diastolic blood pressure of 98 and a low triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 115, and she has no detectable 2-hour serum insulin. She has a healthy body mass index of 24.0 and a slightly elevated diabetes pedigree function of 1.022.###\nHence this label was No."
"This individual is 38 years old and has been pregnant 8 times. They have a diastolic blood pressure of 0, triceps skin fold thickness of 0, and 2-hour serum insulin of 0. However, their plasma glucose concentration after a glucose tolerance test is 120, indicating a normal level. They have a body mass index of 30.0, which falls into the obese category. The diabetes pedigree function value is low at 0.183, suggesting a lower genetic risk for diabetes.###\nHence this label was Yes."
"This 30-year-old individual, who has been pregnant once, shows normal diastolic blood pressure and average triceps skin fold thickness. Their glucose levels after a 2-hour oral glucose tolerance test are within normal range, along with slightly elevated serum insulin levels. Despite having a body mass index indicating obesity, their diabetes pedigree function suggests a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The patient is a 48-year-old woman who has been pregnant 9 times. Her diastolic blood pressure is 72, and her triceps skin fold thickness is 22. She had a plasma glucose concentration of 120 after a 2-hour oral glucose tolerance test, with a 2-hour serum insulin level of 56. Her body mass index is 20.8, and her diabetes pedigree function score is 0.733.###\nHence this label was No."
"This 22-year-old individual has been pregnant once and shows low diastolic blood pressure, minimal triceps skin fold thickness, and no plasma glucose concentration after a glucose tolerance test. Additionally, they have no serum insulin after 2 hours and a healthy body mass index. The diabetes pedigree function is low, indicating a lower risk of developing diabetes.###\nHence this label was No."
"A 60-year-old individual who has been pregnant 8 times has diagnostic measurements indicating potential risk for diabetes. Their diastolic blood pressure is low at 68, but they have high triceps skin fold thickness at 36. The plasma glucose concentration after a glucose tolerance test is high at 181, with a very elevated 2-hour serum insulin level of 495. Despite a body mass index of 30.1, the diabetes pedigree function suggests a moderate genetic predisposition for diabetes at 0.615.###\nHence this label was Yes."
"The patient is a 57-year-old woman who has been pregnant 13 times. She has a diastolic blood pressure of 82, triceps skin fold thickness of 19, and plasma glucose concentration of 145 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 110, and she has a body mass index of 22.2. The diabetes pedigree function for this patient is 0.245.###\nHence this label was No."
"The patient is a 45-year-old woman who is pregnant for the first time. She has a diastolic blood pressure of 102 mmHg and a triceps skin fold thickness of 28 mm. Her plasma glucose concentration after a GTT is 133 mg/dL and her 2-hour serum insulin level is 140 μU/ml. She has a body mass index of 32.8 and a diabetes pedigree function of 0.234.###\nHence this label was Yes."
"A 29-year-old individual who has been pregnant 4 times shows normal diastolic blood pressure and no triceps skin fold thickness. Their plasma glucose concentration after a 2-hour GTT is 92, with low insulin levels. They have a high body mass index of 42.2 and a low diabetes pedigree function of 0.237.###\nHence this label was No."
"A 26-year-old woman who has never been pregnant has slightly elevated diastolic blood pressure, with a triceps skin fold thickness indicating excess body fat. Her glucose levels after a meal are high, along with a significantly elevated insulin level. She has a high body mass index and a low diabetes pedigree function score, suggesting a moderate risk for developing diabetes.###\nHence this label was Yes."
"This data pertains to a 22-year-old individual who has been pregnant 3 times. They have a low diastolic blood pressure of 44, average triceps skin fold thickness, and normal plasma glucose concentration of 113 after a glucose tolerance test. Their 2-hour serum insulin level is 0, indicating a potential risk for diabetes. With a body mass index of 22.4 and a low diabetes pedigree function of 0.14, this individual may have a relatively low risk of developing diabetes.###\nHence this label was No."
"The patient is a 29-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 70 mmHg, triceps skin fold thickness of 23 mm, and a plasma glucose concentration of 134 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130 uU/mL. She has a body mass index of 35.4 and a diabetes pedigree function of 0.542.###\nHence this label was Yes."
"The patient is a 38-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 86 and a triceps skin fold thickness of 37. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 101. Her 2-hour serum insulin level is 0. She has a body mass index of 45.6 and a diabetes pedigree function of 1.136. Overall, these measurements indicate a risk for developing diabetes.###\nHence this label was Yes."
"A 49-year-old individual who has been pregnant 6 times has a diastolic blood pressure of 68 mmHg. Their triceps skin fold thickness is 26 mm. After a 2-hour oral glucose tolerance test, their plasma glucose concentration is 165 mg/dL, and their 2-hour serum insulin level is 168 μU/mL. They have a body mass index of 33.6 and a low diabetes pedigree function score of 0.631.###\nHence this label was No."
"The patient is 37 years old and has been pregnant 7 times. They have a diastolic blood pressure of 70 and a triceps skin fold thickness of 33. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 124, with a 2-hour serum insulin level of 215. The patient's body mass index is 25.5 and their diabetes pedigree function is 0.161.###\nHence this label was No."
"This 23-year-old patient has been pregnant 2 times and has a diastolic blood pressure of 74. Their triceps skin fold thickness is 30, and their plasma glucose concentration after a GTT is 107. Their 2-hour serum insulin level is 100. With a body mass index of 33.6 and a diabetes pedigree function of 0.404, this patient's risk of developing diabetes may need to be monitored closely.###\nHence this label was No."
"A 30-year-old woman who is 6 times pregnant has a diastolic blood pressure of 96. She has no triceps skin fold thickness and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 117. Her 2-hour serum insulin level is 0 and she has a body mass index of 28.7. Her diabetes pedigree function is 0.157.###\nHence this label was No."
"A 30-year-old individual who has been pregnant three times with a diastolic blood pressure of 56, a triceps skin fold thickness of 39, a plasma glucose concentration of 111 after a GTT, no insulin after 2 hours, a body mass index of 30.1, and a diabetes pedigree function of 0.557.###\nHence this label was No."
"This patient is a 32-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 27. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 99. She has no insulin present in her serum after 2 hours. Her body mass index is 29.0 and her diabetes pedigree function is 0.203.###\nHence this label was No."
"A 43-year-old woman who has been pregnant 15 times shows normal diastolic blood pressure and slightly elevated triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is within normal range, and her 2-hour serum insulin levels are slightly higher than average. She has a high body mass index and a relatively low diabetes pedigree function, indicating a moderate risk of developing diabetes.###\nHence this label was Yes."
"In this dataset, a 29-year-old individual who has been pregnant 6 times shows normal diastolic blood pressure, no triceps skin fold thickness, and a healthy body mass index of 24.3. They have a normal plasma glucose concentration of 103 and no serum insulin after a 2-hour oral glucose tolerance test. The individual also has a low diabetes pedigree function score of 0.249.###\nHence this label was No."
"A 25-year-old woman who has been pregnant twice shows signs of high risk for developing diabetes, with low diastolic blood pressure, moderate triceps skin fold thickness, high plasma glucose concentration and exceptionally high 2-hour serum insulin levels. She also has a high body mass index and a low diabetes pedigree function score.###\nHence this label was Yes."
"This data represents a 27-year-old individual who has been pregnant twice. They have a low diastolic blood pressure of 70 and a moderate triceps skin fold thickness of 27. Their plasma glucose concentration is within the normal range at 122, with a very low 2-hour serum insulin level of 0. Despite having a high body mass index of 36.8, their diabetes pedigree function is low at 0.34, indicating a relatively low risk of developing diabetes.###\nHence this label was No."
"A 33-year-old individual who has been pregnant 4 times with a diastolic blood pressure of 70, triceps skin fold thickness of 14, plasma glucose concentration of 173 after a GTT, 2-hour serum insulin level of 168, BMI of 29.7, and a diabetes pedigree function value of 0.361.###\nHence this label was Yes."
"A 47-year-old individual, who has been pregnant 10 times, with a diastolic blood pressure of 68, triceps skin fold thickness of 23, plasma glucose concentration of 161 after a glucose tolerance test, 2-hour serum insulin level of 132, body mass index of 25.5, and a diabetes pedigree function value of 0.326.###\nHence this label was Yes."
"A 50-year-old individual, who has been pregnant 11 times, with a diastolic blood pressure of 74. They have a triceps skin fold thickness of 26, plasma glucose concentration of 138 after a glucose tolerance test, and a 2-hour serum insulin level of 144. Their body mass index is 36.1, and their diabetes pedigree function is 0.557.###\nHence this label was Yes."
"This individual is a 28-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 74 mmHg, a triceps skin fold thickness of 40 mm, and a plasma glucose concentration of 123 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 77 μU/ml. She has a body mass index of 34.1 and a diabetes pedigree function of 0.269.###\nHence this label was No."
"This patient is a 29-year-old female who has been pregnant twice. She has a diastolic blood pressure of 75 mmHg and a triceps skin fold thickness of 0 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 139 mg/dL. Her 2-hour serum insulin level is 0 uU/mL. She has a body mass index of 25.6 kg/m^2 and a diabetes pedigree function value of 0.167.###\nHence this label was No."
"A 39-year-old individual who has been pregnant 3 times with a diastolic blood pressure of 56. Their triceps skin fold thickness is 34, plasma glucose concentration after a glucose tolerance test is 96, and 2-hour serum insulin level is 115. With a body mass index of 24.7 and a diabetes pedigree function of 0.944, this person's risk of developing diabetes may be assessed.###\nHence this label was No."
"This 28-year-old individual has been pregnant 4 times and has a diastolic blood pressure of 58. Their triceps skin fold thickness is 22, while their plasma glucose concentration after a glucose tolerance test is 85. They have a 2-hour serum insulin level of 49 and a body mass index of 27.8. The diabetes pedigree function value is 0.306.###\nHence this label was No."
"A 25-year-old woman has been pregnant five times and shows low diastolic blood pressure. She has extremely low triceps skin fold thickness and 2-hour serum insulin levels. Despite a low plasma glucose concentration after a glucose tolerance test, she has a relatively high body mass index. Additionally, her diabetes pedigree function score indicates a moderate genetic risk for diabetes.###\nHence this label was No."
"The patient is a 41-year-old female who has been pregnant 10 times. She has a diastolic blood pressure of 68 and triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122, with a 2-hour serum insulin level of 0. Her body mass index is 31.2 and her diabetes pedigree function is 0.258.###\nHence this label was No."
"This data represents a 29-year-old individual who is pregnant for the third time. She has a normal diastolic blood pressure of 74 and a high plasma glucose concentration of 182, indicating a potential risk for diabetes. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0. However, she has a relatively high body mass index of 30.5 and a moderate diabetes pedigree function value of 0.345.###\nHence this label was Yes."
"A 28-year-old individual, who is pregnant for the first time, with a diastolic blood pressure of 68, a triceps skin fold thickness of 49, a high plasma glucose concentration of 172 after a glucose tolerance test, a very high 2-hour serum insulin level of 579, a body mass index of 42.4, and a moderate diabetes pedigree function of 0.702.###\nHence this label was Yes."
"The patient is a 38-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 70 mmHg and a triceps skin fold thickness of 40 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 151 mg/dL, and her 2-hour serum insulin level is 271 µU/mL. She has a body mass index of 41.8 and a diabetes pedigree function score of 0.742.###\nHence this label was Yes."
"The patient is a 49-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 88 mmHg and a triceps skin fold thickness of 36 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 126 mg/dL, and she has a 2-hour serum insulin level of 108 μU/mL. Her body mass index is 38.5, and her diabetes pedigree function is 0.349.###\nHence this label was No."
"The patient is a 26-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 33, and a plasma glucose concentration of 124 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 130, and she has a body mass index of 33.2. The diabetes pedigree function for this patient is 0.305.###\nHence this label was No."
"The patient is a 25-year-old female who has been pregnant 3 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 30. Her plasma glucose concentration after a glucose tolerance test is 84, with a 2-hour serum insulin level of 106. The patient has a body mass index of 31.9 and a diabetes pedigree function of 0.591.###\nHence this label was No."
"The patient is a 27-year-old female who has never been pregnant. She has a diastolic blood pressure of 86 mmHg, triceps skin fold thickness of 17mm, and a plasma glucose concentration of 102 mg/dL after a two-hour oral glucose tolerance test. Her 2-hour serum insulin level is 105 μU/mL. She has a body mass index of 29.3 and a diabetes pedigree function value of 0.695.###\nHence this label was No."
"A 24-year-old individual with 2 pregnancies shows normal diastolic blood pressure, high triceps skin fold thickness, average glucose levels after a glucose tolerance test, zero insulin levels, high body mass index, and a moderately elevated diabetes pedigree function score.###\nHence this label was No."
"This individual, aged 36, has been pregnant 3 times. They have a low diastolic blood pressure of 58 and a relatively low triceps skin fold thickness of 22. However, their plasma glucose concentration after a glucose tolerance test is high at 174, and their 2-hour serum insulin level is also elevated at 194. Despite having a body mass index of 32.9, indicating overweight, their diabetes pedigree function value is low at 0.593.###\nHence this label was Yes."
"A 27-year-old woman who has been pregnant twice has a diastolic blood pressure of 74. Her triceps skin fold thickness is 17, and her plasma glucose concentration after a 2-hour oral glucose tolerance test is 155. She has a 2-hour serum insulin level of 96 and a body mass index of 26.6. Her diabetes pedigree function is 0.433.###\nHence this label was Yes."
"This patient is a 39-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 74 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 197, and she has a 2-hour serum insulin level of 0. With a body mass index of 25.9 and a diabetes pedigree function of 1.191, this patient may be at risk for developing diabetes.###\nHence this label was Yes."
"The patient is a 45-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 100, a triceps skin fold thickness of 36, and a plasma glucose concentration of 105 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 0, and she has a body mass index of 43.3. The diabetes pedigree function, which assesses the likelihood of diabetes based on family history, is 0.239.###\nHence this label was Yes."
"A 29-year-old individual, who has been pregnant 4 times, with a diastolic blood pressure of 88. They have a triceps skin fold thickness of 47, a plasma glucose concentration of 90, and a 2-hour serum insulin level of 54. Their body mass index is 37.7, and they have a diabetes pedigree function of 0.362.###\nHence this label was No."
"This 21-year-old individual, who has been pregnant once, has a diastolic blood pressure of 60 and a triceps skin fold thickness of 32. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 124, and they have a 2-hour serum insulin level of 0. With a body mass index of 35.8 and a diabetes pedigree function of 0.514, their risk of developing diabetes may need to be monitored closely.###\nHence this label was No."
"The patient, a 22-year-old female, is at low risk for diabetes based on her diagnostic measurements. She has been pregnant once. Her diastolic blood pressure is normal at 68 mmHg. The patient has a healthy body mass index of 32.0 and a low diabetes pedigree function of 0.389. Notably, her plasma glucose concentration at 2 hours and serum insulin levels are both at the lowest possible values of 0.###\nHence this label was No."
"The patient is a 43-year-old woman who has been pregnant 7 times. She has a diastolic blood pressure of 68 and a triceps skin fold thickness of 49. Her plasma glucose concentration at 2 hours in an oral glucose tolerance test is 129, and she has a 2-hour serum insulin level of 125. With a body mass index of 38.5 and a diabetes pedigree function of 0.439, she may be at risk for developing diabetes.###\nHence this label was Yes."
"A 46-year-old individual who has been pregnant 6 times with a diastolic blood pressure of 80. They have a triceps skin fold thickness of 37 mm and a plasma glucose concentration of 134 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is 370 μU/mL and their body mass index is 46.2. The diabetes pedigree function score is 0.238.###\nHence this label was Yes."
"The patient is a 21-year-old woman who is pregnant for the first time. She has a slightly low diastolic blood pressure of 60 and a normal triceps skin fold thickness of 23. Her glucose levels after a GTT are at a healthy level of 130. She has a relatively high insulin level of 170, possibly indicating insulin resistance. Her body mass index is 28.6, which falls into the overweight category. She has a moderate diabetes pedigree function score of 0.692, suggesting a medium genetic risk for diabetes.###\nHence this label was No."
"This patient is a 25-year-old woman who has never been pregnant. Her diastolic blood pressure is 62, and her triceps skin fold thickness is 0. She has a plasma glucose concentration of 101 after a 2-hour oral glucose tolerance test, with no serum insulin detected. Her body mass index is 21.9, and her diabetes pedigree function is 0.336.###\nHence this label was No."
"The individual in the dataset is a 50-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 62 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a glucose tolerance test is 162, and her 2-hour serum insulin level is 0. With a body mass index of 24.3 and a low diabetes pedigree function of 0.178, she may have a relatively low risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 38-year-old woman who has been pregnant nine times. She has a healthy diastolic blood pressure of 78 and a moderate triceps skin fold thickness of 25. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is low at 72, and her 2-hour serum insulin level is zero. With a body mass index of 31.6, she is considered overweight. The diabetes pedigree function score is low at 0.28, indicating a lower risk of developing diabetes.###\nHence this label was No."
"A 27-year-old woman who has been pregnant four times shows normal diastolic blood pressure and body mass index. Her triceps skin fold thickness is within a healthy range, and her oral glucose tolerance test results indicate normal glucose levels. Despite a moderate level of insulin in her blood, her risk of developing diabetes appears to be low based on her family history.###\nHence this label was No."
"A 25-year-old individual who has been pregnant 3 times shows normal diastolic blood pressure and slightly above average body mass index. Their triceps skin fold thickness is within the healthy range. Despite having a low insulin level, their plasma glucose concentration is normal. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was Yes."
"This patient is a 27-year-old female who has been pregnant twice. She has a diastolic blood pressure of 74, triceps skin fold thickness of 29, and a plasma glucose concentration of 110 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 125, and she has a body mass index of 32.4. The diabetes pedigree function, a measure of the genetic influence of diabetes, is 0.698 for this patient.###\nHence this label was No."
"This 24-year-old patient has never been pregnant and has a healthy diastolic blood pressure of 68. Despite a slightly high triceps skin fold thickness of 42, their plasma glucose concentration after a glucose tolerance test is within normal range at 135. However, their 2-hour serum insulin level is elevated at 250. With a body mass index of 42.3, this patient may be at risk for developing diabetes, as indicated by a diabetes pedigree function of 0.365.###\nHence this label was Yes."
"This individual is a 46-year-old woman who has been pregnant 14 times. She has a diastolic blood pressure of 78 and a triceps skin fold thickness of 25. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 100, and her 2-hour serum insulin level is 184. With a body mass index of 36.6 and a diabetes pedigree function value of 0.412, she may have an increased risk of developing diabetes.###\nHence this label was Yes."
"The patient is a 38-year-old woman who has been pregnant 10 times. She has a diastolic blood pressure of 82 and a triceps skin fold thickness of 0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 75, and her 2-hour serum insulin level is 0. She has a body mass index of 33.3 and a diabetes pedigree function of 0.263.###\nHence this label was No."
"This individual is a 23-year-old who has been pregnant twice. They have normal diastolic blood pressure and no triceps skin fold thickness. Their glucose levels are within a healthy range after a 2-hour oral glucose tolerance test. They have low insulin levels, a low body mass index, and a slightly elevated diabetes pedigree function, indicating a low risk for developing diabetes.###\nHence this label was No."
"This is a data entry for a 23-year-old individual who is pregnant for the first time. The patient has a diastolic blood pressure of 74, a triceps skin fold thickness of 26, and a body mass index of 24.1. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 140, and their 2-hour serum insulin level is 180. The patient has a diabetes pedigree function of 0.828.###\nHence this label was No."
"A 32-year-old woman who is one month pregnant underwent a glucose tolerance test. Her diastolic blood pressure is normal at 70, and her triceps skin fold thickness is within healthy limits. Despite a slightly elevated plasma glucose concentration of 115, her 2-hour serum insulin level is well-controlled at 96. She has a moderately high body mass index of 34.6 and a low diabetes pedigree function score of 0.529, indicating a relatively low risk of developing diabetes.###\nHence this label was Yes."
"This is a 28-year-old individual who is 1 time pregnant, with a diastolic blood pressure of 74. They have a triceps skin fold thickness of 12, a 2-hour plasma glucose concentration of 100, and a 2-hour serum insulin level of 46. Their body mass index is 19.5 and their diabetes pedigree function is 0.149.###\nHence this label was No."
"This is a young female who has never been pregnant. She has normal diastolic blood pressure and slightly above average triceps skin fold thickness. Her glucose levels are within the normal range after a glucose tolerance test. She has a moderate level of insulin in her bloodstream. Her body mass index indicates that she is overweight. Overall, she has a low diabetes pedigree function score, suggesting a lower risk of developing diabetes.###\nHence this label was No."
"This patient is a 27-year-old female who has never been pregnant. She has a diastolic blood pressure of 80, triceps skin fold thickness of 34, and a high plasma glucose concentration of 114 after a glucose tolerance test. Her 2-hour serum insulin level is elevated at 285, and she has a high body mass index of 44.2. Despite these risk factors, her diabetes pedigree function is relatively low at 0.167.###\nHence this label was No."
"A 28-year-old woman, who has been pregnant 3 times, shows normal diastolic blood pressure and a moderate triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range, while her 2-hour serum insulin level is slightly elevated. She has a body mass index indicating she is overweight, and her diabetes pedigree function suggests a moderate genetic risk for developing diabetes.###\nHence this label was No."
"This individual is a 58-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 76 and a triceps skin fold thickness of 0, indicating a low amount of subcutaneous fat. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 110, while her 2-hour serum insulin level is 0. With a body mass index of 27.8 and a low diabetes pedigree function of 0.237, she may have a lower risk of developing diabetes.###\nHence this label was No."
"This individual is a 27-year-old who has never been pregnant. She has normal diastolic blood pressure, low triceps skin fold thickness, and a healthy BMI of 18.4. Her glucose levels after a 2-hour oral glucose tolerance test are normal. She also has low insulin levels and a moderate diabetes pedigree function score.###\nHence this label was No."
"This individual, aged 61, has been pregnant 4 times and has a diastolic blood pressure of 92. Their triceps skin fold thickness is 0, indicating low subcutaneous fat. Their plasma glucose concentration after a glucose tolerance test is 146, and their 2-hour serum insulin level is 0. With a body mass index of 31.2, they are categorized as overweight. Their diabetes pedigree function, a measure of diabetes heredity, is 0.539.###\nHence this label was Yes."
"The patient is a 23-year-old female who has been pregnant twice. She has a low diastolic blood pressure of 58 and a relatively low triceps skin fold thickness of 17. Her plasma glucose concentration after a glucose tolerance test is 101. She has a high level of 2-hour serum insulin at 265. Despite this, her body mass index is within the normal range at 24.2. The diabetes pedigree function, which predicts the likelihood of developing diabetes based on family history, is 0.614.###\nHence this label was No."
"A 47-year-old individual with 5 pregnancies has a low diastolic blood pressure of 78. Their triceps skin fold thickness is 0, indicating low body fat. Despite having a relatively high plasma glucose concentration of 143, their 2-hour serum insulin level is 0, suggesting potential issues with insulin production. The individual has a high body mass index of 45.0 and a low diabetes pedigree function of 0.19.###\nHence this label was No."
"This 22-year-old individual has been pregnant once and has a low diastolic blood pressure of 60. They have a relatively healthy 2-hour serum insulin level of 75 and a normal plasma glucose concentration of 87. Despite a slightly elevated triceps skin fold thickness and body mass index of 37.2, their diabetes pedigree function is low at 0.509.###\nHence this label was No."
"A 21-year-old individual who has never been pregnant shows normal diastolic blood pressure and no triceps skin fold thickness. Their glucose levels are normal, while their insulin levels are low. They have a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was No."
"A 28-year-old woman who has been pregnant twice has a diastolic blood pressure of 52 mmHg. She has a triceps skin fold thickness of 43 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 122 mg/dL, and her 2-hour serum insulin level is 158 μU/mL. With a body mass index of 36.2, she has a moderate risk of developing diabetes as indicated by her diabetes pedigree function of 0.816.###\nHence this label was No."
"This patient is 21 years old and has been pregnant twice. Their diastolic blood pressure is 90 mmHg, triceps skin fold thickness is 19 mm, and plasma glucose concentration after a glucose tolerance test is 117 mg/dL. The 2-hour serum insulin level is 71 μU/mL. They have a body mass index of 25.2 and a diabetes pedigree function of 0.313.###\nHence this label was No."
"The patient is a 23-year-old female who is pregnant for the first time. She has normal diastolic blood pressure, a slightly below average triceps skin fold thickness, and a normal plasma glucose concentration after a glucose tolerance test. She has no insulin in her bloodstream, and her body mass index is in the overweight range. The diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"A 27-year-old woman who has been pregnant twice shows normal diastolic blood pressure and no triceps skin fold thickness. She has a moderately elevated plasma glucose level after a glucose tolerance test, with no insulin resistance. Her body mass index is within the healthy range, and she has a low diabetes pedigree score.###\nHence this label was No."
"The patient is a 40-year-old female who has been pregnant 10 times. She has a normal diastolic blood pressure of 70 and a healthy body mass index of 27.5. Her triceps skin fold thickness is 27mm. The patient had a plasma glucose concentration of 111 after a 2-hour oral glucose tolerance test, with a low level of 2-hour serum insulin at 0. Her diabetes pedigree function is 0.141, indicating a low genetic risk for diabetes.###\nHence this label was Yes."
"The patient is a 22-year-old woman who has been pregnant 4 times. She has a low diastolic blood pressure of 60 and a relatively low triceps skin fold thickness of 23. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 97. She has no serum insulin after 2 hours. Her body mass index is 28.2, indicating she is slightly overweight. The diabetes pedigree function score is 0.443, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"The individual is a 26-year-old who has never been pregnant. She has a slightly elevated diastolic blood pressure of 94 and a higher-than-average triceps skin fold thickness of 46. Her plasma glucose concentration after a glucose tolerance test is 135, and her 2-hour serum insulin level is relatively high at 145. She has a high body mass index of 40.6 and a low diabetes pedigree function value of 0.284.###\nHence this label was No."
"A 24-year-old individual who has been pregnant 3 times has a diastolic blood pressure of 64. They have a triceps skin fold thickness of 13 and a plasma glucose concentration of 158 mg/dL after a glucose tolerance test. Their 2-hour serum insulin level is 387 μU/mL, and their body mass index is 31.2. The diabetes pedigree function is 0.295.###\nHence this label was No."
"This patient is a 41-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 80, triceps skin fold thickness of 48, and a plasma glucose concentration of 120 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 200, and she has a body mass index of 38.9. Additionally, her diabetes pedigree function is 1.162.###\nHence this label was No."
"A 35-year-old woman who has been pregnant 4 times shows low diastolic blood pressure of 62 and no triceps skin fold thickness. Her plasma glucose level after a 2-hour oral glucose tolerance test is 123, with no insulin present. She has a healthy body mass index of 32.0 and a low diabetes pedigree function score of 0.226.###\nHence this label was Yes."
"The patient is a 37-year-old woman who has been pregnant 5 times. She has a normal diastolic blood pressure of 80 and a high triceps skin fold thickness of 32. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 0, and her 2-hour serum insulin level is also 0. Despite these values, she has a high body mass index of 41.0. However, her diabetes pedigree function is relatively low at 0.346.###\nHence this label was Yes."
"The patient is 42 years old, has been pregnant twice, and has a diastolic blood pressure of 90. Their triceps skin fold thickness is 30, plasma glucose concentration after a glucose tolerance test is 89, and they have no serum insulin after 2 hours. The patient's body mass index is 33.5 and their diabetes pedigree function is 0.292.###\nHence this label was No."
"A 45-year-old individual who has been pregnant 10 times with a diastolic blood pressure of 78. Their triceps skin fold thickness is 31, plasma glucose concentration after a glucose tolerance test is 122, and they have no insulin after 2 hours. They have a body mass index of 27.6 and a diabetes pedigree function of 0.512.###\nHence this label was No."
"A 28-year-old individual who has been pregnant 3 times, with a diastolic blood pressure of 76. They have a triceps skin fold thickness of 36, a plasma glucose concentration of 158 following an oral glucose tolerance test, and a 2-hour serum insulin level of 245. Their body mass index is 31.6, and their diabetes pedigree function is 0.851.###\nHence this label was Yes."
"A 44-year-old woman who has been pregnant 12 times with normal diastolic blood pressure, no triceps skin fold thickness, and a slightly low plasma glucose concentration of 106 after a glucose tolerance test. She has no serum insulin level, a healthy body mass index of 23.6, and a low diabetes pedigree function of 0.137.###\nHence this label was No."
"The patient is a 54-year-old female who has been pregnant 8 times. She has a diastolic blood pressure of 96, no triceps skin fold thickness, and a body mass index of 0.0. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 125, and she has a 2-hour serum insulin level of 0. Her diabetes pedigree function is 0.232.###\nHence this label was Yes."
"The patient is a 41-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 84 mmHg and a triceps skin fold thickness of 33 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 184 mg/dL. She has no insulin detected in her serum after 2 hours. Her body mass index is 35.5 and her diabetes pedigree function is 0.355.###\nHence this label was Yes."
"This individual is a 58-year-old female who has been pregnant 5 times. She has a diastolic blood pressure of 82, a triceps skin fold thickness of 26, and a plasma glucose concentration of 144 after a 2-hour oral glucose tolerance test. Additionally, her 2-hour serum insulin level is 285, and her body mass index is 32.0. Her diabetes pedigree function is 0.452.###\nHence this label was Yes."
"The patient is a 25-year-old female who has been pregnant twice. She has a diastolic blood pressure of 74 mmHg and a triceps skin fold thickness of 26mm. Her glucose level after a 2-hour oral glucose tolerance test is 129 mg/dL, and her insulin level is 205 μU/mL. She has a body mass index of 33.2 and a diabetes pedigree function of 0.591.###\nHence this label was No."
"The patient is a 38-year-old woman who has been pregnant 13 times. She has a normal diastolic blood pressure of 72 and zero triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 104, with zero 2-hour serum insulin. She has a body mass index of 31.2 and a low diabetes pedigree function score of 0.465.###\nHence this label was Yes."
"The patient is a young, non-pregnant individual with normal diastolic blood pressure and low triceps skin fold thickness. Their glucose levels after a meal are within a healthy range. Despite having no insulin in their system, they have a higher body mass index. The diabetes pedigree function value suggests a low genetic risk for diabetes.###\nHence this label was No."
"The individual in the data is a 21-year-old who has never been pregnant. She has a diastolic blood pressure of 88, a triceps skin fold thickness of 29, and a plasma glucose concentration of 78 after a glucose tolerance test. Her 2-hour serum insulin level is 40, and she has a body mass index of 36.9. The diabetes pedigree function, a factor indicating diabetes hereditary risk, is 0.434.###\nHence this label was No."
"This individual is 40 years old and has been pregnant 6 times. They have a diastolic blood pressure of 72 and a triceps skin fold thickness of 27. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 144, and their 2-hour serum insulin level is 228. They have a body mass index of 33.9 and a diabetes pedigree function of 0.255.###\nHence this label was No."
"The patient is a young adult female, 21 years old, who has never been pregnant. She has normal diastolic blood pressure and a low triceps skin fold thickness. Her glucose level after a glucose tolerance test is within the normal range. She has very low insulin levels and a healthy body mass index. Her diabetes pedigree function suggests a low genetic risk for diabetes.###\nHence this label was No."
"The person in this data is a 62-year-old who has never been pregnant. They have a diastolic blood pressure of 84 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 105, with a 2-hour serum insulin level of 0. They have a body mass index of 27.9 and a diabetes pedigree function of 0.741.###\nHence this label was Yes."
"This patient, a 31-year-old individual, has been pregnant 6 times. Their diastolic blood pressure is 88, triceps skin fold thickness is 0, and 2-hour serum insulin is 0. They have a plasma glucose concentration of 107 and a body mass index of 36.8. The diabetes pedigree function indicates a potential genetic predisposition to diabetes at 0.727.###\nHence this label was No."
"This individual is a 51-year-old with a history of 10 pregnancies. Their diastolic blood pressure is 84, and they have a triceps skin fold thickness of 48. They registered a plasma glucose concentration of 148 after a 2-hour oral glucose tolerance test, along with a 2-hour serum insulin level of 237. Their body mass index is 37.6, and they have a diabetes pedigree function of 1.001.###\nHence this label was Yes."
"This patient is a 34-year-old female who has been pregnant 9 times. She has a diastolic blood pressure of 70 mmHg, triceps skin fold thickness of 33 mm, and a plasma glucose concentration of 124 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 402 μU/mL, and her body mass index is 35.4 kg/m². Her diabetes pedigree function is 0.282. ###\nHence this label was No."
"The patient is a 46-year-old woman who has been pregnant 8 times. She has a diastolic blood pressure of 62 and a triceps skin fold thickness of 26. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 155. Her 2-hour serum insulin level is high at 495. She has a body mass index of 34.0 and a diabetes pedigree function of 0.543. This data suggests that the patient may be at risk for developing diabetes due to her high insulin levels and elevated body mass index.###\nHence this label was Yes."
"The patient is a 22-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 70 mmHg. Her triceps skin fold thickness is 32 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 91 mg/dL, and her 2-hour serum insulin level is 88 μU/mL. She has a body mass index of 33.1 and a diabetes pedigree function score of 0.446.###\nHence this label was No."
"This patient is a 38-year-old woman who has been pregnant 3 times. Her diastolic blood pressure is 74, triceps skin fold thickness is 16, plasma glucose concentration after a glucose tolerance test is 89, and 2-hour serum insulin level is 85. She has a body mass index of 30.4 and a diabetes pedigree function of 0.551. This data can provide insight into her risk of developing diabetes.###\nHence this label was No."
"A 36-year-old individual who has been pregnant 8 times shows a diastolic blood pressure of 78, triceps skin fold thickness of 32, and a high plasma glucose concentration of 151 after a glucose tolerance test. Additionally, they have a 2-hour serum insulin level of 210, a body mass index of 42.9, and a diabetes pedigree function of 0.516.###\nHence this label was Yes."
"The patient is a 46-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 62, triceps skin fold thickness of 32, and a plasma glucose concentration of 92 after a 2-hour oral glucose tolerance test. Additionally, her 2-hour serum insulin level is 126, her body mass index is 32.0, and her diabetes pedigree function is 0.085.###\nHence this label was No."
"A 21-year-old individual who is pregnant for the first time shows normal diastolic blood pressure and a moderate triceps skin fold thickness. Their glucose level after a 2-hour oral glucose tolerance test is below the normal range. They have moderately high insulin levels, elevated body mass index, and a low diabetes pedigree function, indicating a potential risk for developing diabetes in the future.###\nHence this label was No."
"This data belongs to a 26-year-old individual who has been pregnant 2 times. They have a diastolic blood pressure of 68, a triceps skin fold thickness of 22, a plasma glucose concentration of 112 after a glucose tolerance test, and a 2-hour serum insulin level of 94. Their body mass index is 34.1 and their diabetes pedigree function is 0.315.###\nHence this label was No."
"The patient is a 56-year-old individual who has been pregnant 10 times. They have normal diastolic blood pressure, a below-average triceps skin fold thickness, and a slightly low plasma glucose concentration after a glucose tolerance test. Their insulin level after 2 hours is also low. The patient has a healthy body mass index and a moderate family history of diabetes.###\nHence this label was No."
"A 29-year-old woman who has been pregnant twice shows a normal diastolic blood pressure of 80. Her triceps skin fold thickness is slightly above average at 45, while her blood glucose level after a glucose tolerance test is within the healthy range at 105. Her insulin levels are elevated at 191, indicating possible insulin resistance. She has a body mass index of 33.7, which falls into the obese category. Despite these indicators, her diabetes pedigree function is relatively low at 0.711, suggesting a lower genetic risk for diabetes.###\nHence this label was Yes."
"This patient is 33 years old and has never been pregnant. She has a very low diastolic blood pressure of 40 and a moderate triceps skin fold thickness of 35. Her plasma glucose concentration after a glucose tolerance test is 137, and her 2-hour serum insulin level is high at 168. She has a high body mass index of 43.1 and a relatively high diabetes pedigree function of 2.288.###\nHence this label was Yes."
"A 25-year-old female who has been pregnant 4 times shows normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is low, as well as her insulin level. Despite having a body mass index in the obese range, her diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"This is a 24-year-old individual who is pregnant for the first time and has a diastolic blood pressure of 60. They have a triceps skin fold thickness of 46, a plasma glucose concentration of 108, and a 2-hour serum insulin level of 178. With a body mass index of 35.5 and a diabetes pedigree function of 0.415, this individual's risk of developing diabetes may need to be monitored closely.###\nHence this label was No."
"A 30-year-old woman, who has been pregnant once, has a healthy diastolic blood pressure of 74. She has a moderate triceps skin fold thickness of 36mm. Her glucose levels are within normal range at 124 after a 2-hour oral glucose tolerance test. Her insulin levels are low at 0. With a body mass index of 27.8, she is considered overweight. Her diabetes pedigree function is low at 0.1, indicating a low genetic risk of developing diabetes.###\nHence this label was No."
"A 22-year-old woman who has never been pregnant has a normal diastolic blood pressure and a slightly higher triceps skin fold thickness. Her plasma glucose level after a glucose tolerance test is within the normal range. She has an insulin level of zero, which may indicate potential issues with insulin production. Her body mass index is in the overweight category. Overall, her risk of developing diabetes appears to be low based on these measurements.###\nHence this label was No."
"The patient is a 25-year-old woman who has never been pregnant. She has a diastolic blood pressure of 64, triceps skin fold thickness of 36, and a plasma glucose concentration of 97 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 100, and she has a body mass index of 36.8. The diabetes pedigree function, which assesses the likelihood of developing diabetes based on family history, is 0.6. This data suggests that the patient has some risk factors for diabetes, such as high BMI and insulin levels, but further testing would be needed for a definitive diagnosis.###\nHence this label was No."
"A 22-year-old woman, who has been pregnant 3 times, with a diastolic blood pressure of 100 and a triceps skin fold thickness of 35. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 123, and her 2-hour serum insulin level is 240. Her body mass index is 57.3, and she has a diabetes pedigree function of 0.88.###\nHence this label was No."
"This is a dataset of a 23-year-old individual who has been pregnant twice. Their diastolic blood pressure is 70, triceps skin fold thickness is 32, plasma glucose concentration is 121, 2-hour serum insulin is 95, body mass index is 39.1, and diabetes pedigree function is 0.886. The data provides valuable insights into the individual's health and potential risk for developing diabetes.###\nHence this label was No."
"This data describes a 29-year-old patient who has never been pregnant. They have normal diastolic blood pressure, no triceps skin fold thickness, and zero serum insulin levels. However, their plasma glucose concentration after a 2-hour oral glucose tolerance test is 141, indicating a high glucose level. Their body mass index is 42.4, which is considered obese. The patient has a low diabetes pedigree function score of 0.205, suggesting a lower genetic predisposition to diabetes.###\nHence this label was Yes."
"A 31-year-old woman who has been pregnant twice has a low diastolic blood pressure of 60. She has a moderate triceps skin fold thickness of 20 and a normal plasma glucose concentration of 125 after a glucose tolerance test. Her 2-hour serum insulin level is elevated at 140, and she has a high body mass index of 33.8. The diabetes pedigree function indicates a low genetic predisposition to diabetes at 0.088.###\nHence this label was No."
"The patient is a 65-year-old woman who has been pregnant 5 times. She has normal diastolic blood pressure and zero triceps skin fold thickness. Her glucose tolerance test result is 147, which is slightly high. She has no insulin present in her body, indicating a possible insulin-related issue. Despite having a body mass index of 33.7, she has a low risk for diabetes according to her family history.###\nHence this label was No."
"A 24-year-old individual who has been pregnant 4 times shows normal diastolic blood pressure and slightly above-average triceps skin fold thickness. Their glucose levels after a 2-hour oral glucose tolerance test are within normal range. They have elevated serum insulin levels and a relatively high body mass index indicating possible risk for diabetes. However, their diabetes pedigree function is low, suggesting a lower genetic predisposition to the disease.###\nHence this label was No."
"This individual is 38 years old and has been pregnant 10 times. They have a low diastolic blood pressure of 62 and a high triceps skin fold thickness of 36. Their plasma glucose concentration after a glucose tolerance test is 129, and their 2-hour serum insulin is 0. They have a high body mass index of 41.2 and a relatively low diabetes pedigree function score of 0.441.###\nHence this label was Yes."
"This individual is a 21-year-old who has never been pregnant. They have a diastolic blood pressure of 64 mmHg and a triceps skin fold thickness of 23 mm. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 118 mg/dL, and their 2-hour serum insulin level is 89 μU/mL. Their body mass index is 0.0, and they have a diabetes pedigree function value of 1.731.###\nHence this label was No."
"This individual is a 22-year-old with a low number of pregnancies (1). They have a low diastolic blood pressure (58) and a moderate triceps skin fold thickness (18). Their glucose tolerance test results indicate a normal plasma glucose concentration (109) and slightly elevated insulin levels (116). They have a healthy body mass index (28.5) and a relatively low diabetes pedigree function score (0.219).###\nHence this label was No."
"A 31-year-old woman who has been pregnant twice has a healthy diastolic blood pressure of 78. She has a slightly elevated triceps skin fold thickness of 37, but her plasma glucose concentration after a GTT is within normal range at 128. Her 2-hour serum insulin levels are higher than average at 182. Despite this, her body mass index is quite high at 43.3, indicating obesity. The calculated diabetes pedigree function value is 1.224, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"This patient is 31 years old and has been pregnant 6 times. Their diastolic blood pressure and triceps skin fold thickness are both 0. The patient's plasma glucose concentration after a glucose tolerance test is 91, and their 2-hour serum insulin level is 0. They have a body mass index of 29.8 and a diabetes pedigree function of 0.501.###\nHence this label was No."
"This patient is a 45-year-old woman who has been pregnant 8 times. She has a normal diastolic blood pressure of 78 and a slightly elevated triceps skin fold thickness of 32. Her plasma glucose concentration after a glucose tolerance test is 154, and her 2-hour serum insulin level is 0, indicating a possible issue with insulin production. She has a body mass index of 32.4, classifying her as obese. Despite her risk factors, her diabetes pedigree function is relatively low at 0.443.###\nHence this label was Yes."
"This patient is 32 years old and has been pregnant 7 times. They have a diastolic blood pressure of 0 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a glucose tolerance test is 100, with no insulin detected after 2 hours. The patient has a body mass index of 30.0 and a diabetes pedigree function of 0.484.###\nHence this label was Yes."
"The patient is a 43-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 82 mmHg. Her triceps skin fold thickness is 25mm. During a glucose tolerance test, her plasma glucose concentration at 2 hours is 95 mg/dL. She has a 2-hour serum insulin level of 180 μU/mL. Her body mass index is 35.0, indicating obesity. The diabetes pedigree function value is 0.233, suggesting a low genetic predisposition to diabetes.###\nHence this label was Yes."
"This data represents a 21-year-old individual who is pregnant for the first time. She has a diastolic blood pressure of 74, a triceps skin fold thickness of 20, and a 2-hour serum insulin level of 23. Her plasma glucose concentration at 2 hours is 0. She has a body mass index of 27.7 and a diabetes pedigree function of 0.299.###\nHence this label was No."
"This data is from a 23-year-old individual who has been pregnant twice. Their diastolic blood pressure is 70, triceps skin fold thickness is 0, and plasma glucose concentration after a glucose tolerance test is 134. The individual has zero 2-hour serum insulin, a body mass index of 28.9, and a diabetes pedigree function of 0.542.###\nHence this label was Yes."
"This data belongs to a 51-year-old individual who has been pregnant 11 times. They have a diastolic blood pressure of 106 and a triceps skin fold thickness of 0. Their plasma glucose concentration at 2 hours is 127, while their 2-hour serum insulin level is 0. With a body mass index of 39.0 and a diabetes pedigree function of 0.19, this individual's data suggests varying levels of risk for developing diabetes.###\nHence this label was No."
"The patient is a young adult female, 25 years old, who is pregnant for the first time. She has normal diastolic blood pressure and a low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is within the normal range. She has moderate insulin levels, low body mass index, and a relatively low diabetes pedigree function score. Overall, based on these measurements, she appears to have a low risk of developing diabetes.###\nHence this label was No."
"A 29-year-old woman who has been pregnant twice has a diastolic blood pressure of 70 and a triceps skin fold thickness of 38. Her plasma glucose concentration after a glucose tolerance test is 146, with a 2-hour serum insulin level of 360. She has a body mass index of 28.0 and a diabetes pedigree function of 0.337.###\nHence this label was Yes."
"A 30-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 74, triceps skin fold thickness of 35, plasma glucose concentration of 157 after a GTT, 2-hour serum insulin level of 440, a body mass index of 39.4, and a diabetes pedigree function of 0.134.###\nHence this label was No."
"The patient is a 22-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. Her blood glucose level after a glucose tolerance test is 99 mg/dL. She has a healthy body mass index of 25.0 and a low diabetes pedigree function of 0.253.###\nHence this label was No."
"This patient is a 24-year-old female who has been pregnant 2 times. She has a diastolic blood pressure of 58 mmHg and a triceps skin fold thickness of 34 mm. Her plasma glucose concentration after a glucose tolerance test is 141 mg/dL, and her 2-hour serum insulin level is 128 uU/mL. She has a body mass index of 25.4 and a diabetes pedigree function of 0.699. Overall, these measurements suggest a moderate risk for developing diabetes.###\nHence this label was No."
"A 51-year-old woman, who has been pregnant 7 times, has a diastolic blood pressure of 84 mmHg. Her triceps skin fold thickness is 21 mm. She has a high plasma glucose concentration of 181 mg/dL after a 2-hour oral glucose tolerance test and a relatively high 2-hour serum insulin level of 192 μU/mL. With a body mass index of 35.9, she is considered obese. Her diabetes pedigree function score is 0.586, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"A 22-year-old individual who has been pregnant 3 times shows a low diastolic blood pressure of 58 and a moderately low triceps skin fold thickness of 31. Their plasma glucose concentration after a two-hour oral glucose tolerance test is 111, while their 2-hour serum insulin level is 44. With a body mass index of 29.5, they have a relatively low risk of developing diabetes, indicated by a diabetes pedigree function of 0.43.###\nHence this label was No."
"This individual is a 21-year-old who has never been pregnant. They have a healthy diastolic blood pressure of 68 and a normal triceps skin fold thickness of 14. Their plasma glucose concentration after a glucose tolerance test is 137, and their 2-hour serum insulin level is 148. With a body mass index of 24.8 and a low diabetes pedigree function of 0.143, this person appears to have a relatively low risk of developing diabetes.###\nHence this label was No."
"This individual is a 55-year-old woman who has been pregnant 6 times. She has a healthy diastolic blood pressure of 61 and a low triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 137, and she has no insulin present in her serum. With a body mass index of 24.2 and a low diabetes pedigree function of 0.151, she appears to have a low risk of developing diabetes based on these measurements.###\nHence this label was No."
"The patient is a 27-year-old woman who has been pregnant 3 times. She has a diastolic blood pressure of 88, triceps skin fold thickness of 41, plasma glucose concentration of 126 after a 2-hour oral glucose tolerance test, and 2-hour serum insulin level of 235. Her body mass index is 39.3 and she has a diabetes pedigree function of 0.704.###\nHence this label was No."
"This individual is 37 years old and has been pregnant 4 times. Their diastolic blood pressure is 72, triceps skin fold thickness is 12, and plasma glucose concentration after a glucose tolerance test is 116. Their 2-hour serum insulin level is 87, body mass index is 22.1, and diabetes pedigree function is 0.463.###\nHence this label was No."
"A 38-year-old patient, who is pregnant for the first time, with a diastolic blood pressure of 74, no triceps skin fold thickness, and a plasma glucose concentration of 173 after a glucose tolerance test. The patient has no serum insulin after 2 hours, a body mass index of 36.8, and a low diabetes pedigree function of 0.088.###\nHence this label was Yes."
"This data is from a 22-year-old individual who has never been pregnant. They have a diastolic blood pressure of 64, a triceps skin fold thickness of 39, and a plasma glucose concentration of 95 after a glucose tolerance test. Their 2-hour serum insulin level is 105, and their body mass index is 44.6. The diabetes pedigree function, which predicts the likelihood of developing diabetes based on family history, is 0.366.###\nHence this label was No."
"The patient is a 46-year-old woman who has been pregnant 12 times. She has a diastolic blood pressure of 84, triceps skin fold thickness of 33, and a plasma glucose concentration of 100 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 105, and she has a body mass index of 30.0. The diabetes pedigree function is 0.488.###\nHence this label was No."
"This data represents a 32-year-old individual who has been pregnant 8 times. They have a low diastolic blood pressure of 64 and a triceps skin fold thickness of 0, indicating lower body fat. Their plasma glucose concentration after a glucose tolerance test is high at 183, but they have no insulin present in their serum. The individual has a healthy body mass index of 23.3 and a low diabetes pedigree score of 0.672, suggesting a lower risk of developing diabetes.###\nHence this label was Yes."
"A 24-year-old woman, who is pregnant for the first time, has a healthy diastolic blood pressure of 68. She has a moderate triceps skin fold thickness of 34, and her plasma glucose concentration after a 2-hour oral glucose tolerance test is normal at 87. Her 2-hour serum insulin level is also within the typical range at 77. Despite having a slightly high body mass index of 37.6, her diabetes pedigree function is low at 0.401, indicating a relatively low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 22-year-old female who has been pregnant 3 times. She has a low diastolic blood pressure of 58, a low triceps skin fold thickness of 11, and a normal plasma glucose concentration of 88. Her 2-hour serum insulin level is moderate at 54, and she has a healthy body mass index of 24.8. The diabetes pedigree function indicates a low genetic risk of diabetes at 0.267.###\nHence this label was No."
"This patient is a 21-year-old who has never been pregnant and has a low diastolic blood pressure of 52. They have a thin triceps skin fold thickness of 0, normal glucose levels of 102, and their insulin level is also normal at 0. The patient has a healthy body mass index of 25.1 and a very low diabetes pedigree function score of 0.078.###\nHence this label was No."
"This person is 25 years old and has been pregnant twice. Their diastolic blood pressure is 58, triceps skin fold thickness is 33, and plasma glucose concentration after a GTT is 144. They have a 2-hour serum insulin level of 135 and a body mass index of 31.6. Their diabetes pedigree function is 0.422.###\nHence this label was Yes."
"A 23-year-old individual, who has been pregnant twice, with a diastolic blood pressure of 64, a triceps skin fold thickness of 32, a plasma glucose concentration of 93 after a glucose tolerance test, a 2-hour serum insulin level of 160, a body mass index of 38.0, and a diabetes pedigree function score of 0.674.###\nHence this label was Yes."
"The individual in the dataset is a 21-year-old who has never been pregnant. They have normal diastolic blood pressure and a low triceps skin fold thickness. Their glucose level after a 2-hour oral GTT is within normal range. They have no serum insulin after 2 hours. Despite having a relatively high body mass index, their diabetes pedigree function indicates a low genetic risk for diabetes.###\nHence this label was No."
"A 26-year-old woman, who is pregnant for the first time, has a low diastolic blood pressure of 50. She has a moderate triceps skin fold thickness of 15 and a normal plasma glucose concentration of 101 after a glucose tolerance test. Her 2-hour serum insulin level is within the normal range at 36. With a healthy body mass index of 24.2 and a relatively low diabetes pedigree function score of 0.526, she appears to have a low risk of developing diabetes.###\nHence this label was No."
"A 23-year-old woman who has never been pregnant has normal diastolic blood pressure and no triceps skin fold thickness. Her blood glucose level after a glucose tolerance test is 113, and her insulin level is normal. She has a slightly elevated body mass index and a low diabetes pedigree function, indicating a low risk of developing diabetes.###\nHence this label was Yes."
"This patient is a 21-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 62 mmHg and triceps skin fold thickness of 41 mm. Her glucose level is 139 mg/dL after a 2-hour oral glucose tolerance test, and her insulin level is 480 μU/mL. She has a body mass index of 40.7, indicating obesity, and a diabetes pedigree function of 0.536, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This 25-year-old individual has been pregnant 3 times and has a diastolic blood pressure of 82. Their triceps skin fold thickness is 48, plasma glucose concentration after 2 hours of an oral glucose tolerance test is 173, and 2-hour serum insulin level is 465. With a body mass index of 38.4 and a diabetes pedigree function of 2.137, this person's risk of developing diabetes may be elevated.###\nHence this label was Yes."
"A 49-year-old individual, who has been pregnant 9 times, with a diastolic blood pressure of 85, triceps skin fold thickness of 15, plasma glucose concentration of 184 after a glucose tolerance test, no serum insulin after 2 hours, a body mass index of 30.0, and a diabetes pedigree function of 1.213.###\nHence this label was Yes."
"The patient is a 50-year-old who has been pregnant 6 times. They have a normal diastolic blood pressure of 80 and zero triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 147, and their 2-hour serum insulin level is zero. With a body mass index of 29.5 and a low diabetes pedigree function of 0.178, this individual may have a lower risk of developing diabetes.###\nHence this label was Yes."
"This data belongs to a 66-year-old individual who has been pregnant 6 times. They have a diastolic blood pressure of 74 and no triceps skin fold thickness. Their plasma glucose concentration after a glucose tolerance test is 166, with a 2-hour serum insulin level of 0. The individual has a body mass index of 26.6 and a diabetes pedigree function of 0.304.###\nHence this label was No."
"This individual is 21 years old and has never been pregnant. They have normal diastolic blood pressure and a low triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is within normal range. They have no serum insulin levels and a slightly elevated body mass index. Their diabetes pedigree function score is moderate.###\nHence this label was No."
