"A 22-year-old individual, who is not pregnant, has low diastolic blood pressure, average triceps skin fold thickness, low plasma glucose concentration after a glucose tolerance test, average serum insulin level, low body mass index, and a low diabetes pedigree function score.###\nHence this label was No."
"The patient is a 55-year-old female who has been pregnant 3 times. She has a normal diastolic blood pressure of 78 and a very low triceps skin fold thickness of 0. Her glucose levels are within a healthy range at 128, and she has no insulin present in her serum after a 2-hour glucose tolerance test. With a low body mass index of 21.1 and a relatively low diabetes pedigree function of 0.268, this individual appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"A 26-year-old woman who has been pregnant twice shows relatively normal diagnostic measurements: her diastolic blood pressure, glucose, and BMI are within healthy ranges. However, she has a low triceps skin fold thickness indicating lower body fat, and a slightly elevated 2-hour serum insulin level. Her diabetes pedigree function score suggests a moderate genetic predisposition to diabetes. Overall, she appears to have a lower risk of developing diabetes based on these measurements.###\nHence this label was No."
"A 24-year-old individual, who has been pregnant 3 times, with unusually low diastolic blood pressure of 54 mmHg. They have a moderately high triceps skin fold thickness of 21 mm, and a normal plasma glucose concentration of 106 mg/dL after a 2-hour oral glucose tolerance test. Their 2-hour serum insulin level is high at 158 uU/mL, and they have a slightly elevated body mass index of 30.9. The diabetes pedigree function indicates a low genetic risk of 0.292 for developing diabetes.###\nHence this label was No."
"A 27-year-old individual who has been pregnant 6 times, with a diastolic blood pressure of 78, triceps skin fold thickness of 41, plasma glucose concentration after a 2-hour GTT of 154, 2-hour serum insulin level of 140, body mass index of 46.1, and a diabetes pedigree function of 0.571.###\nHence this label was No."
"This individual is a 42-year-old female who has been pregnant once. She has a normal diastolic blood pressure of 74 mmHg. Her triceps skin fold thickness and 2-hour serum insulin levels are both low, indicating lower body fat and insulin production. Her plasma glucose concentration after a glucose tolerance test is 102 mg/dL, which is within the normal range. Despite having a high body mass index of 39.5, her diabetes pedigree function score is low at 0.293, suggesting a lower genetic risk of developing diabetes.###\nHence this label was Yes."
"This individual is a 36-year-old female who has been pregnant 7 times. She has a diastolic blood pressure of 78 mmHg, a triceps skin fold thickness of 26 mm, and a plasma glucose concentration of 83 mg/dL after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 71 μU/ml, and her body mass index is 29.3 kg/m^2. She has a diabetes pedigree function value of 0.767.###\nHence this label was No."
"This patient is a 30-year-old female who has been pregnant 2 times. She has a slightly low diastolic blood pressure of 68 and a healthy triceps skin fold thickness of 28. Her plasma glucose concentration after a 2-hour GTT is 124, and her 2-hour serum insulin levels are high at 205. She has a slightly elevated body mass index of 32.9 and a moderate diabetes pedigree function of 0.875. This data suggests that the patient may be at risk for developing diabetes due to the high insulin levels, elevated BMI, and family history.###\nHence this label was Yes."
"This data belongs to a 22-year-old individual who is 1 time pregnant. They have a diastolic blood pressure of 82, triceps skin fold thickness of 17, plasma glucose concentration of 128, 2-hour serum insulin of 183, body mass index of 27.5, and a diabetes pedigree function score of 0.115.###\nHence this label was No."
"This patient is a 42-year-old woman who has been pregnant twice. She has a diastolic blood pressure of 90 mmHg and a triceps skin fold thickness of 30mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 89 mg/dL, and she has a 2-hour serum insulin level of 0 μU/mL. Her body mass index is 33.5, indicating that she is overweight. Additionally, her diabetes pedigree function score is 0.292, suggesting a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 54-year-old woman who has been pregnant 8 times. She has normal diastolic blood pressure and zero triceps skin fold thickness. Her plasma glucose concentration after a glucose tolerance test is 125, with no serum insulin detected. She has a body mass index of 0.0 and a low diabetes pedigree function score of 0.232.###\nHence this label was Yes."
"The patient is a 31-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 70 mmHg and a high triceps skin fold thickness of 39 mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is significantly elevated at 197 mg/dL, and her 2-hour serum insulin level is very high at 744 μU/mL. She has a body mass index of 36.7, indicating obesity. The diabetes pedigree function score is 2.329, suggesting a moderate genetic predisposition to diabetes. Overall, this data indicates a high risk for developing diabetes.###\nHence this label was No."
"This data describes a 22-year-old individual who is pregnant for the first time. She has a low diastolic blood pressure of 58 and a moderately low triceps skin fold thickness of 18. Her plasma glucose concentration after a glucose tolerance test is normal at 109, but she has a high 2-hour serum insulin level of 116. Her body mass index is in the overweight range at 28.5, and her diabetes pedigree function score is low at 0.219.###\nHence this label was No."
"A 29-year-old woman who has been pregnant six times shows normal diastolic blood pressure and no triceps skin fold thickness. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 124, with no serum insulin detected. She has a healthy body mass index of 27.6 and a low diabetes pedigree function score of 0.368.###\nHence this label was Yes."
"This 25-year-old individual has been pregnant 5 times and has a diastolic blood pressure of 62. Their triceps skin fold thickness is 41, plasma glucose concentration is 109, and 2-hour serum insulin level is 129. With a body mass index of 35.8 and a diabetes pedigree function of 0.514, this person's health profile suggests they may be at risk for developing diabetes.###\nHence this label was Yes."
"A 50-year-old individual who has been pregnant 6 times with normal diastolic blood pressure and slightly above average triceps skin fold thickness. They have high plasma glucose concentration after a glucose tolerance test, no insulin level after 2 hours, and a high body mass index. Their diabetes pedigree function indicates a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"The individual in this data is a 27-year-old who has been pregnant twice. They have a diastolic blood pressure of 84 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a GTT is 129, with a 2-hour serum insulin level of 0. The individual has a body mass index of 28.0 and a diabetes pedigree function score of 0.284.###\nHence this label was No."
"A 44-year-old individual who has been pregnant 12 times with a low diastolic blood pressure of 62. They have a relatively low triceps skin fold thickness of 7, normal plasma glucose concentration of 92, high 2-hour serum insulin level of 258, and a moderate body mass index of 27.6. Their diabetes pedigree function indicates a slightly elevated genetic predisposition to diabetes.###\nHence this label was Yes."
"This individual is a 60-year-old woman who has been pregnant 7 times. She has a slightly elevated diastolic blood pressure of 95, and a moderate triceps skin fold thickness of 31. Her plasma glucose concentration after a glucose tolerance test is high at 179. Despite having no insulin detected in her serum after 2 hours, her body mass index is elevated at 34.2. Her diabetes pedigree function, a measure of hereditary risk, is relatively low at 0.164.###\nHence this label was No."
"The patient is a 34-year-old woman who has been pregnant 4 times. She has a normal diastolic blood pressure of 68 and a low triceps skin fold thickness of 0. Her glucose level after a 2-hour oral glucose tolerance test is within normal range at 120. She has no insulin present in her serum. Her body mass index is 29.6, indicating she is overweight. The patient has a moderate diabetes pedigree function score of 0.709, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This is a data entry of a 26-year-old individual who is 4 times pregnant. She has a normal diastolic blood pressure of 64 and a moderately high triceps skin fold thickness of 44. Her blood sugar levels are within the normal range at 109, but she has a higher than average 2-hour serum insulin level of 99. With a body mass index of 34.8, she is classified as obese. Despite the high insulin level, her diabetes pedigree function is low at 0.905, indicating a lower genetic risk for diabetes.###\nHence this label was Yes."
"A 30-year-old individual who has been pregnant 6 times, shows normal diastolic blood pressure and no triceps skin fold thickness. Their blood glucose level after a glucose tolerance test is within normal range. There is no insulin present in their serum after 2 hours. They have a healthy body mass index and a low diabetes pedigree function score.###\nHence this label was No."
"The patient is a 46-year-old female who has been pregnant 4 times. She has a normal diastolic blood pressure of 72 and a low triceps skin fold thickness of 0. Her plasma glucose concentration is 115 after a 2-hour oral glucose tolerance test, and her 2-hour serum insulin is 0. She has a body mass index of 28.9 and a relatively low diabetes pedigree function of 0.376. Based on these measurements, the patient may have a low risk of developing diabetes.###\nHence this label was Yes."
"This individual is a 27-year-old who has never been pregnant and has normal diastolic blood pressure. Their triceps skin fold thickness, as well as their 2-hour serum insulin levels, are both at 0. They have a relatively low plasma glucose concentration after a glucose tolerance test. However, they have a high body mass index and a moderate diabetes pedigree function score.###\nHence this label was No."
"The patient is a 66-year-old female who has been pregnant 6 times. She has a diastolic blood pressure of 92 and a high plasma glucose concentration of 190 after a glucose tolerance test. Her triceps skin fold thickness and serum insulin levels are both at 0. Despite having a body mass index of 35.5, her diabetes pedigree function is low at 0.278.###\nHence this label was Yes."
"The patient is a 42-year-old woman who has been pregnant 7 times. She has a healthy diastolic blood pressure of 78 and a moderate triceps skin fold thickness of 40. Her plasma glucose concentration after a glucose tolerance test is 81, and her 2-hour serum insulin level is 48. Despite having a high body mass index of 46.7, her diabetes pedigree function is relatively low at 0.261, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"A 25-year-old woman who has never been pregnant shows normal diastolic blood pressure and a normal triceps skin fold thickness. However, she has a slightly low glucose concentration after a glucose tolerance test and high serum insulin levels. Her body mass index indicates she is obese, and her diabetes pedigree function is relatively low.###\nHence this label was No."
"The patient is a 39-year-old woman who has been pregnant 13 times. She has a diastolic blood pressure of 88 and a triceps skin fold thickness of 37. Her glucose level after a GTT is 153, and her 2-hour serum insulin level is 140. With a body mass index of 40.6 and a diabetes pedigree function of 1.174, this patient may be at risk for developing diabetes.###\nHence this label was No."
"This patient is a 41-year-old female who has been pregnant 8 times. She has a low diastolic blood pressure reading of 66 and a triceps skin fold thickness of 0, indicating low levels of subcutaneous fat. Her plasma glucose concentration after a glucose tolerance test is 143, which is on the higher side. The 2-hour serum insulin level is 0, suggesting a potential issue with insulin production. With a body mass index of 34.9, she is classified as obese. The diabetes pedigree function score is low at 0.129, indicating a lower genetic predisposition to diabetes.###\nHence this label was Yes."
"This 24-year-old patient is in the early stages of pregnancy with a diastolic blood pressure of 80. They have a slightly above-average triceps skin fold thickness, and their plasma glucose concentration is within the normal range. The 2-hour serum insulin level is high, indicating possible insulin resistance. The patient has an elevated body mass index and a low diabetes pedigree function score, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"The patient is a 25-year-old female who has never been pregnant. She has normal diastolic blood pressure, no triceps skin fold thickness, and normal insulin levels. Her plasma glucose concentration is slightly elevated at 138, and she has a high body mass index of 36.3. Additionally, her diabetes pedigree function score is 0.933, indicating a moderate genetic predisposition to diabetes.###\nHence this label was Yes."
"This patient is a 40-year-old individual who has been pregnant 3 times. They have a healthy diastolic blood pressure of 78 and a normal triceps skin fold thickness of 39. Their glucose tolerance test results show a plasma glucose concentration of 96, and their 2-hour serum insulin level is at 0. Despite having a relatively high body mass index of 37.3, their diabetes pedigree function is low at 0.238.###\nHence this label was No."
"A 32-year-old individual who has been pregnant 3 times shows slightly elevated diastolic blood pressure and a moderate level of triceps skin fold thickness. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is normal, while their 2-hour serum insulin level is slightly high. They have a relatively high body mass index and a moderate diabetes pedigree function score.###\nHence this label was Yes."
"The patient is a 37-year-old female who has been pregnant 4 times. She has a diastolic blood pressure of 72 mmHg and a triceps skin fold thickness of 12mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is 116 mg/dL and her 2-hour serum insulin level is 87 uU/mL. With a body mass index of 22.1 and a diabetes pedigree function of 0.463, she is at risk of developing diabetes.###\nHence this label was No."
"The data belongs to a 21-year-old individual who has never been pregnant. Her diastolic blood pressure is 64, triceps skin fold thickness is 17, plasma glucose concentration after a 2-hour oral glucose tolerance test is 101, and 2-hour serum insulin is 0. Her body mass index is 21.0 and she has a low diabetes pedigree function score of 0.252.###\nHence this label was No."
"The patient is 38 years old and has been pregnant 5 times. They have a normal diastolic blood pressure of 82. Their triceps skin fold thickness is 30, indicating a healthy amount of subcutaneous fat. The plasma glucose concentration at 2 hours is 106, which is within the normal range. The 2-hour serum insulin level is 0, suggesting possible insulin sensitivity. The patient has a high body mass index of 39.5, indicating obesity. Their diabetes pedigree function is low at 0.286, suggesting a lower genetic risk for diabetes.###\nHence this label was No."
"A 36-year-old woman, who has been pregnant 3 times, with low diastolic blood pressure and moderate triceps skin fold thickness, shows high plasma glucose concentration and serum insulin levels after a 2-hour oral glucose tolerance test. She has a slightly elevated body mass index and a relatively low diabetes pedigree function score.###\nHence this label was Yes."
"The patient is a 26-year-old female who is pregnant for the first time. She has low diastolic blood pressure of 30 mmHg. Her triceps skin fold thickness is 42 mm. The plasma glucose concentration after a glucose tolerance test is 88 mg/dL, and her 2-hour serum insulin level is 99 μU/mL. She has a high body mass index of 55.0 and a relatively low diabetes pedigree function of 0.496.###\nHence this label was Yes."
"A 40-year-old individual who is 9 times pregnant with a diastolic blood pressure of 80, triceps skin fold thickness of 46, plasma glucose concentration of 145, 2-hour serum insulin of 130, body mass index of 37.9, and a diabetes pedigree function of 0.637. These measurements provide insight into the individual's health and potential risk of developing diabetes.###\nHence this label was Yes."
"This individual is 30 years old and has been pregnant 3 times. Their diastolic blood pressure is 80, triceps skin fold thickness is 11, and plasma glucose concentration after a glucose tolerance test is 99. They have a 2-hour serum insulin level of 64 and a body mass index of 19.3. Their diabetes pedigree function is 0.284.###\nHence this label was No."
"The patient is a 45-year-old female who has been pregnant once. She has a diastolic blood pressure of 94 mmHg and a body mass index of 32.8, indicating obesity. Her triceps skin fold thickness and 2-hour serum insulin levels are both at 0. However, her plasma glucose concentration after a glucose tolerance test is 111 mg/dL, suggesting normal blood sugar levels. The diabetes pedigree function value is 0.265, indicating a low genetic risk for diabetes.###\nHence this label was No."
"The patient is a 42-year-old female who has been pregnant once. She has a diastolic blood pressure of 68, triceps skin fold thickness of 29, and a plasma glucose concentration of 149 after a glucose tolerance test. Her 2-hour serum insulin level is 127, with a body mass index of 29.3. The diabetes pedigree function is 0.349. These measurements indicate a risk for developing diabetes and highlight the importance of monitoring and managing her health.###\nHence this label was Yes."
"This individual is a 21-year-old who has never been pregnant. She has low diastolic blood pressure of 58 and a moderate triceps skin fold thickness of 20. Her plasma glucose concentration after a glucose tolerance test is 134, and her insulin levels are high at 291. With a body mass index of 26.4, she has a moderate risk of developing diabetes according to her diabetes pedigree function of 0.352.###\nHence this label was No."
"This 23-year-old individual has been pregnant twice and shows signs of low insulin sensitivity and high insulin levels. Despite having a relatively low diastolic blood pressure, their plasma glucose concentration after a glucose tolerance test is within normal range. The individual has a healthy body mass index and a moderate diabetes pedigree function score.###\nHence this label was No."
"A 24-year-old woman who has never been pregnant has healthy diastolic blood pressure and a slightly above-average body mass index. Her triceps skin fold thickness and 2-hour serum insulin levels are within normal ranges. However, her plasma glucose concentration after a glucose tolerance test is elevated, indicating a potential risk for developing diabetes. The diabetes pedigree function value suggests a low to moderate genetic predisposition for the disease.###\nHence this label was Yes."
"The patient is a 40-year-old female who is pregnant for the first time. She has a diastolic blood pressure of 88, a triceps skin fold thickness of 24, and a plasma glucose concentration of 117 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 145, and her body mass index is 34.5. The diabetes pedigree function value is 0.403.###\nHence this label was Yes."
"A 21-year-old woman who has been pregnant once has a diastolic blood pressure of 62, triceps skin fold thickness of 41, and a plasma glucose concentration of 139 after a 2-hour oral glucose tolerance test. Her 2-hour serum insulin level is 480, and she has a body mass index of 40.7. The diabetes pedigree function for her is 0.536.###\nHence this label was No."
"This individual is a 41-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 80, a triceps skin fold thickness of 37, and a low plasma glucose concentration of 57 after a glucose tolerance test. Her 2-hour serum insulin level is 0, indicating potentially low insulin production. She has a body mass index of 32.8 and a low diabetes pedigree function of 0.096.###\nHence this label was No."
"This is data from a 26-year-old individual who has been pregnant 6 times. Despite having a normal diastolic blood pressure of 80, they have a slightly elevated triceps skin fold thickness of 28. Their plasma glucose concentration after a glucose tolerance test is within the normal range at 105, but their 2-hour serum insulin level is at 0. They have a body mass index of 32.5, indicating they are overweight. The diabetes pedigree function score is 0.878, suggesting a moderate genetic predisposition to diabetes.###\nHence this label was No."
"This is a young adult woman who has been pregnant 3 times. She has normal diastolic blood pressure and no triceps skin fold thickness. Her glucose levels are within a healthy range, and she has normal insulin levels. She has a healthy body mass index and a low diabetes pedigree function score. Overall, she appears to have a low risk of developing diabetes based on these diagnostic measurements.###\nHence this label was No."
"This patient is 41 years old and has been pregnant 7 times. They have a low diastolic blood pressure of 78 and a triceps skin fold thickness of 0. Their glucose concentration is low at 62, with no insulin present. Despite a body mass index of 32.6, their diabetes pedigree function is low at 0.391.###\nHence this label was No."
"This data belongs to a 28-year-old individual who has been pregnant twice. They have low diastolic blood pressure, moderate triceps skin fold thickness, and slightly elevated plasma glucose concentration after a GTT. Their 2-hour serum insulin level is high, and they have a high body mass index. The individual also has a moderately high diabetes pedigree function score, indicating a potential risk for developing diabetes.###\nHence this label was No."
"This 45-year-old individual has been pregnant 7 times and shows relatively normal diastolic blood pressure at 74. They have a moderate amount of triceps skin fold thickness at 40, and their plasma glucose concentration after a glucose tolerance test is at a normal level of 102. The 2-hour serum insulin level is 105, indicating a healthy response. However, their body mass index is high at 37.2, suggesting overweight. The diabetes pedigree function is low at 0.204, indicating a lower genetic risk for diabetes.###\nHence this label was No."
"The patient is a 45-year-old woman who has been pregnant 9 times. She has a diastolic blood pressure of 94, no triceps skin fold thickness, and a plasma glucose concentration of 140 after a glucose tolerance test. Her 2-hour serum insulin level is 0, and her body mass index is 32.7. With a diabetes pedigree function value of 0.734, this patient may have an increased risk of developing diabetes.###\nHence this label was Yes."
"A 30-year-old individual, who has been pregnant 4 times, has a normal diastolic blood pressure of 62. They have a slightly below-average triceps skin fold thickness of 12, and a normal plasma glucose concentration of 117 after a glucose tolerance test. Their 2-hour serum insulin level is 0, indicating a low insulin production. With a body mass index of 29.7, they are considered overweight. Their diabetes pedigree function score is low at 0.38, suggesting a lower genetic risk for developing diabetes.###\nHence this label was Yes."
"The individual is a 67-year-old, who has been pregnant 4 times. They have a low diastolic blood pressure of 78 and a triceps skin fold thickness of 0. Their plasma glucose concentration after a 2-hour oral glucose tolerance test is 146, with a 2-hour serum insulin level of 0. This person has a high body mass index of 38.5 and a low diabetes pedigree function of 0.52.###\nHence this label was Yes."
"The patient is a 32-year-old female who has never been pregnant. She has a diastolic blood pressure of 88 mmHg and a BMI of 31.6, indicating overweight. Despite having a normal triceps skin fold thickness of 0 mm, her plasma glucose concentration after a glucose tolerance test is slightly elevated at 131 mg/dL. She has no insulin resistance, as her 2-hour serum insulin level is zero. Her diabetes pedigree function score is 0.743, suggesting a moderate genetic predisposition to diabetes. Overall, the patient shows some risk factors for diabetes, but further monitoring may be needed to confirm a diagnosis.###\nHence this label was Yes."
"A 32-year-old woman who has been pregnant 3 times shows normal diastolic blood pressure of 74. She has no triceps skin fold thickness, but her plasma glucose concentration after a 2-hour GTT is 102. Her insulin levels are low at 0, and she has a body mass index of 29.5. Her diabetes risk, as indicated by the pedigree function, is relatively low at 0.121.###\nHence this label was No."
"This individual is a 31-year-old woman who has been pregnant 6 times. She has a diastolic blood pressure of 0, a triceps skin fold thickness of 0, and a 2-hour serum insulin level of 0. Her plasma glucose concentration after a glucose tolerance test is 91, and she has a body mass index of 29.8. The diabetes pedigree function value is 0.501.###\nHence this label was No."
"A 42-year-old individual who has been pregnant 5 times, with a diastolic blood pressure of 86. They have a triceps skin fold thickness of 30, plasma glucose concentration of 117 after a GTT, and a 2-hour serum insulin level of 105. Their body mass index is 39.1, and they have a diabetes pedigree function value of 0.251.###\nHence this label was No."
"This individual is 25 years old and has never been pregnant. Their diastolic blood pressure, triceps skin fold thickness, and 2-hour serum insulin levels are all at 0. However, their plasma glucose concentration after a glucose tolerance test is 94. They have a body mass index of 0.0 and a diabetes pedigree function of 0.256.###\nHence this label was No."
"A 24-year-old woman who has never been pregnant is showing normal values for most diagnostic measurements related to diabetes risk. Her blood pressure, glucose levels, and insulin levels are all within healthy ranges. However, her body mass index is on the higher side, which may indicate a risk factor for developing diabetes in the future.###\nHence this label was Yes."
"A 24-year-old female who has never been pregnant has a diastolic blood pressure of 68, a triceps skin fold thickness of 42, and a plasma glucose concentration of 135 after a GTT. Her 2-hour serum insulin level is 250, and she has a body mass index of 42.3. Her diabetes pedigree function is 0.365.###\nHence this label was Yes."
"The patient is a 34-year-old female who has been pregnant 7 times. She has low diastolic blood pressure (50 mmHg) and a high triceps skin fold thickness of 33mm. Her plasma glucose concentration after a 2-hour oral glucose tolerance test is elevated at 187 mg/dL, and she has a high 2-hour serum insulin level of 392 μU/mL. Despite this, her body mass index is in the obese range at 33.9, and she has a moderate diabetes pedigree function of 0.826.###\nHence this label was Yes."
