"A 50-year-old male patient with no history of chest pain or fasting blood sugar issues. Resting blood pressure is 150, cholesterol level is 243. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 128 without experiencing exercise-induced angina. ST depression relative to rest is 2.6. The peak exercise ST segment has a flat slope. These factors suggest a comprehensive snapshot of the patient's heart health.###\nHence this label was Yes."
"The patient is a 59-year-old male with asymptomatic chest pain. His resting blood pressure is 135, and serum cholesterol is 234. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, and he achieved a maximum heart rate of 161. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.5, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain, high resting blood pressure of 170, normal serum cholesterol levels, fasting blood sugar above 120 mg/dl, showing ST-T wave abnormality in resting electrocardiogram results. He achieved a maximum heart rate of 105 during exercise, experienced angina, had no ST depression induced by exercise relative to rest, and displayed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 52-year-old male patient with non-anginal chest pain, resting blood pressure of 172, and serum cholesterol level of 199. Fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows normal results. Maximum heart rate achieved is 162, with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.5, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"This is a 60-year-old male patient with asymptomatic chest pain. His resting blood pressure is 135, serum cholesterol level is normal, and fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 63 during exercise, experienced exercise-induced angina, and had a 0.5 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 53-year-old male patient with atypical angina chest pain has normal resting blood pressure (120 mmHg) and serum cholesterol levels (181 mg/dl). They have fasting blood sugar levels below 120 mg/dl and a normal resting electrocardiogram. The patient achieved a maximum heart rate of 132 bpm without experiencing exercise-induced angina. Their ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 51-year-old male patient with asymptomatic chest pain, resting blood pressure of 132, serum cholesterol of 218, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 139, did not experience exercise-induced angina, and had ST depression of 0.1 induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain has a resting blood pressure of 120 and normal serum cholesterol levels. They do not have fasting blood sugar greater than 120 mg/dL. The resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 92, and there is no exercise-induced angina. ST depression induced by exercise relative to rest is 0.3, and the peak exercise ST segment slopes upwards.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 125, high serum cholesterol of 249, fasting blood sugar above 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. He achieved a maximum heart rate of 144 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest was 1.2, and the slope of the peak exercise ST segment was flat. This data suggests a potential risk of heart disease in the patient.###\nHence this label was Yes."
"A 37-year-old male patient with no symptoms of chest pain visited the doctor for a check-up. His resting blood pressure was 120, and his serum cholesterol level was 223. He did not have fasting blood sugar levels above 120 mg/dl. The results of his resting electrocardiogram were normal, and he achieved a maximum heart rate of 168 during exercise. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 67-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol level, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate of 110, experiencing exercise-induced angina, with ST depression of 1.9 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old female patient with atypical angina chest pain, resting blood pressure of 130, serum cholesterol level of 236, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram, maximum heart rate achieved of 174, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 40-year-old male patient with non-anginal chest pain, normal resting blood pressure of 140, serum cholesterol level of 235, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 188, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 43-year-old male patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 181 during exercise. The patient did not experience exercise-induced angina and had a slight ST depression of 1.2. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"The patient is a 54-year-old female with non-anginal chest pain. Her resting blood pressure is 130, serum cholesterol is 294, and fasting blood sugar is below 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. She achieved a maximum heart rate of 100 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat. This data suggests a possible heart disease risk.###\nHence this label was Yes."
"A 63-year-old female patient with atypical angina visited the clinic. Her resting blood pressure was 132, and her serum cholesterol level was normal. She had a normal resting electrocardiogram and achieved a maximum heart rate of 130 during exercise. She did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.1, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 40-year-old male patient with asymptomatic chest pain, resting blood pressure of 95, normal serum cholesterol levels, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved of 144, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 40-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal with a maximum heart rate of 138 beats per minute. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 42-year-old male patient with atypical angina is presented with normal resting electrocardiogram results. His blood pressure is high at 150, and cholesterol levels are elevated at 268. He does not have fasting blood sugar above 120 mg/dl. The patient achieved a maximum heart rate of 136 and did not experience exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The 63-year-old male patient has asymptomatic chest pain and elevated resting blood pressure of 130. His serum cholesterol level is high at 330. He has fasting blood sugar over 120 mg/dl and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. The patient achieved a maximum heart rate of 132 and experienced exercise-induced angina. He also had 1.8 ST depression induced by exercise relative to rest, with a peak exercise ST segment showing upsloping.###\nHence this label was Yes."
"A 42-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 178 without exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"This is a 54-year-old male patient with asymptomatic chest pain. His resting blood pressure is 140, and serum cholesterol is 216. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 105 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 36-year-old male patient with atypical angina chest pain, normal resting blood pressure, serum cholesterol level of 166, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate of 180, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 48-year-old male patient with atypical angina chest pain, normal resting blood pressure of 110, and serum cholesterol level of 229. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 168. There were no signs of exercise-induced angina, but there was a 1.0 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is downsloping. ###\nHence this label was Yes."
"The patient is a 71-year-old female with asymptomatic chest pain. Her resting blood pressure is 112, serum cholesterol is 149, and fasting blood sugar is normal. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 125. She does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.6, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"The patient is a 41-year-old male with asymptomatic chest pain. His resting blood pressure is 110, serum cholesterol is 289, and fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal activity. He achieved a maximum heart rate of 170 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment slope is flat.###\nHence this label was Yes."
"A 57-year-old male patient, experiencing asymptomatic chest pain, has a resting blood pressure of 156 and a serum cholesterol level of 173. They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram reveals probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 119 and experienced exercise-induced angina. They exhibited ST depression of 3.0 induced by exercise relative to rest, with a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol, no fasting blood sugar over 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. His maximum heart rate achieved was 100, did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 70-year-old male who is asymptomatic but has probable or definite left ventricular hypertrophy. His resting blood pressure is 130 and serum cholesterol is 322. He does not have fasting blood sugar over 120 mg/dl, does not experience exercise-induced angina, and has an ST depression of 2.4. The slope of his peak exercise ST segment is flat, and he achieved a maximum heart rate of 109.###\nHence this label was Yes."
"A 47-year-old male patient with asymptomatic chest pain has a resting blood pressure of 110 and normal serum cholesterol levels. He has fasting blood sugar levels above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. Despite reaching a maximum heart rate of 149, the patient did not experience exercise-induced angina. The ST segment depression induced by exercise relative to rest is 2.1, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 63-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, serum cholesterol level of 260, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 112, experiencing exercise-induced angina, 3.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 72-year-old male with asymptomatic chest pain. His resting blood pressure is 143, and serum cholesterol level is 211. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results show normal activity. His maximum heart rate achieved is 109, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.4, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with no typical chest pain symptoms, normal blood pressure and cholesterol levels, and a normal resting electrocardiogram. He achieved a high maximum heart rate during exercise and did not experience angina. The ST depression induced by exercise relative to rest was minimal at 0.1, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 132, serum cholesterol level of 207, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 168, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and with an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 32-year-old male patient with typical angina chest pain, resting blood pressure of 95, normal electrocardiogram results, and a maximum heart rate of 127. The patient has fasting blood sugar > 120 mg/dl, no exercise-induced angina, and a slight ST depression of 0.7 induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 48-year-old female patient with non-anginal chest pain, normal resting blood pressure (130), slightly elevated serum cholesterol (275), normal fasting blood sugar levels, normal resting electrocardiogram results, a maximum heart rate of 139, no exercise-induced angina, a slight ST depression of 0.2 induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 54-year-old male patient with non-anginal chest pain, resting blood pressure of 150, serum cholesterol level of 232, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy shown in resting electrocardiogram results, maximum heart rate achieved at 165, no exercise-induced angina, 1.6 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 64-year-old male patient with asymptomatic chest pain, resting blood pressure of 120, fasting blood sugar over 120 mg/dl, ST-T wave abnormality on electrocardiogram, maximum heart rate of 106, no exercise-induced angina, 2.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 46-year-old male patient with non-anginal chest pain has normal resting blood pressure and slightly elevated serum cholesterol levels. They have fasting blood sugar levels below 120 mg/dl and a normal resting electrocardiogram. The patient achieved a maximum heart rate of 150 during exercise, did not experience exercise-induced angina, and had no ST depression induced by exercise. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The 41-year-old female patient experiences atypical angina chest pain. She has normal resting blood pressure and high serum cholesterol levels. Her fasting blood sugar is below 120 mg/dl. The resting electrocardiogram results are normal, and she achieved a maximum heart rate of 150. She did not experience exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 50-year-old male patient with non-anginal chest pain has normal resting blood pressure and serum cholesterol levels. Their fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 163. The patient did not experience exercise-induced angina. They have a slight ST depression of 0.6 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old male patient with non-anginal chest pain, normal blood pressure, and slightly elevated serum cholesterol. There is no fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 165 without experiencing exercise-induced angina. Post-exercise, there was 2.5 mm ST depression relative to rest, and the slope of the peak exercise ST segment was flat. These factors suggest a profile potentially indicative of heart disease.###\nHence this label was Yes."
"A 65-year-old male patient with typical angina presented with normal resting blood pressure and slightly elevated serum cholesterol levels. Fasting blood sugar level was normal. Resting electrocardiogram results were normal, with a maximum heart rate of 135. The patient did not experience exercise-induced angina and had a slight ST depression of 0.3. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 44-year-old female patient with non-anginal chest pain, normal resting blood pressure of 118, and serum cholesterol level of 242. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 149 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.3, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 48-year-old asymptomatic male with normal resting blood pressure and serum cholesterol levels. Resting electrocardiogram results show no abnormalities. Maximum heart rate achieved during exercise is 159. Patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 1.5. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain, resting blood pressure of 142, serum cholesterol level of 228. The patient has a normal fasting blood sugar level, ST-T wave abnormality in resting electrocardiogram, achieved a maximum heart rate of 149. The patient experienced exercise-induced angina, with 2.5 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 42-year-old female patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol, no fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. She achieved a maximum heart rate of 122 during exercise, did not experience exercise-induced angina, and had a slight ST depression of 0.6 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"The patient is a 57-year-old male with non-anginal chest pain. His resting blood pressure is 105, and he has normal electrocardiogram results. Although his serum cholesterol level is not provided, he has fasting blood sugar over 120 mg/dl. He achieved a maximum heart rate of 148 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.3, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 58-year-old male with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol level of 256. They have fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram. The patient achieved a maximum heart rate of 113, experienced exercise-induced angina, and had ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 54-year-old female patient with atypical angina chest pain, normal resting blood pressure of 120, serum cholesterol level of 273. Fasting blood sugar is below 120 mg/dl, with a normal resting electrocardiogram. Maximum heart rate achieved is 150, with no exercise-induced angina. ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 55-year-old male patient with typical angina chest pain has normal resting blood pressure and high serum cholesterol levels. Their fasting blood sugar is not elevated, and their resting electrocardiogram results are normal. Despite achieving a maximum heart rate of 136 during exercise, they did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 37-year-old female with no typical chest pain, normal blood pressure, and normal cholesterol levels. Their resting electrocardiogram shows ST-T wave abnormality but they do not experience exercise-induced angina. The maximum heart rate achieved is 184 and there is no ST depression induced by exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 54-year-old female with atypical angina. Her resting blood pressure is high at 160, and serum cholesterol levels are elevated at 312. She does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 130. She does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 43-year-old male patient with no typical chest pain symptoms presents with normal resting blood pressure and cholesterol levels. His fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results, and he achieved a maximum heart rate of 161 during exercise. The patient did not experience angina during exercise, and there were no ST depressions on the electrocardiogram. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol levels. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient experiences exercise-induced angina and has a flat slope of the peak exercise ST segment. Despite these factors, the maximum heart rate achieved is 132.###\nHence this label was Yes."
"A 39-year-old male patient with no chest pain symptoms, normal resting blood pressure, high serum cholesterol level, normal fasting blood sugar, normal resting electrocardiogram results, a high maximum heart rate achieved, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 73-year-old female patient with non-anginal chest pain, resting blood pressure of 160, no fasting blood sugar over 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 121, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 45-year-old male patient with non-anginal chest pain, normal resting blood pressure, and cholesterol levels. Fasting blood sugar is normal, and resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 144 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest was minimal at 0.1, with an upsloping peak exercise ST segment.###\nHence this label was No."
"A 74-year-old male patient, asymptomatic for chest pain, with a resting blood pressure of 155 and serum cholesterol of 310. The patient has normal fasting blood sugar levels, a resting electrocardiogram showing normal results, and achieved a maximum heart rate of 112. The patient experienced exercise-induced angina, with 1.5 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"A 49-year-old male patient with asymptomatic chest pain, normal resting blood pressure and serum cholesterol levels. Resting electrocardiogram shows no abnormalities. The patient experiences exercise-induced angina but has a low ST depression level relative to rest. The peak exercise ST segment is flat.###\nHence this label was Yes."
"A 56-year-old male patient with non-anginal chest pain has a resting blood pressure of 137 and serum cholesterol level of 208. The patient has a fasting blood sugar level above 120 mg/dl and shows ST-T wave abnormality on resting electrocardiogram. He achieved a maximum heart rate of 122 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest was 1.8, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 49-year-old male patient with non-anginal chest pain, normal resting blood pressure (140), and serum cholesterol (187). The patient has a normal fasting blood sugar level, a maximum heart rate of 172, and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male with non-anginal chest pain has a resting blood pressure of 130 and a serum cholesterol level of 213. His fasting blood sugar is normal, and his resting electrocardiogram shows ST-T wave abnormalities. He achieved a maximum heart rate of 140 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 46-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal fasting blood sugar levels, ST-T wave abnormality on resting electrocardiogram. The patient achieved a maximum heart rate of 140, did not experience exercise-induced angina, and had no ST depression induced by exercise. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"This data represents a 61-year-old male patient with a possible heart disease. The patient is asymptomatic but has high resting blood pressure (190) and elevated serum cholesterol levels (287). They also have probable or definite left ventricular hypertrophy according to resting electrocardiogram results. The patient experienced exercise-induced angina and ST depression of 2.0. Their maximum heart rate achieved was 150, and the peak exercise ST segment showed downsloping.###\nHence this label was Yes."
"The patient is a 54-year-old male with atypical angina chest pain. His resting blood pressure is 110 and serum cholesterol level is 208. Fasting blood sugar is less than 120 mg/dl. Resting electrocardiogram results are normal. He achieved a maximum heart rate of 142 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar greater than 120 mg/dl and their resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 140 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0 and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 74-year-old male with atypical angina chest pain. His resting blood pressure is 145, and he has a fasting blood sugar level > 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 123, and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.3, with a peak exercise ST segment slope that is upsloping.###\nHence this label was Yes."
"A 52-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, and experiencing exercise-induced angina. The patient has a maximum heart rate of 128 and a flat slope of the peak exercise ST segment with ST depression of 2.0 relative to rest.###\nHence this label was Yes."
"A 61-year-old male patient with asymptomatic chest pain, resting blood pressure of 141, and serum cholesterol of 292. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 115, experienced exercise-induced angina, and had an ST depression of 1.7 relative to rest. The slope of the peak exercise ST segment was flat. fasting blood sugar was not above 120 mg/dl.###\nHence this label was Yes."
"The patient is a 63-year-old male who is experiencing asymptomatic chest pain. His resting blood pressure is high at 185 and he has normal resting electrocardiogram results. He is not fasting and his serum cholesterol level is 0. Despite achieving a maximum heart rate of 98, he experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"The patient is a 61-year-old male who is asymptomatic but shows some ST-T wave abnormality on resting electrocardiogram. His resting blood pressure is 120 and serum cholesterol is 282. He does not have fasting blood sugar above 120 mg/dl. He experienced exercise-induced angina and had a maximum heart rate of 135. His ST depression induced by exercise relative to rest is 4.0, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"The patient is a 51-year-old male who is asymptomatic but has high resting blood pressure and serum cholesterol levels. Their resting electrocardiogram is normal, but they experience exercise-induced angina. The maximum heart rate achieved is 122, and there is a significant ST depression induced by exercise. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 35-year-old female patient with no history of chest pain visited the clinic. Her resting blood pressure was 138, and her serum cholesterol level was 183. She had normal resting electrocardiogram results and achieved a maximum heart rate of 182 during exercise. She did not experience exercise-induced angina and had a ST depression of 1.4 relative to rest. The slope of the peak exercise ST segment was upsloping. Overall, the data suggests a relatively healthy cardiovascular profile for this patient.###\nHence this label was No."
"A 45-year-old female patient with atypical angina chest pain, normal resting blood pressure of 180, and serum cholesterol level of 295. The patient has a normal resting electrocardiogram and achieved a maximum heart rate of 180 during exercise without experiencing angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 57-year-old male with atypical angina chest pain. His resting blood pressure is 124, and serum cholesterol is 261. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results show normalcy, and he achieved a maximum heart rate of 141. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.3, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 56-year-old male patient with normal resting blood pressure and asymptomatic chest pain visited the clinic. His fasting blood sugar level was above 120 mg/dl. The rest of his cardiac parameters were within normal range, except for a slightly elevated ST depression after exercise. He also experienced exercise-induced angina and had a flat slope in the peak exercise ST segment. Overall, the patient's heart health appears to be stable, but further monitoring may be needed due to his elevated blood sugar levels.###\nHence this label was Yes."
"A 49-year-old female patient with atypical angina chest pain, normal resting blood pressure of 110, serum cholesterol of 208, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 160, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 58-year-old male with non-anginal chest pain. His resting blood pressure is 132 and serum cholesterol is 224. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 173 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 3.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 56-year-old male patient with non-anginal chest pain, resting blood pressure of 170, no fasting blood sugar > 120 mg/dl, and probable or definite left ventricular hypertrophy shown on resting electrocardiogram. He achieved a maximum heart rate of 123, experienced exercise-induced angina, and had ST depression of 2.5 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 62-year-old female patient with asymptomatic chest pain, resting blood pressure of 140, serum cholesterol level of 268, no fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 160, no exercise-induced angina present. ST depression induced by exercise relative to rest is 3.6, with a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old male patient with typical angina chest pain had a resting blood pressure of 130 and normal serum cholesterol levels. Their fasting blood sugar was below 120 mg/dl. Resting electrocardiogram showed ST-T wave abnormality. The patient achieved a maximum heart rate of 145 without experiencing exercise-induced angina. They had ST depression of 3.0 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 65-year-old male patient with asymptomatic chest pain has a resting blood pressure of 140 and a serum cholesterol level of 306. They have fasting blood sugar over 120 mg/dl and normal resting electrocardiogram results. The patient achieved a maximum heart rate of 87 and experienced exercise-induced angina. They have ST depression of 1.5 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with atypical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol. Their fasting blood sugar level is below 120 mg/dl. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 155 without experiencing exercise-induced angina. There was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 46-year-old male patient with no typical chest pain symptoms visited the clinic. His resting blood pressure was 118, and serum cholesterol was 186. His resting electrocardiogram showed normal results, and he achieved a maximum heart rate of 124 during exercise. He did not experience exercise-induced angina, and there was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 52-year-old male patient with asymptomatic chest pain has a resting blood pressure of 128 and serum cholesterol level of 204. Their fasting blood sugar level is above 120 mg/dl. Resting electrocardiogram results show no abnormality. The patient achieved a maximum heart rate of 156 during exercise, but experienced angina. They also had ST depression of 1.0 induced by exercise compared to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 37-year-old male patient with asymptomatic chest pain has normal resting blood pressure (130 mmHg) and high serum cholesterol levels (315 mg/dl). They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows normal results, and their maximum heart rate achieved is 158 bpm. The patient did not experience exercise-induced angina. They have no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 61-year-old male who is asymptomatic but has high serum cholesterol. His resting blood pressure is normal at 120, and he does not have fasting blood sugar greater than 120 mg/dl. The resting electrocardiogram results are normal. He experienced exercise-induced angina and displayed ST depression of 3.6 relative to rest. The peak exercise ST segment slope was flat, and he achieved a maximum heart rate of 140.###\nHence this label was Yes."
"A 34-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar greater than 120 mg/dl, normal resting electrocardiogram results, a maximum heart rate of 154, no exercise-induced angina, slight ST depression induced by exercise relative to rest (0.2), and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old male patient, asymptomatic, with resting blood pressure of 125 and serum cholesterol level of 300. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 171, with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 52-year-old female patient with atypical angina chest pain has normal resting blood pressure, serum cholesterol levels of 210, and a maximum heart rate of 148. She does not have fasting blood sugar over 120 mg/dl or exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 47-year-old male patient with typical angina chest pain, normal resting blood pressure of 110, and serum cholesterol level of 249. The patient has fasting blood sugar levels below 120 mg/dl and a normal resting electrocardiogram. He achieved a maximum heart rate of 150 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 50-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. Resting electrocardiogram results were normal, with a maximum heart rate of 121. The patient experienced exercise-induced angina, with an ST depression of 2.0. The slope of the peak exercise ST segment was flat. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was Yes."
"The patient is a 68-year-old male with typical angina chest pain. They have a resting blood pressure of 139 and serum cholesterol level of 181. Their fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 135 and there is no exercise-induced angina. They have a slight ST depression of 0.2 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old female patient with no history of chest pain or fasting blood sugar issues. Resting blood pressure is 100 and serum cholesterol is 248. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 122 with no exercise-induced angina. ST depression induced by exercise is 1.0, and the peak exercise ST segment slope is flat.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure, elevated serum cholesterol, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, achieved a maximum heart rate of 100 during exercise without experiencing angina, and had a flat ST segment depression of 0.0 induced by exercise relative to rest.###\nHence this label was Yes."
"The patient is a 61-year-old female presenting with asymptomatic chest pain. She has a resting blood pressure of 130 and serum cholesterol levels of 330. Results show probable or definite left ventricular hypertrophy on the resting electrocardiogram. Despite achieving a maximum heart rate of 169 during exercise, she did not experience angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. Overall, this patient's data suggests a potential risk for heart disease.###\nHence this label was Yes."
"A 42-year-old male patient with non-anginal chest pain has a resting blood pressure of 160 and serum cholesterol level of 147. The patient's fasting blood sugar is normal, and resting electrocardiogram shows normal results. He achieved a maximum heart rate of 146 without experiencing exercise-induced angina. There were no ST depressions induced by exercise, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 60-year-old male experiencing non-anginal chest pain. His resting blood pressure is 120, and serum cholesterol is 246. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 135, and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 48-year-old male patient with non-anginal chest pain, resting blood pressure of 102, normal serum cholesterol level, fasting blood sugar level above 120 mg/dl, showing ST-T wave abnormality in resting electrocardiogram, achieving a maximum heart rate of 110, experiencing exercise-induced angina, with 1.0 ST depression induced by exercise relative to rest, and a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 67-year-old female patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. They have a maximum heart rate of 172 and show no signs of exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. The fasting blood sugar level is below 120 mg/dl.###\nHence this label was No."
"A 58-year-old male patient with atypical angina chest pain, normal resting blood pressure (125), and serum cholesterol level (220). The patient does not have fasting blood sugar over 120 mg/dl, shows a normal resting electrocardiogram, and achieved a maximum heart rate of 144. He did not experience exercise-induced angina and had a slight ST depression of 0.4 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"The patient is a 37-year-old female with non-anginal chest pain. Her resting blood pressure is 120, and her serum cholesterol level is 215. She has normal resting electrocardiogram results. Her maximum heart rate achieved is 170, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. The fasting blood sugar level is not above 120 mg/dl.###\nHence this label was No."
"A 49-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 140, serum cholesterol level of 185, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram, a maximum heart rate of 130, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 64-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130 and serum cholesterol level of 223. They have normal fasting blood sugar levels and show ST-T wave abnormality on their resting electrocardiogram. The patient achieved a maximum heart rate of 128 during exercise, did not experience angina, and had a slight ST depression of 0.5 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 46-year-old asymptomatic male patient with normal resting blood pressure and serum cholesterol levels. His fasting blood sugar is normal. Resting electrocardiogram results were normal, with a maximum heart rate of 112. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 41-year-old male patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a high maximum heart rate of 182 bpm and shows no signs of exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. The fasting blood sugar level is below 120 mg/dl.###\nHence this label was No."
"A 51-year-old male patient with atypical angina chest pain, normal resting blood pressure (130), and serum cholesterol levels (224). They do not have fasting blood sugar over 120 mg/dl and show a normal resting electrocardiogram. The patient achieved a maximum heart rate of 150 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 32-year-old male patient with atypical angina chest pain presents with normal resting blood pressure, slightly elevated serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, and a high maximum heart rate of 184. The patient does not experience exercise-induced angina and shows no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 41-year-old male with asymptomatic chest pain. His resting blood pressure is 130 and serum cholesterol is 172. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 130 and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 55-year-old male with asymptomatic chest pain. His resting blood pressure is 115 and serum cholesterol level is 0. He has fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. The maximum heart rate achieved is 155 and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.1. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They have a normal resting electrocardiogram and achieved a maximum heart rate of 117. The patient experienced exercise-induced angina and had a ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 51-year-old male patient with asymptomatic chest pain, normal resting blood pressure, fasting blood sugar greater than 120 mg/dl, normal electrocardiogram results, maximum heart rate of 92, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 46-year-old female patient with asymptomatic chest pain, resting blood pressure of 138, serum cholesterol level of 243. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 152, and the patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. Fasting blood sugar is higher than 120 mg/dl. Resting electrocardiogram results show normal activity. The patient experiences exercise-induced angina and a slight ST depression induced by exercise relative to rest. Maximum heart rate achieved during the test is 160, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 53-year-old male patient with asymptomatic chest pain, resting blood pressure of 144, high serum cholesterol of 300, fasting blood sugar level above 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 128, experiencing exercise-induced angina, with ST depression of 1.5 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old male patient with non-anginal chest pain has a resting blood pressure of 150 and a serum cholesterol level of 219. They have no fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 118, and the patient experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 70-year-old male patient with non-anginal chest pain, resting blood pressure of 160, serum cholesterol of 269, normal resting electrocardiogram results, maximum heart rate achieved at 112, experiencing exercise-induced angina, with 2.9 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. Fasting blood sugar is below 120 mg/dl.###\nHence this label was Yes."
"A 47-year-old male patient with non-anginal chest pain presented with normal resting blood pressure and serum cholesterol levels. His maximum heart rate reached 145 during the examination. The patient experienced exercise-induced angina and showed a 1.0 ST depression relative to rest. The peak exercise ST segment was flat, indicating a potential heart disease risk.###\nHence this label was Yes."
"A 49-year-old female patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol of 207, normal fasting blood sugar levels, showing ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 135, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a peak exercise ST segment showing upsloping pattern.###\nHence this label was No."
"The patient is a 54-year-old male with atypical angina chest pain. Resting blood pressure is high at 160, while serum cholesterol level is within normal range at 195. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. Maximum heart rate achieved during exercise is 130, and there is no exercise-induced angina. ST depression induced by exercise relative to rest is 1.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 57-year-old male with asymptomatic chest pain and normal resting blood pressure. Even though the serum cholesterol level is not provided, the fasting blood sugar level is above 120 mg/dl. The resting electrocardiogram results are normal, but the maximum heart rate achieved is only 98. The patient experiences exercise-induced angina and has ST depression of 2.0. The slope of the peak exercise ST segment is flat. Overall, this data suggests a potential risk for heart disease despite the normal resting electrocardiogram results.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. Fasting blood sugar is below 120 mg/dl, with a normal resting electrocardiogram. The patient achieved a maximum heart rate of 148 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.4, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 40-year-old male patient with atypical angina chest pain, normal resting blood pressure, high serum cholesterol level, normal fasting blood sugar, normal electrocardiogram results, high maximum heart rate achieved, no exercise-induced angina, no ST depression induced by exercise, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 62-year-old male patient with asymptomatic chest pain, resting blood pressure of 152, normal serum cholesterol level, no fasting blood sugar > 120 mg/dl, showing ST-T wave abnormality in resting electrocardiogram, achieving a maximum heart rate of 97, experiencing exercise-induced angina, with 1.6 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 53-year-old male patient with asymptomatic chest pain has high resting blood pressure (140) and elevated serum cholesterol (203). He has probable or definite left ventricular hypertrophy based on resting electrocardiogram results. Despite reaching a high maximum heart rate of 155 during exercise, he experiences exercise-induced angina. The ST segment depression induced by exercise relative to rest is 3.1, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 43-year-old male patient, with asymptomatic chest pain, resting blood pressure of 140, normal serum cholesterol levels, no fasting blood sugar over 120 mg/dl, showing ST-T wave abnormality on resting electrocardiogram. Maximum heart rate achieved is 140, experiencing exercise-induced angina. Has ST depression induced by exercise relative to rest of 0.5, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 54-year-old male patient with atypical angina chest pain, a resting blood pressure of 132, serum cholesterol level of 182, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 141, no exercise-induced angina, slight ST depression of 0.1 induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
