"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 132, serum cholesterol level of 218, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram, achieving a maximum heart rate of 140, experiencing exercise-induced angina, 1.5 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar over 120 mg/dl and show normal results on resting electrocardiogram. The patient achieved a maximum heart rate of 83 without experiencing exercise-induced angina. Their ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"This is a 39-year-old male with asymptomatic chest pain. His resting blood pressure is 110, serum cholesterol is 280, and fasting blood sugar is normal. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 150 without experiencing exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 53-year-old male who is asymptomatic but has high resting blood pressure and high serum cholesterol levels. They have fasting blood sugar greater than 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. Despite achieving a maximum heart rate of 128, they experience exercise-induced angina. They also have ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 62-year-old male who experiences non-anginal chest pain. His resting blood pressure is 133 and he has abnormal ST-T wave results on an electrocardiogram. He has a fasting blood sugar level over 120 mg/dl and experiences exercise-induced angina. His serum cholesterol levels are not provided. The patient achieved a maximum heart rate of 119 and has a ST depression of 1.2 induced by exercise. The slope of the peak exercise ST segment is flat. These factors suggest a possible risk of heart disease in the patient.###\nHence this label was Yes."
"A 60-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, normal serum cholesterol levels, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, achieved a maximum heart rate of 99, experienced exercise-induced angina, with ST depression of 0.5 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 49-year-old female with non-anginal chest pain. She has a resting blood pressure of 130 and a serum cholesterol level of 207. Her fasting blood sugar is normal. The resting electrocardiogram shows ST-T wave abnormality. She achieved a maximum heart rate of 135 without experiencing exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 62-year-old female patient presenting with typical angina chest pain and normal resting electrocardiogram results. Resting blood pressure is elevated at 140, with fasting blood sugar levels greater than 120 mg/dl. The maximum heart rate achieved is 143, and there is no exercise-induced angina. Serum cholesterol levels are at 0, and the ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is flat. Overall, these factors may indicate a potential risk for heart disease in this patient.###\nHence this label was Yes."
"A 56-year-old male patient with asymptomatic chest pain has normal resting blood pressure and low serum cholesterol levels. He does not have fasting blood sugar over 120 mg/dl. His resting electrocardiogram results are normal and he achieved a maximum heart rate of 120. The patient experienced exercise-induced angina and had 1.5 ST depression induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 37-year-old male with non-anginal chest pain. His resting blood pressure is 118 and serum cholesterol is 240. He does not have fasting blood sugar levels above 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 165, and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain has a resting blood pressure of 128 and a serum cholesterol level of 223. Their fasting blood sugar is under 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 119. The patient experiences exercise-induced angina. They have ST depression of 2.0 induced by exercise relative to rest, with a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 49-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol of 187. Fasting blood sugar is normal. Resting electrocardiogram is normal, with a maximum heart rate of 172 and no exercise-induced angina. ST depression induced by exercise is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 50-year-old female patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol level, normal fasting blood sugar, normal resting electrocardiogram results, moderate maximum heart rate, experiencing exercise-induced angina, with a mild ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 170, serum cholesterol level of 388, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 122, experiencing exercise-induced angina, 2.0 ST depression induced by exercise relative to rest, and flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 64-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130 and a serum cholesterol level of 223. Their fasting blood sugar is below 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality, and the maximum heart rate achieved is 128. They did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 47-year-old male patient with non-anginal chest pain, normal resting blood pressure of 130, serum cholesterol level of 253, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 179, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 59-year-old male who experiences non-anginal chest pain. His resting blood pressure is 130, with a serum cholesterol level of 318. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 120 during exercise, and experienced exercise-induced angina. His ST depression induced by exercise relative to rest is 1.0, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 59-year-old male patient with typical angina chest pain had a high resting blood pressure of 178 and high serum cholesterol of 270. They did not have fasting blood sugar over 120 mg/dl and showed probable or definite left ventricular hypertrophy on resting electrocardiogram. Despite reaching a maximum heart rate of 145, they did not experience exercise-induced angina. However, they had a significant ST depression of 4.2 induced by exercise relative to rest, with a downsloping ST segment on the peak exercise. This data indicates a potential risk of heart disease in the patient.###\nHence this label was No."
"The patient is a 67-year-old male who experienced typical angina chest pain. His resting blood pressure is 145, and he has no fasting blood sugar over 120 mg/dl. The electrocardiogram results indicate probable or definite left ventricular hypertrophy. His maximum heart rate achieved was 125, and he did not have exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the peak exercise ST segment slope was flat.###\nHence this label was Yes."
"The patient is a 68-year-old male presenting with asymptomatic chest pain. \nHis resting blood pressure is 145 and he has fasting blood sugar levels higher than 120 mg/dl. \nResting electrocardiogram results show normal activity. \nHis maximum heart rate achieved is 136 beats per minute and he does not experience exercise-induced angina. \nThe ST depression induced by exercise relative to rest is 1.8. \nThe slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol, normal resting electrocardiogram, moderate heart rate, experiencing exercise-induced angina, with slight ST depression post-exercise, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 32-year-old female patient with atypical angina chest pain, normal resting blood pressure of 105, and serum cholesterol of 198. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 165. The patient did not experience exercise-induced angina, and ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old male patient with atypical angina presents with normal resting electrocardiogram results. His blood pressure is 160 and serum cholesterol is 305. He has a maximum heart rate of 175 and does not have exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 60-year-old female patient with typical angina type chest pain, normal resting blood pressure of 150, serum cholesterol level of 240. She does not have fasting blood sugar greater than 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 171. The patient does not experience exercise-induced angina. She has a ST depression of 0.9 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 69-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, and serum cholesterol of 208. Fasting blood sugar is normal. Resting electrocardiogram shows ST-T wave abnormality. Maximum heart rate achieved is 140. Patient experiences exercise-induced angina. ST depression of 2.0 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 68-year-old male patient with non-anginal chest pain, normal resting blood pressure of 118, serum cholesterol level of 277, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 151 without exercise-induced angina. The ST depression induced by exercise relative to rest was 1.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 61-year-old male patient with non-anginal chest pain, resting blood pressure of 150, serum cholesterol of 243, fasting blood sugar > 120 mg/dl, normal ECG results, maximum heart rate achieved of 137, exercise-induced angina present, 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 52-year-old female who is asymptomatic. She has a normal resting blood pressure of 130 and serum cholesterol level of 180. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, and she achieved a maximum heart rate of 140. She experienced exercise-induced angina and had ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 62-year-old female patient with asymptomatic chest pain, resting blood pressure of 120, normal serum cholesterol level, high fasting blood sugar (> 120 mg/dl), ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 123, experiencing exercise-induced angina, 1.7 ST depression induced by exercise relative to rest, and a downsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 54-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, normal serum cholesterol levels, no fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 117, experiencing exercise-induced angina, ST depression of 1.4 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 41-year-old male patient, experiencing atypical angina chest pain, with normal resting blood pressure and high serum cholesterol levels. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 160 without exercise-induced angina. ST depression post-exercise was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain has high blood pressure and cholesterol levels. He has fasting blood sugar above 120 mg/dl and experiences exercise-induced angina. His resting electrocardiogram is normal, but he has a flattened peak exercise ST segment. Despite these risk factors, his maximum heart rate achieved is relatively low at 105.###\nHence this label was Yes."
"A 43-year-old male patient with asymptomatic chest pain, normal resting blood pressure and high serum cholesterol. They have a high maximum heart rate reached during exercise, with no exercise-induced angina. There is a slight ST depression induced by exercise relative to rest, and the peak exercise ST segment slope is flat. The fasting blood sugar level is below 120 mg/dl.###\nHence this label was No."
"A 52-year-old male patient with atypical angina chest pain had a resting blood pressure of 160 and serum cholesterol level of 196. Their fasting blood sugar was normal, resting electrocardiogram results showed normalcy, and they achieved a maximum heart rate of 165 during exercise. The patient did not experience exercise-induced angina, and their ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 54-year-old male patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has no fasting blood sugar > 120 mg/dl and normal resting electrocardiogram results. He achieved a maximum heart rate of 154 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain, resting blood pressure of 128, serum cholesterol level of 259, no fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 130 and experienced exercise-induced angina. ST depression induced by exercise relative to rest was 3.0, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"In this dataset, we have a 71-year-old male patient with asymptomatic chest pain. His resting blood pressure is 130 and serum cholesterol level is 221. He does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 115. He experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 43-year-old male patient, asymptomatic, with normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar > 120 mg/dl. Their resting electrocardiogram results are normal. They achieved a maximum heart rate of 120 and experienced exercise-induced angina. They have an ST depression of 1.0 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"This is a 58-year-old male patient with asymptomatic chest pain. His resting blood pressure is 130, serum cholesterol level is 0, and fasting blood sugar is not above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 100 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 51-year-old female patient with atypical angina has normal resting blood pressure and serum cholesterol levels. She has a maximum heart rate of 170 and does not experience exercise-induced angina. Her electrocardiogram results are normal, and she shows no signs of ST depression during exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 41-year-old male patient with asymptomatic chest pain has a resting blood pressure of 150 and serum cholesterol level of 171. They have a normal resting electrocardiogram and achieved a maximum heart rate of 128 during exercise. The patient experienced exercise-induced angina and had a ST depression of 1.5 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 59-year-old male patient with non-anginal chest pain, resting blood pressure of 150, serum cholesterol level of 212, and fasting blood sugar greater than 120 mg/dl. The resting electrocardiogram results were normal, with a maximum heart rate achieved of 157. The patient did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 1.6, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 57-year-old female patient with typical angina chest pain has a resting blood pressure of 130 and serum cholesterol level of 308. Fasting blood sugar is normal. Resting electrocardiogram results show normal activity. The maximum heart rate achieved is 98 with no exercise-induced angina. There is 1.0 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat. These factors indicate a detailed profile of the patient's heart health and potential risk of heart disease.###\nHence this label was No."
"A 69-year-old male patient, with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar above 120 mg/dl. The patient's serum cholesterol level is not provided. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 130. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 48-year-old female patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. She does not have fasting blood sugar > 120 mg/dl and shows normal resting electrocardiogram results. Her maximum heart rate achieved is 125, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 56-year-old male who experiences non-anginal chest pain. His resting blood pressure is 125 and he has normal electrocardiogram results. He has fasting blood sugar > 120 mg/dl. His maximum heart rate achieved is 98 and he does not experience exercise-induced angina. The patient has a ST depression of -2.0 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 60-year-old male patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol levels, no fasting blood sugar over 120 mg/dl, probable or definite left ventricular hypertrophy shown on resting electrocardiogram, achieved a maximum heart rate of 141, experienced exercise-induced angina, exhibited ST depression of 2.8 induced by exercise relative to rest, and showed a flat slope of the peak exercise ST segment. These factors indicate a potential heart disease risk and warrant further evaluation.###\nHence this label was Yes."
"A 36-year-old male patient with non-anginal chest pain, normal resting blood pressure (130), and serum cholesterol (209). Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 178 without exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 66-year-old male patient with non-anginal chest pain has a resting blood pressure of 110 and serum cholesterol level of 213. They have a fasting blood sugar level greater than 120 mg/dl and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. The patient achieved a maximum heart rate of 99, experienced exercise-induced angina, and displayed ST depression of 1.3 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 43-year-old female patient with atypical angina, normal resting blood pressure of 150, and serum cholesterol level of 186. Fasting blood sugar is less than 120 mg/dl. Resting electrocardiogram results are normal and the maximum heart rate achieved is 154. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 50-year-old male patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a good heart health with a normal electrocardiogram result and a high maximum heart rate of 170. They do not experience exercise-induced angina and show no ST depression post-exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 115, normal serum cholesterol levels, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate of 82, no exercise-induced angina, -1.0 ST depression induced by exercise relative to rest, and upsloping slope of peak exercise ST segment.###\nHence this label was Yes."
"A 62-year-old male patient with asymptomatic chest pain, resting blood pressure of 152, serum cholesterol of 153, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 97, experiencing exercise-induced angina, with ST depression of 1.6 induced by exercise relative to rest, and upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"This 64-year-old male patient has asymptomatic chest pain and normal resting blood pressure. Although his serum cholesterol levels are not provided, his fasting blood sugar is elevated (>120 mg/dl). Resting electrocardiogram results are normal, and he achieved a maximum heart rate of 114. The patient experienced exercise-induced angina and exhibited ST depression of 1.3 relative to rest. The slope of the peak exercise ST segment was downsloping.###\nHence this label was Yes."
"A 55-year-old male patient with non-anginal chest pain, normal resting blood pressure and cholesterol levels. The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 134 without any exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. No fasting blood sugar > 120 mg/dl was recorded.###\nHence this label was No."
"The 46-year-old male patient with asymptomatic chest pain has normal resting blood pressure (120) and high serum cholesterol (277). They have a maximum heart rate of 125 and experienced exercise-induced angina. Their ST depression induced by exercise relative to rest is 1.0, with a flat slope of the peak exercise ST segment. Fasting blood sugar level is below 120 mg/dl.###\nHence this label was Yes."
"A 63-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol of 267, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 88, experiencing exercise-induced angina, ST depression of 2.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. This data suggests a potential risk of heart disease in the patient.###\nHence this label was Yes."
"A 54-year-old male patient with non-anginal chest pain, resting blood pressure of 150, serum cholesterol level of 232, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 165, no exercise-induced angina, ST depression of 1.6 induced by exercise relative to rest, and an upsloping peak exercise ST segment. This profile provides valuable insights for predicting potential heart disease.###\nHence this label was No."
"A 54-year-old female patient with asymptomatic chest pain, resting blood pressure of 127, high serum cholesterol of 333, fasting blood sugar above 120 mg/dL, ST-T wave abnormality in resting electrocardiogram, achieved a maximum heart rate of 154 without exercise-induced angina. ST depression induced by exercise relative to rest was 0.0, and the peak exercise ST segment was flat. These factors may indicate a risk of heart disease in the patient.###\nHence this label was Yes."
"A 39-year-old male patient with no typical symptoms, normal resting blood pressure, high cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, moderately high maximum heart rate, no exercise-induced angina, no ST depression induced by exercise, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 58-year-old male patient with non-anginal chest pain, normal resting blood pressure, high serum cholesterol levels, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy seen on resting electrocardiogram, reaching a maximum heart rate of 154 during exercise, experiencing exercise-induced angina, showing 0.6 ST depression induced by exercise relative to rest, and displaying a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, high serum cholesterol of 330, fasting blood sugar over 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 132, experiencing exercise-induced angina, ST depression of 1.8 induced by exercise relative to rest, and a peak exercise ST segment with upsloping slope.###\nHence this label was Yes."
"The patient is a 60-year-old male with asymptomatic chest pain. His resting blood pressure is 140, serum cholesterol is 293, and fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 170 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.2, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 69-year-old male patient with asymptomatic chest pain, resting blood pressure of 122, serum cholesterol level of 216, and fasting blood sugar higher than 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient experienced exercise-induced angina, with a maximum heart rate of 84. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
