"This 36-year-old male patient experiences non-anginal chest pain. His resting blood pressure is 130, with a serum cholesterol level of 209. He has normal resting electrocardiogram results and a maximum heart rate of 178. The patient does not have fasting blood sugar over 120 mg/dl or exercise-induced angina. In addition, he shows no ST depression induced by exercise relative to rest, and his peak exercise ST segment slopes upwards.###\nHence this label was No."
"A 54-year-old male patient with no history of chest pain, normal resting blood pressure and cholesterol levels. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 91. The patient experiences exercise-induced angina and has a slight ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat. These factors suggest a possible presence of heart disease.###\nHence this label was Yes."
"A 63-year-old male patient with asymptomatic chest pain has a resting blood pressure of 96 and a serum cholesterol level of 305. The patient's resting electrocardiogram shows ST-T wave abnormality, and the maximum heart rate achieved is 121. The patient experiences exercise-induced angina, with ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 58-year-old male patient with non-anginal chest pain has a resting blood pressure of 160 and serum cholesterol of 211. His fasting blood sugar level is above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 92 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat. These factors suggest a potential heart disease risk in this patient.###\nHence this label was Yes."
"A 59-year-old male patient with typical angina chest pain has normal resting blood pressure (134 mmHg) and serum cholesterol levels (204 mg/dl). The patient's fasting blood sugar is below 120 mg/dl, and resting electrocardiogram results are normal. He achieved a maximum heart rate of 162 bpm and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.8. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 62-year-old female patient with typical angina chest pain had a resting blood pressure of 140 and normal electrocardiogram results. Her maximum heart rate achieved was 143 and did not experience exercise-induced angina. The patient had fasting blood sugar over 120 mg/dl, serum cholesterol level of 0, ST depression of 0.0, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 68-year-old male patient with typical angina chest pain had a resting blood pressure of 139 and a serum cholesterol level of 181. Their fasting blood sugar was above 120 mg/dl. Resting electrocardiogram showed ST-T wave abnormality. The maximum heart rate achieved was 135, and there was no exercise-induced angina. The ST depression induced by exercise relative to rest was 0.2, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 57-year-old male patient experiencing non-anginal chest pain has a resting blood pressure of 150 and low serum cholesterol levels of 126. The patient has high fasting blood sugar levels (>120 mg/dl), but normal resting electrocardiogram results. Despite achieving a maximum heart rate of 173 during exercise, the patient did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.2, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 61-year-old male patient with typical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol. Fasting blood sugar levels are within normal range. Resting electrocardiogram results are normal and the maximum heart rate achieved during exercise is 145. The patient did not experience exercise-induced angina. There is ST depression of 2.6 induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 43-year-old male patient with non-anginal chest pain had a resting blood pressure of 130 and serum cholesterol level of 315. Fasting blood sugar was normal, resting electrocardiogram results were normal, and the maximum heart rate achieved was 162. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest was 1.9, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 43-year-old female patient with non-anginal chest pain, normal resting blood pressure, slightly elevated serum cholesterol, normal fasting blood sugar levels, normal resting electrocardiogram results, high maximum heart rate achieved, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain, normal resting blood pressure (118 mmHg) and serum cholesterol levels (186 mg/dl). Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 124 bpm without experiencing exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 66-year-old male patient with non-anginal chest pain, normal resting blood pressure, no fasting blood sugar over 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 120, no exercise-induced angina, -0.5 ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 52-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 124, experiencing exercise-induced angina, 2.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 53-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 120, and serum cholesterol of 246. The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 116, and experienced exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 32-year-old female patient with atypical angina presented with normal resting blood pressure (105), serum cholesterol levels of 198, and a maximum heart rate achieved of 165. The patient did not have fasting blood sugar > 120 mg/dl, did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping on the resting electrocardiogram results.###\nHence this label was No."
"A 65-year-old male patient with asymptomatic chest pain, normal resting blood pressure and slightly high serum cholesterol level. Fasting blood sugar is normal. Resting electrocardiogram shows normal results. The patient experiences exercise-induced angina and has a significant ST depression of 4.0. The slope of the peak exercise ST segment is downsloping. Maximum heart rate achieved during exercise is 140. These factors indicate a potential risk of heart disease.###\nHence this label was Yes."
"The patient is a 68-year-old male who experiences non-anginal chest pain. His resting blood pressure is 150, and serum cholesterol level is 195. He has high fasting blood sugar (>120 mg/dl) and a normal resting electrocardiogram. The maximum heart rate achieved is 132, and he does not have exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 58-year-old male with atypical angina chest pain. His resting blood pressure is 130, and serum cholesterol level is 251. He does not have fasting blood sugar greater than 120 mg/dl. Resting electrocardiogram results are normal, and he achieved a maximum heart rate of 110. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 170, high serum cholesterol level of 388, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 122, experienced exercise-induced angina, 2.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 53-year-old female patient with non-anginal chest pain, normal resting blood pressure of 128, serum cholesterol level of 216. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The maximum heart rate achieved is 115, with no exercise-induced angina. ST depression post-exercise is 0.0. The slope of the peak exercise ST segment is upsloping. This data suggests a profile without significant risk factors for heart disease.###\nHence this label was No."
"The patient is a 54-year-old female with atypical angina chest pain. Her resting blood pressure is 150, serum cholesterol is 230, and fasting blood sugar is normal. Resting electrocardiogram results show normal readings. Her maximum heart rate achieved is 130, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 44-year-old male patient with atypical angina chest pain, normal resting blood pressure of 150, serum cholesterol level of 288, no fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 150, exercising-induced angina, 3.0 ST depression induced by exercise relative to rest, and flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 61-year-old male patient with non-anginal chest pain, resting blood pressure of 200, normal serum cholesterol levels, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, achieving a maximum heart rate of 70, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 48-year-old male patient with atypical angina, normal resting blood pressure, and slightly elevated serum cholesterol level of 229. The patient has a maximum heart rate of 168 and did not experience exercise-induced angina. However, there is ST depression of 1.0 induced by exercise relative to rest, with a downsloping peak exercise ST segment. Fasting blood sugar is under 120 mg/dl.###\nHence this label was Yes."
"A 45-year-old female patient with no history of chest pain, but showing signs of probable or definite left ventricular hypertrophy in resting electrocardiogram results. Resting blood pressure is 138, serum cholesterol level is 236. The patient experienced exercise-induced angina and reached a maximum heart rate of 152. ST depression induced by exercise relative to rest is 0.2, with a flat slope of the peak exercise ST segment. Fasting blood sugar level is not above 120 mg/dl.###\nHence this label was No."
"A 35-year-old male patient with asymptomatic chest pain, normal resting blood pressure and serum cholesterol levels. The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 130, and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.6, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 53-year-old male patient with asymptomatic chest pain, resting blood pressure of 124, serum cholesterol level of 260, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 112, experiencing exercise-induced angina, ST depression of 3.0 during exercise, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 54-year-old female patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. She does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram results are normal, and she achieved a maximum heart rate of 105 during exercise. The patient experienced exercise-induced angina and had a 1.5 ST depression relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 39-year-old male patient with atypical angina chest pain, normal resting blood pressure (120), and serum cholesterol (204). Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 145 without exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 66-year-old female patient with non-anginal chest pain had a resting blood pressure of 146 and serum cholesterol level of 278. They did not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram showed probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 152 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the peak exercise ST segment had a flat slope.Overall, the data suggests a condition that warrants further evaluation for possible heart disease.###\nHence this label was No."
"A 60-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and normal electrocardiogram results. They have a low serum cholesterol level and did not have fasting blood sugar levels above 120 mg/dl. The patient experienced exercise-induced angina and had a slightly elevated ST depression of 0.5 relative to rest. The slope of the peak exercise ST segment was upsloping, and their maximum heart rate achieved was 63.###\nHence this label was Yes."
"The patient is a 54-year-old male with atypical angina chest pain. \nHis resting blood pressure is high at 160, and his serum cholesterol level is elevated at 305. \nHe does not have fasting blood sugar greater than 120 mg/dl. \nResting electrocardiogram shows normal results. \nHe achieved a high maximum heart rate of 175 during exercise, and did not experience exercise-induced angina. \nThere was no ST depression induced by exercise relative to rest. \nThe slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 51-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and no fasting blood sugar elevation. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 107. The patient did not experience exercise-induced angina, and there was no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 51-year-old female patient with non-anginal chest pain visited the clinic. Her resting blood pressure is 110, and serum cholesterol is 190. She does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram showed normal results. Her maximum heart rate achieved was 120, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The 41-year-old female patient presents with atypical angina chest pain. \nResting blood pressure is 130, serum cholesterol is 204, and fasting blood sugar is normal. \nResting electrocardiogram shows probable or definite left ventricular hypertrophy. \nThe patient achieved a maximum heart rate of 172 without exercise-induced angina. \nThere is 1.4 ST depression induced by exercise relative to rest, with an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 54-year-old male patient with no history of chest pain, normal blood pressure and cholesterol levels, normal fasting blood sugar, and a normal resting electrocardiogram. The patient experiences exercise-induced angina, with a moderate ST depression of 2.8. The peak exercise ST segment shows a flat slope, with a maximum heart rate achieved of 126.###\nHence this label was Yes."
"A 41-year-old female patient with non-anginal chest pain, resting blood pressure of 112, serum cholesterol level of 268, no fasting blood sugar over 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 172, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 66-year-old female patient with asymptomatic chest pain has high resting blood pressure and slightly elevated serum cholesterol levels. They have fasting blood sugar levels above 120 mg/dl and experience exercise-induced angina. Despite these factors, their resting electrocardiogram is normal, and they achieve a high maximum heart rate during exercise. The ST depression induced by exercise relative to rest is minimal at 1.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 66-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 108 bpm, experiencing exercise-induced angina. The patient had ST depression of 2.0 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 52-year-old male who is asymptomatic but has high blood pressure and high cholesterol levels. Despite having a normal resting electrocardiogram, the patient experiences exercise-induced angina. The maximum heart rate achieved is 94, and there is significant ST depression (2.5) induced by exercise relative to rest, with a flat slope of the peak exercise ST segment. The fasting blood sugar level is below 120 mg/dl.###\nHence this label was Yes."
"A 46-year-old male patient with typical angina chest pain, resting blood pressure of 140, and serum cholesterol of 272. The patient has fasting blood sugar greater than 120 mg/dl, a normal resting electrocardiogram, and achieved a maximum heart rate of 175. There was no exercise-induced angina. The ST depression induced by exercise relative to rest was 2.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain has a resting blood pressure of 128 and serum cholesterol level of 216. His resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 131 during exercise, experienced angina, and had ST depression of 2.2 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 48-year-old male with non-anginal chest pain. His resting blood pressure is 102, and he has fasting blood sugar level greater than 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 110. The patient experiences exercise-induced angina and has a ST depression of 1.0 induced by exercise relative to rest. The slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 57-year-old female patient with asymptomatic chest pain has normal resting blood pressure and slightly elevated serum cholesterol. She has a normal resting electrocardiogram and achieved a maximum heart rate of 123 during exercise. The patient experienced exercise-induced angina and had a slight ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 64-year-old male with asymptomatic chest pain. His resting blood pressure is 130, and serum cholesterol is 223. He does not have fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 128, and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 59-year-old male patient with asymptomatic chest pain has a resting blood pressure of 138 and serum cholesterol level of 271. They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 182 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 49-year-old male patient with non-anginal chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. His fasting blood sugar is normal, resting electrocardiogram results are normal, and he achieved a high maximum heart rate during exercise without experiencing angina. ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 46-year-old female patient with asymptomatic chest pain, resting blood pressure of 138, serum cholesterol level of 243, and no fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 152, experienced exercise-induced angina, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 46-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no high serum cholesterol, normal fasting blood sugar level, normal resting electrocardiogram results, achieved maximum heart rate of 113, experienced exercise-induced angina, has ST depression of 1.5 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 60-year-old male with non-anginal chest pain. His resting blood pressure is 120, serum cholesterol level is normal, and fasting blood sugar is above 120 mg/dl. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 141 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, with a peak exercise ST segment sloping upwards.###\nHence this label was Yes."
"A 41-year-old male patient with non-anginal chest pain has normal resting blood pressure and serum cholesterol levels. They have a fasting blood sugar level below 120 mg/dl and a healthy resting electrocardiogram. Despite achieving a high maximum heart rate of 179, they did not experience exercise-induced angina. The ST segment depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 72-year-old male with no chest pain, but with high resting blood pressure and low serum cholesterol levels. They have fasting blood sugar above 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 130 without experiencing exercise-induced angina. They exhibited ST depression of 1.5 relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 52-year-old male patient, presenting with typical angina chest pain, has a resting blood pressure of 118 and serum cholesterol level of 186. He does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram indicates probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 190 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat. These factors suggest a comprehensive profile for assessing the risk of heart disease in the patient.###\nHence this label was No."
"The patient is a 38-year-old male with asymptomatic chest pain. His resting blood pressure is 110, serum cholesterol is 190, and fasting blood sugar is normal. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 150 during exercise, experienced exercise-induced angina, and had ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 38-year-old male patient with no chest pain symptoms, normal resting blood pressure, and cholesterol levels, no fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 166 without exercise-induced angina. The patient showed no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 54-year-old female with atypical angina chest pain. Her resting blood pressure is 120, serum cholesterol is 273, and fasting blood sugar is normal. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 150. The patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"The patient is a 66-year-old male experiencing non-anginal chest pain. \nHis resting blood pressure is 110, with a serum cholesterol level of 213.\nHe has a fasting blood sugar level > 120 mg/dl, and probable or definite left ventricular hypertrophy based on his resting electrocardiogram results.\nHis maximum heart rate achieved is 99, and he experiences exercise-induced angina. \nThe ST depression induced by exercise relative to rest is 1.3, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 49-year-old male patient with no symptoms of chest pain visited the clinic. His resting blood pressure was 130, and serum cholesterol level was 206. His fasting blood sugar was below 120 mg/dl. The results of his resting electrocardiogram were normal. He reached a maximum heart rate of 170 during exercise, and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat. The overall assessment indicates a healthy cardiovascular profile for this patient.###\nHence this label was Yes."
"A 54-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol of 237. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 150 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 39-year-old female patient with non-anginal chest pain, normal resting blood pressure (94), and serum cholesterol of 199. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. Maximum heart rate achieved is 179, with no exercise-induced angina present. ST depression induced by exercise relative to rest is 0.0, with a peak exercise ST segment slope of upsloping.###\nHence this label was No."
"A 65-year-old female patient with non-anginal chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. She has fasting blood sugar levels below 120 mg/dl and a healthy electrocardiogram. Despite reaching a maximum heart rate of 148, she did not experience exercise-induced angina. Her ST depression induced by exercise relative to rest was 0.8, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"This 44-year-old male patient has asymptomatic chest pain and normal resting blood pressure. Their serum cholesterol level is high at 290, but fasting blood sugar is within normal range. Resting electrocardiogram shows normal results. The patient experiences exercise-induced angina and has a ST depression of 2.0. The slope of the peak exercise ST segment is flat. The maximum heart rate achieved during exercise was 100.###\nHence this label was Yes."
"A 62-year-old male patient with non-anginal chest pain, normal resting blood pressure, no fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, a maximum heart rate of 72, experiencing exercise-induced angina, with no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 52-year-old male with atypical angina. His resting blood pressure is 140 and serum cholesterol level is 100. He does not have fasting blood sugar >120 mg/dl. Resting electrocardiogram results show as normal. His maximum heart rate achieved is 138. He experiences exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 47-year-old male patient with typical angina chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, a maximum heart rate of 150, no exercise-induced angina, no ST depression induced by exercise, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 54-year-old male patient with atypical angina chest pain, resting blood pressure of 160, serum cholesterol of 195, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 130, no exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was No."
"A 48-year-old female patient with non-anginal chest pain, normal resting blood pressure, serum cholesterol within normal range, fasting blood sugar level below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 125, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 37-year-old male patient with non-anginal chest pain has a resting blood pressure of 118 and a serum cholesterol level of 240. They do not have fasting blood sugar over 120 mg/dl. Their resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 165 and did not experience exercise-induced angina. They have a ST depression of 1.0 induced by exercise and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 41-year-old male who is asymptomatic and has a resting blood pressure of 104. They have normal serum cholesterol levels and fasting blood sugar below 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality, and the maximum heart rate achieved is 111. The patient does not experience exercise-induced angina and has no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old female patient with asymptomatic chest pain, resting blood pressure of 100, serum cholesterol level of 248, no fasting blood sugar over 120 mg/dl, and probable or definite left ventricular hypertrophy on resting electrocardiogram. She achieved a maximum heart rate of 122, did not experience exercise-induced angina, and showed 1.0 ST depression induced by exercise relative to rest with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 62-year-old male patient with atypical angina chest pain, resting blood pressure of 120, serum cholesterol level of 281. Fasting blood sugar is normal. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 103. Patient did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.4. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 35-year-old male experiencing no chest pain. His resting blood pressure is 120, with a serum cholesterol level of 0. He has fasting blood sugar > 120 mg/dl and normal resting electrocardiogram results. His maximum heart rate achieved is 130, and he experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.2, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 61-year-old male who is asymptomatic but shows probable or definite left ventricular hypertrophy on resting electrocardiogram. His blood pressure is 138, cholesterol level is 166, and he experiences exercise-induced angina. Despite reaching a maximum heart rate of 125, he displays ST depression of 3.6 relative to rest, with a flat slope on the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old female patient with atypical angina chest pain, resting blood pressure of 135, serum cholesterol level of 250. There is no fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 161 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.4, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 56-year-old male patient with non-anginal chest pain, normal resting blood pressure, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, and a maximum heart rate of 98. The patient did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was -2.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 70-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, serum cholesterol of 322, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 109, no exercise-induced angina, ST depression of 2.4 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 63-year-old male with asymptomatic chest pain. His resting blood pressure is 126, and he has normal serum cholesterol levels. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. His maximum heart rate achieved is 120, and he did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was No."
"A 43-year-old male patient with asymptomatic chest pain, resting blood pressure of 140, normal serum cholesterol levels, no fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 140, experiencing exercise-induced angina, with 0.5 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 50-year-old female with atypical angina presented normal resting electrocardiogram results. Her blood pressure was 120, cholesterol level was 244, and fasting blood sugar was below 120 mg/dl. She achieved a maximum heart rate of 162, did not experience exercise-induced angina, and had a ST depression of 1.1 induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 50-year-old male patient with asymptomatic chest pain, resting blood pressure of 144, serum cholesterol level of 200, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, achieving a maximum heart rate of 126, experiencing exercise-induced angina, with ST depression of 0.9 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 47-year-old male patient with asymptomatic chest pain has a resting blood pressure of 110 and normal serum cholesterol levels. They have fasting blood sugar above 120 mg/dl and show ST-T wave abnormality in their resting electrocardiogram. Their maximum heart rate achieved is 149, and they do not experience exercise-induced angina. The ST segment depression induced by exercise relative to rest is 2.1, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 65-year-old male patient with asymptomatic chest pain, normal resting blood pressure (140), high serum cholesterol level (306), fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, achieved a maximum heart rate of 87. The patient experienced exercise-induced angina, with 1.5 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. These factors may indicate a risk of heart disease in this individual.###\nHence this label was Yes."
"A 50-year-old male patient with no history of chest pain, normal resting blood pressure (133), and slightly elevated serum cholesterol (218) levels. The patient has a normal fasting blood sugar level, a healthy resting electrocardiogram, and achieved a maximum heart rate of 128 during exercise. The patient experienced exercise-induced angina, with a 1.1 ST depression relative to rest and a flat slope of the peak exercise ST segment. This data suggests a potential risk for heart disease due to the symptoms exhibited during exercise.###\nHence this label was Yes."
"The patient is a 67-year-old male who is experiencing asymptomatic chest pain. His resting blood pressure is 160 and serum cholesterol is 286. He does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 108. He experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 50-year-old female patient with non-anginal chest pain has normal resting blood pressure (140 mmHg) and slightly elevated serum cholesterol levels (288 mg/dl). She does not have fasting blood sugar levels above 120 mg/dl. The patient had a normal resting electrocardiogram, achieved a maximum heart rate of 140, and experienced exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 39-year-old female patient with non-anginal chest pain, normal resting blood pressure of 138, serum cholesterol level of 220. She has fasting blood sugar less than 120 mg/dl, normal resting electrocardiogram results, and achieved a maximum heart rate of 152. She did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"This female patient, aged 52, presents with atypical angina chest pain. Her resting blood pressure is 120 mmHg, serum cholesterol level is 210 mg/dl, and fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows normal results. She achieved a maximum heart rate of 148 bpm during exercise, did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 41-year-old male patient with atypical angina presented with a resting blood pressure of 120 and serum cholesterol levels of 291. Fasting blood sugar was normal. Resting electrocardiogram showed ST-T wave abnormality. The patient achieved a maximum heart rate of 160 without exercise-induced angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 51-year-old male who is asymptomatic but shows ST-T wave abnormality on resting electrocardiogram. His blood pressure is 130, with fasting blood sugar > 120 mg/dl. He achieved a maximum heart rate of 163 without experiencing exercise-induced angina. His serum cholesterol level is 0, and he has a flat slope of the peak exercise ST segment with no ST depression induced by exercise relative to rest.###\nHence this label was Yes."
"A 44-year-old female patient with non-anginal chest pain visited the clinic. Her resting blood pressure was 108, and serum cholesterol level was 141. She had normal results for resting electrocardiogram and did not have fasting blood sugar above 120 mg/dl. Despite achieving a maximum heart rate of 175 during exercise, she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.6, and the slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 42-year-old male patient with non-anginal chest pain, normal resting blood pressure of 120, serum cholesterol level of 228, normal resting electrocardiogram results, maximum heart rate of 152, experiencing exercise-induced angina. The patient has a slight ST depression of 1.5 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment. Fasting blood sugar is below 120 mg/dl.###\nHence this label was No."
"A 40-year-old male patient with atypical angina chest pain has normal resting blood pressure of 130 and serum cholesterol level of 275. They have fasting blood sugar below 120 mg/dl and a normal resting electrocardiogram. The patient achieved a maximum heart rate of 150 without any exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 42-year-old male patient with atypical angina chest pain, normal resting blood pressure of 150, and serum cholesterol level of 268. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 136. He did not experience exercise-induced angina, and showed no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 125, serum cholesterol level of 249, fasting blood sugar above 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. The patient achieved a maximum heart rate of 144, experienced exercise-induced angina, and had a ST depression of 1.2 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment. These factors suggest a potential risk of heart disease for the patient.###\nHence this label was Yes."
"A 39-year-old male patient with asymptomatic chest pain has normal resting blood pressure and high serum cholesterol levels. Their fasting blood sugar is normal, and resting electrocardiogram results are normal. The patient achieved a maximum heart rate of 140 during exercise without experiencing angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. He has a maximum heart rate of 105 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 1.5, and the slope of the peak exercise ST segment was flat. The patient did not have fasting blood sugar > 120 mg/dl.###\nHence this label was Yes."
"A 74-year-old male patient with atypical angina chest pain, resting blood pressure of 145, fasting blood sugar higher than 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 123, no exercise-induced angina, 1.3 ST depression induced by exercise relative to rest, and upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 42-year-old male patient with asymptomatic chest pain, normal resting blood pressure (140), high serum cholesterol (358), normal fasting blood sugar levels, normal resting electrocardiogram results, achieved a maximum heart rate of 170 during exercise without experiencing angina, and showed no ST depression induced by exercise. The peak exercise ST segment slope was upsloping.###\nHence this label was No."
"The patient is a 53-year-old male who is asymptomatic for chest pain. His resting blood pressure is 125 and he has a serum cholesterol level of 0. He has fasting blood sugar levels above 120 mg/dl. Resting electrocardiogram results show normalcy. His maximum heart rate achieved is 120 and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 56-year-old male patient with atypical angina chest pain has a resting blood pressure of 130 and serum cholesterol level of 221. The patient does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. The maximum heart rate achieved is 163, and there is no exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, with a peak exercise ST segment slope that is upsloping.###\nHence this label was No."
"The patient is a 64-year-old male who is asymptomatic but has high resting blood pressure and cholesterol levels. Their fasting blood sugar is above 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 130 without experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment slope is flat. This data suggests a potential risk of heart disease that should be further investigated.###\nHence this label was Yes."
"The patient is a 61-year-old male who is asymptomatic but experiences exercise-induced angina. His resting blood pressure is 120 and his serum cholesterol level is 260. He has a normal resting electrocardiogram and his maximum heart rate achieved is 140. The ST depression induced by exercise relative to rest is 3.6, and the slope of the peak exercise ST segment is flat. The fasting blood sugar level is not above 120 mg/dl.###\nHence this label was Yes."
"The patient is a 69-year-old male who experienced typical angina chest pain. His resting blood pressure is 160 and serum cholesterol level is 234. He has fasting blood sugar > 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 131 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.1, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 64-year-old female patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, a high maximum heart rate achieved during exercise, experienced exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment. These factors suggest a risk for heart disease and may require further evaluation.###\nHence this label was No."
"A 60-year-old male patient with non-anginal chest pain, normal blood pressure, slightly elevated serum cholesterol level, no fasting blood sugar issues, and probable or definite left ventricular hypertrophy based on resting electrocardiogram results. His maximum heart rate achieved was 135, did not experience exercise-induced angina, and had no ST depression induced by exercise. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 58-year-old female patient with non-anginal chest pain, normal resting blood pressure and high serum cholesterol levels. She has a normal resting electrocardiogram, a maximum heart rate of 172 achieved during exercise with no exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"This is a 56-year-old male with atypical angina chest pain. His resting blood pressure is 130, serum cholesterol level is 184, and fasting blood sugar is normal. The resting electrocardiogram shows normal results. He achieved a maximum heart rate of 100 and did not experience exercise-induced angina. There was no ST depression induced by exercise, and the peak exercise ST segment slope is upsloping.###\nHence this label was No."
"The patient is a 61-year-old male with asymptomatic chest pain. His resting blood pressure is 140 and serum cholesterol levels are 207. He does not have fasting blood sugar above 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 138. He experiences exercise-induced angina and has ST depression of 1.9 induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain, resting blood pressure of 170, and serum cholesterol level of 326. The patient does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 140 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 3.4, with a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 52-year-old male patient with asymptomatic chest pain, normal resting blood pressure of 128, serum cholesterol level of 255, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram. He achieved a maximum heart rate of 161, experienced exercise-induced angina, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 69-year-old male patient with asymptomatic chest pain, resting blood pressure of 142, serum cholesterol of 210, fasting blood sugar above 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 112, experiencing exercise-induced angina, ST depression induced by exercise relative to rest measuring 1.5, and a flat slope of the peak exercise ST segment. This data suggests a potential risk for heart disease in this patient.###\nHence this label was Yes."
"This is a profile of a 63-year-old female patient with atypical angina chest pain. She has normal resting blood pressure (140), serum cholesterol levels of 195, and a maximum heart rate achieved of 179. She does not have fasting blood sugar > 120 mg/dl or exercise-induced angina. Her resting electrocardiogram results are normal, with no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male patient with non-anginal chest pain, resting blood pressure of 105, serum cholesterol of 240, no fasting blood sugar over 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 154, experienced exercise-induced angina. ST depression induced by exercise relative to rest is 0.6, with a flat slope of the peak exercise ST segment. This data suggests a possible heart disease condition.###\nHence this label was No."
"A 51-year-old male patient with atypical angina chest pain, normal resting blood pressure, and serum cholesterol levels, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, and a maximum heart rate of 150. The patient did not experience exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 64-year-old male patient with asymptomatic chest pain, resting blood pressure of 110, normal fasting blood sugar level (>120 mg/dl), normal resting electrocardiogram results, maximum heart rate of 114, experienced exercise-induced angina, ST depression of 1.3 relative to rest, and a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 65-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar above 120 mg/dl. Their resting electrocardiogram results are normal and they achieved a maximum heart rate of 93. The patient experiences exercise-induced angina but has no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 59-year-old male who is asymptomatic for chest pain. His resting blood pressure is 135 and serum cholesterol level is 234. He does not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results show as normal. He achieved a maximum heart rate of 161 and did not experience exercise-induced angina. His ST depression induced by exercise relative to rest is 0.5, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 51-year-old male patient with asymptomatic chest pain has a resting blood pressure of 132 and serum cholesterol level of 227. Their fasting blood sugar is greater than 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 138 and did not experience exercise-induced angina. They had a slight ST depression (0.2) induced by exercise relative to rest, with a peak exercise ST segment showing upsloping pattern.###\nHence this label was No."
"This is a 54-year-old male patient with atypical angina. His resting blood pressure is 108 and serum cholesterol is 309. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal. He achieved a maximum heart rate of 156 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 58-year-old male with asymptomatic chest pain. He has a resting blood pressure of 170 and fasting blood sugar > 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 105 during exercise, experiencing exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 43-year-old female patient, with typical angina chest pain, normal resting blood pressure of 100 and serum cholesterol of 223. She does not have fasting blood sugar greater than 120 mg/dl, her resting electrocardiogram results are normal. The maximum heart rate achieved is 142 and she did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0 and the peak exercise ST segment slope is upsloping.###\nHence this label was No."
"The patient is a 61-year-old male with non-anginal chest pain. His resting blood pressure is 120, and his serum cholesterol is high at 337. He does not have fasting blood sugar above 120 mg/dl. His resting electrocardiogram results are normal. He achieved a maximum heart rate of 98 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 37-year-old female patient with no history of chest pain or fasting blood sugar issues. Resting blood pressure is 130, serum cholesterol level is 173. Resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 184 without experiencing exercise-induced angina. There was no ST depression induced by exercise. The peak exercise ST segment slope is upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain has a resting blood pressure of 140 and serum cholesterol level of 268. They have a normal resting electrocardiogram and achieved a maximum heart rate of 128. The patient experienced exercise-induced angina, with 1.5 ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was flat. No fasting blood sugar > 120 mg/dl was observed in this individual.###\nHence this label was Yes."
"A 59-year-old male patient with no chest pain symptoms, normal resting blood pressure, and normal serum cholesterol levels. The patient has a normal resting electrocardiogram, achieved a maximum heart rate of 140 during exercise without experiencing angina. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 58-year-old male patient with non-anginal chest pain, resting blood pressure of 150, serum cholesterol of 219, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved of 118, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 43-year-old female patient with asymptomatic chest pain, high resting blood pressure of 132, elevated serum cholesterol level of 341, and fasting blood sugar over 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient experiences exercise-induced angina and ST depression of 3.0 relative to rest. Maximum heart rate achieved is 136, and the slope of the peak exercise ST segment is flat. These factors indicate a potential risk of heart disease in the patient.###\nHence this label was Yes."
"The patient is a 49-year-old female with atypical angina chest pain. She has normal resting blood pressure and serum cholesterol levels. Her fasting blood sugar is below 120 mg/dl. The resting electrocardiogram results are normal, and she achieved a maximum heart rate of 160 during exercise. She did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, normal serum cholesterol levels, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy shown on resting electrocardiogram, maximum heart rate achieved is 122, experiencing exercise-induced angina, with 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 57-year-old male who is experiencing asymptomatic chest pain. His resting blood pressure is 110, with a serum cholesterol level of 0. He has fasting blood sugar > 120 mg/dl and ST-T wave abnormality in resting electrocardiogram results. His maximum heart rate achieved is 131, and he experiences exercise-induced angina. The patient has ST depression of 1.4 induced by exercise relative to rest, with a upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 59-year-old male patient with asymptomatic chest pain has normal resting blood pressure and very low serum cholesterol levels. Their fasting blood sugar is higher than 120 mg/dl. Resting electrocardiogram results are normal, and the maximum heart rate achieved is 119. The patient experiences exercise-induced angina and has a slight ST depression of 0.9 relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 67-year-old male patient with non-anginal chest pain, resting blood pressure of 152, serum cholesterol level of 212, no high fasting blood sugar, showing probable or definite left ventricular hypertrophy on resting electrocardiogram, achieving a maximum heart rate of 150. The patient does not experience exercise-induced angina and has an ST depression of 0.8 relative to rest. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 54-year-old female patient with atypical angina chest pain, resting blood pressure of 140, serum cholesterol level of 309, normal fasting blood sugar, ST-T wave abnormality in resting electrocardiogram, maximum heart rate of 140, no exercise-induced angina, no ST depression induced by exercise, and an upsloping slope of peak exercise ST segment.###\nHence this label was No."
"The patient is a 51-year-old male who is asymptomatic but has a resting blood pressure of 95. His fasting blood sugar is above 120 mg/dl. Resting electrocardiogram results show normal activity. He achieved a maximum heart rate of 126 without experiencing exercise-induced angina. However, he has an ST depression of 2.2 relative to rest, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"The patient is a 49-year-old female who is asymptomatic but has elevated serum cholesterol levels. She has normal resting blood pressure and normal resting electrocardiogram results. Her maximum heart rate achieved during exercise is 163, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 49-year-old male patient with no typical symptoms of chest pain, normal blood pressure and cholesterol levels. His resting electrocardiogram results were normal, but he experienced exercise-induced angina. Despite this, he achieved a maximum heart rate of 96. There was no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 45-year-old female patient with atypical angina chest pain, normal resting blood pressure of 112, and serum cholesterol level of 160. She has a normal resting electrocardiogram and achieved a maximum heart rate of 138 during exercise without experiencing angina. There was no ST depression induced by exercise, and the slope of the peak exercise ST segment was flat. The fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 32-year-old male patient with typical angina chest pain, normal resting blood pressure, low serum cholesterol, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram results are normal, maximum heart rate achieved is 127, and there is no exercise-induced angina. The ST depression induced by exercise relative to rest is 0.7, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 43-year-old female patient with atypical angina chest pain, normal resting blood pressure of 150, serum cholesterol level of 186, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate of 154, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"This 59-year-old male patient has asymptomatic chest pain. His resting blood pressure is 120, serum cholesterol level is normal, and fasting blood sugar is below 120 mg/dl. The resting electrocardiogram results are normal with a maximum heart rate of 115. The patient did not experience exercise-induced angina and ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 48-year-old female patient with atypical angina chest pain, resting blood pressure of 120, serum cholesterol level of 177, fasting blood sugar higher than 120 mg/dl, ST-T wave abnormality on resting electrocardiogram, maximum heart rate achieved at 148, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping peak exercise ST segment. These features can help predict the likelihood of heart disease in the patient.###\nHence this label was No."
"A 56-year-old male patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol level of 256, and fasting blood sugar above 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient experienced exercise-induced angina, with a maximum heart rate of 142. ST depression of 0.6 was induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 37-year-old male patient with non-anginal chest pain, normal resting blood pressure (130), serum cholesterol levels (194), and a maximum heart rate of 150. The patient does not have fasting blood sugar > 120 mg/dl, nor does he experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the peak exercise ST segment shows an upsloping pattern on the resting electrocardiogram results.###\nHence this label was No."
"The patient is a 55-year-old male with atypical angina chest pain. Their resting blood pressure is 140, and they have no fasting blood sugar above 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 150 and did not experience exercise-induced angina. They have a ST depression of 0.2 induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 64-year-old male patient with asymptomatic chest pain, normal serum cholesterol levels, and ST-T wave abnormality on resting electrocardiogram. Resting blood pressure is 120, fasting blood sugar is above 120 mg/dl. Maximum heart rate achieved is 106, with no exercise-induced angina. ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat. These factors suggest a potential risk for heart disease in this individual.###\nHence this label was Yes."
"A 51-year-old male patient with asymptomatic chest pain, resting blood pressure of 130, normal electrocardiogram results, fasting blood sugar > 120 mg/dl, maximum heart rate achieved at 170, no exercise-induced angina, ST depression of -0.7 induced by exercise relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was Yes."
"The 48-year-old male patient has asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. They do not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal. They achieved a maximum heart rate of 159 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 49-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and slightly elevated serum cholesterol. The patient does not have fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows normal results. The maximum heart rate achieved is 140, and the patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 1.0, and the slope of the peak exercise ST segment is flat. These factors suggest a potential risk of heart disease in this individual.###\nHence this label was Yes."
"The patient is a 47-year-old male with non-anginal chest pain. His resting blood pressure is 110, serum cholesterol level is 0, and he has high fasting blood sugar (>120 mg/dl). His resting electrocardiogram is normal. He achieved a maximum heart rate of 120 during exercise, experienced exercise-induced angina, and had an ST depression of 0.0 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 53-year-old male patient with non-anginal chest pain, resting blood pressure of 155, serum cholesterol level of 175, and fasting blood sugar higher than 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. Maximum heart rate achieved is 160, and there is no exercise-induced angina. ST depression induced by exercise relative to rest is 0.3, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 48-year-old female patient with atypical angina chest pain, normal resting blood pressure, high serum cholesterol level, normal fasting blood sugar, normal resting electrocardiogram results, moderate maximum heart rate, no exercise-induced angina, no ST depression induced by exercise, and an upsloping peak exercise ST segment.###\nHence this label was No."
"The patient is a 58-year-old male with asymptomatic chest pain. His resting blood pressure is 130 and serum cholesterol level is 0. He does not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. The maximum heart rate achieved is 100. The patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 1.0 and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with no history of chest pain visited the clinic for a regular check-up. His resting blood pressure was 100, and his serum cholesterol level was 234. He had normal resting electrocardiogram results and achieved a maximum heart rate of 156 during exercise. He did not experience exercise-induced angina and had a slight ST depression of 0.1. The slope of his peak exercise ST segment was upsloping. Overall, the patient's heart health indicators suggest a low risk of heart disease.###\nHence this label was Yes."
"A 51-year-old male patient with atypical angina chest pain has normal resting blood pressure (125) and serum cholesterol levels (188). Fasting blood sugar is not above 120 mg/dl. Resting electrocardiogram results are normal with a maximum heart rate of 145. The patient does not experience exercise-induced angina, and ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"This is a 55-year-old female with atypical angina chest pain. Her resting blood pressure is 122, serum cholesterol is 320, and fasting blood sugar is normal. Resting electrocardiogram results are normal, with a maximum heart rate of 155. She does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, moderate maximum heart rate achieved, experiencing exercise-induced angina, mild ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 56-year-old male presenting with asymptomatic chest pain. Resting blood pressure is 132, with serum cholesterol level at 184. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The maximum heart rate achieved is 105. The patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 2.1, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 41-year-old female with atypical angina visited the clinic. Her resting blood pressure was 110, and serum cholesterol was 250. She had a normal fasting blood sugar level and exhibited ST-T wave abnormality on the resting electrocardiogram. Her maximum heart rate achieved was 142, and she did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 55-year-old male patient with non-anginal chest pain, resting blood pressure of 136, serum cholesterol level of 245, high fasting blood sugar, showing ST-T wave abnormality on resting electrocardiogram. The patient achieved a maximum heart rate of 131, experienced exercise-induced angina, ST depression of 1.2 relative to rest, and had a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 62-year-old male patient with non-anginal chest pain has a resting blood pressure of 133. Although the serum cholesterol level is not provided, the patient has high fasting blood sugar. The resting electrocardiogram shows ST-T wave abnormality. The patient achieved a maximum heart rate of 119 and experienced exercise-induced angina. There was a 1.2 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat. Overall, there are multiple indications of potential heart disease in this patient.###\nHence this label was Yes."
"A 48-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol level of 268, normal resting electrocardiogram results, maximum heart rate achieved at 103 bpm, experiencing exercise-induced angina, with 1.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment. Fasting blood sugar is not above 120 mg/dl.###\nHence this label was Yes."
"A 42-year-old male patient with non-anginal chest pain, normal resting blood pressure of 160, and serum cholesterol of 147. Fasting blood sugar is normal, resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 146 without exercise-induced angina. No ST depression was induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 52-year-old female patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar > 120 mg/dl. Their resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 140 during exercise, and experienced exercise-induced angina. They have a ST depression of 1.5 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment. These factors suggest a potential risk of heart disease in this patient.###\nHence this label was No."
"A 49-year-old male patient with typical angina chest pain, resting blood pressure of 130, normal serum cholesterol levels, no fasting blood sugar above 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 145, no exercise-induced angina, 3.0 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 45-year-old male patient presenting with non-anginal chest pain, normal resting blood pressure (130), and serum cholesterol levels (236). Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate achieved of 144. The patient did not experience exercise-induced angina and showed a slight ST depression of 0.1 induced by exercise relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 45-year-old female patient with atypical angina chest pain has normal resting blood pressure (130) and slightly elevated serum cholesterol (237). She does not have fasting blood sugar > 120 mg/dl and her resting electrocardiogram results are normal. Her maximum heart rate achieved is 170 and she does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 59-year-old male patient with no history of chest pain, but with probable or definite left ventricular hypertrophy as per the resting electrocardiogram results. He experienced exercise-induced angina, with a maximum heart rate of 142. Resting blood pressure was 110, serum cholesterol was 239, fasting blood sugar was normal. ST depression induced by exercise relative to rest was 1.2, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 50-year-old male patient presenting with atypical angina chest pain. Resting blood pressure is 140, serum cholesterol is 216. Fasting blood sugar is normal. Resting electrocardiogram shows normal results. Maximum heart rate achieved is 170. The patient does not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"The patient is a 64-year-old male with asymptomatic chest pain and resting blood pressure of 145. His serum cholesterol level is 212, fasting blood sugar is normal, and resting electrocardiogram shows probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 132 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 67-year-old male patient, with asymptomatic chest pain, resting blood pressure of 100, serum cholesterol level of 299, no fasting blood sugar > 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. His maximum heart rate achieved is 125, experienced exercise-induced angina, ST depression induced by exercise relative to rest is 0.9, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 60-year-old male patient with no chest pain, normal resting blood pressure, and serum cholesterol levels, normal fasting blood sugar levels, a normal electrocardiogram, a high maximum heart rate achieved, experiencing exercise-induced angina, a slight ST depression induced by exercise relative to rest, and a peak exercise ST segment with an upsloping slope.###\nHence this label was Yes."
"A 44-year-old male patient with no history of chest pain, normal resting blood pressure and cholesterol levels, normal fasting blood sugar, and a healthy resting electrocardiogram. The patient experiences exercise-induced angina and has ST depression of 2.8 relative to rest, with a downsloping peak exercise ST segment. Despite these findings, the patient achieves a maximum heart rate of 144.###\nHence this label was Yes."
"A 53-year-old male patient with no symptoms of chest pain visited the doctor. His resting blood pressure is 140, serum cholesterol level is 243, and fasting blood sugar is normal. The electrocardiogram results showed a normal reading. His maximum heart rate achieved during exercise was 155, and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 48-year-old male patient with no chest pain symptoms, normal resting blood pressure, zero serum cholesterol, fasting blood sugar above 120 mg/dl, normal resting electrocardiogram results, a maximum heart rate of 128, no exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with atypical angina has a resting blood pressure of 140 and serum cholesterol level of 260. They have fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, and achieved a maximum heart rate of 140. The patient did not experience exercise-induced angina and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 43-year-old male with atypical angina chest pain. His resting blood pressure is 142, serum cholesterol is 207, and fasting blood sugar is normal. Resting electrocardiogram results are normal, with a maximum heart rate of 138. The patient does not experience exercise-induced angina and has no ST depression induced by exercise. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 61-year-old male patient presented with asymptomatic chest pain, resting blood pressure of 105, normal electrocardiogram results, and a maximum heart rate of 110. The patient had a fasting blood sugar level higher than 120 mg/dl and experienced exercise-induced angina. There was ST depression of 1.5 induced by exercise relative to rest, with a peak exercise ST segment slope that was upsloping.###\nHence this label was Yes."
"A 52-year-old male patient with atypical angina chest pain has a resting blood pressure of 160 and serum cholesterol level of 196. They have normal resting electrocardiogram results and achieved a maximum heart rate of 165 during exercise, without experiencing exercise-induced angina. Their ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 53-year-old male patient with asymptomatic chest pain has normal resting blood pressure and serum cholesterol levels. They do not have fasting blood sugar over 120 mg/dl. Resting electrocardiogram results are normal, with a maximum heart rate of 141. The patient experiences exercise-induced angina and has ST depression of 2.0 induced by exercise relative to rest, with a downsloping peak exercise ST segment.###\nHence this label was No."
"A 67-year-old male patient with asymptomatic chest pain, normal resting blood pressure (120), serum cholesterol level of 237, normal fasting blood sugar, normal resting electrocardiogram results, maximum heart rate achieved at 71, no exercise-induced angina, ST depression of 1.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 61-year-old male who has asymptomatic chest pain. His resting blood pressure is high at 190 mmHg and serum cholesterol is elevated at 287 mg/dl. Fasting blood sugar level is above 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient experienced exercise-induced angina and had ST depression of 2.0 mm relative to rest. The slope of the peak exercise ST segment is downsloping. Despite these risk factors, the patient reached a maximum heart rate of 150 beats per minute.###\nHence this label was Yes."
"A 59-year-old male patient with an asymptomatic type of chest pain, resting blood pressure of 154, normal serum cholesterol levels, no high fasting blood sugar, showing ST-T wave abnormality on resting electrocardiogram. He achieved a maximum heart rate of 131 during exercise, experienced exercise-induced angina, had 1.5 ST depression induced by exercise relative to rest, and showed an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 58-year-old male patient with asymptomatic chest pain, resting blood pressure of 132, high serum cholesterol level of 458, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, low maximum heart rate of 69, no exercise-induced angina, 1.0 ST depression induced by exercise relative to rest, and downsloping peak exercise ST segment. These factors suggest a potential risk of heart disease in the patient.###\nHence this label was No."
"A 41-year-old female patient with atypical angina chest pain, normal resting blood pressure, high serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, achieving a maximum heart rate of 163, showing no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment. These factors suggest a low to moderate risk of heart disease in this individual.###\nHence this label was No."
"A 29-year-old male patient presenting with atypical angina chest pain, normal resting blood pressure of 140, serum cholesterol level of 263, normal fasting blood sugar, normal resting electrocardiogram results, achieving a maximum heart rate of 170, denying exercise-induced angina, showing no ST depression induced by exercise relative to rest, and having an upsloping peak exercise ST segment.###\nHence this label was No."
"The patient is a 43-year-old male who is asymptomatic and has a resting blood pressure of 115. Their serum cholesterol level is normal, and fasting blood sugar is below 120 mg/dl. Resting electrocardiogram results show normal activity. The patient achieved a maximum heart rate of 145 during exercise, experiencing angina. ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 64-year-old male patient with asymptomatic chest pain, resting blood pressure of 120, serum cholesterol level of 246, no fasting blood sugar > 120 mg/dl. Resting electrocardiogram indicates probable or definite left ventricular hypertrophy. Maximum heart rate achieved is 96 and the patient experiences exercise-induced angina. The ST depression induced by exercise relative to rest is 2.2, and the slope of the peak exercise ST segment is downsloping.###\nHence this label was Yes."
"A 55-year-old male patient with non-anginal chest pain, resting blood pressure of 136, serum cholesterol level of 228, and no fasting blood sugar above 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 124 and experienced exercise-induced angina. ST depression induced by exercise relative to rest is 1.6, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 28-year-old male patient with atypical angina chest pain has no fasting blood sugar over 120 mg/dl. Resting blood pressure is 130 and serum cholesterol level is 132. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 185 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0 and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 50-year-old male patient with asymptomatic chest pain has a resting blood pressure of 130 and a serum cholesterol level of 233. Their fasting blood sugar is normal, and resting electrocardiogram results show a normal pattern. The patient experiences exercise-induced angina, with a maximum heart rate of 121. They also have ST depression of 2.0 induced by exercise relative to rest and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 62-year-old male patient with non-anginal chest pain, normal resting blood pressure of 130, serum cholesterol level at 231, fasting blood sugar below 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 146. The patient did not experience exercise-induced angina, but had ST depression of 1.8 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 67-year-old male patient with asymptomatic chest pain, resting blood pressure of 120, serum cholesterol level of 229, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 129, experiencing exercise-induced angina, 2.6 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 71-year-old female patient with asymptomatic chest pain, normal resting blood pressure, and low serum cholesterol levels. The patient has a normal resting electrocardiogram, a maximum heart rate of 125, and did not experience exercise-induced angina. However, there was ST depression of 1.6 induced by exercise relative to rest, with a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, resting blood pressure of 142, serum cholesterol level of 228, normal fasting blood sugar, ST-T wave abnormality on resting electrocardiogram, maximum heart rate of 149, experiencing exercise-induced angina, ST depression of 2.5 relative to rest, and an upsloping peak exercise ST segment.###\nHence this label was Yes."
"A 67-year-old female patient with non-anginal chest pain, normal resting blood pressure (152), and serum cholesterol (277) levels. They have fasting blood sugar levels below 120 mg/dl, a normal resting electrocardiogram, and achieved a maximum heart rate of 172. The patient did not experience exercise-induced angina, and showed no ST depression post-exercise. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"The patient is a 53-year-old male with non-anginal chest pain. They have a resting blood pressure of 130 and a serum cholesterol level of 197. The fasting blood sugar is higher than 120 mg/dl. The resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 152 and did not experience exercise-induced angina. They have a ST depression of 1.2 induced by exercise relative to rest, with a downsloping peak exercise ST segment.###\nHence this label was No."
"A 61-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. The patient has a normal fasting blood sugar level, normal resting electrocardiogram results, and achieved a maximum heart rate of 161 during exercise. There was no exercise-induced angina, and ST depression induced by exercise relative to rest was 0.0. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 63-year-old female patient with non-anginal chest pain, resting blood pressure of 135, serum cholesterol of 252, no fasting blood sugar >120 mg/dl, probable or definite left ventricular hypertrophy on resting electrocardiogram, maximum heart rate achieved at 172, no exercise-induced angina, ST depression of 0.0 induced by exercise relative to rest, and upsloping peak exercise ST segment.###\nHence this label was No."
"A 41-year-old male patient with asymptomatic chest pain, normal resting blood pressure, high serum cholesterol level, normal fasting blood sugar, normal resting electrocardiogram results, moderate maximum heart rate achieved, experiencing exercise-induced angina, significant ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 54-year-old male with atypical angina chest pain. He has high resting blood pressure of 192 and elevated serum cholesterol levels of 283. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram suggests probable or definite left ventricular hypertrophy. Despite a high heart rate of 195, the patient did not experience exercise-induced angina. There was no ST depression induced by exercise relative to rest, and the peak exercise ST segment shows an upsloping pattern.###\nHence this label was Yes."
"The patient is a 42-year-old male with atypical angina chest pain. His resting blood pressure is 120, and his serum cholesterol level is 295. He does not have fasting blood sugar over 120 mg/dl. The resting electrocardiogram shows normal results. He achieved a maximum heart rate of 162 and did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 63-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, serum cholesterol level of 267, fasting blood sugar > 120 mg/dl, ST-T wave abnormality in resting electrocardiogram, maximum heart rate achieved at 88, exercise-induced angina present, ST depression of 2.0 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 62-year-old male patient with no history of chest pain presented with asymptomatic heart disease. His resting blood pressure was 158 and serum cholesterol level was 170. The resting electrocardiogram showed ST-T wave abnormality. Despite reaching a maximum heart rate of 138 during exercise, the patient experienced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 54-year-old male with asymptomatic chest pain. He has high resting blood pressure (180) and normal resting electrocardiogram results. His maximum heart rate achieved is 150. He has fasting blood sugar > 120 mg/dl, but does not experience exercise-induced angina. The patient has ST depression of 1.5 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain, high resting blood pressure (140), elevated serum cholesterol levels (385), and probable or definite left ventricular hypertrophy. He achieved a maximum heart rate of 135 without experiencing exercise-induced angina. His ST depression induced by exercise relative to rest was 0.3, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 50-year-old male patient with no fasting blood sugar > 120 mg/dl, asymptomatic chest pain, resting blood pressure of 150, serum cholesterol of 243, probable or definite left ventricular hypertrophy in resting electrocardiogram results, maximum heart rate achieved at 128, no exercise-induced angina, ST depression of 2.6 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 65-year-old male patient with asymptomatic chest pain, resting blood pressure of 160, normal serum cholesterol level, high fasting blood sugar, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 122, no exercise-induced angina, 1.2 ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 55-year-old male patient with atypical angina chest pain, resting blood pressure of 110, serum cholesterol level of 214, fasting blood sugar higher than 120 mg/dl, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 180, no exercise-induced angina, 0.4 ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 57-year-old male patient with non-anginal chest pain has a resting blood pressure of 128 and serum cholesterol level of 229. They do not have fasting blood sugar over 120 mg/dl. Their resting electrocardiogram indicates probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 150 without exercise-induced angina. They experienced a 0.4 ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 53-year-old male patient with no history of chest pain, normal resting blood pressure, and slightly elevated serum cholesterol levels. His fasting blood sugar is below 120 mg/dl and resting electrocardiogram results are normal. He achieved a maximum heart rate of 122 during exercise, experienced exercise-induced angina, and showed ST depression of 2.0 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 74-year-old male patient with non-anginal chest pain, normal resting blood pressure, and no fasting blood sugar issues. Resting electrocardiogram results are normal, with a maximum heart rate of 116 achieved during exercise. The patient did not experience exercise-induced angina. There is a slight ST depression of 0.2 induced by exercise relative to rest, with an upsloping peak exercise ST segment.###\nHence this label was No."
"A 48-year-old female patient presented with atypical angina chest pain. She has a resting blood pressure of 133 and a serum cholesterol level of 308. Fasting blood sugar is below 120 mg/dl. Resting electrocardiogram shows ST-T wave abnormality. Her maximum heart rate achieved is 156, and there is no exercise-induced angina. She has an ST depression of 2.0 induced by exercise relative to rest, with a peak exercise ST segment showing upsloping pattern.###\nHence this label was No."
"A 42-year-old male patient with non-anginal chest pain visited the clinic. His resting blood pressure was 134 and serum cholesterol was 240. He had a normal resting electrocardiogram and achieved a maximum heart rate of 160 during exercise. He did not experience exercise-induced angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping. His fasting blood sugar level was below 120 mg/dl.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure (110), and serum cholesterol levels (201). His fasting blood sugar is below 120 mg/dl, and his resting electrocardiogram shows normal results. He achieved a maximum heart rate of 126, experienced exercise-induced angina, and had ST depression of 1.5 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat. These factors suggest a potential risk of heart disease in this patient.###\nHence this label was No."
"The patient is a 62-year-old male who experiences typical angina chest pain. His resting blood pressure is 120, and he has high fasting blood sugar levels (>120 mg/dl). The resting electrocardiogram suggests probable or definite left ventricular hypertrophy. His maximum heart rate achieved is 134, and he does not experience exercise-induced angina. The ST depression induced by exercise relative to rest is -0.8, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 64-year-old male patient with non-anginal chest pain, normal resting blood pressure and high serum cholesterol levels. Fasting blood sugar is normal. Resting electrocardiogram results are normal. The patient experiences exercise-induced angina and has a peak heart rate of 131. ST depression induced by exercise relative to rest is 1.8, with a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 64-year-old female with non-anginal chest pain presented with normal resting blood pressure, high serum cholesterol, and a normal resting electrocardiogram. She achieved a maximum heart rate of 133 during exercise without experiencing angina. The ST depression induced by exercise relative to rest was 0.2, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 49-year-old male patient with no history of chest pain presented with normal resting blood pressure and cholesterol levels. His fasting blood sugar was below 120 mg/dl. The resting electrocardiogram showed normal results, and he achieved a maximum heart rate of 130 during exercise without experiencing angina. The ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 61-year-old female patient presented with asymptomatic chest pain. Their resting blood pressure was 145 mmHg and serum cholesterol level was 307 mg/dl. The resting electrocardiogram indicated probable or definite left ventricular hypertrophy. They achieved a maximum heart rate of 146 bpm during exercise, which induced angina. The ST depression induced by exercise relative to rest was 1.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 55-year-old asymptomatic male with normal resting blood pressure, no fasting blood sugar above 120 mg/dl, and a resting electrocardiogram showing normal results. He achieved a maximum heart rate of 83 during exercise without experiencing angina. His ST depression induced by exercise relative to rest was 0.0, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 51-year-old female patient with asymptomatic chest pain, resting blood pressure of 114, serum cholesterol level of 258, and fasting blood sugar higher than 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 96, did not experience exercise-induced angina, and had ST depression of 1.0 relative to rest. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 62-year-old female patient with asymptomatic chest pain, resting blood pressure of 140, serum cholesterol level of 268, no fasting blood sugar over 120 mg/dl. Resting electrocardiogram results indicate probable or definite left ventricular hypertrophy. She achieved a maximum heart rate of 160 without exercise-induced angina. ST depression induced by exercise relative to rest was 3.6, with a downsloping peak exercise ST segment.###\nHence this label was Yes."
"A 57-year-old male patient with non-anginal chest pain, normal resting blood pressure, and serum cholesterol levels. The fasting blood sugar is below 120 mg/dl, resting electrocardiogram shows normal results. The maximum heart rate achieved is 174, and there is no exercise-induced angina. The ST depression induced by exercise relative to rest is 1.6, with an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 77-year-old male patient with asymptomatic chest pain has a resting blood pressure of 125 and serum cholesterol level of 304. Their resting electrocardiogram shows probable or definite left ventricular hypertrophy. Despite reaching a maximum heart rate of 162 during exercise, they experienced angina. There was no significant ST depression induced by exercise, and the peak exercise ST segment showed an upsloping slope.###\nHence this label was Yes."
"The patient is a 53-year-old male with atypical angina chest pain. His resting blood pressure is 140 and serum cholesterol level is 320. Fasting blood sugar is normal. Resting electrocardiogram results show normal readings. The patient achieved a maximum heart rate of 162 and did not experience exercise-induced angina. ST depression induced by exercise relative to rest is 0.0. The slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 66-year-old male patient presented with asymptomatic chest pain and resting blood pressure of 160. His serum cholesterol level was 228, and fasting blood sugar was normal. The resting electrocardiogram showed probable or definite left ventricular hypertrophy. Despite reaching a maximum heart rate of 138 during exercise, the patient did not experience angina. However, ST segment depression of 2.3 was observed during exercise, with the slope of the peak exercise ST segment being upsloping.###\nHence this label was No."
"The patient is a 60-year-old male with asymptomatic chest pain. His resting blood pressure is 136, serum cholesterol level is 195, and fasting blood sugar is normal. Resting electrocardiogram shows normal results. He achieved a maximum heart rate of 126 without exercise-induced angina. The ST depression induced by exercise relative to rest is 0.3, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 57-year-old male patient with atypical angina chest pain, resting blood pressure of 154, serum cholesterol level of 232, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, achieved a maximum heart rate of 164, did not experience exercise-induced angina, had 0.0 ST depression induced by exercise relative to rest, and had an upsloping peak exercise ST segment.###\nHence this label was Yes."
"A 62-year-old male patient with asymptomatic chest pain, resting blood pressure of 135, serum cholesterol level of 297, normal resting electrocardiogram results, maximum heart rate achieved at 130, experiencing exercise-induced angina, with ST depression of 1.0 relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 56-year-old female patient with atypical angina chest pain, resting blood pressure of 140, and serum cholesterol levels of 294. Fasting blood sugar is below 120 mg/dl, and resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 153, did not experience exercise-induced angina, and had ST depression of 1.3 induced by exercise relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was No."
"A 41-year-old male patient with atypical angina chest pain has normal resting blood pressure and slightly elevated serum cholesterol. His fasting blood sugar is below 120 mg/dl, and the resting electrocardiogram shows normal results. He achieved a maximum heart rate of 153 without exercise-induced angina. There is no ST depression induced by exercise relative to rest, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 43-year-old male patient with asymptomatic chest pain, resting blood pressure of 132, serum cholesterol level of 247, and fasting blood sugar > 120 mg/dl. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 143, experienced exercise-induced angina, and had ST depression of 0.1 relative to rest. The slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"A 44-year-old male patient with no fasting blood sugar issues presents with asymptomatic chest pain. Resting blood pressure is 110, serum cholesterol is 197. Resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 177 with no exercise-induced angina. ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping. These factors provide insight into the patient's heart health and potential risks for heart disease.###\nHence this label was Yes."
"A 50-year-old male patient with asymptomatic chest pain, normal resting blood pressure, no fasting blood sugar issue, ST-T wave abnormality in resting electrocardiogram, achieved a maximum heart rate of 156 during exercise, experienced exercise-induced angina, showed no ST depression induced by exercise relative to rest, and had an upsloping slope of the peak exercise ST segment.###\nHence this label was Yes."
"A 51-year-old male patient with asymptomatic chest pain, normal resting blood pressure, elevated serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, achieved a maximum heart rate of 122, experienced exercise-induced angina, had ST depression of 4.2 induced by exercise relative to rest, and displayed a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 62-year-old male with atypical angina chest pain. He has a resting blood pressure of 128 and a serum cholesterol level of 208. His fasting blood sugar is above 120 mg/dl, and his resting electrocardiogram shows probable or definite left ventricular hypertrophy. The patient achieved a maximum heart rate of 140 and did not experience exercise-induced angina. His ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 54-year-old male patient with asymptomatic chest pain has normal resting blood pressure and cholesterol levels. Their fasting blood sugar is below 120 mg/dl, and their resting electrocardiogram shows normal results. The patient achieved a maximum heart rate of 155 without experiencing exercise-induced angina. They had no ST depression induced by exercise compared to rest, and the slope of the peak exercise ST segment was flat.###\nHence this label was Yes."
"The patient is a 51-year-old female with asymptomatic chest pain. She has a resting blood pressure of 120 and normal resting electrocardiogram results. Her maximum heart rate achieved is 127, and she experiences exercise-induced angina. The patient has a fasting blood sugar level greater than 120 mg/dl. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 41-year-old male patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol level of 214, no fasting blood sugar > 120 mg/dl, showing probable or definite left ventricular hypertrophy on resting electrocardiogram. The patient achieved a maximum heart rate of 168, did not experience exercise-induced angina, exhibited ST depression of 2.0 induced by exercise relative to rest, and had a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 72-year-old male patient with non-anginal chest pain, resting blood pressure of 160, normal serum cholesterol levels, no fasting blood sugar > 120 mg/dl, probable or definite left ventricular hypertrophy in resting electrocardiogram results, maximum heart rate achieved at 114, no exercise-induced angina, ST depression of 1.6 induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was No."
"A 60-year-old male patient, asymptomatic chest pain, with resting blood pressure of 142 and serum cholesterol of 216. Fasting blood sugar is normal. Resting electrocardiogram shows normal results. Maximum heart rate achieved is 110. Patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 2.5. The slope of the peak exercise ST segment is flat. This set of data may indicate a potential risk of heart disease.###\nHence this label was Yes."
"A 75-year-old male patient with asymptomatic chest pain had a resting blood pressure of 160 and a serum cholesterol level of 310. His fasting blood sugar was above 120 mg/dl. Resting electrocardiogram results were normal, and he achieved a maximum heart rate of 112. The patient experienced exercise-induced angina and had a ST depression of 2.0 induced by exercise relative to rest. The slope of the peak exercise ST segment was downsloping.###\nHence this label was No."
"A 56-year-old female patient with non-anginal chest pain, resting blood pressure of 130, serum cholesterol of 219, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram results, maximum heart rate achieved at 164, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 73-year-old female patient with non-anginal chest pain, resting blood pressure of 160, normal serum cholesterol level, no fasting blood sugar > 120 mg/dl, showing ST-T wave abnormality in resting electrocardiogram results. She achieved a maximum heart rate of 121, did not experience exercise-induced angina, and had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was Yes."
"A 46-year-old male patient with atypical angina chest pain, normal resting blood pressure, serum cholesterol of 197, fasting blood sugar > 120 mg/dl, normal resting electrocardiogram results, maximum heart rate achieved at 156, no exercise-induced angina, no ST depression induced by exercise relative to rest, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 50-year-old male patient with no chest pain symptoms, normal resting blood pressure, low serum cholesterol levels, normal fasting blood sugar, a normal resting electrocardiogram, a moderate maximum heart rate achieved during exercise, no exercise-induced angina, no ST depression induced by exercise, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 67-year-old male with asymptomatic chest pain. His resting blood pressure is 140 and serum cholesterol level is 219. He has a normal fasting blood sugar level. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 122 and experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 2.0, and the slope of the peak exercise ST segment is flat.###\nHence this label was Yes."
"A 58-year-old male patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol, normal fasting blood sugar levels, ST-T wave abnormality in resting electrocardiogram, achieving a maximum heart rate of 110, no exercise-induced angina, no ST depression induced by exercise, and an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"A 59-year-old female patient with asymptomatic chest pain, normal resting blood pressure, slightly elevated serum cholesterol levels, normal fasting blood sugar, normal resting electrocardiogram results, a maximum heart rate of 143, experiencing exercise-induced angina, no ST depression induced by exercise relative to rest, and a flat slope of the peak exercise ST segment.###\nHence this label was Yes."
"The patient is a 60-year-old male with non-anginal chest pain. His resting blood pressure is high at 180, while his serum cholesterol level is at an optimal level. He does not have fasting blood sugar greater than 120 mg/dl. The resting electrocardiogram shows ST-T wave abnormality. He achieved a maximum heart rate of 140 during exercise, but experienced exercise-induced angina. The ST depression induced by exercise relative to rest is 1.5, and the slope of the peak exercise ST segment is flat.###\nHence this label was No."
"A 56-year-old male patient with asymptomatic chest pain has an above normal resting blood pressure of 140. The patient's serum cholesterol level is 0. They have a fasting blood sugar level above 120 mg/dl. Resting electrocardiogram results show normal readings. The maximum heart rate achieved by the patient is 121. The patient experiences exercise-induced angina. ST depression induced by exercise relative to rest is 1.8. The slope of the peak exercise ST segment is upsloping.###\nHence this label was Yes."
"A 40-year-old male patient with atypical angina chest pain, normal resting blood pressure, high serum cholesterol level, normal fasting blood sugar, normal resting electrocardiogram results, achieved a maximum heart rate of 172, did not experience exercise-induced angina, had no ST depression induced by exercise relative to rest, and showed an upsloping slope of the peak exercise ST segment.###\nHence this label was No."
"The patient is a 56-year-old male with no symptoms of chest pain. His resting blood pressure is 120, and serum cholesterol level is 85. He has normal fasting blood sugar levels and resting electrocardiogram results. The maximum heart rate achieved during exercise is 140, and he did not experience exercise-induced angina. The ST depression induced by exercise relative to rest is 0.0, and the slope of the peak exercise ST segment is upsloping.###\nHence this label was No."
"A 57-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels. They do not have fasting blood sugar > 120 mg/dl. Resting electrocardiogram results were normal, with a maximum heart rate of 168. The patient experienced exercise-induced angina but had no ST depression induced by exercise relative to rest. The slope of the peak exercise ST segment was upsloping.###\nHence this label was No."
"A 55-year-old male patient with asymptomatic chest pain, normal resting blood pressure, and serum cholesterol levels, experiencing exercise-induced angina with a flat slope of the peak exercise ST segment. Despite a high maximum heart rate of 130, the patient shows significant ST depression of 3.0 induced by exercise relative to rest.###\nHence this label was Yes."
