"This individual is a 31-year-old married white male from Germany. He works in the private sector as an executive manager, putting in 50 hours per week. Despite having no capital gains or losses last year, his education level is college for less than one year.###\nHence this label was Yes."
"The individual is a 41-year-old married male from the United States working in the craft and repair sector as a private sector employee. He is a high school graduate with no capital gain or loss last year. He works 40 hours per week and is classified as a husband in the household.###\nHence this label was No."
"This individual is a 41-year-old married Black male from the United States. He works in the private sector in the transportation, communication, and other public utilities sector. He finished 10th class education and works 40 hours per week. He had no capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 51-year-old widowed White female in the United States. She works in the private sector as an office and administrative support employee, having received college education for less than a year. With no capital gain or loss last year, she works 40 hours per week and is not closely related to the head of the household.###\nHence this label was No."
"The individual is a 50-year-old Black male from the United States who is married and works in the private sector as an office and administrative support employee. He is the husband in the household and has a high school education. He did not have any capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 63-year-old married White male from the United States. He works in the cleaning and maintenance sector as a private sector employee, with a 40-hour work week. He has finished 10th class education and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 44-year-old married Black male from Jamaica. He works in the sales sector as an owner of a non-incorporated business, professional practice, or farm. He is the husband in the household and has a high school education. Despite working 70 hours per week, he had no capital gain or loss last year.###\nHence this label was No."
"This is a 46-year-old unmarried Black female from the United States working in the service sector for the state government. She is a high school graduate and works 40 hours per week with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 38-year-old White male from the United States who has never been married. He is not living with family and works as a professional specialty in the private sector. He is a high school graduate and works 40 hours per week, with no capital gain or loss last year.###\nHence this label was Yes."
"This is a 48-year-old widowed White female in the United States. She is unmarried and works in the private sector as an office and administrative support employee. With a high school education, she works 24 hours per week and had no capital gains or losses last year.###\nHence this label was No."
"This individual is a 24-year-old White male from the United States. He is married and works as a machine operator and inspector in the private sector. He is a high school graduate and works 50 hours per week. His capital gain and loss last year were both 0.###\nHence this label was No."
"This individual is a 43-year-old married white male from the United States. He works in the craft and repair sector as a private sector employee, putting in 60 hours per week. Despite only having some college education, he shows dedication to his work with no capital gain or loss last year.###\nHence this label was No."
"A 23-year-old White female, who has never been married, lives in the United States. She is classified as an Own-child in the household. Working in the private sector as a cleaning and maintenance employee, she had no capital gain or loss last year. Her education level is college for less than one year, and she works 25 hours per week.###\nHence this label was No."
"The person in this dataset is a 74-year-old White female from the United States who is widowed. She is not living with any family member, does not have a specified occupation or work class, and did not have any capital gain or loss last year. She has received some college education, less than one year. Currently, she works 12 hours per week.###\nHence this label was No."
"The individual is a 17-year-old White female from the United States. She is never married and lives with her parent(s) as an own-child. She is a private sector employee in the service sector and has a high school education. Last year, she had no capital gains or losses. She works 15 hours per week.###\nHence this label was No."
"The person is a 27-year-old white male from the United States. He has never been married and is classified as an other-relative in terms of his relation to the head of the household. He works in the private sector as a service sector employee, with an associate's degree education. Last year, he had no capital gain or loss. He works 42 hours per week. Based on this information, we predict that his annual income is not over $50,000.###\nHence this label was No."
"The individual is a 53-year-old White male from the United States. He is married and works in the private sector as an executive manager. With a master's degree, he had a high capital gain last year and no capital loss. He works 55 hours per week, indicating a strong work ethic and dedication to his career. His demographic and professional profile suggest that he is likely to have an annual income exceeding $50,000.###\nHence this label was Yes."
"The person in the dataset is a 24-year-old Amer-Indian-Eskimo male. He is never married and lives alone without any close family members. He is from the United States and works in the service sector as a private sector employee. Despite no capital gains or losses in the last year, he is a high school graduate working 35 hours per week.###\nHence this label was No."
"The individual is a 29-year-old White male from the United States, who is married and works in the private sector as an execution and management professional. He has a college education for less than one year. Despite not having any capital gain or loss last year, he works 48 hours per week.###\nHence this label was No."
"This individual is a 33-year-old White male from the United States who has never been married. He is classified as an Own-child in relation to the head of the household. He works in the craft and repair sector as a private sector employee, with 11th class education. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"This is a 33-year-old White female from the United States who has never been married. She is not living with family and works in office and administrative support for the local government. With a bachelor's degree, she works 40 hours per week and had a capital gain of 1055 last year with no capital loss.###\nHence this label was No."
"The person is a 35-year-old married White male from the United States. He is employed in the private sector as a professional specialty worker, with a bachelor's degree education. He works 60 hours per week and had no capital gains or losses last year. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"The individual is a 48-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. With zero capital gain and loss last year, he has less than one year of college education and works 45 hours per week.###\nHence this label was No."
"The person is a 34-year-old White male from the United States, married, and working in a professional specialty occupation in the private sector. He holds a bachelor's degree and works 40 hours per week, with no capital gain or loss last year.###\nHence this label was Yes."
"This individual is a 26-year-old White female from the United States. She has never been married and is not living with any family members. She works as an office and administrative support in the private sector, putting in 40 hours per week. She is a high school graduate with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 54-year-old white male from the United States. He is married and works in the private sector in an executive or managerial role. He is a high school graduate and works an average of 55 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The individual is a 39-year-old White female from the United States. She is divorced and not living with family. She works in the service sector as a private sector employee, with a high school education. She had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"The person is a 31-year-old married White male from Canada. He works as a professional specialty in the private sector and holds a bachelor's degree. He has a capital gain of $7688 and no capital loss from last year. He works 40 hours per week as a husband.###\nHence this label was Yes."
"This individual is a 53-year-old White female in the United States. She is divorced and not living with any family members. She works as a machine operator and inspector in the private sector, with no capital gain or loss last year. She completed 8th class education and works 40 hours per week.###\nHence this label was No."
"This individual is a 22-year-old White female from the United States. She has never been married and is classified as an Own-child in terms of relation to the head of the household. She works in the private sector as an office and administrative support employee, having graduated from high school. Despite working 40 hours per week, she did not have any capital gains or losses last year.###\nHence this label was No."
"This individual is a 49-year-old Black male from the United States who has never been married. He is not living with family and works in the craft and repair sector as an owner of a non-incorporated business, professional practice, or farm. He had no capital gains or losses last year and completed the 10th class for education. He works 32 hours per week.###\nHence this label was No."
"The person is a 37-year-old White female from the United States. She is divorced and unmarried, working in the private sector as an office and administrative support employee. She has some college education, works 25 hours per week, had a significant capital gain last year, and no capital loss.###\nHence this label was Yes."
