"The person is an 18-year-old White female from the United States who has never been married. She is living with her own-child relation to the head of the household. She works in the service sector as a private sector employee, with no capital gain or loss last year. She has received some college education for less than one year and works 12 hours per week.###\nHence this label was No."
"The individual is a 28-year-old married white male from Cambodia, working in the sales sector as a private sector employee. He holds a bachelor's degree and works 45 hours per week. There were no capital gains or losses noted from the previous year.###\nHence this label was No."
"This person is a 32-year-old White male in the United States who is divorced and not living with family. He works as a sales sector employee in the private sector, holding a bachelor's degree. Despite working 45 hours per week, he had no capital gains or losses last year.###\nHence this label was No."
"The person in the dataset is a 56-year-old white male from the United States. He is married and is listed as the husband in the household. His occupation and work class are not specified. He has no capital gain or loss from the previous year. He holds an associate's degree and works 20 hours per week.###\nHence this label was No."
"The individual is a 30-year-old married White male from the United States with a master's degree. They are listed as the husband in the household and have no reported occupation or work class. Their annual income is predicted to be below $50,000 based on the information provided, as their capital gains and losses last year were both 0. Despite working 46 hours per week, their income remains below the $50,000 threshold.###\nHence this label was Yes."
"This individual is a 28-year-old White male from the United States who has never been married. He is not living with family and his occupation and work class are unknown. He had no capital gains last year but experienced a capital loss of $1762. He completed 11th grade education and works 40 hours per week.###\nHence this label was No."
"This individual is a 37-year-old married White male from the United States. He works in the protective services sector as a private sector employee, with a work week of 16 hours. He has no capital gain or loss from last year and has completed 9th grade education.###\nHence this label was No."
"This person is a 39-year-old unmarried White female from the United States. She works for the federal government in an office and administrative support role, holding an associate's degree. Last year, she had no capital gain or loss, and she works 40 hours per week.###\nHence this label was No."
"The person is a 66-year-old widowed White female in the United States. She is not living with any family member and works as an owner of a non-incorporated business, professional practice, or farm in execution and management. She finished 11th class and works 84 hours per week, with no capital gain or loss last year.###\nHence this label was Yes."
"This 23-year-old white female, who has never been married, is not residing with any family member. She is from the United States and works in the sales sector as a private sector employee. Despite having no capital gain or loss last year, she received some college education for less than a year. She works 30 hours per week.###\nHence this label was No."
"The individual is a 50-year-old married White male from the United States. He works in the service sector as a private sector employee, with a college education for less than one year. He has no capital gain or loss from last year and works 44 hours per week.###\nHence this label was No."
"This is a 39-year-old White female who is married and works in the service sector. She is the wife of the head of the household in the United States. She owns a non-incorporated business, professional practice, or farm. She had no capital gain or loss last year. She has less than a year of college education and works 15 hours per week.###\nHence this label was Yes."
"This person is a 36-year-old White female from the United States who has never been married. She is living with her parent(s) as an own-child. She holds a bachelor's degree and works as an occupation that is unspecified. Last year, she did not experience any capital gain or loss. She works 40 hours per week.###\nHence this label was No."
"The individual is a 39-year-old married White male from the United States. He is the husband of the household and works as an owner of an incorporated business, professional practice, or farm in the field of execution and management. He has no recorded capital gains or losses from the previous year. His education level is college for less than one year. Despite working long hours per week (84), it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"The person is a 51-year-old White female from the United States. She is divorced and currently unmarried. She works in the service sector as a private sector employee, with a college education for less than one year. Last year, she had no capital gains or losses. She works 56 hours per week.###\nHence this label was No."
"The person is a 27-year-old White male from the United States who has never been married. He is classified as an Other-relative to the head of the household. He works as a professional specialty in his own non-incorporated business, professional practice, or farm. He has no capital gains or losses from last year. His education level is college for one or more years without a degree, and he works 30 hours per week.###\nHence this label was No."
"This individual is a 37-year-old White male from the United States. He is married and the husband in the household. He works in the transportation, communication, and other public utilities sector as an owner of a non-incorporated business, professional practice, or farm. Last year, he had no capital gains or losses. He finished 11th class in terms of education and works 40 hours per week.###\nHence this label was No."
"This individual is a 52-year-old White female from the United States. She is separated and not living with family. She works in execution and management for the federal government, with no capital gain or loss last year. She has less than one year of college education and works 40 hours per week.###\nHence this label was No."
"The person is a 52-year-old married white female from the United States. She works in the private sector as a service sector employee and finished 10th class for her education. Last year, she had no capital gain or loss. She works 35 hours per week.###\nHence this label was No."
"The person is a 29-year-old White male from the United States who has never been married. He is not living with family and works in the craft and repair sector as a private sector employee. Despite having a high school degree, he works 35 hours per week and had a capital loss of $1974 last year.###\nHence this label was No."
"The individual is a 19-year-old White male from the United States who has never been married. He is not living with family and works in the service sector as a private sector employee. He has no capital gains or losses from last year. His education level is college for less than one year, and he works 35 hours per week.###\nHence this label was No."
"The person in the dataset is a 40-year-old married white male from the United States. He works in the private sector as a sales sector employee and has a high school education. He is the husband in the household and worked 40 hours per week last year with no capital gains or losses. The prediction for this individual is whether his annual income is over $50,000.###\nHence this label was Yes."
"This individual is an 18-year-old Black female from the United States who has never been married. She is classified as an other-relative in her household and works in the private sector in a sales occupation. She completed 10th grade and works 40 hours per week, with no capital gains or losses last year.###\nHence this label was No."
"This individual is a 31-year-old White male from the United States who is never married and has no direct family in the household. He works in the technology and support sector as a private sector employee, putting in 40 hours per week. Despite having attended college for one or more years without completing a degree, he did not experience any capital gain or loss last year. The prediction is whether his annual income exceeds $50,000.###\nHence this label was No."
"This individual is a 35-year-old white male from the United States. He has never been married and is not living with any family members. He works in the private sector as an office and administrative support employee, putting in 40 hours per week. With a high school education, he had a capital gain of $8614 and no capital loss last year.###\nHence this label was Yes."
"This individual is a 21-year-old White male from the United States. He has never been married and is classified as an Own-child in the household. He has not specified his occupation or work class. Despite attending college for less than one year, he works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 26-year-old white male from the United States who has never been married. He is not living with family. He owns an incorporated business, professional practice, or farm in the sales sector. Despite having some college education, he has been working 48 hours a week with no capital gain or loss reported last year.###\nHence this label was No."
"This individual is a 45-year-old White male from the United States who is married. He works in the craft and repair sector as a private sector employee, with 11 years of education. Despite having no capital gains or losses last year, he consistently works an average of 42 hours per week.###\nHence this label was No."
"This individual is a 25-year-old White female from Guatemala. She is never married and is considered an Other-relative in the household. She works as a private household employee in the private sector, with no capital gain or loss last year. She has completed 8th grade education and works 40 hours per week.###\nHence this label was No."
"This person is a 34-year-old white male from the United States who has never been married. He works in the office and administrative support sector as a private sector employee, with a college education for less than one year. Despite working 40 hours per week, he did not have any capital gain or loss last year.###\nHence this label was No."
"The person is a 48-year-old Black male married to the head of the household. He resides in the United States and works in the sales sector as a private sector employee. With a bachelor's degree, he works 40 hours per week with no capital gain or loss last year.###\nHence this label was Yes."
"This individual is an 18-year-old White female from the United States who has never been married. She is categorized as an Own-child in terms of relation to the head of the household and works in the service sector as a private sector employee. She is a high school graduate working 20 hours per week with no capital gains or losses last year.###\nHence this label was No."
"This individual is a 46-year-old unmarried White male from the United States. He works in execution and management for the state government, holding a bachelor's degree. He has no capital gains or losses from the previous year and works 45 hours per week.###\nHence this label was No."
"The individual is a 52-year-old Caucasian woman from the United States who is divorced and currently unmarried. She is a high school graduate and her occupation and work class are not specified. She had no capital gain or loss last year and works 38 hours per week.###\nHence this label was No."
"This individual is a 17-year-old White female from the United States who has never been married. She is the own-child of the head of the household. She did not complete high school and currently does not have a job. She had no capital gain or loss last year and works 8 hours per week.###\nHence this label was No."
"This individual is a 62-year-old Black male from the United States. He is divorced and not living with any family member. He works in the technology and support sector for the federal government. Despite having less than a year of college education, he manages to work 40 hours per week. Last year, he had a capital gain of 4650 and did not incur any capital losses.###\nHence this label was No."
"This individual is a 20-year-old white male from the United States who has never been married. He is classified as an own-child in the household. He works in the sales sector as a private sector employee, with a college education of less than one year. Last year, he had no capital gains or losses. He works 35 hours per week.###\nHence this label was No."
"The individual is a 35-year-old married White male from the United States. He works in the sales sector as a private sector employee, holding a bachelor's degree. Despite working long hours (60 per week), he did not have any capital gains or losses last year.###\nHence this label was Yes."
"This person is a 27-year-old Black male from the United States who has never been married. He is an own-child in the household and works as a professional specialty in the private sector. With a bachelor's degree, he works 40 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 29-year-old unmarried White male from Mexico, working in the service sector as a private sector employee. They have finished 6th class education and work 35 hours per week. There were no capital gains or losses last year, and they are classified as an other-relative in the household.###\nHence this label was No."
"The individual is a 60-year-old White male from the United States who is married and works in the technology and support sector for the federal government. He is the husband in his household and is a high school graduate. Despite working 40 hours per week, he had no capital gain and a capital loss of $1,977 last year.###\nHence this label was Yes."
"The individual is a 62-year-old White male, married and working in office and administrative support for the state government. He holds a bachelor's degree, works 38 hours per week, and had no capital gains or losses last year. He is the husband in the household and is from the United States.###\nHence this label was No."
"The individual is a 44-year-old White male from the United States, who is married and works in a professional specialty occupation for the state government. He holds a doctoral degree and works 40 hours per week. Last year, he had no capital gains but incurred a capital loss of $1902.###\nHence this label was Yes."
"This individual is a 27-year-old Black male from the United States. He has never been married and is categorized as an own-child in the household. He works in the cleaning and maintenance sector as a private sector employee, with a college education for less than one year. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
"The person is a 63-year-old Black male from the United States. He is widowed and not living with family. He works in the cleaning and maintenance sector for the federal government. He has a high school education and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This is a 57-year-old White female from the United States, currently divorced and not living with family. She works in execution and management for the federal government, with a master's degree education. Despite having no capital gains or losses last year, she puts in 60 hours of work per week.###\nHence this label was Yes."
"The individual is a 39-year-old married White male from the United States. He is the husband in the household and works in the agriculture, forestry, and fisheries sector as an owner of a non-incorporated business, professional practice, or farm. He has not experienced any capital gains or losses in the last year. He has attended college for one or more years without obtaining a degree and works 60 hours per week.###\nHence this label was No."
"The person is a 37-year-old White female from the United States. She is divorced and currently unmarried. She works in office and administrative support in the local government, with a college education for less than one year. Despite working 40 hours per week, she had no capital gain or loss last year.###\nHence this label was No."
"This person is a 39-year-old white female, divorced, and currently unmarried. She is from the United States and works in the craft and repair sector for the local government. She is a high school graduate and works 40 hours per week. Last year, she had no capital gain or loss.###\nHence this label was No."
"This individual is a 51-year-old married White male from the United States. He is the husband in the household and works in the sales sector. He is the owner of an incorporated business, professional practice, or farm. Despite having no capital gain or loss last year, he has a college education for less than one year. He works 40 hours per week.###\nHence this label was No."
"This individual is a 35-year-old married White male from the United States. He works in the service sector for the local government, with no capital gain or loss last year. His education level is college for less than one year, and he works full-time with 40 hours per week.###\nHence this label was No."
"The individual is a 47-year-old married white male from the United States. He is the husband in the household and works in the craft and repair sector as the owner of a non-incorporated business, professional practice, or farm. He is a high school graduate and works 40 hours per week. Last year, he had no capital gain or loss.###\nHence this label was Yes."
"This individual is a 54-year-old married White male from the United States. He holds a master's degree and works in execution and management for the state government. Despite having no capital gains or losses last year, he puts in 50 hours of work per week.###\nHence this label was Yes."
"This is a 47-year-old White female from the United States who is divorced and not living with family. She works in a professional specialty occupation for the local government, holding a bachelor's degree. Last year, she had no capital gains or losses and works 35 hours per week.###\nHence this label was Yes."
"The individual is a 37-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, earning a high school graduate education. With no capital gain or loss last year, he works 45 hours per week, striving to achieve an annual income over $50,000.###\nHence this label was No."
"This individual is a 40-year-old married White male from the United States. He works in the sales sector as a private sector employee, with a high school education. Despite working long hours (60 per week), he did not have any capital gains or losses last year.###\nHence this label was No."
"This individual is a 20-year-old white female from the United States who has never been married. She is employed in the private sector as an execution and management worker, with less than one year of college education. Despite working 30 hours per week, she had no capital gain or loss in the last year.###\nHence this label was No."
"The individual is a 32-year-old White male from the United States who has never been married. He is not in a family relation to the head of the household. The individual works as a professional specialty in the private sector and holds a bachelor's degree. He had no capital gain or loss last year and works 50 hours per week. Based on this data, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"The person is a 43-year-old White male who is divorced and not living with family. He works as a machine operator and inspector in the private sector in the United States. He is a high school graduate and works 45 hours per week. Last year, he had neither any capital gain nor loss.###\nHence this label was No."
"The person in the dataset is a 49-year-old married white male from the United States. He works in the protective services sector for the local government, with no capital gain or loss last year. He has received college education for less than a year and works 44 hours per week.###\nHence this label was Yes."
"This individual is a 46-year-old married white male from the United States. He works in the transportation, communication, and other public utilities sector for the local government. He finished the 11th class and works 30 hours per week. He had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 35-year-old white male from the United States. He is married and works in the craft and repair sector as a private sector employee. He is a high school graduate and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 32-year-old White female from the United States who has never been married. She is not living with any family members. She works in the private sector as an office and administrative support employee, with a work schedule of 60 hours per week. She completed less than a year of college education. In the past year, she did not experience any capital gains or losses.###\nHence this label was No."
"This individual is a 38-year-old white male living in the United States. He is divorced, not living with family, and works in the sales sector as a private sector employee. He is a high school graduate and works 80 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"A 32-year-old Asian-Pac-Islander female, who has never been married and is not living with family, resides in the United States. She works in the protective services sector for the local government, with no capital gain or loss last year. She has attended college for one or more years without obtaining a degree and works 50 hours per week.###\nHence this label was No."
"This individual is a 34-year-old married white male from the United States. He works in the craft and repair sector as a private sector employee, putting in 40 hours per week. Despite not having a college degree, he has some college education. Last year, he had a capital gain of $7688 and no capital loss. His annual income is predicted to be over $50,000.###\nHence this label was Yes."
"The individual is a 22-year-old White female from the United States. She has never been married and is not living with family. She works in a professional specialty occupation for the state government, with no capital gain or loss last year. She has attended college for less than one year and works 32 hours per week. The prediction is whether her annual income is over $50,000.###\nHence this label was No."
"The individual is a 44-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, holding a bachelor's degree. Last year, he had no capital gain but incurred a capital loss of 1977. He works 40 hours per week and is listed as the husband in the household.###\nHence this label was Yes."
"The individual is a 32-year-old married white male from Italy. He works in the agriculture, forestry, and fisheries sector as the owner of a non-incorporated business, professional practice, or farm. With a high school education, he works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 44-year-old White female who is married and works in the service sector. She is the wife of the head of the household and is the owner of a non-incorporated business, professional practice, or farm. She has an associate's degree, works an unusually high 99 hours per week, and had no capital gain or loss last year. Her native country is the United States.###\nHence this label was No."
"This individual is a 24-year-old White male from the United States who is never married and not living with family. He works as a machine operator and inspector in the private sector, has a high school education, and works 48 hours per week. He did not have any capital gains or losses last year.###\nHence this label was No."
"This individual is a 22-year-old White female from the United States. She has never been married and is classified as an Own-child in relation to the head of the household. She works in the private sector as an office and administrative support employee, with an education level of college for less than one year. She had no capital gain or loss in the last year and works 25 hours per week.###\nHence this label was No."
"The individual is a 23-year-old unmarried White female from the United States. She is not living with family and works as an executive in the private sector. With a bachelor's degree, she works 38 hours per week with no significant capital gains or losses in the previous year.###\nHence this label was No."
"The individual is a 29-year-old White male from the United States, who is married and works as a professional specialist in the private sector. He has no capital gain or loss from the previous year, with education level at college for less than one year. He works 40 hours per week.###\nHence this label was No."
"This person is a 32-year-old married white male from the United States. He is the husband in the household and works as an owner of a non-incorporated business, professional practice, or farm in the transportation, communication, and other public utilities sector. He is a high school graduate and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 19-year-old White male from the United States who has never been married. He is an own-child in the household and works as a machine operator and inspector in the private sector. He completed 11th class for education and works 60 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"The individual in this dataset is a 26-year-old married White male from the United States. He works in the sales sector as a private sector employee, putting in 45 hours per week. His education level is college for one or more years without a degree. Last year, he had a capital gain of $3103 and did not incur any capital losses.###\nHence this label was Yes."
"The individual is a 56-year-old married White male living in the United States. He works in the private sector as a professional specialty employee, holding a bachelor's degree. Last year, he had no capital gains or losses. He works 40 hours per week and is identified as the husband in the household.###\nHence this label was Yes."
"The individual is a 43-year-old White male from the United States. He is married and works in the private sector as a craft and repair employee. With a bachelor's degree, he works 48 hours per week with no capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 33-year-old Black male from the United States who has never been married. He is not living with any family members. He works in the private sector as an office and administrative support employee, with a bachelor's degree. In the past year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"This 26-year-old White female, who has never been married and is not part of a family, is from the United States. She works in an office and administrative support role in the private sector, putting in 45 hours per week. Last year, she did not have any capital gains or losses. She has attended college for at least a year but does not hold a degree.###\nHence this label was No."
"This 27-year-old White woman, who has never been married, works in the private sector as a professional specialty employee in the United States. She is not living with family and holds a bachelor's degree. Despite no capital gain or loss last year, she works 40 hours per week.###\nHence this label was No."
"This 21-year-old White male is a private sector employee in the agriculture, forestry, and fisheries sector. He is never married and lives in the United States as an own-child. With a high school education, he works 24 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"The person is a 71-year-old widowed white male from the United States. He has a master's degree and works in execution and management for the local government. Despite his age, he works 20 hours per week. Last year, he had a capital gain of 2050 and no capital loss. He is not living with any family members.###\nHence this label was No."
"The person is a 37-year-old White male from El-Salvador who has never been married. He is not living with family and works in the sales sector as a private sector employee. Despite having no capital gain last year, he experienced a capital loss of 2339. He is a high school graduate and works 40 hours per week.###\nHence this label was No."
"This person is a 37-year-old White female from the United States. She is divorced and is categorized as an Other-relative in terms of her relation to the head of the household. She works in execution and management for the federal government, holding a bachelor's degree. Last year, she had no capital gains or losses. She works 50 hours per week.###\nHence this label was No."
"The individual is a 53-year-old married white male from England, working in a professional specialty occupation in the private sector. With a doctoral degree, he worked 50 hours per week last year and had a capital gain of $15,024 with no capital loss. The data suggests that he is likely to have an annual income over $50,000.###\nHence this label was Yes."
"This individual is a 43-year-old White female from the United States. She is divorced, unmarried, and works in the private sector as an office and administrative support employee. She is a high school graduate and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 27-year-old Amer-Indian-Eskimo male who has never been married. He is classified as an other-relative in the household and works in the cleaning and maintenance sector as a private sector employee in the United States. He is a high school graduate who worked 40 hours per week last year with no capital gain or loss.###\nHence this label was No."
"The person in the dataset is a 34-year-old married White male from the United States. He works in the sales sector as a private sector employee with a bachelor's degree. Last year, he had no capital gains or losses. He works 45 hours per week and the prediction is that his annual income is over $50,000.###\nHence this label was Yes."
"This person is a 28-year-old White male from the United States who has never been married. He is an Own-child of the household and works as a professional specialty in the private sector. He is a high school graduate and works 40 hours per week with no capital gains or losses last year.###\nHence this label was No."
"This dataset includes information about a 25-year-old Black male who has never been married. He is categorized as an own-child in the household and is from the United States. He works in the craft and repair sector within the local government, with a high school graduate education. Last year, he had no capital gains or losses and works 40 hours per week. This data aims to predict whether his annual income exceeds $50,000.###\nHence this label was No."
"The person is a 40-year-old married White female from the United States. She works as a machine operator and inspector in the private sector, is a high school graduate, and works 40 hours per week. She had no capital gains or losses last year. This data is used to predict if her annual income is over $50,000.###\nHence this label was No."
"The individual is a 64-year-old widowed White male from the United States. He is not living with family and works in the sales sector as a private sector employee. He had a capital gain of 2354 last year and no capital loss. His education level is college for less than one year, and he works 35 hours per week.###\nHence this label was No."
"This individual is a 32-year-old married, White male from the United States. He is a husband and works in a professional specialty occupation in the local government sector. With a bachelor's degree education, he works 40 hours per week with no capital gains or losses last year.###\nHence this label was Yes."
"This individual is a 47-year-old married Asian-Pac-Islander male from the Philippines. He works as a machine operator and inspector in the private sector, putting in 40 hours per week. With a college education for less than one year, he had a capital gain of 3103 last year and no capital loss. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This individual is a 26-year-old single male of Asian-Pac-Islander descent from India. He holds a professional specialty occupation in the state government sector and has a professional degree. Last year, he had a capital gain of 2463 and no capital loss, indicating financial stability. He works 50 hours per week, suggesting a strong work ethic.###\nHence this label was No."
"The individual is a 34-year-old married white male from the United States. He works in the private sector as an executive manager, holding a bachelor's degree. Despite having no capital gains or losses last year, he works around 45 hours per week. This person's demographic and occupational details suggest a stable lifestyle with the potential for an annual income over $50,000.###\nHence this label was No."
"The individual is a 28-year-old married White male, living in the United States. He is working as a professional specialty in the private sector, holding a bachelor's degree. Last year, he had no capital gains or losses. He works 50 hours per week.###\nHence this label was No."
"The individual is a 75-year-old White female from the United States. She is married and not living with family. She is the owner of a non-incorporated business, professional practice, or farm, working in a professional specialty occupation. With a master's degree education, she worked 50 hours per week last year, with no capital gain or loss.###\nHence this label was No."
"A 40-year-old White male, who is divorced and unmarried, resides in the United States. He works in the craft and repair sector as a private sector employee, with a high school education. In the previous year, he had no capital gains or losses, and he works 40 hours per week.###\nHence this label was No."
"This individual is a 49-year-old married White male from the United States. He works in the private sector as an employee in the protective services sector. He is a high school graduate and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This dataset describes a young 18-year-old White female in the United States who has never been married and is living with her parents. She works in the service sector as a private sector employee, with no capital gain or loss last year. She has completed 10th grade education and works 28 hours per week.###\nHence this label was No."
"The individual is a 44-year-old married White male from the United States. He works as a professional specialty in the private sector, with a bachelor's degree education. Last year, he had a capital gain of $7688 and no capital loss. He works 40 hours per week.###\nHence this label was Yes."
"This person is a 41-year-old married White male from the United States. He works in the technology and support sector as a private sector employee with a bachelor's degree. His role in the household is as a Husband. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was Yes."
"The individual is a 64-year-old married White male from the United States. He holds a master's degree and works in the private sector as an executive manager. Despite working 20 hours per week, he did not have any capital gains or losses last year. The data suggests he is likely to have an annual income over $50,000.###\nHence this label was Yes."
"This individual is a 26-year-old white male from Peru who has never been married. He works in the protective services sector for the local government, with a standard 40-hour work week. Despite his young age, he has some college education but for less than a year. He did not experience any capital gains or losses last year. He is not living with any family members.###\nHence this label was No."
"This individual is a 54-year-old Black male from the United States. He is married and works in the private sector as an office and administrative support employee. He is the husband in the household and has a high school education. Despite working only 20 hours per week with no capital gain or loss last year, he may have an annual income over $50,000.###\nHence this label was No."
"The individual is a 49-year-old separated white female from the United States. She works in a professional specialty occupation in the local government sector. With a master's degree education, she dedicates 50 hours per week to her work. Last year, she had no capital gains or losses. She is unmarried and does not live with the head of the household.###\nHence this label was No."
"The individual is a 26-year-old Asian-Pac-Islander male from the Philippines. He is divorced and not living with any family members. He works in the agriculture, forestry, and fisheries sector as a private sector employee. He had no capital gains or losses last year. He graduated from high school and works 40 hours per week.###\nHence this label was No."
"This 28-year-old Male, who is of Amer-Indian-Eskimo descent, is divorced and not living with family. He works in the sales sector as a private sector employee in the United States. With a high school education, he worked 40 hours per week last year and had a significant capital gain of $14,084.###\nHence this label was Yes."
"The individual is a 29-year-old married Amer-Indian-Eskimo male working in the private sector as a cleaning and maintenance employee. He has no capital gain or loss from the previous year. He is a high school graduate, works 40 hours per week, and is not living with family members. His annual income is being predicted to be over $50,000.###\nHence this label was No."
"The person is a 62-year-old Black female from the United States. She is divorced and not living with any family members. She works in the private household sector as a private sector employee with a high school education. Last year, she had no capital gain or loss. She works 20 hours per week.###\nHence this label was No."
"This individual is a 40-year-old married White male from the United States. He works as a professional specialty in the private sector and has an education level of college for less than one year. Last year, he had a capital gain of $7298 and no capital loss. He works 40 hours per week.###\nHence this label was Yes."
"The person is a 21-year-old white male from Mexico. He is never married and not living with family. He works in the agriculture, forestry, and fisheries sector as a private sector employee. He had no schooling and works 50 hours per week. Last year, he had no capital gain or loss.###\nHence this label was No."
"The individual is a 56-year-old married White male from the United States. He has a master's degree and works as an owner of a non-incorporated business, professional practice, or farm in the field of execution and management. He had no capital gain or loss last year and works 25 hours per week. According to the dataset, he is likely to have an annual income over $50,000.###\nHence this label was No."
"The individual is a 60-year-old married White male living in the United States. He is the husband in the household and works as an executive or manager in his own non-incorporated business, professional practice, or farm. He has a high school education and works 48 hours per week. In the past year, he did not experience any capital gains or losses.###\nHence this label was No."
"The individual is a 29-year-old White male from the United States who has never been married. He is living with the head of the household as their own child. He works as a machine operator and inspector in the private sector, having finished 11th class for education. With no capital gains or losses last year, he puts in 42 hours of work per week.###\nHence this label was No."
"The individual is a 66-year-old married White male from the United States. He works in the private sector as an execution and management professional, with a high school education. His annual income is likely over $50,000, as indicated by a capital gain of $10,605 and no capital loss in the last year. He works 40 hours per week as a dedicated husband.###\nHence this label was Yes."
"The person is a 44-year-old White male from the United States who has never been married. He is not living with any family members. He works in a professional specialty occupation for the local government, holding a master's degree. Last year, he had no capital gain but incurred a capital loss of $1876. He works 42 hours per week.###\nHence this label was No."
"The individual is a 68-year-old widowed White female from the United States. She works as a machine operator and inspector in the private sector, with a high school education. She is not living with family and worked 28 hours per week. Additionally, she had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 26-year-old White male from the United States, married, working in the private sector as a protective services employee. Despite having no capital gain or loss last year, the individual has completed less than a year of college education and works 40 hours per week.###\nHence this label was No."
"The individual is a 38-year-old married White male from the United States. He works in the protective services sector for the local government, having achieved a high school education. With no capital gains or losses last year, he works 40 hours per week to provide for his household.###\nHence this label was Yes."
"The individual is a 52-year-old Black woman from the United States. She is widowed and classified as an other-relative in relation to the head of the household. She works in the service sector as an owner of a non-incorporated business, professional practice, or farm. She has no capital gain or loss from last year. She is a high school graduate and works 40 hours per week.###\nHence this label was No."
"The individual is a 20-year-old White male from the United States. He has never been married and is classified as an own-child in the household. He works in the private sector as an employee in the cleaning and maintenance sector, with a college education of less than one year. Last year, he did not have any capital gain or loss. He works 40 hours per week.###\nHence this label was No."
"This individual is a 19-year-old White male from the United States who has never been married and is currently classified as an Own-child in the household. He is working in the service sector without pay in a for-profit family business or farm. With a high school education, he works 10 hours per week, with no capital gains or losses in the previous year.###\nHence this label was No."
"The individual is a 38-year-old White male from the United States. He is never married and living independently, not with family. He works as a professional in the private sector, having graduated from high school. Despite working 40 hours per week, he did not have any capital gain or loss last year.###\nHence this label was Yes."
"The person is a 39-year-old White male from the United States. He is divorced and currently unmarried. He works as a private sector employee in the cleaning and maintenance sector, having graduated from high school. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was No."
