"The individual is a 54-year-old widowed female of White descent from Mexico. She is unmarried and works in office and administrative support for the local government. She had no capital gain or loss last year and has received college education for less than one year. She works 40 hours per week.###\nHence this label was No."
"The individual is a 52-year-old married white male from the United States. He works in the sales sector as a private sector employee, having graduated from high school. He has no capital gains or losses from the previous year and works 40 hours per week.###\nHence this label was Yes."
"This individual is a 34-year-old White male from the United States. He is married and works in the private sector as an executive. He holds a bachelor's degree and works 50 hours per week. Last year, he did not experience any capital gains or losses. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This 23-year-old White female, who has never been married, is living in the United States as an own-child in the household. She is employed in the service sector as a private sector employee, with an associate's degree education. She had no capital gain or loss last year and works 20 hours per week.###\nHence this label was No."
"This individual is a 51-year-old Black female from the United States. She is widowed and has no children. She works in the technology and support sector as a private sector employee. Despite being a high school graduate, she works 40 hours per week. Her financial situation is modest, with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 45-year-old married white male from the United States. He works as a professional in a specialty occupation, and owns a non-incorporated business, professional practice, or farm. He has a professional degree and works 38 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The individual is a 48-year-old White married male from the United States. He works in the craft and repair sector for the local government, with a high school education. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"This dataset describes a 28-year-old White female from the United States who has never been married. She is not living with any family member and works in a professional specialty occupation in the local government. She holds a bachelor's degree and works 40 hours per week with no capital gain or loss last year. The prediction task is to determine if her annual income exceeds $50,000.###\nHence this label was No."
"This 25-year-old White male, who has never been married, is not living with family. He works in the private sector as a professional specialty employee in the United States. With a bachelor's degree, he works 35 hours a week and had no capital gain or loss last year.###\nHence this label was No."
"The person is a 22-year-old White female from the United States who has never been married. She is classified as an Own-child in relation to the head of the household. She works in the service sector as a private sector employee, with a college education for less than a year. Last year, she had no capital gain or loss. She works 25 hours per week.###\nHence this label was No."
"This person is a 39-year-old White female from the United States. She is married and identified as the wife within the household. She holds a bachelor's degree and works an average of 30 hours per week. She did not report any capital gains or losses last year, and her specific occupation and work class are not provided in the dataset.###\nHence this label was No."
"This individual is an 88-year-old White male from the United States. He is widowed and does not live with family. He owns a non-incorporated business in the agriculture, forestry, and fisheries sector. Despite his age, he only works 5 hours per week and did not have any capital gain or loss last year. He completed up to 8th grade education level.###\nHence this label was No."
"This individual is a 29-year-old White female from the United States. She has never been married and is not living with any family members. She works in the technology and support sector as a private sector employee. Despite being a high school graduate, she has no capital gain or loss from the previous year. She works 45 hours per week.###\nHence this label was No."
"This individual is a 45-year-old married White male from the United States. He holds a professional specialty occupation and is the owner of an incorporated business, professional practice, or farm. He has a professional degree and works 50 hours per week. Last year, he had no capital gain but incurred a capital loss of $1485.###\nHence this label was Yes."
"This female individual is 49 years old and of White race. She is married and works in the private sector as an execution and management professional. Originally from Canada, she has a college education for less than a year. Last year, she had a capital gain of $5178 and no capital loss. She works 40 hours per week.###\nHence this label was Yes."
"The person is a 24-year-old White male from the United States who has never been married. He is classified as an Own-child in terms of relation to the head of the household. He works in the sales sector as a private sector employee, with a high school education. In the past year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"This individual is a 40-year-old married White male living in the United States. He works in the private sector as an office and administrative support worker, putting in 35 hours per week. Last year, he did not have any capital gains or losses. With less than a year of college education, he is likely striving to achieve a stable annual income of over $50,000.###\nHence this label was Yes."
"The person is a 50-year-old married white male from El-Salvador. He works in the sales sector as the owner of a non-incorporated business, professional practice, or farm. He is a high school graduate and worked 55 hours per week. Last year, he had a capital gain of $15,024 and no capital loss.###\nHence this label was Yes."
"The individual is a 34-year-old married Amer-Indian-Eskimo male living in the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He is the husband within the household. Despite being a high school graduate, he works 52 hours per week and did not experience any capital gain or loss last year.###\nHence this label was No."
"The individual is a 64-year-old Black male from the United States. He is widowed and not living with family. He works in a professional specialty occupation for the state government, with a doctoral degree education. Last year, he had a capital gain of $8614 and no capital loss. He works 50 hours per week.###\nHence this label was Yes."
"This individual is a 39-year-old married White male from the United States. He works in the craft and repair sector for the local government, holding an associate's degree. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was Yes."
"This person is a 21-year-old White female from the United States. She is never married and lives with the head of the household as an own-child. She is employed in the sales sector as a private sector employee, with a capital gain and loss of 0 last year. She finished 11th class and works 38 hours per week.###\nHence this label was No."
"This individual is a 54-year-old White female from the United States. She is divorced and not living with family. She works as a professional in the private sector, holding a master's degree. Despite working 40 hours per week, her capital loss last year was $2559, with no capital gain reported.###\nHence this label was Yes."
"The person is a 47-year-old White male, married and classified as an other-relative in relation to the head of the household. He is from the United States and works in the service sector for the local government. Last year, he had a capital gain of $3,908 and no capital loss. He is a high school graduate and works 40 hours per week.###\nHence this label was No."
"The individual is a 53-year-old married White male from the Dominican Republic. He works in the service sector as a private sector employee, having completed 9th grade education. He works 40 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 34-year-old Black male, never married, not living with family, working in the private sector as a professional specialty employee. He holds a master's degree and works 45 hours per week. He did not have any capital gains or losses last year, and his native country is not specified in the data.###\nHence this label was Yes."
"The individual is a 41-year-old white female from the United States who has never been married. She is not living with family members and works in a professional specialty occupation for the state government. Last year, she had no capital gains or losses. She holds a bachelor's degree and works 40 hours per week.###\nHence this label was No."
"This individual is a 46-year-old married White male working in the private sector as a sales employee. He is a high school graduate and works 35 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"The individual is a 55-year-old White woman from the United States. She is divorced, not living with any family member. She works as a professional in a specialty occupation and owns a non-incorporated business, professional practice, or farm. She holds a professional degree and works 35 hours per week. Last year, she had no capital gains or losses.###\nHence this label was No."
"This individual is a 58-year-old married White male who works in the craft and repair sector as a private sector employee. He is considered the husband in the household and is a high school graduate. With no capital gains or losses last year, he works 40 hours per week in the United States.###\nHence this label was Yes."
"This individual is a 41-year-old married white female from the United States. She works as a professional specialty in the private sector and has a professional degree. Her capital gains and losses last year were both zero. She works 40 hours per week.###\nHence this label was Yes."
"The individual is a 19-year-old White male from the United States who has never been married. He is classified as an own-child in the household. The person's occupation and work class are not specified. He had no capital gains or losses last year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"The individual is a 36-year-old married White male from the United States. He holds a master's degree and works in the sales sector as a private sector employee, putting in 50 hours per week. Last year, he had no capital gains or losses. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This 31-year-old female who is a high school graduate works in the service sector as a private sector employee in the United States. She has never been married and is not living with any family members. Last year, she had zero capital gains and zero capital losses. She works 35 hours per week.###\nHence this label was No."
"This individual is a 46-year-old married White male from the United States. He works in a professional specialty occupation for the local government, with a bachelor's degree education. He reported no capital gain or loss last year and works 38 hours per week.###\nHence this label was Yes."
"This young 17-year-old White female who has never been married lives in the United States with her parents as their own child. She is currently working in the service sector for the local government, completing 10th grade education. Despite her young age, she dedicates 25 hours per week to her job, with no capital gain or loss last year.###\nHence this label was No."
"This person is a 34-year-old White male from the United States, married and working in the private sector as an executive manager. He has a bachelor's degree and works 40 hours per week. Last year, he had a capital gain of 7688 and no capital loss.###\nHence this label was Yes."
"This individual is a 27-year-old Black male from the United States. He has never been married and is living with the head of the household as an own-child. His occupation and work class are not specified. He graduated from high school and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 30-year-old White female residing in the United States. She is separated and currently unmarried. She works in the private sector as an office and administrative support employee, with a high school education. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was No."
"This individual is a 43-year-old married White male from the United States. He works as an owner of a non-incorporated business, professional practice, or farm in the agriculture, forestry, and fisheries sector. He has a college education for less than one year. Despite not having any capital gain or loss last year, he works 50 hours per week.###\nHence this label was No."
"This individual is a 33-year-old Black female from the United States. She is divorced and currently unmarried. She works in the craft and repair sector for the federal government, putting in 40 hours per week. Her capital gain and loss last year were both 0. She has attended college for one or more years but does not have a degree.###\nHence this label was Yes."
"The individual is a 37-year-old married White male from the United States. He works in the private sector as an execution and management professional, having graduated from high school. With a work week of 45 hours, he had a capital gain of $4386 and no capital loss last year.###\nHence this label was Yes."
"This individual is a 67-year-old widowed White female living in the United States. She is not living with any family member and works in the service sector as a private sector employee. She is a high school graduate and works 24 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 59-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a college education for less than one year. His capital gain and loss last year were both 0. He works 43 hours per week.###\nHence this label was Yes."
"The individual is a 59-year-old Asian-Pac-Islander male from China, currently working in the service sector as a private sector employee. He is divorced and not living with any family members. He graduated from high school and works 40 hours per week. He did not have any capital gain or loss last year.###\nHence this label was No."
"This individual is a 54-year-old married white male from the United States. He works in the sales sector as a private sector employee, with 40 hours worked per week. He has not experienced any capital gain or loss in the past year and has received education for less than a year at college.###\nHence this label was No."
"The individual is a 46-year-old married White female from the United States. She works in a professional specialty occupation for the local government, holding a bachelor's degree. Despite working long hours per week (70 hours), she did not report any capital gain or loss last year.###\nHence this label was No."
"This individual is a 53-year-old White female from the United States who is widowed. She is not living with any family members and works as a machine operator and inspector in the private sector. She has a high school education and works 40 hours per week. Last year, she had no capital gains or losses.###\nHence this label was No."
"The person is a 34-year-old male of Amer-Indian-Eskimo descent, who is divorced and not currently living with family. He works in a professional specialty occupation in the private sector in the United States. Last year, he had no capital gains or losses. He has completed less than one year of college education and works 44 hours per week.###\nHence this label was No."
"The individual is a 41-year-old White female from the United States. She is divorced, unmarried, and works in the craft and repair sector as a private sector employee. She is a high school graduate and works 50 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"The individual is an 81-year-old White male from Poland, currently married and working in a professional specialty occupation in the private sector. He has no capital gain or loss from last year, completed 4th class education, and works 15 hours per week.###\nHence this label was No."
"The person is a 24-year-old married Asian-Pac-Islander female from Vietnam. She works in the service sector as a private sector employee, with an education level of finishing 4th class. She is considered an Own-child in relation to the head of the household. Despite working only 5 hours per week, she had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 26-year-old White female from the United States. She is divorced and has a relation to the head of the household as an Other-relative. She has no specified occupation or work class. Her capital gain and loss last year were both 0. She received education for less than one year in college. She works 35 hours per week.###\nHence this label was No."
"This person is a 46-year-old married White male from the United States. He is the husband in the family and works in the agriculture, forestry, and fisheries sector as the owner of a non-incorporated business, professional practice, or farm. He holds a bachelor's degree and works 60 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This 26-year-old White female, who is divorced and not living with family, resides in the United States. She works in the service sector as a private sector employee, having finished 10th class for education. With no capital gain or loss last year, she works 40 hours per week.###\nHence this label was No."
"This individual is a 32-year-old married White male from the United States. He works in the private sector as an executive and manager, holding a bachelor's degree. Despite working long hours per week (60), he did not experience any capital gains but incurred a loss of $1902 last year.###\nHence this label was Yes."
"This individual is a 27-year-old Black woman from the United States. She has never been married and is classified as an Own-child in terms of household relation. She works in the service sector as a private sector employee, with no capital gain or loss in the previous year. Her education level is college for less than one year, and she works 40 hours per week.###\nHence this label was No."
"This person is an 18-year-old White female from the United States who has never been married. She is living with her parents as an own-child. She works in the cleaning and maintenance sector as a private sector employee, having graduated high school. With no capital gain or loss last year, she works 20 hours per week.###\nHence this label was No."
"The individual is a 45-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector for the local government. Despite having no capital gain or loss last year, he has a stable job working 40 hours per week. With a high school education, he is dedicated to providing for his family with hopes of achieving an annual income over $50,000.###\nHence this label was No."
"This individual is a 20-year-old White male from the United States who has never been married. He is classified as an own-child in the household. He did not have any capital gain or loss last year. His occupation, as well as work class, are unspecified. He has completed less than a year of college education and works 15 hours per week.###\nHence this label was No."
"This individual is a 21-year-old, White male from the United States. He has never been married and is classified as an Other-relative in relation to the head of the household. He works as a machine operator and inspector in the private sector, with a work week of 35 hours. His capital gain and capital loss last year were both $0. He has received some college education but for less than a year.###\nHence this label was No."
"This individual is a 41-year-old married white male from the United States. He holds a master's degree and works in a professional specialty occupation in the local government sector. Despite having no capital gain or loss last year, he dedicates 61 hours per week to his work.###\nHence this label was Yes."
"This 21-year-old White male is never married and lives in the United States. He is an Own-child in the household and works in the sales sector as a private sector employee. Despite having some college education, he has been working for less than a year. With no capital gain or loss last year, he dedicates 45 hours per week to his job.###\nHence this label was No."
"The individual is a 51-year-old Caucasian female from the United States. She is divorced and not married, working in a local government position in the field of execution and management. With a master's degree, she works 40 hours per week and had no capital gains or losses the previous year.###\nHence this label was No."
