"This individual is a 44-year-old married Black male from the United States. He is the husband in the household and works in the service sector as an owner of an incorporated business, professional practice, or farm. He has a high school education and works 48 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"This individual is a 43-year-old married White male from the United States. He works in the private sector as an employee in the transportation, communication, and other public utilities sector. He is a high school graduate and works an average of 40 hours per week. Last year, he did not experience any capital gains or losses.###\nHence this label was No."
"The individual is a 49-year-old White male from the United States. He is married and not living with family. He works as a professional in the private sector and holds a master's degree. Despite working 40 hours a week with no capital gain or loss last year, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"This 43-year-old White female, who has never been married and is not in a family household, resides in the United States. She works in the private sector as an office and administrative support employee, holding a bachelor's degree. Last year, she had no capital gains or losses, and she works 40 hours per week.###\nHence this label was No."
"This individual is a 37-year-old married white male with a master's degree. He works as an executive in the private sector in El-Salvador, putting in 55 hours a week. Last year, he did not have any capital gains or losses.###\nHence this label was Yes."
"This 20-year-old white male is an unmarried private sector employee in the agriculture, forestry, and fisheries sector. He is not living with family and has less than one year of college education. Despite working 72 hours per week, he did not have any capital gains or losses last year in the United States.###\nHence this label was No."
"This individual is a 20-year-old White male from the United States. He has never been married and is categorized as an Own-child in relation to the head of the household. He works in the agriculture, forestry, and fisheries sector as a private sector employee, with a high school education. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"The individual is a 34-year-old married white male from the United States. He works in execution and management for the local government, holding a bachelor's degree. He has a capital gain of $3103 and no capital loss from the previous year. He works 50 hours per week and is classified as the husband in his household.###\nHence this label was Yes."
"This individual is a 36-year-old unmarried white male who works in the cleaning and maintenance sector as a private sector employee. He is classified as an Own-child in relation to the head of the household and is a high school graduate. With no capital gains or losses last year, he works 40 hours per week in the United States.###\nHence this label was No."
"This person is a 39-year-old married White male, working in the craft and repair sector as a private sector employee. He has a bachelor's degree and works 50 hours per week. Last year, he had no capital gain but incurred a capital loss of $1564. His relation to the head of the household is \"Not-in-family\", and his native country is not specified in the data.###\nHence this label was Yes."
"This 25-year-old White female, who has never been married, is not living with family members in the United States. She works in the sales sector as a private sector employee, holding a bachelor's degree. She had no capital gains or losses last year and works 40 hours per week. This information is used to predict whether her annual income exceeds $50,000.###\nHence this label was No."
"This individual is a 22-year-old White female from the United States. She is married but is classified as unmarried in relation to the head of the household. She works in the sales sector as a private sector employee, with a high school education. Last year, she had no capital gains or losses. She works 30 hours per week.###\nHence this label was No."
"The individual is a 28-year-old White male from the United States. He is married and works in the craft and repair sector as an owner of an incorporated business, professional practice, or farm. He has no capital gain or loss from the previous year and finished 11th class for education. He works 50 hours per week.###\nHence this label was Yes."
"The individual is a 21-year-old White male from the United States who has never been married. He is classified as an own-child in the household. He is a high school graduate with an occupation and work class that are not specified. In the previous year, he had no capital gains or losses. He works 20 hours per week.###\nHence this label was No."
"This data represents a 50-year-old white female who is divorced and not living with family in the United States. She works in the private sector in an executive or management role, with no capital gain or loss last year. She has received some college education and works 40 hours per week.###\nHence this label was No."
"The individual is a 34-year-old never-married White female working in the private sector as an executive and manager. She has a master's degree and works 50 hours per week. Her capital gain and loss last year were both 0. She is not related to the head of the household and is from the United States.###\nHence this label was No."
"The individual is a 25-year-old unmarried Asian-Pacific-Islander male from the Philippines. He is employed in the private sector as a sales sector employee with a bachelor's degree. He had no capital gains or losses last year and works 44 hours per week.###\nHence this label was No."
"The individual is an 80-year-old White male, married and working in the private sector as a professional specialty. He holds a professional degree and works 35 hours per week. His capital gain and loss last year were both $0. He is classified as the husband in the household and is a native of the United States.###\nHence this label was Yes."
"The individual is a 27-year-old married White male from the United States. He works as an owner of an incorporated business, professional practice, or farm in the craft and repair sector, with a high school education. Last year, he had no capital gain but incurred a capital loss of $1740. He works 40 hours per week.###\nHence this label was No."
"This person is a 19-year-old White male from the United States. He is never married and is classified as an Other-relative in terms of his relation to the head of the household. He works as a machine operator and inspector in the private sector, with a high school education. Last year, he had no capital gains or losses. He works 45 hours per week.###\nHence this label was No."
"The individual is a 46-year-old White female from Guatemala. She is separated and classified as an Own-child in terms of relation to the head of the household. She works as a machine operator and inspector in the private sector, with no capital gain or loss last year. She has completed 4th class education and works 40 hours per week.###\nHence this label was No."
"The individual is a 44-year-old married White male from the United States. He works in an executive and managerial role for the state government, having a bachelor's degree. Last year, he had no capital gains or losses. He works 40 hours per week and is the husband in the household.###\nHence this label was Yes."
"The person is a 32-year-old married White male living in the United States. He works as an executive in a non-incorporated business, professional practice, or farm. He holds a bachelor's degree and works an average of 50 hours per week. Last year, he had no capital gains or losses. This person's annual income is predicted to be over $50,000 based on the provided information.###\nHence this label was Yes."
"The person is a 32-year-old unmarried White male working in office and administrative support for the federal government in the United States. He is not living with family, has no capital gains or losses, is a high school graduate, and works 40 hours per week.###\nHence this label was No."
"The individual is a 35-year-old married White male from the United States. He works in the technology and support sector as an owner of an incorporated business, professional practice, or farm. He holds a bachelor's degree and works 45 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"This individual is a 38-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a high school graduate education. Last year, he had a capital gain of $7298 and no capital loss. He works 50 hours per week. Based on this information, it is likely that his annual income is over $50,000.###\nHence this label was Yes."
"This is a 38-year-old White female from the United States who has never been married. She is not living with family and works in the sales sector as a private sector employee. She holds a bachelor's degree and works 42 hours per week. Last year, she had no capital gain or loss.###\nHence this label was No."
"The person is a 38-year-old White female from the United States who is married. She works in the private sector as a professional specialty. Last year, she had a capital gain of 3908 and no capital loss. She has attended college for one or more years without completing a degree and works 50 hours per week.###\nHence this label was No."
"The individual is a 33-year-old married White male from the United States. He works in the sales sector as a private sector employee, putting in 60 hours per week. Despite not having any capital gain or loss last year, he has achieved education up to the 11th class.###\nHence this label was No."
"The individual is a 61-year-old White male from the United States. He is married and works in the craft and repair sector as a private sector employee. He has no capital gains or losses from the previous year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was No."
"This 23-year-old White female, who has never been married and is not living with family, resides in the United States. She works in the private sector as a technology and support sector employee, with a college education for less than a year. Last year, she had a capital gain of 4101 and no capital loss, working 40 hours per week.###\nHence this label was No."
"This individual is a 34-year-old married White male from the United States. He holds a professional degree and works in the sales sector as a private sector employee, working 40 hours per week. In the previous year, he had a capital gain of 7688 and did not incur any capital losses.###\nHence this label was Yes."
"The individual is a 32-year-old White male from the United States. He has never been married and is categorized as an own-child in the household. He works for the state government in the craft and repair sector, with a college education of less than one year. He did not experience any capital gain or loss last year and works 20 hours per week.###\nHence this label was No."
"The individual is a 27-year-old White male from the United States who has never been married. He works in the technology and support sector as a private sector employee, holding a bachelor's degree. Despite working 50 hours per week, he did not experience any capital gain or loss last year.###\nHence this label was No."
"This individual is a 30-year-old White male from the United States. He is divorced and unmarried, working as a sales sector employee in the private sector. With a high school education, he works 30 hours per week and had a capital gain of $1151 last year.###\nHence this label was No."
"The individual is a 27-year-old married white male working in the service sector as a private sector employee. He is a high school graduate with no capital gains or losses last year. He works 36 hours per week and is the husband in the household.###\nHence this label was No."
"This individual is a 65-year-old married white male from the United States. He works in the private sector as a professional specialty employee, holding a bachelor's degree. He has no capital gains or losses from the past year, and he works 40 hours per week.###\nHence this label was Yes."
"This 45-year-old Black female, who has never been married, works as a machine operator and inspector in the private sector in the United States. She is not living with family and completed 11th class for education. Despite working 40 hours per week, she did not have any capital gain or loss last year.###\nHence this label was No."
"The individual is a 53-year-old widowed White female from the United States. She is unmarried and works in the sales sector as the owner of an incorporated business, professional practice, or farm. She had no capital gain or loss last year. She completed college for less than one year and works 40 hours per week.###\nHence this label was No."
"The individual is a 23-year-old White male in the United States. He has never been married and is not living with family. He works in office and administrative support in the private sector, with a bachelor's degree. He had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The person is a 41-year-old white female from the United States who has never been married. She works as a machine operator and inspector in the private sector, holding a doctoral degree. She is not living with family and had no capital gain or loss last year. She works 40 hours per week.###\nHence this label was Yes."
"The individual is a 34-year-old married, White male from the United States. He works in the private sector as an execution and management professional with a high school education. He has no capital gain or loss from the previous year and works an average of 45 hours per week.###\nHence this label was No."
"This individual is a 37-year-old White male from the United States. He is married and works in the private sector as a craft and repair employee. With a bachelor's degree education, he works 40 hours per week and had no capital gains or losses last year.###\nHence this label was Yes."
"The individual in this dataset is a 35-year-old White female from the United States. She is separated and unmarried, working as a machine operator and inspector in the private sector. She has no capital gain or loss from the previous year and completed 12th grade without obtaining a diploma. She works 40 hours per week.###\nHence this label was No."
"This individual is a 53-year-old White male from the United States who has never been married. He works in the sales sector as a private sector employee, with a high school education. He is not-in-family relation to the head of the household and worked 48 hours per week last year. He had no capital gain but experienced a loss of $2559.###\nHence this label was Yes."
"This person is a single, 21-year-old White female from the United States working in the private sector. She is an office and administrative support worker, with a high school education. Despite working 45 hours per week, she did not have any capital gain or loss last year. The prediction is whether her annual income exceeds $50,000.###\nHence this label was No."
"This individual is a 43-year-old married White male from the United States. He works in the agriculture, forestry, and fisheries sector as the owner of a non-incorporated business, professional practice, or farm. With a college education of less than one year, he dedicates a significant amount of time to work, putting in 84 hours per week. Despite not having any capital gain or loss last year, he is likely to have an annual income over $50,000.###\nHence this label was No."
"This individual is a 22-year-old married white male from the United States. He works in the private sector as an employee in the cleaning and maintenance sector. He has no capital gain or loss from the previous year. He finished 8th grade for his education and works 40 hours per week.###\nHence this label was No."
"This is a 48-year-old white female who is married and works in office and administrative support in the private sector in the United States. She is the wife of the head of the household and has a high school education. She had no capital gains or losses last year and works 20 hours per week.###\nHence this label was No."
"The person is a 39-year-old married White male from the United States. He works in the private sector in the agriculture, forestry, and fisheries sector. He has no capital gain or loss from last year. His education level is college for less than one year. He works 45 hours per week.###\nHence this label was No."
"This 27-year-old married White male, working in the private sector as a professional specialty, holds a bachelor's degree and works 40 hours per week in the United States. He had no capital gain or loss last year. The prediction is that his annual income is over $50,000.###\nHence this label was No."
"This individual is a 43-year-old Black male from the United States. He has never been married and is not living with any family members. He works in office and administrative support for the federal government, holding a bachelor's degree. Last year, he had a capital gain of $6849 and no capital loss. He puts in 50 hours of work per week.###\nHence this label was No."
"The individual is a 24-year-old, White female from Iran who has never been married. She is currently working in the private sector as an office and administrative support employee. She has completed less than one year of college education. Last year, she had no capital gains or losses. She works 40 hours per week.###\nHence this label was No."
"The person is a 42-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, having a high school graduate education. Last year, he had a capital gain of $5178 and no capital loss. He works 40 hours per week. This individual's demographic and occupational profile suggests that he potentially earns an annual income over $50,000.###\nHence this label was Yes."
"This individual is a 44-year-old married White male from the United States. He works in the technology and support sector as a private sector employee, putting in 40 hours per week. He has not experienced any capital gain or loss in the last year. His education level is college for one or more years without a degree. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"The person is a 63-year-old married White male from the United States. He works in the sales sector as the owner of a non-incorporated business, professional practice, or farm. He had no capital gain but experienced a loss of $1902 last year. His education level is college for less than one year, and he works 60 hours per week. This individual's annual income is being predicted to be over $50,000.###\nHence this label was Yes."
"The individual is a 44-year-old White male from the United States. He is married and his relationship to the head of the household is a husband. He works in an office and administrative support role for the federal government, with a high school graduate education level. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was Yes."
"The person is a 67-year-old married white male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He finished 9th class for education and works 40 hours per week. His capital gain and loss last year were both 0. The person's annual income is predicted to be over $50,000.###\nHence this label was No."
"This individual is a 32-year-old White female living in the United States. She is divorced and is classified as an Other-relative in relation to the head of the household. She works in a professional specialty occupation for the state government, with no capital gain or loss in the last year. She has attended college for less than one year and works 40 hours per week.###\nHence this label was No."
"The individual in the dataset is a 21-year-old married White female from the United States. She is employed in the private sector as an office and administrative support worker, with less than a year of college education. Last year, she had no capital gains or losses. She works 40 hours per week. This data will be used to predict if her annual income is over $50,000.###\nHence this label was No."
"This 27-year-old White male, who has never been married, is employed in the craft and repair sector in the state government. He has an education level of college for less than one year and works 40 hours per week. Despite having no capital gains or losses last year, he resides in the United States as an Other-relative in the household.###\nHence this label was No."
"The person is a 31-year-old divorced White female from the United States. She works in the private sector as a professional specialty with a professional degree. She is not-in-family but earns an income over $50,000 per year. Last year, she had no capital gains or losses, and she works 45 hours per week.###\nHence this label was Yes."
"This data describes a married 18-year-old White male who is a husband in the United States. He is a high school graduate with a capital gain of $4508 from last year and no capital loss. His occupation and work class are not specified, but he works 40 hours per week.###\nHence this label was No."
"This individual is a 43-year-old married White male from Italy, working in the sales sector as a private sector employee. He is the husband in the household and has completed 12th grade without obtaining a diploma. He worked 40 hours per week last year and did not have any capital gains or losses.###\nHence this label was No."
"The person is a 60-year-old married White male from the United States. He works as a professional specialty in the private sector, with a high school education. He has no capital gain or loss from last year and works 45 hours per week.###\nHence this label was Yes."
"The individual is a 50-year-old married Asian-Pac-Islander male from the United States. He works in the sales sector as a private sector employee. His education level is college for less than one year. He works 50 hours per week and had no capital gain or loss last year.###\nHence this label was Yes."
"This individual is a 50-year-old married white male from the United States. He works in the technology and support sector as a private sector employee with a bachelor's degree. He has no capital gain or loss from the previous year and works 20 hours per week.###\nHence this label was Yes."
"The individual is a 27-year-old White female from Mexico. She is married and categorized as an Own-child in relation to the head of the household. She works in the agriculture, forestry, and fisheries sector as a private sector employee. Despite being a high school graduate, she does not have any capital gain or loss from the previous year. She works 40 hours per week.###\nHence this label was No."
"This individual is a 29-year-old married White male from the United States. He works in the technology and support sector as a private sector employee with a bachelor's degree. Last year, he had no capital gain or loss, and he works 40 hours per week.###\nHence this label was No."
"The person is a 29-year-old White male from the United States, married and working in the private sector as a cleaning and maintenance employee. He has a college education for less than a year and works 40 hours per week. In the last year, he had a capital gain of $3103 and no capital loss.###\nHence this label was Yes."
"This individual is a 35-year-old White male from the United States. He has never been married and is not living with family. He works in the sales sector as a private sector employee with a bachelor's degree. Despite working 55 hours per week, he did not have any capital gain or loss last year. The prediction is that his annual income is over $50,000.###\nHence this label was No."
"This individual is a 48-year-old White male from the United States. He is widowed and unmarried, working in the private sector as a sales employee. Despite having a college education of less than one year, he works 50 hours per week with no capital gain or loss last year.###\nHence this label was Yes."
"This is a 47-year-old White female from the United States. She is divorced and not living with family. She works in office and administrative support for the federal government. She is a high school graduate and works 40 hours per week. Last year, she had no capital gain or loss.###\nHence this label was No."
"The individual is a 30-year-old White male from the United States. He has never been married and is classified as an Own-child in terms of relation to the head of the household. He works in the private sector as an execution and management professional, with a high school education. Last year, he had no capital gains or losses. He works 40 hours per week.###\nHence this label was No."
"The person is a 64-year-old widowed White female from the United States. She is not living with any family members. She works in the technology and support sector as a private sector employee. She has no capital gain or loss from the previous year. She attended college for less than one year and works 35 hours per week.###\nHence this label was No."
"The individual in the dataset is a 33-year-old White male from the United States. He is married and works in the private sector as an executive or manager. Despite having attended college for less than a year, he puts in long hours, working 70 hours per week. He did not experience any capital gain or loss last year. The prediction is whether his annual income exceeds $50,000.###\nHence this label was Yes."
"This individual is an 18-year-old White male from the United States who has never been married. He is classified as an Own-child in relation to the head of the household. His occupation and work class are not specified. He had no capital gains or losses last year. He completed the 11th class for education and works 72 hours per week.###\nHence this label was No."
"This individual is a 66-year-old White male from the United States. He is married and is the husband in the household. He has not reported his occupation or work class. He had no capital gain or loss last year. He has completed up to the 11th class in education and works 40 hours per week.###\nHence this label was No."
"This is a 45-year-old white male from the United States who has never been married. He is not living with family and works as a professional specialist in the private sector. He holds a bachelor's degree, works 46 hours per week, and had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 45-year-old white female from the United States. She is divorced and not living with family. She works in a professional specialty occupation in the local government sector. She holds a bachelor's degree and works 50 hours per week. Last year, she had no capital gains or losses.###\nHence this label was Yes."
"The person is a 71-year-old White male from the United States. He is widowed and not living with family. He works in the private sector as an executive manager, putting in 40 hours per week. Last year, he had a capital gain of $6097 and no capital loss. He has completed 8th grade education.###\nHence this label was Yes."
"This individual is a 27-year-old married White male from Mexico, working as a machine operator and inspector in the private sector. He is a high school graduate and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 33-year-old White male from the United States. He has never been married and is classified as an \"Other-relative\" in relation to the head of the household. He works for the state government in the transportation, communication, and other public utilities sector. With a high school education, he works 40 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"The person in the dataset is a 44-year-old White male from the United States. He is divorced and considered an own-child in relation to the head of the household. He works in the cleaning and maintenance sector as a private sector employee, with no capital gain or loss last year. He has completed less than one year of college education and works 40 hours per week.###\nHence this label was No."
"This individual is a 46-year-old married white male from the United States. He holds a bachelor's degree and works in executive management for the state government. Last year, he had neither capital gain nor loss. He works 40 hours per week and is classified as the husband in his household.###\nHence this label was Yes."
"This individual is a 19-year-old White female from the United States. She has never been married and is living with the head of the household as an Own-child. She works in the sales sector as a private sector employee, with a college education of less than one year. Last year, she had no capital gain or loss. She works 25 hours per week.###\nHence this label was No."
"This individual is a 49-year-old White male from the United States who has never been married. He works in the craft and repair sector as a private sector employee, with a high school education. He is not living with family and had no capital gain or loss last year. He works 40 hours per week.###\nHence this label was No."
"This is a 36-year-old Amer-Indian-Eskimo female who has never been married and works as a machine operator and inspector in the private sector. She is unmarried and lives in the United States. She is a high school graduate who worked 40 hours per week last year, with neither capital gain nor loss.###\nHence this label was No."
"This individual is a 30-year-old Caucasian woman from the United States. She is divorced and does not live with any family members. She works in the private sector as an office and administrative support employee, with an associate's degree as her highest level of education. She did not have any capital gains or losses last year and works 25 hours per week.###\nHence this label was No."
"The individual is a 22-year-old White male from the United States who has never been married. He is classified as an own-child in the household. He works in the sales sector as a private sector employee with a bachelor's degree education. In the past year, he had no capital gains or losses. Despite being young, he works relatively few hours per week, only 15.###\nHence this label was No."
"The individual is a 43-year-old white male from the United States, currently married and working in the private sector as an office and administrative support employee. He is the husband in the household and has a high school education. In the past year, he had no capital gains or losses and works 40 hours per week.###\nHence this label was No."
"This individual is a 24-year-old unmarried white male from the United States. He works in the private sector as an executive manager, holding a master's degree. Despite his young age, he works long hours per week (90) and had a significant capital gain last year ($6849). His capital loss last year was $0.###\nHence this label was No."
"This individual is a 21-year-old White male from the United States who has never been married. He is working as a professional specialty in the private sector, with a college education for less than one year. Despite having no capital gain or loss last year, he works 48 hours per week.###\nHence this label was No."
"The individual is a 76-year-old married White male from the United States. He works in the private sector as an office and administrative support employee with a bachelor's degree. Last year, he had a capital gain of $20,051 and no capital loss. He works 50 hours per week.###\nHence this label was Yes."
"The individual is a 33-year-old married White male from the United States. He works in the craft and repair sector as the owner of a non-incorporated business, professional practice, or farm. He is a high school graduate and works 35 hours per week. His capital gain and loss last year were both 0.###\nHence this label was No."
"This individual is a 40-year-old Black male from the United States. He is divorced and not living with family. He works in the service sector as a private sector employee, with a college education of less than one year. Last year, he had a capital gain of $4787 and no capital loss. He works 50 hours per week.###\nHence this label was Yes."
"The individual is a 35-year-old married White male from the United States. He holds a master's degree and works in the private sector as an executive manager, with a weekly work schedule of 45 hours. In the previous year, he had no capital gains or losses.###\nHence this label was No."
"The person is a 27-year-old married White female from Portugal. She works as a machine operator and inspector in the private sector, with a 9th class education. She had no capital gain or loss last year and works 37 hours per week.###\nHence this label was No."
"The individual is a 41-year-old married white male from the United States. He is the husband in the household and works as an owner of an incorporated business, professional practice, or farm in the agriculture, forestry, and fisheries sector. He has a college education for less than one year. Despite working long hours per week (60), he did not have any capital gain or loss last year. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"The individual is a 27-year-old White female who has never been married. She is not living with family and works in an office in the private sector. She attended college for less than a year and works 40 hours per week. There were no capital gains or losses last year, and her native country is unknown.###\nHence this label was No."
"This person is a 25-year-old Black female from Jamaica. She is separated and classified as an other relative in the household. She works in an office and administrative support role in the private sector, earning no capital gain or loss last year. She has completed less than a year of college education and works 40 hours per week.###\nHence this label was No."
"The individual is a 36-year-old married Asian-Pac-Islander male from India working in the craft and repair sector as a private sector employee. He is a high school graduate and works 40 hours per week. In the last year, he did not have any capital gains or losses.###\nHence this label was No."
"This 22-year-old White female is never married and lives in the United States as an own-child in the household. She is employed in the private sector as a professional specialty worker, holding a bachelor's degree. With no capital gains or losses last year, she works 40 hours per week.###\nHence this label was No."
"The person is a 63-year-old married White male from the United States. He works in execution and management as the owner of a non-incorporated business, professional practice, or farm. He finished 8th class education and works 15 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 34-year-old married Asian-Pac-Islander female from China. She works as a professional specialty in the private sector, holding a master's degree. She had no capital gains or losses last year and works 40 hours per week.###\nHence this label was Yes."
"The individual is a 45-year-old White male from the United States. He is married and works in the private sector as an executive manager. He has a bachelor's degree and works 45 hours per week. There were no capital gains or losses last year.###\nHence this label was Yes."
"The individual is a 48-year-old married White male from the United States working in the private sector in the transportation, communication, and other public utilities sector. He is a high school graduate and works an average of 50 hours per week. Last year, he did not have any capital gain or loss.###\nHence this label was Yes."
"The person is a 32-year-old Black female from England. She is never married and not living with family. She works in execution and management in the private sector, with no capital gain or loss last year. She attended college for one or more years without completing a degree and works 35 hours per week.###\nHence this label was No."
"This individual is a 27-year-old male from the United States. He is divorced and currently unmarried. He works in the craft and repair sector as a private sector employee, with 11 years of education completed (finished 11th class). In the past year, he had no capital gains or losses and works 35 hours per week.###\nHence this label was No."
"The person is an 18-year-old Asian-Pac-Islander female from Germany who has never been married. She is the own-child in the household and works in the private sector as an office and administrative support employee. She has a college education for less than one year. Last year, she had no capital gain or loss. She works 22 hours per week. Based on this information, it is predicted that her annual income is not over $50,000.###\nHence this label was No."
"This is a 35-year-old Asian-Pacific-Islander male who has never been married. He is living with his parents in the United States as an own child. He works in the transportation, communication, and other public utilities sector as a private sector employee. Despite working 60 hours a week, he did not have any capital gains or losses last year. His highest level of education is a high school graduate.###\nHence this label was No."
"The individual is a 49-year-old married white male from the United States. He works in the private sector as an office and administrative support employee, putting in 40 hours per week. He is a high school graduate with no reported capital gain or loss last year.###\nHence this label was No."
"The individual is a 56-year-old married White male from the United States. He is employed in the private sector as a professional specialty worker. He has a bachelor's degree and works 50 hours per week. Last year, he had no capital gains or losses. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This person is a 31-year-old married White male from the United States. He works as a private sector employee in the sales sector, with a college education for less than one year. He is the husband in his household and worked 45 hours per week last year. His capital gain was $15,024, and he did not incur any capital loss. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This person is a 36-year-old White male, married and working as a machine operator and inspector in the private sector. He is the husband in the household and is from the United States. He finished 8th class for education and works 40 hours per week. He did not have any capital gain or loss last year.###\nHence this label was No."
"The individual is a 26-year-old white female from the United States who has never been married. She is not living with family and works as a professional specialist in the private sector. She holds a bachelor's degree and works 20 hours per week. Last year, she did not experience any capital gain or loss.###\nHence this label was No."
"This individual is a 23-year-old white female from the United States who has never been married. She is classified as an own-child in the household. She works in the sales sector as a private sector employee, with a college education for less than one year. Last year, she did not have any capital gain or loss. She works 20 hours per week.###\nHence this label was No."
"The individual is a 27-year-old married White male from the United States. He works in the private sector as an employee in the cleaning and maintenance sector, putting in 50 hours per week. He has no capital gains or losses from the previous year and has attended college for less than one year.###\nHence this label was No."
"The individual is a 28-year-old married White male from England. He works in the protective services sector for the local government, holding an associate's degree. He works 40 hours per week and had no capital gain last year but experienced a capital loss of $2002.###\nHence this label was No."
"The individual is a 31-year-old White male from Mexico. He has never been married and is classified as unmarried. He works in the craft and repair sector as a private sector employee. He has no capital gain or loss from the previous year. His education level is college for less than one year. He works 42 hours per week.###\nHence this label was No."
"This individual is a 41-year-old married white male living in the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He is a high school graduate and works 45 hours per week. Last year, he had a capital gain of 0 and a capital loss of 1887.###\nHence this label was Yes."
"The person is a 55-year-old Black male from the United States. He is married and his relation to the head of the household is a husband. His occupation and work class are not provided. He had a capital gain of $7688 and no capital loss last year. He holds an associate's degree and works 40 hours per week.###\nHence this label was Yes."
"This individual is a 29-year-old married white male from the United States. He works in a professional specialty occupation for the local government, holding a bachelor's degree. Last year, he had a capital gain of $7298 and no capital loss. He works 40 hours per week.###\nHence this label was Yes."
"This person is a 36-year-old White female from the United States who has never been married. She is not living with any family member and works in the private sector as an executive. Despite being a high school graduate, she does not have any capital gain or loss from the previous year. She works 38 hours per week.###\nHence this label was No."
"The person in the dataset is a 33-year-old White male from the United States who has never been married. He is not living with family members and works in the agriculture, forestry, and fisheries sector as a private sector employee. Last year, he had no capital gains or losses. He is a high school graduate and works 40 hours per week.###\nHence this label was No."
"The person is a 64-year-old White female from the United States. She is divorced and not living with any family members. She works in the service sector as a private sector employee. She has no capital gain or loss from the previous year. Her education level is a high school graduate, and she works 15 hours per week.###\nHence this label was No."
"This individual is a 54-year-old married White male from the United States. He works as a professional specialty in the private sector, holding a master's degree. Last year, he had no capital gains or losses and typically works 40 hours per week.###\nHence this label was Yes."
"This dataset includes information about a 47-year-old White female from the United States who has never been married. She is not in a family relation to the head of the household and works in an executive and management role in the federal government. Last year, she had no capital gains or losses. She is a high school graduate and works 40 hours per week.###\nHence this label was No."
"This 29-year-old White male who has never been married is living with the head of the household as their own child in the United States. He has completed high school education, with no reported occupation or work class. Last year, he had no capital gains or losses. He works 50 hours per week.###\nHence this label was No."
"The individual is a 33-year-old separated White female from the United States. She is not living with family. She works in a professional specialty in the private sector, with a bachelor's degree. She did not have any capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"This individual is a 34-year-old married white male from the United States. He works in the private sector as a craft and repair employee, putting in 32 hours per week. Additionally, he has not experienced any capital gains or losses in the last year. His education level is described as having attended college for one or more years without obtaining a degree.###\nHence this label was Yes."
"This person is a 56-year-old married White male with a master's degree working in a professional specialty occupation in the local government. They are the husband in the household and worked 35 hours per week last year with no capital gains or losses.###\nHence this label was Yes."
"A 45-year-old married white male, husband in the household, from the United States, working in the private sector as a service sector employee. He has a college education for less than one year and works 44 hours per week. In the past year, he had a capital gain of $15,024 and no reported capital loss.###\nHence this label was Yes."
"The individual is a 17-year-old White female from the United States who has never been married. She is classified as an Own-child in relation to the head of the household. She is employed in the service sector as a private sector employee, with a high school graduate level of education. She works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 26-year-old White male from Mexico. He is never married and does not live with any family members. He works in the private sector as an office and administrative support employee, with a high school education. He worked 50 hours per week with no capital gains or losses last year. The prediction is whether his annual income exceeds $50,000.###\nHence this label was No."
"This individual is a 45-year-old Black male from the United States. He is married and works in the private sector as an executive manager. With a master's degree, he works 40 hours per week and had no capital gain or loss last year.###\nHence this label was Yes."
"The individual is a 51-year-old Black male residing in the United States. He is divorced and classified as unmarried in terms of his relation to the head of the household. He works in the transportation, communication, and other public utilities sector for the local government. Despite being a high school graduate, he has no capital gain or loss from the previous year. He works 40 hours per week.###\nHence this label was No."
"The individual is a 23-year-old White female from the United States who is not married and has no family living with her. She is employed in the service sector as a private sector employee, with an educational background of college for less than one year. Last year, she had no capital gain or loss. She works 35 hours per week.###\nHence this label was No."
"This individual is a 50-year-old White female from the United States. She is divorced and currently unmarried. She works in the private sector as an executive manager, having graduated from high school. In the previous year, she had no capital gains or losses. She works 38 hours per week.###\nHence this label was No."
"The individual is a 46-year-old divorced white male from the United States. He is unmarried and works in office and administrative support for the federal government. He has no capital gain or loss from the previous year, and is a high school graduate. He works 40 hours per week.###\nHence this label was No."
"A 44-year-old married white male from the United States, working in the private sector as a craft and repair sector employee. He has attended college for less than one year and works 56 hours per week. He had no capital gain or loss last year. This individual's annual income is predicted to be over $50,000.###\nHence this label was Yes."
"This is a 38-year-old married white male from the United States. He works in an office and administrative support role for the federal government, with a high school education. Last year, he had no capital gains or losses. He works 45 hours per week. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was No."
"This is a profile of a 17-year-old white male from the United States who has never been married and is classified as an own-child in the household. He works in the service sector as a private sector employee, with no capital gain or loss last year. He finished 10th class for his education and works 18 hours per week.###\nHence this label was No."
"The individual is a 62-year-old married Asian-Pac-Islander male from China, working as an office and administrative support staff in the private sector. He holds a master's degree and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was Yes."
"The individual is a 33-year-old married male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"The person is a 39-year-old married white male from the United States. He is the husband in the household and works as an owner of an incorporated business, professional practice, or farm in an executive and management role. He has an associate's degree and worked 55 hours per week last year. He had a capital gain of $15,024 and no capital loss. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"This individual is a 45-year-old Black woman from the United States. She is never married and does not live with any family members. She works in the service sector for the federal government and has a high school education. With no capital gains or losses last year, she works 40 hours per week.###\nHence this label was No."
"This person is a 45-year-old Black male from the United States. He is married and works in office and administrative support for the federal government. He has no capital gain or loss from last year. His education level is college for less than one year, and he works 20 hours per week.###\nHence this label was No."
"The individual is a 30-year-old married White male from Nicaragua, working as a machine operator and inspector in the private sector. He has no capital gain or loss from the previous year and has received college education for less than one year. He works 40 hours per week.###\nHence this label was No."
"The person is a 52-year-old White male from the United States. He is married and works in the craft and repair sector as a private sector employee. He has no capital gain or loss from the previous year. His education level is college for less than one year, and he works 40 hours per week.###\nHence this label was Yes."
"This is a 22-year-old White female from the United States who has never been married and works in the service sector as a private sector employee. She is a high school graduate and works 40 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 26-year-old Black female from Jamaica, working in the private sector as an office and administrative support employee. She is unmarried and has never been married, with a high school education. She had no capital gain or loss last year, and works 40 hours per week.###\nHence this label was No."
"The individual is a 43-year-old married White male from the United States. He works in the sales sector as the owner of an incorporated business, professional practice, or farm. He holds a bachelor's degree and works an extensive 60 hours per week. Despite having no capital gains or losses last year, he likely earns an annual income over $50,000.###\nHence this label was Yes."
"This 24-year-old single White male, who is the child of the household head, resides in the United States and works as an office and administrative support employee in the private sector. With a bachelor's degree, he worked 30 hours per week last year, earning a capital gain of $2202 and incurring no capital loss.###\nHence this label was No."
"This individual is a 56-year-old White male from the United States who has never been married. He is not living with family and works in the service sector as a private sector employee. Despite attending college for less than a year, he currently works 32 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The individual is a 41-year-old married White male, working in the private sector in the technology and support sector. He is a high school graduate with no capital gain or loss last year. He works 40 hours per week and resides in the United States.###\nHence this label was No."
"The person is a 57-year-old married White female from the United States. She works as an executive in the private sector, with education equivalent to college for one or more years without a degree. She is not living with family and worked 47 hours per week. Last year, she had no capital gain or loss.###\nHence this label was No."
"The individual is an 18-year-old white male from the United States who has never been married. He is classified as an own-child in the household and currently does not have a specified occupation or work class. Despite finishing 11th class education, he works 36 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This individual is a 22-year-old Amer-Indian-Eskimo male who has never been married and is classified as an own-child in the household. He works in the private sector as an employee in the cleaning and maintenance sector, with a high school education. Despite working 40 hours per week, he did not have any capital gain or loss last year. His native country is the United States.###\nHence this label was No."
"The individual is a 47-year-old White female from the United States. She is divorced, unmarried, and works in the technology and support sector for the federal government. She holds a bachelor's degree, works 50 hours per week, and had no capital gain or loss last year.###\nHence this label was No."
"The individual is an 18-year-old White male from the United States who has never been married and is living with a parent. He is a high school graduate and currently not employed. He did not have any capital gain or loss last year. He works 20 hours per week.###\nHence this label was No."
"This individual is a 22-year-old White female from the United States. She is never married and not living with any family members. She works in the transportation, communication, and other public utilities sector as a private sector employee. She is a high school graduate and works 46 hours per week. Last year, she had no capital gain or loss.###\nHence this label was No."
"This dataset represents a 48-year-old married White male from the United States. He works in the private sector as an employee in the transportation, communication, and other public utilities sector. He completed the 11th class for his education and works 40 hours per week. Last year, he had no capital gain but experienced a capital loss of 2002.###\nHence this label was No."
"This individual is a 35-year-old White male from the United States. He is divorced and not living with any family members. He works in the private sector as an executive manager, holding a bachelor's degree. Last year, he had a high capital gain of $27,828 and no capital loss. He works 50 hours per week.###\nHence this label was Yes."
"This 22-year-old Black female, who has never been married, resides in the United States without any family members in the household. She works in the service sector as a private sector employee, with a high school education. Last year, she had no capital gain or loss, and she typically works 35 hours per week.###\nHence this label was No."
"This individual is a 29-year-old divorced white male from the United States. He is classified as an own-child in terms of his relation to the head of the household. He works as a craft and repair sector employee in the private sector, putting in 40 hours per week. With no recorded capital gains or losses last year, he has completed less than a year of college education.###\nHence this label was No."
"The individual is a 45-year-old white male from the United States who is married and works in the private sector as a cleaning and maintenance employee. He is a high school graduate and works 48 hours per week. He did not have any capital gain or loss last year. The prediction is whether his annual income is over $50,000.###\nHence this label was Yes."
"The person is a 52-year-old Black female from the United States. She is divorced and unmarried, working in office and administrative support for the federal government. She had no capital gain or loss last year. Her education level is college for less than one year, and she works 40 hours per week.###\nHence this label was No."
"This individual is a 41-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. Last year, he had a capital gain of 7688 and no capital loss. He works 42 hours per week.###\nHence this label was Yes."
"This entry describes an 18-year-old White male who has never been married and is classified as an own-child in the household. He is from the United States and works as a machine operator and inspector in the private sector. He is a high school graduate and works 20 hours per week with no capital gain or loss last year.###\nHence this label was No."
"The person is a 35-year-old White male from the United States who is married and works as a professional specialty in the private sector. He has an associate's degree and works 45 hours per week. Last year, he had no capital gain or loss. This person's annual income is predicted to be over $50,000.###\nHence this label was No."
"The individual is a 42-year-old White male from the United States. He is married and the husband in the household. He works in the craft and repair sector as an owner of a non-incorporated business, professional practice, or farm. Last year, he had no capital gain or loss. He completed some college education for less than one year and works 45 hours per week.###\nHence this label was No."
"This individual is a 28-year-old married white male from the United States. He works as a private sector employee in the technology and support sector, holding a bachelor's degree. His relationship to the head of the household is a husband. Despite having no capital gain or loss last year, he works 40 hours per week.###\nHence this label was Yes."
"This individual is a 52-year-old married Asian-Pac-Islander male working in the private sector as a professional specialty. He has a relation of other-relative to the head of the household and finished 10th class for education. With no capital gain or loss last year, he works 45 hours per week.###\nHence this label was No."
"The individual is a 77-year-old White male from Cuba, currently married and working in the service sector as a private sector employee. He is the husband in the household and has no capital gains or losses from last year. With a high school education, he works 25 hours per week.###\nHence this label was No."
"This dataset represents a 27-year-old married White male from the United States. He works in the technology and support sector as a private sector employee, putting in 40 hours per week. Last year, he had no capital gains or losses. His education level is college for one or more years without a degree.###\nHence this label was No."
"This 27-year-old white male is never married and not living with family. He works in the private sector as an office and administrative support employee in the United States. With a high school education, he works 50 hours per week with no capital gain or loss last year.###\nHence this label was No."
"This 19-year-old White female, who has never been married, is living with her parents in the United States. She is employed in the service sector under the state government, working 40 hours per week. Despite her young age, she has attained some college education. Last year, she did not have any capital gains or losses.###\nHence this label was No."
"This individual is a 37-year-old married White male from the United States. He is employed in the private sector as an office and administrative support worker with a bachelor's degree. He works 40 hours per week and had no capital gain or loss last year.###\nHence this label was No."
"This 23-year-old Black male, who has never been married, is an own-child in the household. He is from the United States and works as a sales sector employee in the private sector. With no capital gain or loss last year, he has received college education for less than a year. Currently, he works 25 hours per week.###\nHence this label was No."
"The individual is a 73-year-old White male, married and classified as a husband in the household. He is from the United States and has missing information on occupation and work class. He had no capital gain or loss last year. He is a high school graduate and works 10 hours per week.###\nHence this label was No."
"This individual is a 40-year-old Amer-Indian-Eskimo male who has never been married. He is not living with family and is employed in the private sector as an execution and management professional. He is a high school graduate working 43 hours per week, with a capital gain of $6849 and no capital loss in the previous year. He resides in the United States.###\nHence this label was No."
"This individual is a 37-year-old White female from Mexico. She is divorced and not currently married. She works in the service sector as a private sector employee, with a 4th class education. Last year, she had no capital gains or losses. She works 35 hours per week.###\nHence this label was No."
"This individual is a 45-year-old married White male from the United States, working in the private sector as an executive manager. He holds a bachelor's degree and works 50 hours per week. With a capital gain of $7688 and no reported capital loss, he is likely to have an annual income exceeding $50,000.###\nHence this label was Yes."
"This individual is a 29-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a high school education. He has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was No."
"This 24-year-old White female, who has never been married, is living with her own parents. She works in the technology and support sector for the federal government, holding a bachelor's degree. Despite no capital gain or loss last year, she works 40 hours per week.###\nHence this label was No."
"This person is an 18-year-old White female from the United States. She has never been married and is classified as an Own-child in the household. She works in the sales sector as a private sector employee, with a high school education. She had no capital gains or losses last year and works 20 hours per week.###\nHence this label was No."
"The individual is a 45-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a college education for less than one year. Despite working 55 hours per week, he had no capital gains or losses last year.###\nHence this label was Yes."
"The individual is a 60-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, having graduated from high school. Last year, he had a capital gain of $7298 and no capital loss. He works 40 hours per week as a husband.###\nHence this label was Yes."
"The individual is a 67-year-old married white male from the United States. He is the husband in the household and works in the transportation, communication, and other public utilities sector as the owner of a non-incorporated business, professional practice, or farm. He holds a bachelor's degree and works 40 hours per week. Last year, he had no capital gains or losses.###\nHence this label was No."
"The person is a 33-year-old married White male from Columbia. He works in the sales sector as a private sector employee with a bachelor's degree. As the husband, he has no capital gains or losses from the previous year. He works a full-time job, putting in 80 hours per week.###\nHence this label was Yes."
"The individual is a 46-year-old White male from the United States. He is married and works in the private sector as an office and administrative support worker, putting in 40 hours per week. He had no capital gains or losses last year and has less than a year of college education.###\nHence this label was No."
"The person is a 76-year-old White female from the United States. She is widowed and not living with any family member. She works as an owner of a non-incorporated business, professional practice, or farm in the field of execution and management. Despite being a high school graduate, she only works 2 hours per week. Last year, she had no capital gain or loss.###\nHence this label was No."
"This individual is a 42-year-old White female from the United States. She has never been married and is living with the head of the household as an own-child. She works in the private sector as an office and administrative support employee, holding a bachelor's degree. Despite working 35 hours per week, she did not have any capital gain or loss last year. The prediction is that her annual income is under $50,000.###\nHence this label was No."
"This individual is a 34-year-old White male from the United States who is married and works in the craft and repair sector as the owner of a non-incorporated business, professional practice, or farm. He has a high school education, works 55 hours per week, and had no capital gains or losses last year.###\nHence this label was No."
"The person is a 31-year-old married White female from the United States. She works in the private sector as a professional specialty employee and has an associate's degree. Last year, she had no capital gain or loss. She works 40 hours per week.###\nHence this label was Yes."
"The individual is a 51-year-old married White male from the United States. He works in a professional specialty occupation for the federal government, holding a bachelor's degree. He had no capital gain or loss last year and works 40 hours per week.###\nHence this label was Yes."
"This individual is a 33-year-old married White male from the United States. He works in the craft and repair sector as a private sector employee, with a work week of 40 hours. He finished 11th class for education and had zero capital gain and capital loss last year.###\nHence this label was No."
"This dataset describes a 59-year-old married White male from the United States. He is the husband in his household and works as an executive or manager in his own non-incorporated business, professional practice, or farm. He has finished 10th class education and works 36 hours per week. Last year, he had no capital gains or losses. This information is being used to predict whether his annual income exceeds $50,000.###\nHence this label was No."
"This individual is a 23-year-old Black male from the United States who has never been married. He is considered an own-child in relation to the head of the household. He is employed in the sales sector as a private sector employee, working 10 hours per week. His annual income is unlikely to be over $50,000 as both his capital gain and capital loss last year were 0. His educational background includes a bachelor's degree.###\nHence this label was No."
"This person is a 33-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a 40-hour workweek. He finished 9th class education and had no capital gains or losses last year.###\nHence this label was No."
"This is a profile of a 52-year-old white female from the United States who has never been married. She is classified as an own-child in the household and works in the service sector as a private sector employee. Despite finishing 8th class education, she only works 7 hours per week and had no capital gains or losses last year.###\nHence this label was No."
"This person is a 25-year-old White male from the United States who has never been married. He works in the craft and repair sector as a private sector employee, with a college education for less than one year. He is classified as an own-child in relation to the head of the household. Last year, he had no capital gains or losses. He works 30 hours per week.###\nHence this label was No."
"This individual is a 36-year-old White male from the United States who has never been married. He is classified as an own-child in the household and works in the service sector as a private sector employee. His educational background includes some college experience and he works an average of 45 hours per week. In the previous year, he did not experience any capital gains or losses.###\nHence this label was No."
"This individual is a 55-year-old married white male from the United States. He works in the transportation, communication, and other public utilities sector for the federal government. He is a high school graduate and works 40 hours per week with no capital gains or losses last year.###\nHence this label was No."
"The individual is a 42-year-old married White male living in the United States. He works in the craft and repair sector as a private sector employee, having a high school education. With no capital gain or loss last year, he works 40 hours per week to support his household.###\nHence this label was No."
"The individual is a 36-year-old married White male from the United States working in the private sector as an executive/manager. He holds a master's degree and works 40 hours per week. Last year, he did not experience any capital gain or loss.###\nHence this label was Yes."
"The individual is a 35-year-old married White male from the United States. He holds a master's degree and works in the private sector as an executive. His work hours per week are 45, and he had no capital gain or loss last year. The data suggests that he likely has an annual income over $50,000.###\nHence this label was Yes."
"This person is a 32-year-old married White female from France. She works in the protective services sector for the local government, with a college education for less than one year. She has no capital gain or loss from the previous year and works 40 hours per week.###\nHence this label was Yes."
"The individual is a 35-year-old Black female from the United States. She is separated and has her own child. She works as an execution and management professional in the private sector, with an education level of college for less than one year. Last year, she had no capital gain or loss. She works 40 hours per week. Based on this information, it is predicted that her annual income is over $50,000.###\nHence this label was No."
"This individual is a 33-year-old married White male from the United States. He works in the private sector in an executive and management role, with a work week of 40 hours. He attended college for less than a year. Last year, he had a capital gain of 7298 and no capital loss. Based on this information, it is predicted that his annual income is over $50,000.###\nHence this label was Yes."
"The individual is a 46-year-old White male from the United States. He is divorced and not living with family. He works in the transportation, communication, and other public utilities sector as a private sector employee. He had no capital gains or losses last year. His education level is 10th class. He works 50 hours per week.###\nHence this label was No."
"The individual is a 44-year-old White female who is divorced. She is not living with family and is a machine operator and inspector in the private sector. She is a high school graduate working 40 hours per week with no capital gains or losses last year. Her native country is the United States.###\nHence this label was No."
"This person is a 19-year-old White male from the United States. He has never been married and is classified as an Own-child in the household. He works in the craft and repair sector as a private sector employee, with a high school education. He worked 40 hours per week last year with no capital gains or losses.###\nHence this label was No."
"This person is a 39-year-old White male from the United States, who is married and works in the private sector as an executive manager. He holds a bachelor's degree and works 40 hours per week. Last year, he did not have any capital gains or losses.###\nHence this label was Yes."
"This person is a 51-year-old white male from the United States, working in the craft and repair sector as a private sector employee. He is divorced and not living with family. Last year, he had a capital gain of $6849 and no capital loss. He has attended college for one or more years but does not have a degree. He typically works 40 hours per week.###\nHence this label was No."
"The person is a 17-year-old, White male from the United States who has never been married. He is classified as an Own-child in the household. He is an owner of a non-incorporated business, professional practice, or farm in the agriculture, forestry, and fisheries sector. He finished 11th class for education and works 15 hours per week. Both his capital gain and capital loss last year were 0.###\nHence this label was No."
"This 20-year-old White female in the United States works in office and administrative support for the local government. She is never married, lives independently from her family, and is a high school graduate. Despite working 30 hours per week, she did not experience any capital gains or losses last year.###\nHence this label was No."
"The individual is a 42-year-old married White male from the United States. He works in the sales sector as a private sector employee, with a college education for less than one year. He has not had any capital gains or losses in the past year and works for 40 hours per week.###\nHence this label was Yes."
"The person is a 26-year-old Asian-Pacific-Islander female who is married and considered an other relative in the household. She works in the craft and repair sector as a private sector employee, holding an associate's degree. She had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"This person is a 40-year-old divorced White female from the United States. She works as a professional in a specialty occupation and owns a non-incorporated business, professional practice, or farm. She has an associate's degree and works 50 hours per week. Last year, she had no capital gains or losses.###\nHence this label was No."
"This individual is a 35-year-old married White male living in the United States. He is the husband in the household. His occupation, work class, and education level are unspecified. He had no capital gains but incurred a capital loss of $2603 last year. He works 40 hours per week.###\nHence this label was No."
"This young 22-year-old white male from the United States has never been married and is classified as an own-child in the household. He has not specified his occupation or work class. With no capital gain or loss last year, he has received less than one year of college education. Currently, he works 35 hours per week.###\nHence this label was No."
"This individual is a 58-year-old White female from the United States who has never been married. She is not living with family and works in a professional specialty occupation in the private sector. She holds a bachelor's degree and works 60 hours per week. Last year, she did not experience any capital gains or losses.###\nHence this label was No."
"The individual is a 35-year-old married White male from the United States. He works in the craft and repair sector for the local government, having a high school graduate education. He is categorized as the husband in the household. With a capital gain and loss of 0 from last year, he puts in 40 hours of work per week.###\nHence this label was No."
"This 25-year-old White female, who has never been married, is not living with family members. She is a private sector employee working in office and administrative support, with a bachelor's degree. Last year, she had no capital gains or losses. She works 35 hours per week in the United States.###\nHence this label was No."
"The individual is a 35-year-old white male from the United States. He is divorced and currently unmarried. He works in the craft and repair sector as a private sector employee, having graduated from high school. Last year, he had no capital gain or loss. He works 40 hours per week.###\nHence this label was No."
"The individual is an 18-year-old White male from the United States who has never been married. He is categorized as an Other-relative in relation to the head of the household. His occupation and work class information are not available. He has a capital gain and loss of 0 from last year. His education level is a high school graduate and he works 40 hours per week.###\nHence this label was No."
"This individual is a 59-year-old White female from the United States. She has never been married and is classified as an Other-relative in terms of her relation to the head of the household. She works in execution and management for the federal government, with a high school education qualification. Last year, she had no capital gain or loss. She works 40 hours per week.###\nHence this label was No."
"This individual is an 18-year-old White male from the United States who has never been married and is classified as an Other-relative in the household. He works in the sales sector as a private sector employee, with a high school education and works 25 hours per week. He had no capital gain or loss last year.###\nHence this label was No."
"This individual is a 42-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. He is a high school graduate and works 40 hours per week with no capital gains or losses last year.###\nHence this label was No."
"This person is a 56-year-old White female from Yugoslavia. She is divorced, not living with family, and works as a machine operator and inspector in the private sector. She finished 8th class for education, works 20 hours per week, and had no capital gain or loss last year.###\nHence this label was No."
"The individual is a 27-year-old White male from the United States who has never been married and is considered an own-child in the household. He works as a machine operator and inspector in the private sector, having graduated from high school. With no capital gain or loss last year, he works 40 hours per week.###\nHence this label was No."
"This individual is a 61-year-old married White male from the United States. He works in the transportation, communication, and other public utilities sector as a private sector employee. Despite only completing 8th grade education, he works 50 hours per week. He did not have any capital gains or losses last year.###\nHence this label was No."
"The individual is a 48-year-old married White male from the United States. He is the husband in the household and works as an owner of an incorporated business, professional practice, or farm in the agriculture, forestry, and fisheries sector. He holds a bachelor's degree and works long hours per week (70). He had no capital gains or losses last year.###\nHence this label was Yes."
"This individual is a 34-year-old White male, never married, and not living with family. He works as a machine operator and inspector in the private sector, with a high school education. He has no capital gains or losses from the previous year and works 40 hours per week in the United States.###\nHence this label was No."
"This is a 45-year-old divorced White female from the United States. She is professionally specialized and works in the local government, with a bachelor's degree education. She has no capital gain or loss from the last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 38-year-old married White male from the United States. He is a husband and works in the craft and repair sector as a private sector employee. He is a high school graduate and works 40 hours per week, with no capital gain or loss last year.###\nHence this label was No."
"The person is a 40-year-old Black male from the United States who has never been married. He is categorized as an Other-relative in relation to the head of the household. He works in the service sector as a private sector employee, with a high school education. Last year, he had no capital gains or losses, and he works 40 hours per week.###\nHence this label was No."
"This individual is a 56-year-old White female in the United States. She is divorced and not living with family members. She works in office and administrative support for the state government, putting in 40 hours per week. She attended college for less than one year. Last year, she did not have any capital gains but incurred a capital loss of 2339.###\nHence this label was No."
"The individual is a 45-year-old married White male from the United States. He works as a machine operator and inspector in the private sector, with a college education for less than one year. Despite working long hours per week (65), he did not have any capital gain or loss last year.###\nHence this label was No."
"This individual is a 20-year-old unmarried White female from the United States. She is not living with family and her occupation and work class are not specified. She has had no capital gains or losses in the last year. She has a high school education and works 40 hours per week.###\nHence this label was No."
"This individual is a 22-year-old White male from the United States who has never been married. He is not living with family and works in an office and administrative support role in the private sector. Despite having some college education, he works long hours per week (55) and did not have any capital gains or losses last year.###\nHence this label was No."
"The individual is a 47-year-old white male from the United States. He is married and works in the private sector as an executive manager. He holds a bachelor's degree and works 40 hours per week. Last year, he had a capital loss of $1887 and did not have any capital gains.###\nHence this label was Yes."
"This individual is a 27-year-old White male working in the craft and repair sector as a private sector employee. He is separated and not living with any family members. He is a high school graduate and works 40 hours per week. Last year, he did not experience any capital gains or losses. His native country is the United States.###\nHence this label was No."
"The individual is a 48-year-old White male from the United States who has never been married. He is not living with family and works as a machine operator and inspector in the private sector. He completed 10th class for education and works 40 hours per week. There were no capital gains or losses last year.###\nHence this label was No."
"This individual is a 42-year-old married White male from the United States. He works as an owner of a non-incorporated business, professional practice, or farm in the field of execution and management. Despite having no capital gain or loss last year, he works 55 hours per week. His education level is college for less than one year.###\nHence this label was Yes."
"This individual is a 38-year-old Black female from the United States. She is never married and works in the sales sector as a private sector employee. She has no capital gain or loss from the previous year. Her education level is college for less than one year, and she works 40 hours per week.###\nHence this label was No."
"The individual is a 56-year-old married White male from Dominican-Republic working in the private sector in an office and administrative support role. He has a capital gain and loss of 0 from the previous year, with a level of education being the completion of 8th grade. He works 40 hours per week.###\nHence this label was No."
"This individual is a 24-year-old White male from the United States who has never been married. He works as an office and administrative support employee in the private sector, with a bachelor's degree education. He is an own-child in the household with no capital gain or loss last year, and works 39 hours per week.###\nHence this label was No."
"This individual is a 53-year-old White female from the United States. She is divorced and not living with any family members. She works in a professional specialty occupation for the local government, with a master's degree as her highest level of education. She worked 40 hours per week last year, with a capital gain of $2174 and no capital loss.###\nHence this label was No."
"The person is a 30-year-old White female from the United States. She is divorced and currently unmarried. Her occupation, work class, and level of education are not specified. She had no capital gains or losses last year and works 40 hours per week.###\nHence this label was No."
"The individual is a 21-year-old white female from the United States who has never been married. She is the own-child of the head of the household. She works in the private sector as an office and administrative support employee, earning no capital gain or loss last year. She has received some college education for less than a year and works 20 hours per week.###\nHence this label was No."
"This individual is a 51-year-old married White male from the United States. He holds a master's degree and works in the private sector as an executive/manager, dedicating 70 hours per week to his job. His capital gains and losses were both zero in the last year.###\nHence this label was Yes."
"This 29-year-old married Asian-Pac-Islander female, working in the technology and support sector as a private sector employee, resides in the United States. She is a high school graduate and works 45 hours per week. In the previous year, she had a capital gain of 4386 and no capital loss.###\nHence this label was Yes."
"This individual is a 35-year-old White female who is separated and not currently living with family. She is an office and administrative support worker in the private sector in the United States. She is a high school graduate who worked 40 hours per week last year, with no capital gains or losses.###\nHence this label was No."
